var _0x1f4662 = _0x35f8;
(function(_0x179ed1, _0x24c04a) {
    var _0x1f9cd7 = _0x35f8,
        _0x1514d9 = _0x179ed1();
    while (!![]) {
        try {
            var _0x7b1f40 = -parseInt(_0x1f9cd7(0x33b)) / 0x1 + parseInt(_0x1f9cd7(0x322)) / 0x2 * (parseInt(_0x1f9cd7(0x1a7)) / 0x3) + parseInt(_0x1f9cd7(0x2e4)) / 0x4 * (-parseInt(_0x1f9cd7(0x4d8)) / 0x5) + parseInt(_0x1f9cd7(0x574)) / 0x6 * (parseInt(_0x1f9cd7(0x551)) / 0x7) + parseInt(_0x1f9cd7(0x2ab)) / 0x8 * (-parseInt(_0x1f9cd7(0x40c)) / 0x9) + -parseInt(_0x1f9cd7(0x204)) / 0xa + -parseInt(_0x1f9cd7(0x471)) / 0xb;
            if (_0x7b1f40 === _0x24c04a) break;
            else _0x1514d9['push'](_0x1514d9['shift']());
        } catch (_0x52540e) {
            _0x1514d9['push'](_0x1514d9['shift']());
        }
    }
}(_0x3be7, 0xd23d1));
var normal = _0x1f4662(0x37c);
const fontgenArray = ['firework', _0x1f4662(0x4fb), _0x1f4662(0x4c5), _0x1f4662(0x519), 'heartsBetween', _0x1f4662(0x5b3), _0x1f4662(0x3b0), 'dottyJoiner', _0x1f4662(0x1c1), _0x1f4662(0x5b5), _0x1f4662(0x3aa), _0x1f4662(0x221), 'strikeThrough', _0x1f4662(0x36c), _0x1f4662(0x1a5), _0x1f4662(0x3e3), _0x1f4662(0x337), _0x1f4662(0x2aa)],
    fontgenArrayMap = [_0x1f4662(0x4fa), _0x1f4662(0x1d6), _0x1f4662(0x301), _0x1f4662(0x4ff), _0x1f4662(0x1f6), _0x1f4662(0x30e), _0x1f4662(0x354), _0x1f4662(0x4cc), _0x1f4662(0x287), 'squiggle3CharMapFun', _0x1f4662(0x282), _0x1f4662(0x28a), _0x1f4662(0x36e), _0x1f4662(0x4c4), _0x1f4662(0x4d9), _0x1f4662(0x33d), 'cursiveCharMapFun', _0x1f4662(0x33f), _0x1f4662(0x17f), _0x1f4662(0x1a3), _0x1f4662(0x280), 'upperAnglesCharMapFun', _0x1f4662(0x506), _0x1f4662(0x51c), _0x1f4662(0x2f0), _0x1f4662(0x59e), 'asianStyle2CharMapFun'];

function applyCharMap(_0xe19a17, _0xd9d159) {
    var _0x411b84 = _0x1f4662;
    let _0x5e00b2 = '';
    for (let _0x4e2ff2 of _0xd9d159[_0x411b84(0x540)]('')) {
        if (_0xe19a17[_0x4e2ff2] !== undefined) _0x5e00b2 += _0xe19a17[_0x4e2ff2];
        else {
            if (_0xe19a17[_0x4e2ff2[_0x411b84(0x311)]()] !== undefined) _0x5e00b2 += _0xe19a17[_0x4e2ff2['toLowerCase']()];
            else _0x5e00b2 += _0x4e2ff2;
        }
    }
    return _0x5e00b2;
}

function invertedSquaresCharMapFun(_0x48ddbf) {
    return applyCharMap(invertedSquaresCharMap, _0x48ddbf);
}

function wideTextCharMapFun(_0xa18508) {
    return applyCharMap(wideTextCharMap, _0xa18508);
}

function squaresCharMapFun(_0x5d872a) {
    return applyCharMap(squaresCharMap, _0x5d872a);
}

function subscriptCharMapFun(_0x44a111) {
    return applyCharMap(subscriptCharMap, _0x44a111);
}

function bentTextCharMapFun(_0x2efd23) {
    return applyCharMap(bentTextCharMap, _0x2efd23);
}

function neonCharMapFun(_0x48f3ae) {
    return applyCharMap(neonCharMap, _0x48f3ae);
}

function futureAlienCharMapFun(_0x5c41f0) {
    return applyCharMap(futureAlienCharMap, _0x5c41f0);
}

function squiggleCharMapFun(_0x33d444) {
    return applyCharMap(squiggleCharMap, _0x33d444);
}

function squiggle2CharMapFun(_0x22af3e) {
    return applyCharMap(squiggle2CharMap, _0x22af3e);
}

function squiggle3CharMapFun(_0x1086c2) {
    return applyCharMap(squiggle3CharMap, _0x1086c2);
}

function squiggle4CharMapFun(_0x505dde) {
    return applyCharMap(squiggle4CharMap, _0x505dde);
}

function squiggle5CharMapFun(_0x41ec45) {
    return applyCharMap(squiggle5CharMap, _0x41ec45);
}

function squiggle6CharMapFun(_0x35a70a) {
    return applyCharMap(squiggle6CharMap, _0x35a70a);
}

function boldCharMapFun(_0x246c64) {
    return applyCharMap(boldCharMap, _0x246c64);
}

function oldEnglishCharMapFun(_0x57be67) {
    return applyCharMap(oldEnglishCharMap, _0x57be67);
}

function medievalCharMapFun(_0x7acbc6) {
    return applyCharMap(medievalCharMap, _0x7acbc6);
}

function cursiveCharMapFun(_0x143ca0) {
    return applyCharMap(cursiveCharMap, _0x143ca0);
}

function doubleStruckCharMapFun(_0x3063ab) {
    return applyCharMap(doubleStruckCharMap, _0x3063ab);
}

function italicCharMapFun(_0x2db85b) {
    return applyCharMap(italicCharMap, _0x2db85b);
}

function boldItalicCharMapFun(_0x38aa99) {
    return applyCharMap(boldItalicCharMap, _0x38aa99);
}

function monospaceCharMapFun(_0x50e9aa) {
    return applyCharMap(monospaceCharMap, _0x50e9aa);
}

function upperAnglesCharMapFun(_0x39bdd2) {
    return applyCharMap(upperAnglesCharMap, _0x39bdd2);
}

function greekCharMapFun(_0x426500) {
    return applyCharMap(greekCharMap, _0x426500);
}

function symbolsCharMapFun(_0x3d5967) {
    return applyCharMap(symbolsCharMap, _0x3d5967);
}

function currencyCharMapFun(_0x11d301) {
    return applyCharMap(currencyCharMap, _0x11d301);
}

function asianStyleCharMapFun(_0x3072b7) {
    return applyCharMap(asianStyleCharMap, _0x3072b7);
}

function asianStyle2CharMapFun(_0x5791e6) {
    return applyCharMap(asianStyle2CharMap, _0x5791e6);
}
var luni = new Lunicode();

function _0x3be7() {
    var _0x1d11ed = ['&#1062;', 'A&#826;', 'G&#857;', '•´¯`•.\x20[[text]]\x20.•´¯`•', 'e&#828;', '&#1223;', '6&#826;', 'N&#846;', 'a&#799;', '.cursiveCharMap', '&#3648;', 'D&#830;', '&#3057;', '🖫︎', '2&#799;', 'fullCrazy', '🏱︎', 'vaporwaveText', '&#120825;&#823;', '&#9450;', '&#120451;&#823;', '&#1140;', '0&#830;', 'd&#838;', '&#5609;', '&#8355;', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', '$2$1', '6&#866;', 'O&#826;', 'K&#826;', 'k&#828;', 'I&#857;', '9&#846;', 'replace', 'y&#829;&#851;', 'i&#830;', '°·.¸.·°¯°·.¸.·°¯°·.¸.->\x20', 'q&#799;', '&#1040;', '&#1097;', 'x&#830;', '&#41029;', '&#435;', '&#41246;', 'z&#846;', '&Gamma;', '••.•´¯`•.••\x20[[text]]\x20••.•´¯`•.••', 'z&#838;', '—(••÷', 's&#838;', 'j&#857;', '.result-s29', 'W&#828;', 'charCodeAt', '.flourish6', 'u&#830;', 'r&#846;', '.strikeThrough', 'X&#857;', '(/◔◡◔)/', 'P&#838;', 'flip', '٩(˘◡˘)۶', 'y&#846;', '&#41433;', '(-_-)\x20[[text]]\x20(-_-)', '&#670;', 's25', '1&#830;', 'randomization', 'C&#829;&#851;', '&#9442;', '9&#857;', 'Q&#826;', 'toUpperCase', 'px}\x20</style>', '】〗〙〛］', 'B&#828;', 'K&#857;', 'Z&#826;', '2&#826;', '7&#829;&#851;', 's19', '&#2790;', 'N&#830;', '&#1179;', '.diametricAngleFrame', 'ღ(¯`◕‿◕´¯)\x20♫\x20♪\x20♫\x20[[text]]\x20♫\x20♪\x20♫\x20(¯`◕‿◕´¯)ღ', '(ɔ◔‿◔)ɔ', 'q&#857;', '••.•´¯`•.••\x20', '&#8857;', '.result-s21', '&#41296;', '&#41706;', '&#42150;', '&#5616;', 'f&#857;', '&#1488;', '&#387;', 'r&#826;', 'f&#828;', 's20', 'x&#799;', '&#41079;', '&#1074;', '2&#857;', 'bottom', '&#327;', 'z&#799;', '&forall;', '0&#866;', '&#1072;', '(¯`*•.¸,¤°´✿.｡.:*\x20[[text]]\x20*.:｡.✿`°¤,¸.•*´¯)', '●‿●', 'H&#866;', '&nu;', '&#9730;', '⫷\x20[[text]]\x20⫸', '7&#838;', 'v&#866;', 't&#829;&#851;', '&#120461;&#823;', 'h&#866;', '.wideTextCharMap', '&ETH;', '&#41532;', '&#9736;', '.flourish3', '&#350;', '9&#838;', '&#4331;', '&#1078;', '.o0×X×0o.\x20', 'N&#866;', 'w&#838;', '1&#866;', '(^▽^)', 'o&#828;', '&#41081;', '&#120437;&#823;', 'F&#799;', '&#23610;', '(¯`·.¸¸.->\x20°º\x20', 'c&#830;', 'A&#838;', '&#8023;', '&#42148;', 's21', '&#120436;&#823;', 'push', '◦•●◉✿\x20[[text]]\x20✿◉●•◦', 'input', 'V&#866;', 'options', 'I&#838;', '2&#829;&#851;', 'U&#846;', '&#41045;', 'U&#830;', '&#595;', '&#646;', '&#627;', '&#647;', 'i&#857;', '&#1356;', '&scaron;', '7&#846;', 'input\x20change', 'Y&#828;', '&#42171;', '&#5845;', 'k&#866;', '.vaporwaveText1', '.firework', 'H&#830;', 'm&#846;', '&kappa;', '.lunitoolstinyencode', 'insertBefore', 'G&#829;&#851;', 'cookie', 'italicCharMapFun', '8&#829;&#851;', 't&#799;', 'b&#829;&#851;', '&#41712;', '.result-s22', '&#382;', 'z&#857;', '&#1333;', 'C&#857;', 'i&#829;&#851;', '&#2414;', '&#996;', 'W&#846;', 'ıllıllı\x20[[text]]\x20ıllıllı', '&#412;', '.stylenamerecentlist', 'I&#828;', '8&#838;', '.flourish1', '&alpha;', 's17', 'V&#838;', '&#42180;', '0&#838;', '🕛︎', '&#268;', 's&#846;', 'N&#829;&#851;', '▀▄▀▄▀▄\x20', '&#1360;', '&#42131;', '_blank', '&#608;', 'encode', '#loader', 'boldItalicCharMapFun', '&#9790;', 'underline', 'n&#829;&#851;', '5142147SzBKNP', '&#41203;', '&#120474;&#823;', '&#1330;', '&#1092;', '&#20057;', 'f&#838;', 'u&#866;', '&#1031;', 'r&#857;', '•._.••´¯``•.¸¸.•`\x20', '&#40974;', '.result-s14', 'S&#857;', 'J&#857;', '1&#799;', '3&#799;', '&#120434;&#823;', '&#9835;', '&#642;', '9&#799;', '&#120446;&#823;', '&#19973;', '&#42130;', 'f&#866;', '2&#838;', 'wavyJoiner', 'textSize', '[[text]]\x20☜(`o´)', 'z&#828;', '<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>', 'L&#838;', 'h&#799;', 'k&#857;', '.superscriptCharMap', 'M&#866;', '¸„.-•~¹°”ˆ˜¨\x20', '•´¯`•»\x20', '.currencyCharMap', 'reverse', 'O&#830;', '.fullCrazy', 'A&#799;', '&#41833;', '#textSize', 's27', '&#4336;', 'wideTextCharMapFun', 'v&#829;&#851;', 'o&#830;', 'n&#846;', '.littleSparkles', '9&#866;', 'b&#830;', 'diacriticsTop', '&#120438;&#823;', 'K&#846;', 'X&#826;', 's30', '••¤(`×[¤\x20[[text]]\x20¤]×´)¤••', '.•°¤*(¯`★´¯)*¤°\x20', '9&#826;', '.medievalCharMap', 'f&#799;', '1&#838;', '❀◕‿◕❀', '.result-s7', '&#344;', '&sigmaf;', '&#120433;&#823;', '8&#846;', 'moveToElementText', '&#1008;', '.stylenamerecentlist\x20.stylename', '&#41807;', '(✿╹◡╹)', '&#41155;', '•´¯`•»\x20[[text]]\x20«•´¯`•', 'r&#799;', 'bentTextCharMapFun', '&#391;', '&#1180;', '&part;', 'readOnly', '⁀‿⁀', '•]••´º´•»\x20', 'D&#829;&#851;', '&#438;', '&Xi;', '🕐︎', '&#321;', 'Y&#829;&#851;', '0&#799;', '941240eDIKUi', '&fnof;', '&#272;', 'last', '&#5741;', '9&#829;&#851;', '🕿︎', '&#41427;', '&#1059;', 's23', 'b&#857;', '&oplus;', 'L&#799;', '&#42159;', '&#1063;', 'v&#838;', '&Uacute;', 'onload', 'exports', '&#576;', '&#x', 'e&#866;', 'h&#838;', '&#120457;&#823;', 'U&#866;', '🕮︎', '.result-s26', 'tools', 'ღƪ(ˆ◡ˆ)ʃ♡\x20[[text]]\x20♡ƪ(ˆ◡ˆ)ʃ♪', 'crossAboveBelow', 'Z&#829;&#851;', 'o&#838;', '(✿^▽^)', '&#477;', 'v&#826;', '`•.¸¸.•´´¯`••._.•\x20', '.squiggle5CharMap', '.y2k-font', 'r&#830;', '&#120448;&#823;', '8&#826;', 'Z&#830;', '&#1141;', 'M&#857;', 'append', '1&#826;', 'g&#828;', 'v&#830;', 's16', 's15', 'j&#799;', '0&#846;', '&#5198;', '7&#830;', '&#120460;&#823;', '.futureAlienCharMap', 'hide', '&euro;', 'A&#857;', '2&#846;', '«-(¯`v´¯)-«\x20[[text]]\x20»-(¯`v´¯)-»', '&chi;', '¸¸♬·¯·♩¸¸♪·¯·♫¸¸\x20[[text]]\x20¸¸♫·¯·♪¸¸♩·¯·♬¸¸', 'K&#829;&#851;', '&#41141;', '&#429;', '&#10122;', 'diacriticsBottom', '&#355;', 'H&#828;', '(y)', 'Q&#799;', 'l&#857;', '(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧', 'o&#866;', 'O&#829;&#851;', '.luniroundsquares', '👓︎', '&#270;', '&#41074;', '&#9834;', '.leftsection', ']|I{•------»\x20', '&#490;', 'm&#829;&#851;', 'k&#838;', '&#1352;', '.result-s5', '&#296;', '0&#829;&#851;', 'm&#838;', '💣︎', '\x20•°*”˜.•°*”˜', 'animate', '&#5620;', '&#120466;&#823;', 'E&#826;', '</p></div>', '░▒▓█\x20[[text]]\x20█▓▒░', '`•.¸¸.•´´¯`••._.•\x20[[text]]\x20•._.••`¯´´•.¸¸.•`', '▌│█║▌║▌║\x20[[text]]\x20║▌║▌║█│▌', 'C&#828;', '&Oslash;', '(¯`·.¸¸.·´¯`·.¸¸.->\x20', '&#381;', 'Z&#838;', '&#120453;&#823;', 'a&#826;', 'o&#799;', '&#41949;', '&#4327;', '.result-s12', '୧(•̀ᗝ•́)૭\x20[[text]]\x20୧(⇀‸↼‶)૭', '&#41008;', 'a&#857;', 's31', '&#987;', '&dagger;', 'R&#838;', 'a&#846;', 'm&#826;', 'mirror', 'creepify', '•._.••´¯``•.¸¸.•`\x20[[text]]\x20`•.¸¸.•´´¯`••._.•', 'monospaceCharMapFun', 'c&#826;', 'squiggle4CharMapFun', 'addRange', '☽≫≻≽≿⋝⋟⋑⊃⊐⊒⫸》＞❯❱', '&#1358;', 'E&#830;', 'squiggle2CharMapFun', '&#4315;', '⚔️\x20[[text]]\x20⚔️', 'squiggle5CharMapFun', 'floor', 'P&#829;&#851;', 'nodeName', '<br>\x0a', '.oldEnglishCharMap', 'n&#799;', 'W&#866;', '.doubleUnderline', '&#12552;', '🖴︎', 'リサフランク現代のコンピュ竹内\x20まりや若者が履く流行のスニーカー真夜中のドアホットドッグマスターストライカーソニーブギ新しい日の誕生ライフ\x20-\x20ヒスイ蒸気波\x20無線゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゙゚゛゜ゝゞゟ亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育壱逸茨芋引印因咽姻員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科', 'f&#826;', '&#1139;', 'L&#829;&#851;', '&#639;', 'I&#829;&#851;', 'O&#828;', 'fixedtop', '&#276;', '&#416;', 'B&#838;', '&#401;', 'k&#846;', '°°°·.°·..·°¯°·._.·\x20', '&#652;', '8&#866;', 'decode', '&#1084;', 'A&#828;', '&#42075;', 'U&#829;&#851;', 'scriptify', '40WrajYI', 'B&#846;', '&#9761;', 'W&#857;', '&#2792;', '&#1050;', 'R&#826;', 'class', 'scroll', 'U&#826;', '&#1043;', '.result-s25', '【$1】', 'Q&#828;', 'X&#838;', 'test', '.lunitoolsmirrorencode', '&#295;', 's11', '&#607;', '5&#830;', 'click', '1&#857;', '&#41754;', 'remove', '8&#799;', '.subscriptCharMap', '๑۞๑,¸¸,ø¤º°`°๑۩\x20', '&#651;', '.result-s23', '4&#799;', 'getSelection', 's18', '&beta;', 'n&#830;', 'random', 'getHTML', 'y&#826;', '🕈︎', 'max', '&#942;', '&#5167;', 'B&#830;', '&#8134;', '.squiggle6CharMap', '&#1044;', 'queryCommandSupported', '&#5290;', '&#654;', '&#1047;', '&#41076;', '#mobile-fly-menu', '&#120473;&#823;', '&#404;', 'Q&#866;', 't&#830;', '.thickBlockFramed', '36UfCRNe', '&#5205;', 's&#830;', '.crazyWithFlourishOrSymbols', '.stinky', '\x20.o0×X×0o.\x20[[text]]\x20.o0×X×0o.', '๑۞๑,¸¸,ø¤º°`°๑۩\x20[[text]]\x20๑۩\x20,¸¸,ø¤º°`°๑۞๑', '&#5623;', 'F&#826;', 'u&#857;', 'k&#830;', 'X&#828;', 'currencyCharMapFun', 'V&#846;', 'F&#866;', '5&#846;', 'round', '&#1331;', '&#120462;&#823;', 's22', '&#1359;', 'a&#828;', 'html', '.squiggle4CharMap', 'rel', 'contentEditable', '&#1079;', 'R&#866;', '&#41555;', 'squaresCharMapFun', '&#1213;', '&#40996;', '&#41648;', 'bubbles', '.result-s9', '.squiggleCharMap', '&iota;', '&#7433;', '&#120463;&#823;', '&#41976;', '&#407;', 'x&#846;', 'neonCharMapFun', '&#41708;', 'X&#866;', 'toLowerCase', 'h&#829;&#851;', 'title', '.upperAnglesCharMap', '&#41295;', 'b&#799;', '&#3588;', '&#41042;', 'M&#846;', '-·=»‡«=·-\x20[[text]]\x20-·=»‡«=·-', '&#41016;', 'o&#846;', 'w&#799;', '&#10127;', '&#1075;', 'e&#829;&#851;', '8&#830;', '2EHLIMr', '&#4329;', '(¯`·.¸¸.·´¯`·.¸¸.->\x20[[text]]\x20<-.¸¸.·´¯`·.¸¸.·´¯)', 'e&#826;', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20', '•?((¯°·._.•\x20[[text]]\x20•._.·°¯))؟•', '&#65434;', 'E&#846;', '&#1349;', 'O&#799;', 'maxHeight', '&#1046;', '5&#828;', '.result-s11', '&#2794;', '#y2k-font', '&#10126;', '5&#838;', 'P&#826;', '°°°·.°·..·°¯°·._.·\x20[[text]]\x20·._.·°¯°·.·°\x20.·°°°', '&#645;', 'slashThrough', '&#41157;', '.result-s17', '&#120447;&#823;', '217363QHjYBf', 'squares', 'medievalCharMapFun', 'c&#838;', 'doubleStruckCharMapFun', '&#120455;&#823;', '&#1202;', 'H&#838;', 'y&#838;', '&#1111;', '｡*ﾟ.*.｡(っ\x20ᐛ\x20)っ✂╰⋃╯\x20[[text]]', 'I&#846;', '\x22\x20/><span\x20class=\x22copybtn\x22>✔\x20Copied\x20!</span></p>', '&#41823;', '#scroll', 'Copy', 'S&#828;', '.result-s27', '&#42014;', 'tiny', 's&#826;', '&#4335;', 'x&#866;', 'M&#826;', 'setSelectionRange', 'futureAlienCharMapFun', '🕙︎', '&#434;', '&#9815;', '📂︎', '┗(^o^\x20)┓三\x20[[text]]\x20三\x20┗(^o^\x20)┓', '&#998;', '5&#826;', '&#310;', '&#42015;', '⎝⎝✧GͥOͣDͫ✧⎠⎠\x20[[text]]\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', '&#1192;', '🗐︎', '&#1112;', 'mapInverse', '&#1344;', 'Y&#846;', 'N&#799;', '&#392;', 's26', '&#633;', '&#8467;', '&#409;', 'J&#830;', 'tildeStrikeThrough', 'join', 'squiggle6CharMapFun', '&#394;', '🕒︎', '^ㅅ^', '&#1073;', 's24', 'val', '&#1342;', '&#8984;', '&#120452;&#823;', 'E&#829;&#851;', 'w&#846;', '.italicCharMap', '&#120831;&#823;', 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890', 'A&#829;&#851;', '&otilde;', '&#120440;&#823;', '&#10123;', '.crossAboveBelow', '&#974;', '&#120829;&#823;', 'f&#830;', 'g&#799;', '&#120823;&#823;', '&#1087;', '&#985;', 'o&#826;', '#random', '&#120467;&#823;', 'expires', '&#9739;', 'recenttext', 'w&#829;&#851;', '&#406;', '&#4306;', '&szlig;', '╰☆☆\x20[[text]]\x20☆☆╮', '.symbolsCharMap', '&#1105;', 'u&#846;', 'x&#826;', 'G&#828;', 'Z&#828;', '.neonCharMap', 'a&#830;', '&Delta;', 'recentlist', '&#41426;', '(ㅅꈍ﹃ꈍ)*\x20[[text]]\x20*(ꈍ﹃ꈍㅅ)♡', '&#447;', '0&#828;', '3&#828;', 'N&#857;', 'ıllıllı\x20', '&Mu;', '2&#830;', 'b&#828;', '·.¸¸.·♩♪♫\x20[[text]]\x20♫♪♩·.¸¸.·', '(¯´•._.•\x20[[text]]\x20•._.•´¯)', 'arrowBelow', '&#40984;', '.result-s3', '&#1094;', '▌│█║▌║▌║\x20', '░▒▓█►─═\x20\x20[[text]]\x20═─◄█▓▒░', 'kirbyHug', 'p&#838;', 'amd', 'window', '&omega;', 'https://calligraphyfonts.pro/', '&#2799;', '&#4325;', 'g&#838;', '.monospaceCharMap', '&#669;', '&#586;', '&#5511;', '🕓︎', '6&#799;', '🕔︎', '\x20\x20🎀\x20\x20', '4&#829;&#851;', '&#41731;', '&#120471;&#823;', '&phi;', 'D&#846;', 'z&#829;&#851;', '&#3182;', '📬︎', '&#1076;', 'text', '6&#857;', '&#4318;', '¸,ø¤º°`°º¤ø,¸\x20[[text]]\x20¸,ø¤º°`°º¤ø,¸', 's&#866;', 'U&#857;', '5&#799;', '.squiggle2CharMap', 'nodeType', '������', '.result-s31', '(人◕‿◕)', 'R&#830;', 'h&#826;', 'J&#846;', '.lunisquares', 'INPUT', 'ready', '&epsilon;', '&#9773;', 'X&#799;', '&#4317;', '🗏︎', 'T&#846;', '&#65420;', 'doubleUnderline', 'Y2k\x20Font', 'Z&#799;', '&#1085;', 'e&#846;', '&#5029;', 'scrollTop', '&#7918;', '&#120828;&#823;', '&#2798;', '.result-s1', '&#5597;', '&upsilon;', 'x&#829;&#851;', '.lunitoolsbubbles', '&#653;', '&#5556;', 'find', '3&#838;', '§.•´¨\x27°÷•..×\x20', '&#1506;', 'L&#866;', 'E&#838;', '.copied', 'q&#829;&#851;', 's10', 'G&#799;', '&#1065;', '1&#828;', '&#358;', 'u&#799;', '&#1338;', 'N&#828;', 'indexOf', '&#9796;', '.result-s19', '📁︎', '&#549;', '.invertedSquaresCharMap', 'N&#826;', '&#625;', '651690nxvAuv', 'createRange', '.result-s2', '(✿◕ᗜ◕)━♫.*･｡ﾟ', '.asianStyle2CharMap', '&eta;', '*´¯`*.¸¸.*´¯`*\x20', '&#41007;', 'c&#829;&#851;', 'g&#830;', '.•♫•♬•\x20[[text]]\x20•♬•♫•.', 'v&#799;', '&#403;', '&#41571;', 'r&#828;', 'i&#828;', 'l&#866;', '😐︎', '&#423;', 'N&#838;', '&#1350;', '•]••´º´•»\x20[[text]]\x20«•´º´••[•', '&#1193;', 'w&#866;', 'J&#838;', 'p&#846;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', '&#10081;', '【〖〘〚［', 'j&#828;', '&#12425;', '&#120822;&#823;', '&#548;', 'A&#830;', '<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22Press\x20CTRL+C\x20to\x20copy\x22\x20/></p>', '&#3923;', '2&#828;', '(｡◕‿◕｡)', 'x&#857;', '&#41346;', 'href', 'object', '&#120449;&#823;', '🌘‿🌘', '&micro;', '.leftsection\x20.close', '<:::::[]=¤\x20[[text]]\x20(▀̿̿Ĺ̯̿̿▀̿\x20̿)', 'F&#857;', '&#41204;', 'H&#857;', '&#10003;', '&#1103;', 'f&#846;', '&#374;', '&#323;', '&#120481;&#823;', '&#8627;', '&#1340;', '&#422;', '*•.¸♡\x20[[text]]\x20♡¸.•*', 'l&#838;', '.squaresCharMap', 'Z&#866;', '\x20⋆\x20', 'c&#866;', '8&#857;', 'O&#838;', '&#120454;&#823;', '&#120441;&#823;', '&#262;', '(っ◔◡◔)っ\x20♥\x20', '🕯︎', '•°¯`••\x20[[text]]\x20••´¯°•', '&#41240;', '.result-s24', '★·.·´¯`·.·★\x20[[text]]\x20★·.·´¯`·.·★', 'V&#857;', 'K&#799;', 'prepend', '&#9812;', '&#5262;', '&#2749;', '&#42181;', '&#940;', '&#408;', '6&#846;', '.kirbyHug', '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', '&#1171;', '📄︎', 'n&#866;', 'c&#799;', 'P&#828;', 'style', 'C&#799;', '&#5610;', 'selectNodeContents', 'W&#830;', '&#5196;', '&#120464;&#823;', '&#294;', '16975596BxrZWl', 'y&#799;', 'pop', '&iuml;', 'h&#828;', 'D&#799;', 's&#799;', '&#623;', 'global', 'M&#828;', '.boldItalicCharMap', 'd&#829;&#851;', '&thorn;', 'removeAllRanges', '•°¯`••\x20', 'p&#830;', '&sigma;', 'r&#866;', '📫︎', '—(••÷[\x20[[text]]\x20]÷••)—', 'g&#857;', '.flourish8', '.result-s30', 'q&#846;', 't&#826;', 'H&#829;&#851;', '&#5615;', '#load-more', 'Q&#846;', 'G&#846;', '.wingdings', '&#5500;', '📭︎', '&#484;', 'j&#846;', 'Y&#838;', '&#41804;', 'a&#829;&#851;', '&#41660;', 'y2kcredit', '&#9687;', '&#356;', '&#988;', 'h&#857;', 'q&#828;', ',-*\x27^\x27~*-.,_,.-*~\x20', 'charAt', '.lunicreepify', 'innerHTML', '&#120482;&#823;', 'ᕕ(ᐛ)ᕗ', '<div\x20class=\x22stylename\x22><span>Recently\x20Used</span><p\x20onclick=\x22copyit(this)\x22\x20data-clipboard-target=\x22.', '×º°”˜`”°º×\x20[[text]]\x20×º°”˜`”°º×', '&#41080;', '&#315;', '★·.·´¯`·.·★\x20', '◥꧁ད\x20[[text]]\x20ཌ꧂◤', '&#41863;', 'c&#846;', '&#340;', 'c&#857;', 'k&#826;', 's29', 'w&#857;', '(づ｡◕‿‿◕｡)づ', '&ugrave;', '&#336;', '.result-s10', 'S&#829;&#851;', '¤¸¸.•´¯`•¸¸.•..>>\x20', 'M&#830;', 'fadeIn', '&#592;', 'q&#826;', '★彡\x20[[text]]\x20彡★', '&#120444;&#823;', '&#41392;', 'l&#799;', '&#541;', '🕭︎', 'i&#826;', '¤\x20(¯´☆✭.¸_)¤\x20[[text]]\x20¤(_¸.✭☆´¯)\x20¤', '4&#830;', 'boldCharMapFun', 'littleSparkles', 'm&#830;', 'p&#828;', 'R&#799;', 'S&#826;', 'U&#828;', 'undefined', 'squiggleCharMapFun', 'length', '↫↫↫↫↫\x20[[text]]\x20↬↬↬↬↬', '&#411;', '&#120468;&#823;', 'location', '3&#829;&#851;', 'fromCharCode', '&#10125;', '<style>\x20.stylename\x20p{font-size:', 'D&#866;', '&#41126;', '177130INgwbw', 'oldEnglishCharMapFun', '#share-link', '&#41120;', 'setAttribute', '🖃︎', '&#2797;', '&#372;', '&#120475;&#823;', 'j&#838;', '&#1348;', 'y&#828;', '&#120445;&#823;', 'b&#826;', 'm&#866;', '&#1351;', '|!¤*\x27~``~\x27*¤!|\x20[[text]]\x20|!¤*\x27~``~\x27*¤!|', '-漫~*\x27¨¯¨\x27*·舞~\x20[[text]]\x20~舞*\x27¨¯¨\x27*·~漫-', '&#41766;', 'function', '&#1095;', '&#120442;&#823;', 'Y&#866;', '&#41733;', '&#10129;', '7&#826;', 'e&#799;', '&#1071;', '&#1052;', '&#5229;', 'T&#857;', '&#420;', '[[text]]', '&#1178;', 'invertedSquaresCharMapFun', 'weirdBox', '【｡_｡】\x20[[text]]\x20【｡_｡】', '&#613;', '3&#846;', 'subscriptCharMapFun', 'O&#857;', '&#351;', 'd&#830;', '&#12579;', '&#120830;&#823;', '&#1028;', 'greekCharMapFun', 'G&#866;', '&#1347;', '&#1185;', 'B&#866;', 'E&#857;', '&#41037;', '&#638;', 'init', 'M&#838;', 'W&#838;', '&#385;', 'C&#826;', 'target', '&#4330;', 'x&#838;', '.vaporwaveText', 'I&#866;', '&#1041;', 'diametricAngleFrame', '🖮︎', 's12', 'symbolsCharMapFun', 'X&#829;&#851;', 'map', 't&#857;', '&#3619;', '.vaporwaveText2', '&#311;', '&#2670;', '&#9837;', '&#120450;&#823;', 'D&#826;', 'userAgent', 'i&#846;', '.stylenamelist', '[̲̅$1]', '&#40983;', 'm&#799;', 'g&#826;', '&#41674;', 'ஜ۩۞۩ஜ\x20[[text]]\x20ஜ۩۞۩ஜ', 'fadeOut', 'body', '.slashThrough', '&#41053;', 'trim', 'I&#799;', '&#618;', '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', 'U&#838;', '&#313;', '&#413;', 'C&#838;', '&#1283;', '<%=\x20version\x20%>', 'match', '&#418;', 'split', '▀▄▀▄▀▄\x20[[text]]\x20▄▀▄▀▄▀', 'k&#829;&#851;', 's13', '&#120483;&#823;', '📪︎', 'top', '&#400;', '&rho;', '&#377;', '.result-s18', 'n&#826;', '&#41105;', '&#41751;', '.flourish7', '&#120824;&#823;', 'ᵔ⌣ᵔ', '89915VHxvTe', '&#41556;', 'q&#838;', '&#614;', 'l&#828;', 'j&#826;', '&#120480;&#823;', '(≧◡≦)', '7&#828;', '.scriptify', 'Z&#857;', '&#10130;', '🕑︎', 'w&#826;', '&#7990;', 't&#838;', '0&#857;', 'd&#866;', '&#120477;&#823;', '&psi;', 'html,\x20body', '&#943;', '&#5397;', ',-*\x27\x20^\x20\x27~*-.,_,.-*~\x20[[text]]\x20~*-.,_,.-*~\x27\x20^\x20\x27*-,', '&#972;', 'p&#799;', '&#41005;', 'j&#830;', '.result-s20', 'show', 'Y&#830;', 'X&#830;', '🖂︎', '3&#826;', 'diacriticsMiddle', '786mhwnpk', 'V&#799;', '&#42128;', '&Omega;', 'P&#846;', '.greekCharMap', 'esrever', '&#341;', '&#7828;', 'L&#826;', 'Q&#838;', '&#308;', '.result-s4', '&#4308;', '2&#866;', '&#615;', '&#120456;&#823;', 'J&#799;', '&#41991;', 'v&#828;', 'R&#857;', '&#1060;', '4&#838;', '&#120479;&#823;', '&#1291;', 'u&#838;', '◠◡◠', '&#1048;', 'width', 'T&#829;&#851;', '&#286;', '(⌒‿⌒)', '&#1337;', 'h&#830;', 'F&#838;', '.heartsBetween', 'createTextRange', 'U&#799;', '4&#826;', '&#258;', 'Y&#857;', '&#120478;&#823;', 'asianStyleCharMapFun', '&#1397;', 'q&#830;', '&Lambda;', 'n&#828;', 's(^‿^)-b'];
    _0x3be7 = function() {
        return _0x1d11ed;
    };
    return _0x3be7();
}
luni['tools'][_0x1f4662(0x27e)]['options'][_0x1f4662(0x32c)] = 0xa;

function crazyWithFlourishOrSymbols(_0x41c911) {
    var _0x2cb512 = _0x1f4662;
    if (Math[_0x2cb512(0x2ce)]() < 0.7) return wrapInSymbols(crazifyText(_0x41c911), 0x2);
    else return wrapInFlourish(crazifyText(_0x41c911), 0x2);
}

function strikeThrough(_0x5d9b6a) {
    var _0x18f720 = _0x1f4662;
    return _0x5d9b6a[_0x18f720(0x540)]('')[_0x18f720(0x36d)]('̶') + '̶';
}

function tildeStrikeThrough(_0x3c11a1) {
    return _0x3c11a1['split']('')['join']('̴') + '̴';
}

function underline(_0x568e7d) {
    var _0x3fae86 = _0x1f4662;
    return _0x568e7d[_0x3fae86(0x540)]('')[_0x3fae86(0x36d)]('̲') + '̲';
}

function doubleUnderline(_0x3b9012) {
    var _0x428c06 = _0x1f4662;
    return _0x3b9012[_0x428c06(0x540)]('')[_0x428c06(0x36d)]('̳') + '̳';
}

function slashThrough(_0x32812a) {
    var _0xd0365 = _0x1f4662;
    return _0x32812a[_0xd0365(0x540)]('')[_0xd0365(0x36d)]('̷') + '̷';
}

function stinky(_0x28d067) {
    var _0x5e64be = _0x1f4662;
    return _0x28d067[_0x5e64be(0x540)]('')[_0x5e64be(0x36d)]('̾') + '̾';
}

function heartsBetween(_0x37ab36) {
    var _0x384130 = _0x1f4662;
    return _0x37ab36[_0x384130(0x540)]('')[_0x384130(0x36d)]('♥');
}

function arrowBelow(_0x53255b) {
    var _0x124134 = _0x1f4662;
    return _0x53255b['split']('')[_0x124134(0x36d)]('͎') + '͎';
}

function crossAboveBelow(_0x512393) {
    var _0xda836 = _0x1f4662;
    return _0x512393[_0xda836(0x540)]('')[_0xda836(0x36d)]('͓̽') + '͓̽';
}
var f = {};
f['0'] = _0x1f4662(0x407), f['1'] = _0x1f4662(0x358), f['2'] = _0x1f4662(0x465), f['3'] = _0x1f4662(0x3e0), f['4'] = _0x1f4662(0x360), f['5'] = '🗄︎', f['6'] = '⌛︎', f['7'] = _0x1f4662(0x51a), f['8'] = '🖰︎', f['9'] = '🖲︎', f['!'] = '✏︎', f['\x22'] = '✂︎', f['#'] = '✁︎', f['$'] = _0x1f4662(0x251), f['%'] = _0x1f4662(0x4c0), f['&'] = _0x1f4662(0x21d), f['\x27'] = _0x1f4662(0x453), f['('] = _0x1f4662(0x20a), f[')'] = '✆︎', f['*'] = _0x1f4662(0x571), f['+'] = _0x1f4662(0x4dd), f[','] = _0x1f4662(0x545), f['-'] = _0x1f4662(0x483), f['.'] = _0x1f4662(0x3c8), f['/'] = _0x1f4662(0x491), f[':'] = '🖳︎', f[';'] = _0x1f4662(0x294), f['<'] = _0x1f4662(0x5b1), f['='] = '🖬︎', f['>'] = '✇︎', f['?'] = '✍︎', f['A'] = '✌︎', f['B'] = '👌︎', f['C'] = '👍︎', f['D'] = '👎︎', f['E'] = '☜︎', f['F'] = '☞︎', f['G'] = '☝︎', f['H'] = '☟︎', f['I'] = '✋︎', f['J'] = '☺︎', f['K'] = _0x1f4662(0x41d), f['L'] = '☹︎', f['M'] = _0x1f4662(0x25f), f['N'] = '☠︎', f['O'] = '⚐︎', f['P'] = _0x1f4662(0x5b4), f['Q'] = '✈︎', f['R'] = '☼︎', f['S'] = '💧︎', f['T'] = '❄︎', f['U'] = '🕆︎', f['V'] = '✞︎', f['W'] = _0x1f4662(0x2d1), f['X'] = '✠︎', f['Y'] = '✡︎', f['Z'] = '☪︎', f['['] = '☯︎', f['\x5c'] = 'ॐ︎', f[']'] = '☸︎', f['^'] = '♈︎', f['_'] = '♉︎', f['`'] = '♊︎', f['a'] = '♋︎', f['b'] = '♌︎', f['c'] = '♍︎', f['d'] = '♎︎', f['e'] = '♏︎', f['f'] = '♐︎', f['g'] = '♑︎', f['h'] = '♒︎', f['i'] = '♓︎', f['j'] = '🙰', f['k'] = '🙵', f['l'] = '●︎', f['m'] = '❍︎', f['n'] = '■︎', f['o'] = '□︎', f['p'] = '◻︎', f['q'] = '❑︎', f['r'] = '❒︎', f['s'] = '⬧︎', f['t'] = '⧫︎', f['u'] = '◆︎', f['v'] = '❖︎', f['w'] = '⬥︎', f['x'] = '⌧︎', f['y'] = '⍓︎', f['z'] = '⌘︎', f['{'] = '❀︎', f['|'] = '✿︎', f['}'] = '❝︎', f['~'] = '❞︎', f['\x20'] = '▯︎', f['€'] = '⓪︎', f['\x20'] = '①︎', f['‚'] = '②︎', f['ƒ'] = '③︎', f['„'] = '④︎', f['…'] = '⑤︎', f['†'] = '⑥︎', f['‡'] = '⑦︎', f['ˆ'] = '⑧︎', f['‰'] = '⑨︎', f['Š'] = '⑩︎', f['‹'] = '⓿︎', f['Œ'] = '❶︎', f['\x20'] = '❷︎', f['Ž'] = '❸︎', f['\x20'] = '❹︎', f['\x20'] = '❺︎', f['‘'] = '❻︎', f['’'] = '❼︎', f['“'] = '❽︎', f['”'] = '❾︎', f['•'] = '❿︎', f['–'] = '◻︎', f['—'] = '◻︎', f['˜'] = '◻︎', f['™'] = '◻︎', f['š'] = '◻︎', f['›'] = '◻︎', f['œ'] = '◻︎', f['\x20'] = '◻︎', f['ž'] = '·︎', f['Ÿ'] = '•︎', f['¡'] = '○︎', f['¢'] = '⭕︎', f['£'] = '◻︎', f['¤'] = '◉︎', f['¥'] = '◎︎', f['¦'] = '◻︎', f['§'] = '▪︎', f['¨'] = '◻︎', f['©'] = '◻︎', f['ª'] = '✦︎', f['«'] = '★︎', f['¬'] = '✶︎', f['®'] = '✹︎', f['¯'] = '✵︎', f['°'] = '◻︎', f['±'] = '⌖︎', f['²'] = '⟡︎', f['³'] = '⌑︎', f['´'] = '◻︎', f['µ'] = '✪︎', f['¶'] = '✰︎', f['·'] = _0x1f4662(0x200), f['¸'] = _0x1f4662(0x55d), f['¹'] = _0x1f4662(0x370), f['º'] = _0x1f4662(0x3bd), f['»'] = _0x1f4662(0x3bf), f['¼'] = '🕕︎', f['½'] = '🕖︎', f['¾'] = '🕗︎', f['¿'] = '🕘︎', f['À'] = _0x1f4662(0x355), f['Á'] = '🕚︎', f['Â'] = _0x1f4662(0x198), f['Ã'] = '◻︎', f['Ä'] = '◻︎', f['Å'] = '◻︎', f['Æ'] = '◻︎', f['Ç'] = '◻︎', f['È'] = '◻︎', f['É'] = '◻︎', f['Ê'] = '◻︎', f['Ë'] = '◻︎', f['Ì'] = '◻︎', f['Í'] = '◻︎', f['Î'] = '◻︎', f['Ï'] = '◻︎', f['Ð'] = '◻︎', f['Ñ'] = '◻︎', f['Ò'] = '◻︎', f['Ó'] = '◻︎', f['Ô'] = '◻︎', f['Õ'] = '⌫︎', f['Ö'] = '⌦︎', f['×'] = '◻︎', f['Ø'] = '➢︎', f['Ù'] = '◻︎', f['Ú'] = '◻︎', f['Û'] = '◻︎', f['Ü'] = '➲︎', f['Ý'] = '◻︎', f['Þ'] = '◻︎', f['ß'] = '◻︎', f['à'] = '◻︎', f['á'] = '◻︎', f['â'] = '◻︎', f['ã'] = '◻︎', f['ä'] = '◻︎', f['å'] = '◻︎', f['æ'] = '◻︎', f['ç'] = '◻︎', f['è'] = '➔︎', f['é'] = '◻︎', f['ê'] = '◻︎', f['ë'] = '◻︎', f['ì'] = '◻︎', f['í'] = '◻︎', f['î'] = '◻︎', f['ï'] = '⇦︎', f['ð'] = '⇨︎', f['ñ'] = '⇧︎', f['ò'] = '⇩︎', f['ó'] = '⬄︎', f['ô'] = '⇳︎', f['õ'] = '⬀︎', f['ö'] = '⬁︎', f['÷'] = '⬃︎', f['ø'] = '⬂︎', f['ù'] = '▭︎', f['ú'] = '▫︎', f['û'] = '✗︎', f['ü'] = '✓︎', f['ý'] = '☒︎', f['þ'] = '☑︎', f['ÿ'] = '◻︎';
const wingdingsCharMap = f;

function wingdings(_0x142096) {
    var _0xfaaa95 = _0x1f4662;
    return _0x142096['split']('')[_0xfaaa95(0x51e)](function(_0x4f474f) {
        return wingdingsCharMap[_0x4f474f] ? wingdingsCharMap[_0x4f474f] : _0x4f474f;
    })[_0xfaaa95(0x36d)]('');
}
var g = {};
g['\x20'] = '\u3000', g['`'] = '`', g['1'] = '１', g['2'] = '２', g['3'] = '３', g['4'] = '４', g['5'] = '５', g['6'] = '６', g['7'] = '７', g['8'] = '８', g['9'] = '９', g['0'] = '０', g['-'] = '－', g['='] = '＝', g['~'] = '~', g['!'] = '！', g['@'] = '＠', g['#'] = '＃', g['$'] = '＄', g['%'] = '％', g['^'] = '^', g['&'] = '＆', g['*'] = '＊', g['('] = '（', g[')'] = '）', g['_'] = '_', g['+'] = '＋', g['q'] = 'ｑ', g['w'] = 'ｗ', g['e'] = 'ｅ', g['r'] = 'ｒ', g['t'] = 'ｔ', g['y'] = 'ｙ', g['u'] = 'ｕ', g['i'] = 'ｉ', g['o'] = 'ｏ', g['p'] = 'ｐ', g['['] = '[', g[']'] = ']', g['\x5c'] = '\x5c', g['Q'] = 'Ｑ', g['W'] = 'Ｗ', g['E'] = 'Ｅ', g['R'] = 'Ｒ', g['T'] = 'Ｔ', g['Y'] = 'Ｙ', g['U'] = 'Ｕ', g['I'] = 'Ｉ', g['O'] = 'Ｏ', g['P'] = 'Ｐ', g['{'] = '{', g['}'] = '}', g['|'] = '|', g['a'] = 'ａ', g['s'] = 'ｓ', g['d'] = 'ｄ', g['f'] = 'ｆ', g['g'] = 'ｇ', g['h'] = 'ｈ', g['j'] = 'ｊ', g['k'] = 'ｋ', g['l'] = 'ｌ', g[';'] = '；', g['\x27'] = '＇', g['A'] = 'Ａ', g['S'] = 'Ｓ', g['D'] = 'Ｄ', g['F'] = 'Ｆ', g['G'] = 'Ｇ', g['H'] = 'Ｈ', g['J'] = 'Ｊ', g['K'] = 'Ｋ', g['L'] = 'Ｌ', g[':'] = '：', g['\x22'] = '\x22', g['z'] = 'ｚ', g['x'] = 'ｘ', g['c'] = 'ｃ', g['v'] = 'ｖ', g['b'] = 'ｂ', g['n'] = 'ｎ', g['m'] = 'ｍ', g[','] = '，', g['.'] = '．', g['/'] = '／', g['Z'] = 'Ｚ', g['X'] = 'Ｘ', g['C'] = 'Ｃ', g['V'] = 'Ｖ', g['B'] = 'Ｂ', g['N'] = 'Ｎ', g['M'] = 'Ｍ', g['<'] = '<', g['>'] = '>', g['?'] = '？';
const vaporwaveCharMap = g;

function vaporwaveText(_0x3777fc) {
    var _0x6e61cd = _0x1f4662,
        _0x6833da = _0x3777fc[_0x6e61cd(0x540)]('\x20')[_0x6e61cd(0x4cd)];
    _0x3777fc = applyCharMap(vaporwaveCharMap, _0x3777fc);
    var _0x19f620 = getAsianChars(Math[_0x6e61cd(0x2d2)](0x3, _0x6833da));
    if (_0x6833da > 0x6) _0x19f620 = _0x19f620['split']('')[_0x6e61cd(0x51e)](_0x5802f4 => _0x5802f4 + ['', ''][Math[_0x6e61cd(0x2f4)](Math[_0x6e61cd(0x2ce)]() * 0.6)])[_0x6e61cd(0x36d)]('');
    var _0x2def19 = [];
    return _0x2def19[_0x6e61cd(0x15f)](_0x3777fc), _0x2def19['join']();
}

function vaporwaveText1(_0x4be1fd) {
    var _0x2d690b = _0x1f4662,
        _0x117498 = _0x4be1fd[_0x2d690b(0x540)]('\x20')['length'];
    _0x4be1fd = applyCharMap(vaporwaveCharMap, _0x4be1fd);
    var _0xfd008b = getAsianChars(Math[_0x2d690b(0x2d2)](0x3, _0x117498));
    if (_0x117498 > 0x6) _0xfd008b = _0xfd008b[_0x2d690b(0x540)]('')[_0x2d690b(0x51e)](_0xb949b9 => _0xb949b9 + ['', ''][Math[_0x2d690b(0x2f4)](Math['random']() * 0.6)])[_0x2d690b(0x36d)]('');
    var _0x39093c = [];
    return _0x39093c[_0x2d690b(0x15f)](_0x4be1fd['replace'](/　/g, '░')['replace'](/ａｅ/, 'æ')[_0x2d690b(0x5c6)](/Ａ/g, 'Λ')[_0x2d690b(0x5c6)](/Ｅ/g, function() {
        var _0x5a1b60 = _0x2d690b;
        return Math[_0x5a1b60(0x2ce)]() > 0.5 ? 'Ξ' : 'Σ';
    })['replace'](/Ｏ/g, '♢')), _0x39093c['join']();
}

function vaporwaveText2(_0x386b6b) {
    var _0x486adc = _0x1f4662,
        _0x33a5f1 = _0x386b6b[_0x486adc(0x540)]('\x20')[_0x486adc(0x4cd)];
    _0x386b6b = applyCharMap(vaporwaveCharMap, _0x386b6b);
    var _0x4bcdbc = getAsianChars(Math['max'](0x3, _0x33a5f1));
    if (_0x33a5f1 > 0x6) _0x4bcdbc = _0x4bcdbc[_0x486adc(0x540)]('')['map'](_0x3ba50f => _0x3ba50f + ['', ''][Math[_0x486adc(0x2f4)](Math[_0x486adc(0x2ce)]() * 0.6)])[_0x486adc(0x36d)]('');
    var _0x1085c7 = [];
    return _0x1085c7[_0x486adc(0x15f)]('【\ufeff' + _0x386b6b + '】'), _0x1085c7['join']();
}

function getAsianChars(_0x2cfd6e) {
    var _0x4623b1 = _0x1f4662;
    if (!_0x2cfd6e) _0x2cfd6e = 0x1;
    var _0xb20d5c = _0x4623b1(0x295),
        _0x26725e = '';
    for (var _0x256c08 = 0x0; _0x256c08 < _0x2cfd6e; _0x256c08++) {
        _0x26725e += _0xb20d5c[Math['floor'](Math[_0x4623b1(0x2ce)]() * _0xb20d5c[_0x4623b1(0x4cd)])];
    }
    return _0x26725e;
}
const flourishArray = ['꧁༒☬\x20[[text]]\x20☬༒꧂', _0x1f4662(0x4a9), _0x1f4662(0x457), _0x1f4662(0x289), '꧁༒༻☬ད\x20[[text]]\x20ཌ☬༺༒꧂', '♪ღ♪*•.¸¸.•*¨¨*•.♪\x20[[text]]\x20♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪', '◥꧁ད\x20ॐ卐[[text]]\x20卐ॐ\x20ཌ꧂◤', '(\x20ﾟ∀ﾟ)ﾉ【[[text]]】', _0x1f4662(0x220), _0x1f4662(0x1c3), _0x1f4662(0x35e), _0x1f4662(0x43a), _0x1f4662(0x345), _0x1f4662(0x359), _0x1f4662(0x39f), '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20[[text]]\x20¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', _0x1f4662(0x274), '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20[[text]]\x20█\x20▇\x20▆\x20▅\x20▄\x20▂\x20▁', _0x1f4662(0x335), '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20[[text]]\x20°º¤ø,¸¸,ø¤º°`°º¤ø,¸', _0x1f4662(0x18d), _0x1f4662(0x327), _0x1f4662(0x268), _0x1f4662(0x4a5), _0x1f4662(0x421), _0x1f4662(0x447), _0x1f4662(0x393), _0x1f4662(0x5be), '(¯´•._.•\x20[[text]]\x20•._.•´¯)', _0x1f4662(0x537), _0x1f4662(0x266), _0x1f4662(0x3af), _0x1f4662(0x4bb), '•´¯`•.\x20[[text]]\x20.•´¯`•', '§.•´¨\x27°÷•..×\x20[[text]]\x20×,.•´¨\x27°÷•..§', _0x1f4662(0x454), _0x1f4662(0x616), _0x1f4662(0x4e8), _0x1f4662(0x27f), _0x1f4662(0x537), _0x1f4662(0x3a9), _0x1f4662(0x1e2), _0x1f4662(0x1f4), _0x1f4662(0x2e9), _0x1f4662(0x463), _0x1f4662(0x484), _0x1f4662(0x3cd), _0x1f4662(0x267), _0x1f4662(0x568), '`•.,¸¸,.•´¯\x20[[text]]\x20¯`•.,¸¸,.•´', '↤↤↤↤↤\x20[[text]]\x20↦↦↦↦↦', '➶➶➶➶➶\x20[[text]]\x20➷➷➷➷➷', _0x1f4662(0x4ce), _0x1f4662(0x3a8), _0x1f4662(0x4fc), ']|I{•------»\x20[[text]]\x20«------•}I|[', _0x1f4662(0x541), _0x1f4662(0x5e6), _0x1f4662(0x5a7), _0x1f4662(0x4e9), _0x1f4662(0x2ea), _0x1f4662(0x5be), _0x1f4662(0x5d3), _0x1f4662(0x463), _0x1f4662(0x160), '꧁𓊈𒆜\x20[[text]]\x20𒆜𓊉꧂', '╚»★«╝\x20[[text]]\x20╚»★«╝', _0x1f4662(0x61b), _0x1f4662(0x31a), '∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ\x20[[text]]\x20ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙', _0x1f4662(0x242), _0x1f4662(0x52f), _0x1f4662(0x4c2), _0x1f4662(0x324), '✿.｡.:*\x20☆:**:.\x20[[text]]\x20.:**:.☆*.:｡.✿', _0x1f4662(0x416), _0x1f4662(0x5fc), _0x1f4662(0x240)];

function wrapInFlourish(_0xbf433) {
    var _0x210480 = _0x1f4662;
    return flourishArray[Math['floor'](Math[_0x210480(0x2ce)]() * flourishArray[_0x210480(0x4cd)])]['replace'](_0x210480(0x4f8), _0xbf433);
}

function Flourishlist(_0x32087b, _0x541407) {
    var _0x1b0f7a = _0x1f4662;
    return flourishArray[_0x32087b]['replace'](_0x1b0f7a(0x4f8), _0x541407);
}

function wrapInSymbols(_0x2c6b4c, _0x20dc9c) {
    return randomSymbols(_0x20dc9c) + '\x20\x20' + _0x2c6b4c + '\x20\x20' + randomSymbols(_0x20dc9c);
}

function firework(_0x313bf1) {
    var _0x2c3ff0 = _0x1f4662;
    return _0x313bf1[_0x2c3ff0(0x540)]('')[_0x2c3ff0(0x36d)]('҉') + '҉';
}

function weirdBox(_0x3ab19d) {
    var _0x3060e1 = _0x1f4662;
    return _0x3ab19d[_0x3060e1(0x5c6)](/([^\s])/g, _0x3060e1(0x52a));
}

function littleSparkles(_0x273504) {
    var _0x513f25 = _0x1f4662;
    return '˜”*°•.˜”*°•\x20' + _0x273504 + _0x513f25(0x260);
}

function kirbyHug(_0x78e092) {
    var _0x2e5f7f = _0x1f4662;
    return _0x2e5f7f(0x452) + _0x78e092 + '\x20♥';
}

function dottyJoiner(_0x61c678) {
    var _0x1bd2a0 = _0x1f4662;
    return '░' + _0x61c678[_0x1bd2a0(0x540)]('')[_0x1bd2a0(0x36d)]('░') + '░';
}

function wavyJoiner(_0x549709) {
    var _0x2cd90a = _0x1f4662;
    return '≋' + _0x549709['split']('')[_0x2cd90a(0x36d)]('≋') + '≋';
}

function diametricAngleFrame(_0x690825) {
    var _0x459574 = _0x1f4662;
    return _0x690825[_0x459574(0x5c6)](/([^\s])/g, '『$1』');
}

function thickBlockFramed(_0x25f00d) {
    var _0xb40081 = _0x1f4662;
    return _0x25f00d[_0xb40081(0x5c6)](/([^\s])/g, _0xb40081(0x2b7));
}
var h = {};
h['1'] = _0x1f4662(0x193), h['2'] = '&#4310;', h['3'] = _0x1f4662(0x366), h['4'] = _0x1f4662(0x53c), h['5'] = _0x1f4662(0x302), h['6'] = '&#989;', h['7'] = _0x1f4662(0x1a0), h['8'] = _0x1f4662(0x58c), h['9'] = _0x1f4662(0x308), h['10'] = _0x1f4662(0x3ba), h['11'] = _0x1f4662(0x36a), h['12'] = _0x1f4662(0x336), h['13'] = _0x1f4662(0x40b), h['14'] = _0x1f4662(0x16b), h['15'] = _0x1f4662(0x481), h['16'] = _0x1f4662(0x548), h['17'] = _0x1f4662(0x388), h['18'] = _0x1f4662(0x50d), h['19'] = _0x1f4662(0x1ba), h['20'] = '&#410;', h['21'] = _0x1f4662(0x3ef), h['22'] = _0x1f4662(0x2c7), h['23'] = _0x1f4662(0x478), h['24'] = 'x', h['25'] = _0x1f4662(0x272), h['26'] = _0x1f4662(0x408), h['27'] = 'A', h['28'] = 'B', h['29'] = 'C', h['30'] = 'D', h['31'] = 'E', h['32'] = 'F', h['33'] = 'G', h['34'] = 'H', h['35'] = 'I', h['36'] = 'J', h['37'] = 'K', h['38'] = 'L', h['39'] = 'M', h['40'] = 'N', h['41'] = 'O', h['42'] = 'P', h['43'] = 'Q', h['44'] = 'R', h['45'] = 'S', h['46'] = 'T', h['47'] = 'U', h['48'] = 'V', h['49'] = 'W', h['50'] = 'X', h['51'] = 'Y', h['52'] = 'Z', h['53'] = '1', h['54'] = '2', h['55'] = '3', h['56'] = '4', h['57'] = '5', h['58'] = '6', h['59'] = '7', h['60'] = '8', h['61'] = '9', h['62'] = '0';
var i = {};
i['1'] = _0x1f4662(0x1f1), i['2'] = _0x1f4662(0x524), i['3'] = '&#9790;', i['4'] = _0x1f4662(0x499), i['5'] = _0x1f4662(0x23d), i['6'] = _0x1f4662(0x49b), i['7'] = _0x1f4662(0x427), i['8'] = '&#9796;', i['9'] = _0x1f4662(0x357), i['10'] = _0x1f4662(0x254), i['11'] = _0x1f4662(0x1ef), i['12'] = _0x1f4662(0x444), i['13'] = _0x1f4662(0x45b), i['14'] = '&#9835;', i['15'] = _0x1f4662(0x600), i['16'] = '&rho;', i['17'] = _0x1f4662(0x3dd), i['18'] = _0x1f4662(0x624), i['19'] = _0x1f4662(0x5ec), i['20'] = _0x1f4662(0x61a), i['21'] = _0x1f4662(0x38d), i['22'] = _0x1f4662(0x43e), i['23'] = '&omega;', i['24'] = _0x1f4662(0x376), i['25'] = '&#9791;', i['26'] = _0x1f4662(0x2ad), i['27'] = _0x1f4662(0x1f1), i['28'] = _0x1f4662(0x524), i['29'] = _0x1f4662(0x1a4), i['30'] = '&#9687;', i['31'] = _0x1f4662(0x23d), i['32'] = _0x1f4662(0x49b), i['33'] = _0x1f4662(0x427), i['34'] = _0x1f4662(0x405), i['35'] = '&#9815;', i['36'] = _0x1f4662(0x254), i['37'] = '&#1008;', i['38'] = _0x1f4662(0x444), i['39'] = '&#9812;', i['40'] = _0x1f4662(0x1b9), i['41'] = _0x1f4662(0x600), i['42'] = _0x1f4662(0x548), i['43'] = _0x1f4662(0x3dd), i['44'] = _0x1f4662(0x624), i['45'] = '&#9442;', i['46'] = _0x1f4662(0x61a), i['47'] = _0x1f4662(0x38d), i['48'] = _0x1f4662(0x43e), i['49'] = _0x1f4662(0x3b4), i['50'] = '&#8984;', i['51'] = '&#9791;', i['52'] = _0x1f4662(0x2ad), i['53'] = _0x1f4662(0x246), i['54'] = _0x1f4662(0x380), i['55'] = '&#10124;', i['56'] = _0x1f4662(0x4d4), i['57'] = _0x1f4662(0x332), i['58'] = _0x1f4662(0x31e), i['59'] = '&#10128;', i['60'] = _0x1f4662(0x4f0), i['61'] = _0x1f4662(0x55c), i['62'] = _0x1f4662(0x5b7);
var j = {};
j['1'] = _0x1f4662(0x59b), j['2'] = _0x1f4662(0x2cc), j['3'] = _0x1f4662(0x199), j['4'] = _0x1f4662(0x252), j['5'] = _0x1f4662(0x29d), j['6'] = '&#358;', j['7'] = _0x1f4662(0x592), j['8'] = '&#292;', j['9'] = _0x1f4662(0x25c), j['10'] = _0x1f4662(0x57f), j['11'] = _0x1f4662(0x35c), j['12'] = _0x1f4662(0x539), j['13'] = '&#1052;', j['14'] = _0x1f4662(0x442), j['15'] = _0x1f4662(0x4b3), j['16'] = '&#1056;', j['17'] = 'Q', j['18'] = _0x1f4662(0x4ac), j['19'] = '&#346;', j['20'] = _0x1f4662(0x49a), j['21'] = _0x1f4662(0x214), j['22'] = 'V', j['23'] = '&#372;', j['24'] = _0x1f4662(0x32d), j['25'] = '&#374;', j['26'] = _0x1f4662(0x549), j['27'] = _0x1f4662(0x59b), j['28'] = '&beta;', j['29'] = '&#268;', j['30'] = _0x1f4662(0x252), j['31'] = _0x1f4662(0x29d), j['32'] = '&#358;', j['33'] = _0x1f4662(0x592), j['34'] = '&#292;', j['35'] = _0x1f4662(0x25c), j['36'] = _0x1f4662(0x57f), j['37'] = _0x1f4662(0x35c), j['38'] = _0x1f4662(0x539), j['39'] = _0x1f4662(0x4f4), j['40'] = '&#323;', j['41'] = _0x1f4662(0x4b3), j['42'] = '&#1056;', j['43'] = 'Q', j['44'] = '&#340;', j['45'] = '&#346;', j['46'] = _0x1f4662(0x49a), j['47'] = _0x1f4662(0x214), j['48'] = 'V', j['49'] = _0x1f4662(0x4df), j['50'] = _0x1f4662(0x32d), j['51'] = _0x1f4662(0x441), j['52'] = '&#377;', j['53'] = '1', j['54'] = '2', j['55'] = '3', j['56'] = '4', j['57'] = '5', j['58'] = '6', j['59'] = '7', j['60'] = '8', j['61'] = '9', j['62'] = '0';
var k = {};
k['1'] = _0x1f4662(0x4b9), k['2'] = 'q', k['3'] = '&#596;', k['4'] = 'p', k['5'] = '&#477;', k['6'] = '&#607;', k['7'] = _0x1f4662(0x608), k['8'] = _0x1f4662(0x4fd), k['9'] = '&#7433;', k['10'] = _0x1f4662(0x50d), k['11'] = _0x1f4662(0x5e7), k['12'] = 'l', k['13'] = _0x1f4662(0x478), k['14'] = 'u', k['15'] = 'o', k['16'] = 'd', k['17'] = 'b', k['18'] = _0x1f4662(0x368), k['19'] = 's', k['20'] = _0x1f4662(0x16c), k['21'] = 'n', k['22'] = _0x1f4662(0x2a3), k['23'] = '&#653;', k['24'] = 'x', k['25'] = _0x1f4662(0x2db), k['26'] = 'z', k['27'] = _0x1f4662(0x4b9), k['28'] = 'q', k['29'] = '&#596;', k['30'] = 'p', k['31'] = _0x1f4662(0x225), k['32'] = _0x1f4662(0x2be), k['33'] = _0x1f4662(0x608), k['34'] = _0x1f4662(0x4fd), k['35'] = _0x1f4662(0x309), k['36'] = _0x1f4662(0x50d), k['37'] = _0x1f4662(0x5e7), k['38'] = 'l', k['39'] = _0x1f4662(0x478), k['40'] = 'u', k['41'] = 'o', k['42'] = 'd', k['43'] = 'b', k['44'] = _0x1f4662(0x368), k['45'] = 's', k['46'] = _0x1f4662(0x16c), k['47'] = 'n', k['48'] = '&#652;', k['49'] = '&#653;', k['50'] = 'x', k['51'] = _0x1f4662(0x2db), k['52'] = 'z', k['53'] = _0x1f4662(0x390), k['54'] = '&#4357;', k['55'] = _0x1f4662(0x547), k['56'] = _0x1f4662(0x503), k['57'] = _0x1f4662(0x278), k['58'] = '9', k['59'] = '&#12581;', k['60'] = '8', k['61'] = '6', k['62'] = '0';
var l = {};
l['1'] = '&Delta;', l['2'] = _0x1f4662(0x2cc), l['3'] = _0x1f4662(0x451), l['4'] = _0x1f4662(0x206), l['5'] = _0x1f4662(0x23d), l['6'] = _0x1f4662(0x5bd), l['7'] = _0x1f4662(0x492), l['8'] = '&#294;', l['9'] = '&#407;', l['10'] = _0x1f4662(0x57f), l['11'] = _0x1f4662(0x1f8), l['12'] = _0x1f4662(0x201), l['13'] = _0x1f4662(0x3a5), l['14'] = _0x1f4662(0x611), l['15'] = _0x1f4662(0x26a), l['16'] = '&#420;', l['17'] = '&Omega;', l['18'] = _0x1f4662(0x1ea), l['19'] = _0x1f4662(0x14a), l['20'] = _0x1f4662(0x400), l['21'] = '&#7918;', l['22'] = 'V', l['23'] = _0x1f4662(0x4df), l['24'] = _0x1f4662(0x32d), l['25'] = '&yen;', l['26'] = _0x1f4662(0x26c), l['27'] = _0x1f4662(0x39c), l['28'] = _0x1f4662(0x2cc), l['29'] = _0x1f4662(0x451), l['30'] = _0x1f4662(0x206), l['31'] = _0x1f4662(0x23d), l['32'] = _0x1f4662(0x5bd), l['33'] = _0x1f4662(0x492), l['34'] = _0x1f4662(0x470), l['35'] = _0x1f4662(0x30c), l['36'] = '&#308;', l['37'] = _0x1f4662(0x1f8), l['38'] = '&#321;', l['39'] = _0x1f4662(0x3a5), l['40'] = _0x1f4662(0x611), l['41'] = '&Oslash;', l['42'] = _0x1f4662(0x4f7), l['43'] = _0x1f4662(0x577), l['44'] = _0x1f4662(0x1ea), l['45'] = _0x1f4662(0x14a), l['46'] = '&#358;', l['47'] = _0x1f4662(0x3ea), l['48'] = 'V', l['49'] = _0x1f4662(0x4df), l['50'] = '&#1046;', l['51'] = '&yen;', l['52'] = _0x1f4662(0x26c), l['53'] = '1', l['54'] = '2', l['55'] = '3', l['56'] = '4', l['57'] = '5', l['58'] = '6', l['59'] = '7', l['60'] = '8', l['61'] = '9', l['62'] = '0';
var m = {};
m['1'] = _0x1f4662(0x193), m['2'] = '&#595;', m['3'] = _0x1f4662(0x3ec), m['4'] = _0x1f4662(0x1f9), m['5'] = _0x1f4662(0x3dc), m['6'] = '&fnof;', m['7'] = _0x1f4662(0x1a0), m['8'] = _0x1f4662(0x554), m['9'] = _0x1f4662(0x5ae), m['10'] = _0x1f4662(0x3ba), m['11'] = '&#1185;', m['12'] = _0x1f4662(0x369), m['13'] = _0x1f4662(0x40b), m['14'] = _0x1f4662(0x16b), m['15'] = _0x1f4662(0x481), m['16'] = _0x1f4662(0x548), m['17'] = _0x1f4662(0x3c4), m['18'] = _0x1f4662(0x2af), m['19'] = _0x1f4662(0x520), m['20'] = _0x1f4662(0x245), m['21'] = '&micro;', m['22'] = _0x1f4662(0x22e), m['23'] = _0x1f4662(0x3b4), m['24'] = _0x1f4662(0x607), m['25'] = '&#4327;', m['26'] = _0x1f4662(0x1fe), m['27'] = _0x1f4662(0x193), m['28'] = _0x1f4662(0x169), m['29'] = _0x1f4662(0x3ec), m['30'] = _0x1f4662(0x1f9), m['31'] = _0x1f4662(0x3dc), m['32'] = '&fnof;', m['33'] = _0x1f4662(0x1a0), m['34'] = _0x1f4662(0x554), m['35'] = _0x1f4662(0x5ae), m['36'] = _0x1f4662(0x3ba), m['37'] = _0x1f4662(0x509), m['38'] = '&#8467;', m['39'] = _0x1f4662(0x40b), m['40'] = '&#627;', m['41'] = _0x1f4662(0x481), m['42'] = _0x1f4662(0x548), m['43'] = _0x1f4662(0x3c4), m['44'] = _0x1f4662(0x2af), m['45'] = _0x1f4662(0x520), m['46'] = _0x1f4662(0x245), m['47'] = _0x1f4662(0x438), m['48'] = '&#1141;', m['49'] = _0x1f4662(0x3b4), m['50'] = '&#1488;', m['51'] = '&#4327;', m['52'] = '&#438;', m['53'] = '1', m['54'] = '2', m['55'] = '3', m['56'] = '4', m['57'] = '5', m['58'] = '6', m['59'] = '7', m['60'] = '8', m['61'] = '9', m['62'] = '0';
var n = {};
n['1'] = _0x1f4662(0x5bc), n['2'] = _0x1f4662(0x2eb), n['3'] = _0x1f4662(0x2e5), n['4'] = '&#5610;', n['5'] = _0x1f4662(0x262), n['6'] = _0x1f4662(0x3f3), n['7'] = _0x1f4662(0x492), n['8'] = _0x1f4662(0x490), n['9'] = _0x1f4662(0x3e8), n['10'] = _0x1f4662(0x45c), n['11'] = _0x1f4662(0x174), n['12'] = _0x1f4662(0x2da), n['13'] = _0x1f4662(0x605), n['14'] = _0x1f4662(0x238), n['15'] = _0x1f4662(0x3ee), n['16'] = '&#5229;', n['17'] = _0x1f4662(0x3bb), n['18'] = _0x1f4662(0x3bc), n['19'] = _0x1f4662(0x567), n['20'] = _0x1f4662(0x1bd), n['21'] = _0x1f4662(0x46e), n['22'] = _0x1f4662(0x2d4), n['23'] = '&#5615;', n['24'] = _0x1f4662(0x208), n['25'] = _0x1f4662(0x5cf), n['26'] = _0x1f4662(0x1ac), n['27'] = '&#5609;', n['28'] = _0x1f4662(0x2eb), n['29'] = _0x1f4662(0x2e5), n['30'] = _0x1f4662(0x46b), n['31'] = _0x1f4662(0x262), n['32'] = _0x1f4662(0x3f3), n['33'] = '&#484;', n['34'] = _0x1f4662(0x490), n['35'] = _0x1f4662(0x3e8), n['36'] = _0x1f4662(0x45c), n['37'] = _0x1f4662(0x174), n['38'] = '&#5290;', n['39'] = _0x1f4662(0x605), n['40'] = _0x1f4662(0x238), n['41'] = _0x1f4662(0x3ee), n['42'] = _0x1f4662(0x4f5), n['43'] = _0x1f4662(0x3bb), n['44'] = _0x1f4662(0x3bc), n['45'] = '&#5397;', n['46'] = _0x1f4662(0x1bd), n['47'] = _0x1f4662(0x46e), n['48'] = _0x1f4662(0x2d4), n['49'] = _0x1f4662(0x48b), n['50'] = _0x1f4662(0x208), n['51'] = _0x1f4662(0x5cf), n['52'] = _0x1f4662(0x1ac), n['53'] = '1', n['54'] = '2', n['55'] = '3', n['56'] = '4', n['57'] = '5', n['58'] = '6', n['59'] = '7', n['60'] = '8', n['61'] = '9', n['62'] = '0';
var o = {};
o['1'] = _0x1f4662(0x288), o['2'] = _0x1f4662(0x323), o['3'] = '&#4308;', o['4'] = '&#4331;', o['5'] = _0x1f4662(0x3cc), o['6'] = 'f', o['7'] = '&#4330;', o['8'] = 'h', o['9'] = _0x1f4662(0x55f), o['10'] = _0x1f4662(0x3b7), o['11'] = _0x1f4662(0x17a), o['12'] = 'l', o['13'] = _0x1f4662(0x3df), o['14'] = '&#8134;', o['15'] = _0x1f4662(0x37e), o['16'] = '&rho;', o['17'] = _0x1f4662(0x391), o['18'] = _0x1f4662(0x5d2), o['19'] = _0x1f4662(0x1d5), o['20'] = '&#3923;', o['21'] = _0x1f4662(0x3ef), o['22'] = _0x1f4662(0x15b), o['23'] = 'w', o['24'] = _0x1f4662(0x350), o['25'] = '&#4327;', o['26'] = _0x1f4662(0x217), o['27'] = '&#4315;', o['28'] = _0x1f4662(0x323), o['29'] = _0x1f4662(0x581), o['30'] = _0x1f4662(0x14c), o['31'] = _0x1f4662(0x3cc), o['32'] = 'f', o['33'] = _0x1f4662(0x514), o['34'] = 'h', o['35'] = '&#7990;', o['36'] = _0x1f4662(0x3b7), o['37'] = '&kappa;', o['38'] = 'l', o['39'] = _0x1f4662(0x3df), o['40'] = _0x1f4662(0x2d6), o['41'] = _0x1f4662(0x37e), o['42'] = _0x1f4662(0x548), o['43'] = _0x1f4662(0x391), o['44'] = '&Gamma;', o['45'] = '&#4336;', o['46'] = _0x1f4662(0x42f), o['47'] = _0x1f4662(0x3ef), o['48'] = _0x1f4662(0x15b), o['49'] = 'w', o['50'] = '&#4335;', o['51'] = _0x1f4662(0x272), o['52'] = '&#576;', o['53'] = '1', o['54'] = '2', o['55'] = '3', o['56'] = '4', o['57'] = '5', o['58'] = '6', o['59'] = '7', o['60'] = '8', o['61'] = '9', o['62'] = '0';
var p = {};
p['1'] = _0x1f4662(0x45f), p['2'] = _0x1f4662(0x60e), p['3'] = _0x1f4662(0x1eb), p['4'] = '&#545;', p['5'] = '&#941;', p['6'] = _0x1f4662(0x464), p['7'] = '&#291;', p['8'] = _0x1f4662(0x2bc), p['9'] = '&#943;', p['10'] = _0x1f4662(0x361), p['11'] = _0x1f4662(0x522), p['12'] = _0x1f4662(0x4a7), p['13'] = _0x1f4662(0x2a6), p['14'] = '&#942;', p['15'] = _0x1f4662(0x569), p['16'] = '&rho;', p['17'] = 'q', p['18'] = _0x1f4662(0x57b), p['19'] = _0x1f4662(0x501), p['20'] = _0x1f4662(0x248), p['21'] = _0x1f4662(0x4b2), p['22'] = _0x1f4662(0x619), p['23'] = _0x1f4662(0x382), p['24'] = 'x', p['25'] = _0x1f4662(0x4ec), p['26'] = _0x1f4662(0x185), p['27'] = _0x1f4662(0x45f), p['28'] = '&#1074;', p['29'] = _0x1f4662(0x1eb), p['30'] = '&#545;', p['31'] = '&#941;', p['32'] = _0x1f4662(0x464), p['33'] = '&#291;', p['34'] = _0x1f4662(0x2bc), p['35'] = _0x1f4662(0x566), p['36'] = _0x1f4662(0x361), p['37'] = _0x1f4662(0x522), p['38'] = _0x1f4662(0x4a7), p['39'] = _0x1f4662(0x2a6), p['40'] = _0x1f4662(0x2d3), p['41'] = _0x1f4662(0x569), p['42'] = _0x1f4662(0x548), p['43'] = 'q', p['44'] = _0x1f4662(0x57b), p['45'] = _0x1f4662(0x501), p['46'] = _0x1f4662(0x248), p['47'] = '&ugrave;', p['48'] = _0x1f4662(0x619), p['49'] = '&#974;', p['50'] = 'x', p['51'] = '&#1095;', p['52'] = '&#382;', p['53'] = '1', p['54'] = '2', p['55'] = '3', p['56'] = '4', p['57'] = '5', p['58'] = '6', p['59'] = '7', p['60'] = '8', p['61'] = '9', p['62'] = '0';
var q = {};
q['1'] = '&#41707;', q['2'] = '&#41155;', q['3'] = _0x1f4662(0x30b), q['4'] = _0x1f4662(0x167), q['5'] = _0x1f4662(0x348), q['6'] = _0x1f4662(0x455), q['7'] = '&#41037;', q['8'] = _0x1f4662(0x2a8), q['9'] = _0x1f4662(0x54c), q['10'] = _0x1f4662(0x56b), q['11'] = _0x1f4662(0x52b), q['12'] = _0x1f4662(0x1be), q['13'] = _0x1f4662(0x318), q['14'] = '&#41081;', q['15'] = '&#41346;', q['16'] = _0x1f4662(0x419), q['17'] = _0x1f4662(0x4a6), q['18'] = '&#42131;', q['19'] = '&#41754;', q['20'] = _0x1f4662(0x45e), q['21'] = _0x1f4662(0x586), q['22'] = _0x1f4662(0x271), q['23'] = _0x1f4662(0x602), q['24'] = _0x1f4662(0x20b), q['25'] = _0x1f4662(0x35d), q['26'] = _0x1f4662(0x2dd), q['27'] = '&#41707;', q['28'] = _0x1f4662(0x1f3), q['29'] = '&#41976;', q['30'] = _0x1f4662(0x167), q['31'] = _0x1f4662(0x348), q['32'] = _0x1f4662(0x455), q['33'] = _0x1f4662(0x50c), q['34'] = _0x1f4662(0x2a8), q['35'] = _0x1f4662(0x54c), q['36'] = _0x1f4662(0x56b), q['37'] = _0x1f4662(0x52b), q['38'] = _0x1f4662(0x1be), q['39'] = _0x1f4662(0x318), q['40'] = _0x1f4662(0x154), q['41'] = _0x1f4662(0x433), q['42'] = '&#41571;', q['43'] = _0x1f4662(0x4a6), q['44'] = _0x1f4662(0x19e), q['45'] = _0x1f4662(0x2c2), q['46'] = '&#42181;', q['47'] = '&#41991;', q['48'] = _0x1f4662(0x271), q['49'] = _0x1f4662(0x602), q['50'] = _0x1f4662(0x20b), q['51'] = _0x1f4662(0x35d), q['52'] = '&#41076;', q['53'] = '1', q['54'] = '2', q['55'] = '3', q['56'] = '4', q['57'] = '5', q['58'] = '6', q['59'] = '7', q['60'] = '8', q['61'] = '9', q['62'] = '0';
var r = {};
r['1'] = _0x1f4662(0x2d8), r['2'] = _0x1f4662(0x518), r['3'] = 'C', r['4'] = 'D', r['5'] = _0x1f4662(0x1ff), r['6'] = 'F', r['7'] = 'G', r['8'] = 'H', r['9'] = 'I', r['10'] = 'J', r['11'] = _0x1f4662(0x1f8), r['12'] = 'L', r['13'] = 'M', r['14'] = _0x1f4662(0x58f), r['15'] = _0x1f4662(0x589), r['16'] = 'P', r['17'] = _0x1f4662(0x257), r['18'] = '&#1071;', r['19'] = 'S', r['20'] = _0x1f4662(0x5d2), r['21'] = _0x1f4662(0x5a4), r['22'] = 'V', r['23'] = _0x1f4662(0x3fe), r['24'] = _0x1f4662(0x32d), r['25'] = _0x1f4662(0x20c), r['26'] = 'Z', r['27'] = _0x1f4662(0x2d8), r['28'] = _0x1f4662(0x518), r['29'] = 'C', r['30'] = 'D', r['31'] = _0x1f4662(0x1ff), r['32'] = 'F', r['33'] = 'G', r['34'] = 'H', r['35'] = 'I', r['36'] = 'J', r['37'] = _0x1f4662(0x1f8), r['38'] = 'L', r['39'] = 'M', r['40'] = _0x1f4662(0x58f), r['41'] = _0x1f4662(0x589), r['42'] = 'P', r['43'] = _0x1f4662(0x257), r['44'] = _0x1f4662(0x4f3), r['45'] = 'S', r['46'] = _0x1f4662(0x5d2), r['47'] = _0x1f4662(0x5a4), r['48'] = 'V', r['49'] = _0x1f4662(0x3fe), r['50'] = '&#1046;', r['51'] = _0x1f4662(0x20c), r['52'] = 'Z', r['53'] = '1', r['54'] = '2', r['55'] = '3', r['56'] = '4', r['57'] = '5', r['58'] = '6', r['59'] = '7', r['60'] = '8', r['61'] = '9', r['62'] = '0';
var s = {};
s['1'] = _0x1f4662(0x1f1), s['2'] = _0x1f4662(0x3c2), s['3'] = _0x1f4662(0x300), s['4'] = _0x1f4662(0x31b), s['5'] = '&#41823;', s['6'] = '&#41863;', s['7'] = _0x1f4662(0x5ce), s['8'] = _0x1f4662(0x338), s['9'] = _0x1f4662(0x303), s['10'] = _0x1f4662(0x56b), s['11'] = _0x1f4662(0x3ab), s['12'] = _0x1f4662(0x1be), s['13'] = _0x1f4662(0x244), s['14'] = '&#41508;', s['15'] = '&#41126;', s['16'] = _0x1f4662(0x419), s['17'] = _0x1f4662(0x4bd), s['18'] = '&#41706;', s['19'] = _0x1f4662(0x54d), s['20'] = '&#42180;', s['21'] = _0x1f4662(0x1b2), s['22'] = _0x1f4662(0x43c), s['23'] = _0x1f4662(0x315), s['24'] = _0x1f4662(0x497), s['25'] = '&#41769;', s['26'] = _0x1f4662(0x2dd), s['27'] = _0x1f4662(0x1f1), s['28'] = _0x1f4662(0x3c2), s['29'] = '&#41555;', s['30'] = '&#41016;', s['31'] = _0x1f4662(0x348), s['32'] = _0x1f4662(0x4aa), s['33'] = _0x1f4662(0x5ce), s['34'] = '&#41157;', s['35'] = _0x1f4662(0x303), s['36'] = '&#41005;', s['37'] = _0x1f4662(0x3ab), s['38'] = '&#42130;', s['39'] = _0x1f4662(0x244), s['40'] = '&#41508;', s['41'] = _0x1f4662(0x4d7), s['42'] = '&#41571;', s['43'] = _0x1f4662(0x4bd), s['44'] = _0x1f4662(0x603), s['45'] = _0x1f4662(0x54d), s['46'] = _0x1f4662(0x196), s['47'] = _0x1f4662(0x1b2), s['48'] = _0x1f4662(0x43c), s['49'] = '&#41295;', s['50'] = _0x1f4662(0x497), s['51'] = '&#41769;', s['52'] = _0x1f4662(0x2dd), s['53'] = '1', s['54'] = '2', s['55'] = '3', s['56'] = '4', s['57'] = '5', s['58'] = '6', s['59'] = '7', s['60'] = '8', s['61'] = '9', s['62'] = '0';
var t = {};
t['1'] = _0x1f4662(0x30f), t['2'] = _0x1f4662(0x1a8), t['3'] = _0x1f4662(0x552), t['4'] = _0x1f4662(0x211), t['5'] = '&#41922;', t['6'] = _0x1f4662(0x304), t['7'] = _0x1f4662(0x495), t['8'] = '&#41053;', t['9'] = '&#42128;', t['10'] = _0x1f4662(0x173), t['11'] = '&#40984;', t['12'] = '&#42130;', t['13'] = '&#41141;', t['14'] = _0x1f4662(0x52e), t['15'] = '&#41266;', t['16'] = '&#41571;', t['17'] = _0x1f4662(0x4bd), t['18'] = _0x1f4662(0x603), t['19'] = _0x1f4662(0x5e5), t['20'] = _0x1f4662(0x196), t['21'] = _0x1f4662(0x15c), t['22'] = _0x1f4662(0x604), t['23'] = _0x1f4662(0x602), t['24'] = '&#41575;', t['25'] = _0x1f4662(0x4ea), t['26'] = _0x1f4662(0x2dd), t['27'] = _0x1f4662(0x30f), t['28'] = '&#41203;', t['29'] = _0x1f4662(0x552), t['30'] = '&#42159;', t['31'] = '&#41922;', t['32'] = '&#41648;', t['33'] = _0x1f4662(0x495), t['34'] = _0x1f4662(0x533), t['35'] = _0x1f4662(0x576), t['36'] = '&#42171;', t['37'] = _0x1f4662(0x3ab), t['38'] = _0x1f4662(0x1be), t['39'] = '&#41141;', t['40'] = _0x1f4662(0x52e), t['41'] = '&#41266;', t['42'] = _0x1f4662(0x419), t['43'] = _0x1f4662(0x4bd), t['44'] = _0x1f4662(0x603), t['45'] = _0x1f4662(0x5e5), t['46'] = _0x1f4662(0x196), t['47'] = _0x1f4662(0x15c), t['48'] = '&#42150;', t['49'] = _0x1f4662(0x602), t['50'] = '&#41575;', t['51'] = _0x1f4662(0x4ea), t['52'] = '&#41076;', t['53'] = '1', t['54'] = '2', t['55'] = '3', t['56'] = '4', t['57'] = '5', t['58'] = '6', t['59'] = '7', t['60'] = '8', t['61'] = '9', t['62'] = '0';
var u = {};
u['1'] = _0x1f4662(0x5a1), u['2'] = _0x1f4662(0x35a), u['3'] = '&#12552;', u['4'] = '&ETH;', u['5'] = _0x1f4662(0x547), u['6'] = 'F', u['7'] = _0x1f4662(0x418), u['8'] = _0x1f4662(0x3e6), u['9'] = '&#618;', u['10'] = _0x1f4662(0x3e2), u['11'] = _0x1f4662(0x4f9), u['12'] = _0x1f4662(0x201), u['13'] = _0x1f4662(0x5b0), u['14'] = '&#1051;', u['15'] = _0x1f4662(0x26a), u['16'] = _0x1f4662(0x47d), u['17'] = _0x1f4662(0x35f), u['18'] = _0x1f4662(0x157), u['19'] = '&#12425;', u['20'] = _0x1f4662(0x49a), u['21'] = _0x1f4662(0x5a4), u['22'] = '&#404;', u['23'] = _0x1f4662(0x18e), u['24'] = _0x1f4662(0x241), u['25'] = _0x1f4662(0x18b), u['26'] = _0x1f4662(0x57c), u['27'] = _0x1f4662(0x5a1), u['28'] = _0x1f4662(0x35a), u['29'] = _0x1f4662(0x293), u['30'] = _0x1f4662(0x622), u['31'] = _0x1f4662(0x547), u['32'] = 'F', u['33'] = _0x1f4662(0x418), u['34'] = _0x1f4662(0x3e6), u['35'] = _0x1f4662(0x536), u['36'] = _0x1f4662(0x3e2), u['37'] = _0x1f4662(0x4f9), u['38'] = _0x1f4662(0x201), u['39'] = _0x1f4662(0x5b0), u['40'] = '&#1051;', u['41'] = _0x1f4662(0x26a), u['42'] = _0x1f4662(0x47d), u['43'] = _0x1f4662(0x35f), u['44'] = _0x1f4662(0x157), u['45'] = _0x1f4662(0x42a), u['46'] = _0x1f4662(0x49a), u['47'] = _0x1f4662(0x5a4), u['48'] = _0x1f4662(0x2e0), u['49'] = _0x1f4662(0x18e), u['50'] = _0x1f4662(0x241), u['51'] = _0x1f4662(0x18b), u['52'] = _0x1f4662(0x57c), u['53'] = '1', u['54'] = '2', u['55'] = '3', u['56'] = '4', u['57'] = '5', u['58'] = '6', u['59'] = '7', u['60'] = '8', u['61'] = '9', u['62'] = '0';
var v = {};
v['1'] = _0x1f4662(0x4cf), v['2'] = _0x1f4662(0x511), v['3'] = _0x1f4662(0x1f7), v['4'] = _0x1f4662(0x36f), v['5'] = _0x1f4662(0x505), v['6'] = _0x1f4662(0x2a0), v['7'] = _0x1f4662(0x418), v['8'] = _0x1f4662(0x5a9), v['9'] = '&#406;', v['10'] = _0x1f4662(0x16a), v['11'] = _0x1f4662(0x460), v['12'] = _0x1f4662(0x445), v['13'] = 'M', v['14'] = _0x1f4662(0x53a), v['15'] = '&#416;', v['16'] = '&#420;', v['17'] = _0x1f4662(0x53f), v['18'] = _0x1f4662(0x446), v['19'] = '&#423;', v['20'] = '&#428;', v['21'] = _0x1f4662(0x356), v['22'] = _0x1f4662(0x2e0), v['23'] = _0x1f4662(0x18e), v['24'] = _0x1f4662(0x341), v['25'] = _0x1f4662(0x5cf), v['26'] = '&#548;', v['27'] = _0x1f4662(0x4cf), v['28'] = _0x1f4662(0x511), v['29'] = _0x1f4662(0x1f7), v['30'] = '&#394;', v['31'] = '&#1028;', v['32'] = '&#401;', v['33'] = _0x1f4662(0x418), v['34'] = _0x1f4662(0x5a9), v['35'] = _0x1f4662(0x390), v['36'] = _0x1f4662(0x16a), v['37'] = _0x1f4662(0x460), v['38'] = _0x1f4662(0x445), v['39'] = 'M', v['40'] = _0x1f4662(0x53a), v['41'] = _0x1f4662(0x29e), v['42'] = _0x1f4662(0x4f7), v['43'] = _0x1f4662(0x53f), v['44'] = _0x1f4662(0x446), v['45'] = _0x1f4662(0x41e), v['46'] = '&#428;', v['47'] = '&#434;', v['48'] = '&#404;', v['49'] = _0x1f4662(0x18e), v['50'] = _0x1f4662(0x341), v['51'] = _0x1f4662(0x5cf), v['52'] = _0x1f4662(0x42c), v['53'] = '1', v['54'] = '2', v['55'] = '3', v['56'] = '4', v['57'] = '5', v['58'] = '6', v['59'] = '7', v['60'] = '8', v['61'] = '9', v['62'] = '0';
var w = {};
w['1'] = _0x1f4662(0x253), w['2'] = _0x1f4662(0x183), w['3'] = _0x1f4662(0x413), w['4'] = _0x1f4662(0x4db), w['5'] = _0x1f4662(0x623), w['6'] = _0x1f4662(0x5d0), w['7'] = _0x1f4662(0x5ce), w['8'] = _0x1f4662(0x1d2), w['9'] = _0x1f4662(0x54c), w['10'] = '&#42171;', w['11'] = _0x1f4662(0x52b), w['12'] = _0x1f4662(0x1be), w['13'] = _0x1f4662(0x244), w['14'] = '&#41674;', w['15'] = _0x1f4662(0x4d7), w['16'] = _0x1f4662(0x419), w['17'] = '&#41079;', w['18'] = _0x1f4662(0x4ef), w['19'] = _0x1f4662(0x2c2), w['20'] = '&#41686;', w['21'] = _0x1f4662(0x586), w['22'] = _0x1f4662(0x275), w['23'] = _0x1f4662(0x315), w['24'] = _0x1f4662(0x39e), w['25'] = '&#42014;', w['26'] = _0x1f4662(0x2dd), w['27'] = _0x1f4662(0x253), w['28'] = _0x1f4662(0x183), w['29'] = _0x1f4662(0x413), w['30'] = '&#41120;', w['31'] = _0x1f4662(0x623), w['32'] = _0x1f4662(0x5d0), w['33'] = _0x1f4662(0x5ce), w['34'] = '&#41833;', w['35'] = '&#41105;', w['36'] = _0x1f4662(0x173), w['37'] = _0x1f4662(0x52b), w['38'] = _0x1f4662(0x1be), w['39'] = '&#41141;', w['40'] = _0x1f4662(0x52e), w['41'] = _0x1f4662(0x4d7), w['42'] = _0x1f4662(0x419), w['43'] = _0x1f4662(0x60d), w['44'] = _0x1f4662(0x4ef), w['45'] = _0x1f4662(0x2c2), w['46'] = '&#41686;', w['47'] = _0x1f4662(0x586), w['48'] = _0x1f4662(0x275), w['49'] = _0x1f4662(0x315), w['50'] = '&#41426;', w['51'] = _0x1f4662(0x34d), w['52'] = _0x1f4662(0x2dd), w['53'] = '1', w['54'] = '2', w['55'] = '3', w['56'] = '4', w['57'] = '5', w['58'] = '6', w['59'] = '7', w['60'] = '8', w['61'] = '9', w['62'] = '0';
var x = {};
x['1'] = _0x1f4662(0x594), x['2'] = _0x1f4662(0x32a), x['3'] = _0x1f4662(0x4e7), x['4'] = '&#1338;', x['5'] = _0x1f4662(0x4bf), x['6'] = '&#1330;', x['7'] = _0x1f4662(0x2f5), x['8'] = _0x1f4662(0x583), x['9'] = _0x1f4662(0x299), x['10'] = '&#669;', x['11'] = _0x1f4662(0x36a), x['12'] = '&#645;', x['13'] = _0x1f4662(0x3f2), x['14'] = '&#1356;', x['15'] = '&#1342;', x['16'] = _0x1f4662(0x548), x['17'] = _0x1f4662(0x3c4), x['18'] = _0x1f4662(0x19d), x['19'] = _0x1f4662(0x2f8), x['20'] = _0x1f4662(0x187), x['21'] = _0x1f4662(0x4e2), x['22'] = _0x1f4662(0x3f7), x['23'] = '&#1377;', x['24'] = _0x1f4662(0x508), x['25'] = _0x1f4662(0x285), x['26'] = _0x1f4662(0x363), x['27'] = '&#1337;', x['28'] = _0x1f4662(0x32a), x['29'] = '&#1351;', x['30'] = _0x1f4662(0x402), x['31'] = _0x1f4662(0x4bf), x['32'] = '&#1330;', x['33'] = '&#1331;', x['34'] = _0x1f4662(0x583), x['35'] = '&#639;', x['36'] = '&#669;', x['37'] = _0x1f4662(0x36a), x['38'] = '&#645;', x['39'] = _0x1f4662(0x3f2), x['40'] = _0x1f4662(0x16e), x['41'] = _0x1f4662(0x375), x['42'] = _0x1f4662(0x548), x['43'] = _0x1f4662(0x3c4), x['44'] = _0x1f4662(0x19d), x['45'] = _0x1f4662(0x2f8), x['46'] = _0x1f4662(0x187), x['47'] = _0x1f4662(0x4e2), x['48'] = _0x1f4662(0x3f7), x['49'] = '&#1377;', x['50'] = _0x1f4662(0x508), x['51'] = _0x1f4662(0x285), x['52'] = '&#1344;', x['53'] = '1', x['54'] = '2', x['55'] = '3', x['56'] = '4', x['57'] = '5', x['58'] = '6', x['59'] = '7', x['60'] = '8', x['61'] = '9', x['62'] = '0';
var y = {};
y['1'] = _0x1f4662(0x193), y['2'] = _0x1f4662(0x392), y['3'] = _0x1f4662(0x1eb), y['4'] = 'd', y['5'] = _0x1f4662(0x3dc), y['6'] = _0x1f4662(0x205), y['7'] = 'g', y['8'] = 'h', y['9'] = _0x1f4662(0x474), y['10'] = _0x1f4662(0x59f), y['11'] = _0x1f4662(0x17a), y['12'] = '&#65434;', y['13'] = 'm', y['14'] = '&eta;', y['15'] = '&oplus;', y['16'] = 'p', y['17'] = '&Omega;', y['18'] = 'r', y['19'] = _0x1f4662(0x16f), y['20'] = _0x1f4662(0x279), y['21'] = 'u', y['22'] = _0x1f4662(0x613), y['23'] = _0x1f4662(0x3b4), y['24'] = 'x', y['25'] = _0x1f4662(0x564), y['26'] = 'z', y['27'] = '&alpha;', y['28'] = _0x1f4662(0x392), y['29'] = '&sigmaf;', y['30'] = 'd', y['31'] = _0x1f4662(0x3dc), y['32'] = _0x1f4662(0x205), y['33'] = 'g', y['34'] = 'h', y['35'] = _0x1f4662(0x474), y['36'] = _0x1f4662(0x59f), y['37'] = _0x1f4662(0x17a), y['38'] = _0x1f4662(0x328), y['39'] = 'm', y['40'] = _0x1f4662(0x411), y['41'] = _0x1f4662(0x20f), y['42'] = 'p', y['43'] = _0x1f4662(0x577), y['44'] = 'r', y['45'] = _0x1f4662(0x16f), y['46'] = _0x1f4662(0x279), y['47'] = 'u', y['48'] = _0x1f4662(0x613), y['49'] = _0x1f4662(0x3b4), y['50'] = 'x', y['51'] = '&psi;', y['52'] = 'z', y['53'] = '1', y['54'] = '2', y['55'] = '3', y['56'] = '4', y['57'] = '5', y['58'] = '6', y['59'] = '7', y['60'] = '8', y['61'] = '9', y['62'] = '0';
var z = {};
z['1'] = _0x1f4662(0x317), z['2'] = _0x1f4662(0x514), z['3'] = _0x1f4662(0x18a), z['4'] = '&#4331;', z['5'] = _0x1f4662(0x3b6), z['6'] = _0x1f4662(0x1aa), z['7'] = '&#2797;', z['8'] = '&#1210;', z['9'] = _0x1f4662(0x299), z['10'] = _0x1f4662(0x16a), z['11'] = '&#1179;', z['12'] = _0x1f4662(0x420), z['13'] = '&#625;', z['14'] = '&#1352;', z['15'] = _0x1f4662(0x5f8), z['16'] = _0x1f4662(0x3a0), z['17'] = _0x1f4662(0x422), z['18'] = _0x1f4662(0x19d), z['19'] = _0x1f4662(0x1eb), z['20'] = _0x1f4662(0x523), z['21'] = _0x1f4662(0x3ef), z['22'] = _0x1f4662(0x3c7), z['23'] = _0x1f4662(0x3b4), z['24'] = _0x1f4662(0x330), z['25'] = _0x1f4662(0x3f7), z['26'] = _0x1f4662(0x45d), z['27'] = '&#3588;', z['28'] = _0x1f4662(0x514), z['29'] = _0x1f4662(0x18a), z['30'] = _0x1f4662(0x14c), z['31'] = _0x1f4662(0x3b6), z['32'] = '&#1330;', z['33'] = _0x1f4662(0x4de), z['34'] = '&#1210;', z['35'] = _0x1f4662(0x299), z['36'] = _0x1f4662(0x16a), z['37'] = _0x1f4662(0x5fa), z['38'] = _0x1f4662(0x420), z['39'] = _0x1f4662(0x40b), z['40'] = _0x1f4662(0x25a), z['41'] = '&#2790;', z['42'] = _0x1f4662(0x3a0), z['43'] = '&#1193;', z['44'] = _0x1f4662(0x19d), z['45'] = _0x1f4662(0x1eb), z['46'] = _0x1f4662(0x523), z['47'] = '&upsilon;', z['48'] = _0x1f4662(0x3c7), z['49'] = _0x1f4662(0x3b4), z['50'] = '&#2794;', z['51'] = _0x1f4662(0x3f7), z['52'] = _0x1f4662(0x45d), z['53'] = '1', z['54'] = '2', z['55'] = '3', z['56'] = '4', z['57'] = '5', z['58'] = '6', z['59'] = '7', z['60'] = '8', z['61'] = '9', z['62'] = '0';
var A = {};
A['1'] = _0x1f4662(0x615), A['2'] = _0x1f4662(0x372), A['3'] = 'c', A['4'] = _0x1f4662(0x3c9), A['5'] = _0x1f4662(0x395), A['6'] = 'f', A['7'] = 'g', A['8'] = _0x1f4662(0x3e6), A['9'] = _0x1f4662(0x344), A['10'] = 'j', A['11'] = '&#1082;', A['12'] = _0x1f4662(0x31f), A['13'] = '&#1131;', A['14'] = _0x1f4662(0x387), A['15'] = _0x1f4662(0x297), A['16'] = 'p', A['17'] = _0x1f4662(0x1ab), A['18'] = _0x1f4662(0x43f), A['19'] = '$', A['20'] = '&#1090;', A['21'] = _0x1f4662(0x3ad), A['22'] = '&#1141;', A['23'] = _0x1f4662(0x5cc), A['24'] = _0x1f4662(0x14d), A['25'] = _0x1f4662(0x4ec), A['26'] = _0x1f4662(0x2fe), A['27'] = _0x1f4662(0x5cb), A['28'] = _0x1f4662(0x518), A['29'] = 'C', A['30'] = _0x1f4662(0x2d8), A['31'] = '&#1028;', A['32'] = 'F', A['33'] = 'G', A['34'] = 'H', A['35'] = _0x1f4662(0x1af), A['36'] = 'J', A['37'] = _0x1f4662(0x2b0), A['38'] = _0x1f4662(0x2b5), A['39'] = '&#1130;', A['40'] = '&#1049;', A['41'] = '&#1138;', A['42'] = 'P', A['43'] = _0x1f4662(0x589), A['44'] = '&#1071;', A['45'] = '$', A['46'] = 'T', A['47'] = _0x1f4662(0x5a4), A['48'] = _0x1f4662(0x5b9), A['49'] = '&#1064;', A['50'] = '&#1046;', A['51'] = _0x1f4662(0x212), A['52'] = _0x1f4662(0x2dc), A['53'] = '1', A['54'] = '2', A['55'] = '3', A['56'] = '4', A['57'] = '5', A['58'] = '6', A['59'] = '7', A['60'] = '8', A['61'] = '9', A['62'] = '0';
var B = {};
B['1'] = _0x1f4662(0x39b), B['2'] = _0x1f4662(0x1dc), B['3'] = _0x1f4662(0x159), B['4'] = _0x1f4662(0x502), B['5'] = 'e&#830;', B['6'] = _0x1f4662(0x384), B['7'] = _0x1f4662(0x415), B['8'] = _0x1f4662(0x595), B['9'] = _0x1f4662(0x5c8), B['10'] = _0x1f4662(0x56c), B['11'] = _0x1f4662(0x2ee), B['12'] = 'l&#830;', B['13'] = _0x1f4662(0x4c6), B['14'] = _0x1f4662(0x2cd), B['15'] = _0x1f4662(0x1d8), B['16'] = _0x1f4662(0x480), B['17'] = _0x1f4662(0x5a0), B['18'] = _0x1f4662(0x22a), B['19'] = _0x1f4662(0x2e6), B['20'] = _0x1f4662(0x2e2), B['21'] = _0x1f4662(0x5dc), B['22'] = _0x1f4662(0x233), B['23'] = 'w&#830;', B['24'] = _0x1f4662(0x5cd), B['25'] = 'y&#830;', B['26'] = 'z&#830;', B['27'] = _0x1f4662(0x42d), B['28'] = _0x1f4662(0x2d5), B['29'] = 'C&#830;', B['30'] = _0x1f4662(0x5af), B['31'] = _0x1f4662(0x286), B['32'] = 'F&#830;', B['33'] = 'G&#830;', B['34'] = _0x1f4662(0x178), B['35'] = 'I&#830;', B['36'] = _0x1f4662(0x36b), B['37'] = 'K&#830;', B['38'] = 'L&#830;', B['39'] = _0x1f4662(0x4b7), B['40'] = _0x1f4662(0x5f9), B['41'] = _0x1f4662(0x1cf), B['42'] = 'P&#830;', B['43'] = 'Q&#830;', B['44'] = _0x1f4662(0x3d6), B['45'] = 'S&#830;', B['46'] = 'T&#830;', B['47'] = _0x1f4662(0x168), B['48'] = 'V&#830;', B['49'] = _0x1f4662(0x46d), B['50'] = _0x1f4662(0x570), B['51'] = _0x1f4662(0x56f), B['52'] = _0x1f4662(0x22d), B['53'] = _0x1f4662(0x5e9), B['54'] = _0x1f4662(0x3a6), B['55'] = '3&#830;', B['56'] = _0x1f4662(0x4c3), B['57'] = _0x1f4662(0x2bf), B['58'] = '6&#830;', B['59'] = _0x1f4662(0x239), B['60'] = _0x1f4662(0x321), B['61'] = '9&#830;', B['62'] = _0x1f4662(0x5ba);
var C = {};
C['1'] = 'a&#838;', C['2'] = 'b&#838;', C['3'] = _0x1f4662(0x33e), C['4'] = _0x1f4662(0x5bb), C['5'] = 'e&#838;', C['6'] = _0x1f4662(0x1ad), C['7'] = _0x1f4662(0x3b8), C['8'] = _0x1f4662(0x21a), C['9'] = 'i&#838;', C['10'] = _0x1f4662(0x4e1), C['11'] = _0x1f4662(0x259), C['12'] = _0x1f4662(0x448), C['13'] = _0x1f4662(0x25e), C['14'] = 'n&#838;', C['15'] = _0x1f4662(0x223), C['16'] = _0x1f4662(0x3b1), C['17'] = _0x1f4662(0x553), C['18'] = 'r&#838;', C['19'] = _0x1f4662(0x5d6), C['20'] = _0x1f4662(0x560), C['21'] = _0x1f4662(0x58d), C['22'] = _0x1f4662(0x213), C['23'] = _0x1f4662(0x150), C['24'] = _0x1f4662(0x515), C['25'] = _0x1f4662(0x343), C['26'] = _0x1f4662(0x5d4), C['27'] = _0x1f4662(0x15a), C['28'] = _0x1f4662(0x29f), C['29'] = _0x1f4662(0x53b), C['30'] = 'D&#838;', C['31'] = _0x1f4662(0x3f9), C['32'] = _0x1f4662(0x596), C['33'] = 'G&#838;', C['34'] = _0x1f4662(0x342), C['35'] = _0x1f4662(0x164), C['36'] = _0x1f4662(0x424), C['37'] = 'K&#838;', C['38'] = _0x1f4662(0x1c6), C['39'] = _0x1f4662(0x50f), C['40'] = _0x1f4662(0x41f), C['41'] = _0x1f4662(0x44e), C['42'] = _0x1f4662(0x5e1), C['43'] = _0x1f4662(0x57e), C['44'] = _0x1f4662(0x27a), C['45'] = 'S&#838;', C['46'] = 'T&#838;', C['47'] = _0x1f4662(0x538), C['48'] = _0x1f4662(0x195), C['49'] = _0x1f4662(0x510), C['50'] = _0x1f4662(0x2b9), C['51'] = _0x1f4662(0x494), C['52'] = _0x1f4662(0x26d), C['53'] = _0x1f4662(0x1e7), C['54'] = _0x1f4662(0x1c0), C['55'] = _0x1f4662(0x3f5), C['56'] = _0x1f4662(0x58a), C['57'] = _0x1f4662(0x333), C['58'] = '6&#838;', C['59'] = _0x1f4662(0x61c), C['60'] = _0x1f4662(0x191), C['61'] = _0x1f4662(0x14b), C['62'] = _0x1f4662(0x197);
var D = {};
D['1'] = _0x1f4662(0x26f), D['2'] = _0x1f4662(0x4e5), D['3'] = _0x1f4662(0x281), D['4'] = 'd&#826;', D['5'] = _0x1f4662(0x325), D['6'] = _0x1f4662(0x296), D['7'] = _0x1f4662(0x52d), D['8'] = _0x1f4662(0x3d7), D['9'] = _0x1f4662(0x4c1), D['10'] = _0x1f4662(0x556), D['11'] = _0x1f4662(0x4ae), D['12'] = 'l&#826;', D['13'] = _0x1f4662(0x27c), D['14'] = _0x1f4662(0x54b), D['15'] = _0x1f4662(0x389), D['16'] = 'p&#826;', D['17'] = _0x1f4662(0x4ba), D['18'] = _0x1f4662(0x609), D['19'] = _0x1f4662(0x34f), D['20'] = _0x1f4662(0x489), D['21'] = 'u&#826;', D['22'] = _0x1f4662(0x226), D['23'] = _0x1f4662(0x55e), D['24'] = _0x1f4662(0x397), D['25'] = _0x1f4662(0x2d0), D['26'] = 'z&#826;', D['27'] = _0x1f4662(0x5a5), D['28'] = 'B&#826;', D['29'] = _0x1f4662(0x512), D['30'] = _0x1f4662(0x526), D['31'] = _0x1f4662(0x264), D['32'] = _0x1f4662(0x2ec), D['33'] = 'G&#826;', D['34'] = 'H&#826;', D['35'] = 'I&#826;', D['36'] = 'J&#826;', D['37'] = _0x1f4662(0x5c2), D['38'] = _0x1f4662(0x57d), D['39'] = _0x1f4662(0x352), D['40'] = _0x1f4662(0x40a), D['41'] = _0x1f4662(0x5c1), D['42'] = _0x1f4662(0x334), D['43'] = _0x1f4662(0x5ee), D['44'] = _0x1f4662(0x2b1), D['45'] = _0x1f4662(0x4c9), D['46'] = 'T&#826;', D['47'] = _0x1f4662(0x2b4), D['48'] = 'V&#826;', D['49'] = 'W&#826;', D['50'] = _0x1f4662(0x1e0), D['51'] = 'Y&#826;', D['52'] = _0x1f4662(0x5f4), D['53'] = _0x1f4662(0x231), D['54'] = _0x1f4662(0x5f5), D['55'] = _0x1f4662(0x572), D['56'] = _0x1f4662(0x59a), D['57'] = _0x1f4662(0x35b), D['58'] = _0x1f4662(0x5aa), D['59'] = _0x1f4662(0x4f1), D['60'] = _0x1f4662(0x22c), D['61'] = _0x1f4662(0x1e4), D['62'] = '0&#826;';
var E = {};
E['1'] = _0x1f4662(0x276), E['2'] = _0x1f4662(0x20e), E['3'] = _0x1f4662(0x4ad), E['4'] = 'd&#857;', E['5'] = 'e&#857;', E['6'] = _0x1f4662(0x606), E['7'] = _0x1f4662(0x485), E['8'] = _0x1f4662(0x49c), E['9'] = _0x1f4662(0x16d), E['10'] = _0x1f4662(0x5d7), E['11'] = _0x1f4662(0x1c8), E['12'] = _0x1f4662(0x24c), E['13'] = 'm&#857;', E['14'] = 'n&#857;', E['15'] = 'o&#857;', E['16'] = 'p&#857;', E['17'] = _0x1f4662(0x5fe), E['18'] = _0x1f4662(0x1b0), E['19'] = 's&#857;', E['20'] = _0x1f4662(0x51f), E['21'] = _0x1f4662(0x2ed), E['22'] = 'v&#857;', E['23'] = _0x1f4662(0x4b0), E['24'] = _0x1f4662(0x432), E['25'] = 'y&#857;', E['26'] = _0x1f4662(0x186), E['27'] = _0x1f4662(0x23e), E['28'] = 'B&#857;', E['29'] = _0x1f4662(0x188), E['30'] = 'D&#857;', E['31'] = _0x1f4662(0x50b), E['32'] = _0x1f4662(0x43b), E['33'] = _0x1f4662(0x5a6), E['34'] = _0x1f4662(0x43d), E['35'] = _0x1f4662(0x5c4), E['36'] = _0x1f4662(0x1b5), E['37'] = _0x1f4662(0x5f3), E['38'] = 'L&#857;', E['39'] = _0x1f4662(0x22f), E['40'] = _0x1f4662(0x3a3), E['41'] = _0x1f4662(0x500), E['42'] = 'P&#857;', E['43'] = 'Q&#857;', E['44'] = _0x1f4662(0x588), E['45'] = _0x1f4662(0x1b4), E['46'] = _0x1f4662(0x4f6), E['47'] = _0x1f4662(0x3cf), E['48'] = _0x1f4662(0x458), E['49'] = _0x1f4662(0x2ae), E['50'] = _0x1f4662(0x5df), E['51'] = _0x1f4662(0x59c), E['52'] = _0x1f4662(0x55b), E['53'] = _0x1f4662(0x2c1), E['54'] = _0x1f4662(0x60f), E['55'] = '3&#857;', E['56'] = '4&#857;', E['57'] = '5&#857;', E['58'] = _0x1f4662(0x3cb), E['59'] = '7&#857;', E['60'] = _0x1f4662(0x44d), E['61'] = _0x1f4662(0x5ed), E['62'] = _0x1f4662(0x561);
var F = {};
F['1'] = _0x1f4662(0x5ac), F['2'] = _0x1f4662(0x316), F['3'] = _0x1f4662(0x467), F['4'] = 'd&#799;', F['5'] = _0x1f4662(0x4f2), F['6'] = _0x1f4662(0x1e6), F['7'] = _0x1f4662(0x385), F['8'] = _0x1f4662(0x1c7), F['9'] = 'i&#799;', F['10'] = _0x1f4662(0x236), F['11'] = 'k&#799;', F['12'] = _0x1f4662(0x4be), F['13'] = _0x1f4662(0x52c), F['14'] = _0x1f4662(0x290), F['15'] = _0x1f4662(0x270), F['16'] = _0x1f4662(0x56a), F['17'] = _0x1f4662(0x5ca), F['18'] = _0x1f4662(0x1f5), F['19'] = _0x1f4662(0x477), F['20'] = _0x1f4662(0x181), F['21'] = _0x1f4662(0x401), F['22'] = _0x1f4662(0x417), F['23'] = _0x1f4662(0x31d), F['24'] = _0x1f4662(0x60c), F['25'] = _0x1f4662(0x472), F['26'] = _0x1f4662(0x612), F['27'] = _0x1f4662(0x1d1), F['28'] = 'B&#799;', F['29'] = _0x1f4662(0x46a), F['30'] = _0x1f4662(0x476), F['31'] = 'E&#799;', F['32'] = _0x1f4662(0x156), F['33'] = _0x1f4662(0x3fd), F['34'] = 'H&#799;', F['35'] = _0x1f4662(0x535), F['36'] = _0x1f4662(0x585), F['37'] = _0x1f4662(0x459), F['38'] = _0x1f4662(0x210), F['39'] = 'M&#799;', F['40'] = _0x1f4662(0x365), F['41'] = _0x1f4662(0x32b), F['42'] = 'P&#799;', F['43'] = _0x1f4662(0x24b), F['44'] = _0x1f4662(0x4c8), F['45'] = 'S&#799;', F['46'] = 'T&#799;', F['47'] = _0x1f4662(0x599), F['48'] = _0x1f4662(0x575), F['49'] = 'W&#799;', F['50'] = _0x1f4662(0x3de), F['51'] = 'Y&#799;', F['52'] = _0x1f4662(0x3e5), F['53'] = _0x1f4662(0x1b6), F['54'] = _0x1f4662(0x5b2), F['55'] = _0x1f4662(0x1b7), F['56'] = _0x1f4662(0x2c9), F['57'] = _0x1f4662(0x3d0), F['58'] = _0x1f4662(0x3be), F['59'] = '7&#799;', F['60'] = _0x1f4662(0x2c4), F['61'] = _0x1f4662(0x1bb), F['62'] = _0x1f4662(0x203);
var G = {};
G['1'] = _0x1f4662(0x27b), G['2'] = 'b&#846;', G['3'] = _0x1f4662(0x4ab), G['4'] = 'd&#846;', G['5'] = _0x1f4662(0x3e7), G['6'] = _0x1f4662(0x440), G['7'] = 'g&#846;', G['8'] = 'h&#846;', G['9'] = _0x1f4662(0x528), G['10'] = _0x1f4662(0x493), G['11'] = _0x1f4662(0x2a1), G['12'] = 'l&#846;', G['13'] = _0x1f4662(0x179), G['14'] = _0x1f4662(0x1d9), G['15'] = _0x1f4662(0x31c), G['16'] = _0x1f4662(0x425), G['17'] = _0x1f4662(0x488), G['18'] = _0x1f4662(0x5dd), G['19'] = _0x1f4662(0x19a), G['20'] = 't&#846;', G['21'] = _0x1f4662(0x396), G['22'] = 'v&#846;', G['23'] = _0x1f4662(0x379), G['24'] = _0x1f4662(0x30d), G['25'] = _0x1f4662(0x5e4), G['26'] = _0x1f4662(0x5d1), G['27'] = 'A&#846;', G['28'] = _0x1f4662(0x2ac), G['29'] = 'C&#846;', G['30'] = _0x1f4662(0x3c5), G['31'] = _0x1f4662(0x329), G['32'] = 'F&#846;', G['33'] = _0x1f4662(0x48e), G['34'] = 'H&#846;', G['35'] = _0x1f4662(0x346), G['36'] = _0x1f4662(0x3d8), G['37'] = _0x1f4662(0x1df), G['38'] = 'L&#846;', G['39'] = _0x1f4662(0x319), G['40'] = _0x1f4662(0x5ab), G['41'] = 'O&#846;', G['42'] = _0x1f4662(0x578), G['43'] = _0x1f4662(0x48d), G['44'] = 'R&#846;', G['45'] = 'S&#846;', G['46'] = _0x1f4662(0x3e1), G['47'] = _0x1f4662(0x166), G['48'] = _0x1f4662(0x2f1), G['49'] = _0x1f4662(0x18c), G['50'] = 'X&#846;', G['51'] = _0x1f4662(0x364), G['52'] = 'Z&#846;', G['53'] = '1&#846;', G['54'] = _0x1f4662(0x23f), G['55'] = _0x1f4662(0x4fe), G['56'] = '4&#846;', G['57'] = _0x1f4662(0x2f3), G['58'] = _0x1f4662(0x461), G['59'] = _0x1f4662(0x170), G['60'] = _0x1f4662(0x1ed), G['61'] = _0x1f4662(0x5c5), G['62'] = _0x1f4662(0x237);
var H = {};
H['1'] = _0x1f4662(0x496), H['2'] = _0x1f4662(0x182), H['3'] = _0x1f4662(0x414), H['4'] = _0x1f4662(0x47c), H['5'] = _0x1f4662(0x320), H['6'] = 'f&#829;&#851;', H['7'] = 'g&#829;&#851;', H['8'] = _0x1f4662(0x312), H['9'] = _0x1f4662(0x189), H['10'] = 'j&#829;&#851;', H['11'] = _0x1f4662(0x542), H['12'] = 'l&#829;&#851;', H['13'] = _0x1f4662(0x258), H['14'] = _0x1f4662(0x1a6), H['15'] = 'o&#829;&#851;', H['16'] = 'p&#829;&#851;', H['17'] = _0x1f4662(0x3fb), H['18'] = 'r&#829;&#851;', H['19'] = 's&#829;&#851;', H['20'] = _0x1f4662(0x61e), H['21'] = 'u&#829;&#851;', H['22'] = _0x1f4662(0x1d7), H['23'] = _0x1f4662(0x38f), H['24'] = _0x1f4662(0x3f0), H['25'] = _0x1f4662(0x5c7), H['26'] = _0x1f4662(0x3c6), H['27'] = _0x1f4662(0x37d), H['28'] = 'B&#829;&#851;', H['29'] = _0x1f4662(0x5eb), H['30'] = _0x1f4662(0x1fd), H['31'] = _0x1f4662(0x378), H['32'] = 'F&#829;&#851;', H['33'] = _0x1f4662(0x17d), H['34'] = _0x1f4662(0x48a), H['35'] = _0x1f4662(0x29a), H['36'] = 'J&#829;&#851;', H['37'] = _0x1f4662(0x243), H['38'] = _0x1f4662(0x298), H['39'] = 'M&#829;&#851;', H['40'] = _0x1f4662(0x19b), H['41'] = _0x1f4662(0x24f), H['42'] = _0x1f4662(0x28c), H['43'] = 'Q&#829;&#851;', H['44'] = 'R&#829;&#851;', H['45'] = _0x1f4662(0x4b5), H['46'] = _0x1f4662(0x591), H['47'] = _0x1f4662(0x2a9), H['48'] = 'V&#829;&#851;', H['49'] = 'W&#829;&#851;', H['50'] = _0x1f4662(0x51d), H['51'] = _0x1f4662(0x202), H['52'] = _0x1f4662(0x222), H['53'] = '1&#829;&#851;', H['54'] = _0x1f4662(0x165), H['55'] = _0x1f4662(0x4d2), H['56'] = _0x1f4662(0x3c1), H['57'] = '5&#829;&#851;', H['58'] = '6&#829;&#851;', H['59'] = _0x1f4662(0x5f6), H['60'] = _0x1f4662(0x180), H['61'] = _0x1f4662(0x209), H['62'] = _0x1f4662(0x25d);
var I = {};
I['1'] = '&#120458;&#823;', I['2'] = '&#120459;&#823;', I['3'] = _0x1f4662(0x23a), I['4'] = _0x1f4662(0x61f), I['5'] = _0x1f4662(0x2f6), I['6'] = _0x1f4662(0x30a), I['7'] = _0x1f4662(0x46f), I['8'] = '&#120465;&#823;', I['9'] = _0x1f4662(0x263), I['10'] = _0x1f4662(0x38b), I['11'] = _0x1f4662(0x4d0), I['12'] = '&#120469;&#823;', I['13'] = '&#120470;&#823;', I['14'] = _0x1f4662(0x3c3), I['15'] = '&#120472;&#823;', I['16'] = _0x1f4662(0x2df), I['17'] = _0x1f4662(0x1a9), I['18'] = _0x1f4662(0x4e0), I['19'] = '&#120476;&#823;', I['20'] = _0x1f4662(0x563), I['21'] = _0x1f4662(0x59d), I['22'] = _0x1f4662(0x58b), I['23'] = _0x1f4662(0x557), I['24'] = _0x1f4662(0x443), I['25'] = _0x1f4662(0x4a2), I['26'] = _0x1f4662(0x544), I['27'] = '&#120432;&#823;', I['28'] = _0x1f4662(0x1ec), I['29'] = _0x1f4662(0x1b8), I['30'] = '&#120435;&#823;', I['31'] = _0x1f4662(0x15e), I['32'] = _0x1f4662(0x155), I['33'] = _0x1f4662(0x1de), I['34'] = '&#120439;&#823;', I['35'] = _0x1f4662(0x37f), I['36'] = _0x1f4662(0x450), I['37'] = _0x1f4662(0x4ed), I['38'] = '&#120443;&#823;', I['39'] = _0x1f4662(0x4bc), I['40'] = _0x1f4662(0x4e4), I['41'] = _0x1f4662(0x1bc), I['42'] = _0x1f4662(0x33a), I['43'] = _0x1f4662(0x22b), I['44'] = _0x1f4662(0x436), I['45'] = _0x1f4662(0x525), I['46'] = _0x1f4662(0x5b8), I['47'] = _0x1f4662(0x377), I['48'] = _0x1f4662(0x26e), I['49'] = _0x1f4662(0x44f), I['50'] = _0x1f4662(0x340), I['51'] = _0x1f4662(0x584), I['52'] = _0x1f4662(0x21b), I['53'] = _0x1f4662(0x386), I['54'] = _0x1f4662(0x54f), I['55'] = _0x1f4662(0x5b6), I['56'] = '&#120826;&#823;', I['57'] = '&#120827;&#823;', I['58'] = _0x1f4662(0x3eb), I['59'] = _0x1f4662(0x383), I['60'] = _0x1f4662(0x504), I['61'] = _0x1f4662(0x37b), I['62'] = _0x1f4662(0x42b);
var J = {};
J['1'] = 'a&#866;', J['2'] = 'b&#866;', J['3'] = _0x1f4662(0x44c), J['4'] = _0x1f4662(0x562), J['5'] = _0x1f4662(0x219), J['6'] = _0x1f4662(0x1bf), J['7'] = 'g&#866;', J['8'] = _0x1f4662(0x620), J['9'] = 'i&#866;', J['10'] = 'j&#866;', J['11'] = _0x1f4662(0x175), J['12'] = _0x1f4662(0x41c), J['13'] = _0x1f4662(0x4e6), J['14'] = _0x1f4662(0x466), J['15'] = _0x1f4662(0x24e), J['16'] = 'p&#866;', J['17'] = 'q&#866;', J['18'] = _0x1f4662(0x482), J['19'] = _0x1f4662(0x3ce), J['20'] = 't&#866;', J['21'] = _0x1f4662(0x1ae), J['22'] = _0x1f4662(0x61d), J['23'] = _0x1f4662(0x423), J['24'] = _0x1f4662(0x351), J['25'] = 'y&#866;', J['26'] = 'z&#866;', J['27'] = 'A&#866;', J['28'] = _0x1f4662(0x50a), J['29'] = 'C&#866;', J['30'] = _0x1f4662(0x4d6), J['31'] = 'E&#866;', J['32'] = _0x1f4662(0x2f2), J['33'] = _0x1f4662(0x507), J['34'] = _0x1f4662(0x618), J['35'] = _0x1f4662(0x517), J['36'] = 'J&#866;', J['37'] = 'K&#866;', J['38'] = _0x1f4662(0x3f8), J['39'] = _0x1f4662(0x1ca), J['40'] = _0x1f4662(0x14f), J['41'] = 'O&#866;', J['42'] = 'P&#866;', J['43'] = _0x1f4662(0x2e1), J['44'] = _0x1f4662(0x2ff), J['45'] = 'S&#866;', J['46'] = 'T&#866;', J['47'] = _0x1f4662(0x21c), J['48'] = _0x1f4662(0x162), J['49'] = _0x1f4662(0x291), J['50'] = _0x1f4662(0x310), J['51'] = _0x1f4662(0x4ee), J['52'] = _0x1f4662(0x44a), J['53'] = _0x1f4662(0x151), J['54'] = _0x1f4662(0x582), J['55'] = '3&#866;', J['56'] = '4&#866;', J['57'] = '5&#866;', J['58'] = _0x1f4662(0x5c0), J['59'] = '7&#866;', J['60'] = _0x1f4662(0x2a4), J['61'] = _0x1f4662(0x1db), J['62'] = _0x1f4662(0x614);
var K = {};
K['1'] = _0x1f4662(0x2f9), K['2'] = _0x1f4662(0x3a7), K['3'] = 'c&#828;', K['4'] = 'd&#828;', K['5'] = _0x1f4662(0x5a8), K['6'] = _0x1f4662(0x60a), K['7'] = _0x1f4662(0x232), K['8'] = _0x1f4662(0x475), K['9'] = _0x1f4662(0x41b), K['10'] = _0x1f4662(0x429), K['11'] = _0x1f4662(0x5c3), K['12'] = _0x1f4662(0x555), K['13'] = 'm&#828;', K['14'] = _0x1f4662(0x5a2), K['15'] = _0x1f4662(0x153), K['16'] = _0x1f4662(0x4c7), K['17'] = _0x1f4662(0x49d), K['18'] = _0x1f4662(0x41a), K['19'] = 's&#828;', K['20'] = 't&#828;', K['21'] = 'u&#828;', K['22'] = _0x1f4662(0x587), K['23'] = 'w&#828;', K['24'] = 'x&#828;', K['25'] = _0x1f4662(0x4e3), K['26'] = _0x1f4662(0x1c4), K['27'] = _0x1f4662(0x2a7), K['28'] = _0x1f4662(0x5f2), K['29'] = _0x1f4662(0x269), K['30'] = 'D&#828;', K['31'] = 'E&#828;', K['32'] = 'F&#828;', K['33'] = _0x1f4662(0x398), K['34'] = _0x1f4662(0x249), K['35'] = _0x1f4662(0x190), K['36'] = 'J&#828;', K['37'] = 'K&#828;', K['38'] = 'L&#828;', K['39'] = _0x1f4662(0x47a), K['40'] = _0x1f4662(0x403), K['41'] = _0x1f4662(0x29b), K['42'] = _0x1f4662(0x468), K['43'] = _0x1f4662(0x2b8), K['44'] = 'R&#828;', K['45'] = _0x1f4662(0x34b), K['46'] = 'T&#828;', K['47'] = _0x1f4662(0x4ca), K['48'] = 'V&#828;', K['49'] = _0x1f4662(0x5d9), K['50'] = _0x1f4662(0x2ef), K['51'] = _0x1f4662(0x172), K['52'] = _0x1f4662(0x399), K['53'] = _0x1f4662(0x3ff), K['54'] = _0x1f4662(0x430), K['55'] = _0x1f4662(0x3a2), K['56'] = '4&#828;', K['57'] = _0x1f4662(0x32e), K['58'] = '6&#828;', K['59'] = _0x1f4662(0x559), K['60'] = '8&#828;', K['61'] = '9&#828;', K['62'] = _0x1f4662(0x3a1);
var L = {};
L['s1'] = h, L['s2'] = i, L['s3'] = j, L['s4'] = k, L['s5'] = l, L['s6'] = m, L['s7'] = n, L['s8'] = o, L['s9'] = p, L[_0x1f4662(0x3fc)] = q, L[_0x1f4662(0x2bd)] = r, L[_0x1f4662(0x51b)] = s, L[_0x1f4662(0x543)] = t, L['s14'] = u, L['s15'] = v, L[_0x1f4662(0x234)] = w, L[_0x1f4662(0x194)] = x, L[_0x1f4662(0x2cb)] = y, L['s19'] = z, L[_0x1f4662(0x60b)] = A, L[_0x1f4662(0x15d)] = B, L[_0x1f4662(0x2f7)] = C, L['s23'] = D, L[_0x1f4662(0x373)] = E, L[_0x1f4662(0x5e8)] = F, L['s26'] = G, L[_0x1f4662(0x1d4)] = H, L['s29'] = I, L[_0x1f4662(0x1e1)] = J, L[_0x1f4662(0x277)] = K;
var newtext = L;

function Change(_0x321100, _0x1a69d7) {
    var _0x3702b2 = _0x1f4662,
        _0x25b845 = '',
        _0x321100 = _0x321100;
    if (_0x321100['length'] == 0x0) return;
    for (i = 0x0; i < _0x321100['length']; i++) {
        var _0x1bd828 = _0x321100[_0x3702b2(0x49f)](i),
            _0x3acd01 = normal[_0x3702b2(0x404)](_0x1bd828) + 0x1;
        if (_0x1bd828 == '\x20') _0x25b845 += '\x20';
        else !_0x3acd01 ? _0x25b845 += _0x1bd828 : _0x25b845 += newtext[_0x1a69d7][_0x3acd01];
    }
    return _0x25b845;
}
var M = {};
M['0'] = '0', M['1'] = '1', M['2'] = '2', M['3'] = '3', M['4'] = '4', M['5'] = '5', M['6'] = '6', M['7'] = '7', M['8'] = '8', M['9'] = '9', M['a'] = 'ᗩ', M['b'] = 'ᗷ', M['c'] = 'ᑢ', M['d'] = 'ᕲ', M['e'] = 'ᘿ', M['f'] = 'ᖴ', M['g'] = 'ᘜ', M['h'] = 'ᕼ', M['i'] = 'ᓰ', M['j'] = 'ᒚ', M['k'] = 'ᖽᐸ', M['l'] = 'ᒪ', M['m'] = 'ᘻ', M['n'] = 'ᘉ', M['o'] = 'ᓍ', M['p'] = 'ᕵ', M['q'] = 'ᕴ', M['r'] = 'ᖇ', M['s'] = 'S', M['t'] = 'ᖶ', M['u'] = 'ᑘ', M['v'] = 'ᐺ', M['w'] = 'ᘺ', M['x'] = '᙭', M['y'] = 'ᖻ', M['z'] = 'ᗱ', M['A'] = 'ᗩ', M['B'] = 'ᗷ', M['C'] = 'ᑢ', M['D'] = 'ᕲ', M['E'] = 'ᘿ', M['F'] = 'ᖴ', M['G'] = 'ᘜ', M['H'] = 'ᕼ', M['I'] = 'ᓰ', M['J'] = 'ᒚ', M['K'] = 'ᖽᐸ', M['L'] = 'ᒪ', M['M'] = 'ᘻ', M['N'] = 'ᘉ', M['O'] = 'ᓍ', M['P'] = 'ᕵ', M['Q'] = 'ᕴ', M['R'] = 'ᖇ', M['S'] = 'S', M['T'] = 'ᖶ', M['U'] = 'ᑘ', M['V'] = 'ᐺ', M['W'] = 'ᘺ', M['X'] = '᙭', M['Y'] = 'ᖻ', M['Z'] = 'ᗱ';
const futureAlienCharMap = M;
var N = {};
N['0'] = '0', N['1'] = '1', N['2'] = '2', N['3'] = '3', N['4'] = '4', N['5'] = '5', N['6'] = '6', N['7'] = '7', N['8'] = '8', N['9'] = '9', N['a'] = 'ค', N['b'] = '๖', N['c'] = '¢', N['d'] = '໓', N['e'] = 'ē', N['f'] = 'f', N['g'] = 'ງ', N['h'] = 'h', N['i'] = 'i', N['j'] = 'ว', N['k'] = 'k', N['l'] = 'l', N['m'] = '๓', N['n'] = 'ຖ', N['o'] = '໐', N['p'] = 'p', N['q'] = '๑', N['r'] = 'r', N['s'] = 'Ş', N['t'] = 't', N['u'] = 'น', N['v'] = 'ง', N['w'] = 'ຟ', N['x'] = 'x', N['y'] = 'ฯ', N['z'] = 'ຊ', N['A'] = 'ค', N['B'] = '๖', N['C'] = '¢', N['D'] = '໓', N['E'] = 'ē', N['F'] = 'f', N['G'] = 'ງ', N['H'] = 'h', N['I'] = 'i', N['J'] = 'ว', N['K'] = 'k', N['L'] = 'l', N['M'] = '๓', N['N'] = 'ຖ', N['O'] = '໐', N['P'] = 'p', N['Q'] = '๑', N['R'] = 'r', N['S'] = 'Ş', N['T'] = 't', N['U'] = 'น', N['V'] = 'ง', N['W'] = 'ຟ', N['X'] = 'x', N['Y'] = 'ฯ', N['Z'] = 'ຊ';
const squiggle6CharMap = N;
var O = {};
O['0'] = '0', O['1'] = '1', O['2'] = '2', O['3'] = '3', O['4'] = '4', O['5'] = '5', O['6'] = '6', O['7'] = '7', O['8'] = '8', O['9'] = '9', O['a'] = 'ą', O['b'] = 'ც', O['c'] = 'ƈ', O['d'] = 'ɖ', O['e'] = 'ɛ', O['f'] = 'ʄ', O['g'] = 'ɠ', O['h'] = 'ɧ', O['i'] = 'ı', O['j'] = 'ʝ', O['k'] = 'ƙ', O['l'] = 'Ɩ', O['m'] = 'ɱ', O['n'] = 'ŋ', O['o'] = 'ơ', O['p'] = '℘', O['q'] = 'զ', O['r'] = 'ཞ', O['s'] = 'ʂ', O['t'] = 'ɬ', O['u'] = 'ų', O['v'] = '۷', O['w'] = 'ῳ', O['x'] = 'ҳ', O['y'] = 'ყ', O['z'] = 'ʑ', O['A'] = 'ą', O['B'] = 'ც', O['C'] = 'ƈ', O['D'] = 'ɖ', O['E'] = 'ɛ', O['F'] = 'ʄ', O['G'] = 'ɠ', O['H'] = 'ɧ', O['I'] = 'ı', O['J'] = 'ʝ', O['K'] = 'ƙ', O['L'] = 'Ɩ', O['M'] = 'ɱ', O['N'] = 'ŋ', O['O'] = 'ơ', O['P'] = '℘', O['Q'] = 'զ', O['R'] = 'ཞ', O['S'] = 'ʂ', O['T'] = 'ɬ', O['U'] = 'ų', O['V'] = '۷', O['W'] = 'ῳ', O['X'] = 'ҳ', O['Y'] = 'ყ', O['Z'] = 'ʑ';
const squiggle5CharMap = O;
var P = {};
P['0'] = '0', P['1'] = '1', P['2'] = '2', P['3'] = '3', P['4'] = '4', P['5'] = '5', P['6'] = '6', P['7'] = '7', P['8'] = '8', P['9'] = '9', P['a'] = 'ﾑ', P['b'] = '乃', P['c'] = 'ᄃ', P['d'] = 'り', P['e'] = '乇', P['f'] = 'ｷ', P['g'] = 'ム', P['h'] = 'ん', P['i'] = 'ﾉ', P['j'] = 'ﾌ', P['k'] = 'ズ', P['l'] = 'ﾚ', P['m'] = 'ﾶ', P['n'] = '刀', P['o'] = 'の', P['p'] = 'ｱ', P['q'] = 'ゐ', P['r'] = '尺', P['s'] = '丂', P['t'] = 'ｲ', P['u'] = 'ひ', P['v'] = '√', P['w'] = 'W', P['x'] = 'ﾒ', P['y'] = 'ﾘ', P['z'] = '乙', P['A'] = 'ﾑ', P['B'] = '乃', P['C'] = 'ᄃ', P['D'] = 'り', P['E'] = '乇', P['F'] = 'ｷ', P['G'] = 'ム', P['H'] = 'ん', P['I'] = 'ﾉ', P['J'] = 'ﾌ', P['K'] = 'ズ', P['L'] = 'ﾚ', P['M'] = 'ﾶ', P['N'] = '刀', P['O'] = 'の', P['P'] = 'ｱ', P['Q'] = 'ゐ', P['R'] = '尺', P['S'] = '丂', P['T'] = 'ｲ', P['U'] = 'ひ', P['V'] = '√', P['W'] = 'W', P['X'] = 'ﾒ', P['Y'] = 'ﾘ', P['Z'] = '乙';
const asianStyle2CharMap = P;
var Q = {};
Q['0'] = '0', Q['1'] = '1', Q['2'] = '2', Q['3'] = '3', Q['4'] = '4', Q['5'] = '5', Q['6'] = '6', Q['7'] = '7', Q['8'] = '8', Q['9'] = '9', Q['a'] = '卂', Q['b'] = '乃', Q['c'] = '匚', Q['d'] = 'ᗪ', Q['e'] = '乇', Q['f'] = '千', Q['g'] = 'Ꮆ', Q['h'] = '卄', Q['i'] = '丨', Q['j'] = 'ﾌ', Q['k'] = 'Ҝ', Q['l'] = 'ㄥ', Q['m'] = '爪', Q['n'] = '几', Q['o'] = 'ㄖ', Q['p'] = '卩', Q['q'] = 'Ɋ', Q['r'] = '尺', Q['s'] = '丂', Q['t'] = 'ㄒ', Q['u'] = 'ㄩ', Q['v'] = 'ᐯ', Q['w'] = '山', Q['x'] = '乂', Q['y'] = 'ㄚ', Q['z'] = '乙', Q['A'] = '卂', Q['B'] = '乃', Q['C'] = '匚', Q['D'] = 'ᗪ', Q['E'] = '乇', Q['F'] = '千', Q['G'] = 'Ꮆ', Q['H'] = '卄', Q['I'] = '丨', Q['J'] = 'ﾌ', Q['K'] = 'Ҝ', Q['L'] = 'ㄥ', Q['M'] = '爪', Q['N'] = '几', Q['O'] = 'ㄖ', Q['P'] = '卩', Q['Q'] = 'Ɋ', Q['R'] = '尺', Q['S'] = '丂', Q['T'] = 'ㄒ', Q['U'] = 'ㄩ', Q['V'] = 'ᐯ', Q['W'] = '山', Q['X'] = '乂', Q['Y'] = 'ㄚ', Q['Z'] = '乙';
const asianStyleCharMap = Q;
var R = {};
R['0'] = '0', R['1'] = '1', R['2'] = '2', R['3'] = '3', R['4'] = '4', R['5'] = '5', R['6'] = '6', R['7'] = '7', R['8'] = '8', R['9'] = '9', R['a'] = '🄰', R['b'] = '🄱', R['c'] = '🄲', R['d'] = '🄳', R['e'] = '🄴', R['f'] = '🄵', R['g'] = '🄶', R['h'] = '🄷', R['i'] = '🄸', R['j'] = '🄹', R['k'] = '🄺', R['l'] = '🄻', R['m'] = '🄼', R['n'] = '🄽', R['o'] = '🄾', R['p'] = '🄿', R['q'] = '🅀', R['r'] = '🅁', R['s'] = '🅂', R['t'] = '🅃', R['u'] = '🅄', R['v'] = '🅅', R['w'] = '🅆', R['x'] = '🅇', R['y'] = '🅈', R['z'] = '🅉', R['A'] = '🄰', R['B'] = '🄱', R['C'] = '🄲', R['D'] = '🄳', R['E'] = '🄴', R['F'] = '🄵', R['G'] = '🄶', R['H'] = '🄷', R['I'] = '🄸', R['J'] = '🄹', R['K'] = '🄺', R['L'] = '🄻', R['M'] = '🄼', R['N'] = '🄽', R['O'] = '🄾', R['P'] = '🄿', R['Q'] = '🅀', R['R'] = '🅁', R['S'] = '🅂', R['T'] = '🅃', R['U'] = '🅄', R['V'] = '🅅', R['W'] = '🅆', R['X'] = '🅇', R['Y'] = '🅈', R['Z'] = '🅉';
const squaresCharMap = R;
var S = {};
S['0'] = '0', S['1'] = '1', S['2'] = '2', S['3'] = '3', S['4'] = '4', S['5'] = '5', S['6'] = '6', S['7'] = '7', S['8'] = '8', S['9'] = '9', S['a'] = 'Ꮧ', S['b'] = 'Ᏸ', S['c'] = 'ፈ', S['d'] = 'Ꮄ', S['e'] = 'Ꮛ', S['f'] = 'Ꭶ', S['g'] = 'Ꮆ', S['h'] = 'Ꮒ', S['i'] = 'Ꭵ', S['j'] = 'Ꮰ', S['k'] = 'Ꮶ', S['l'] = 'Ꮭ', S['m'] = 'Ꮇ', S['n'] = 'Ꮑ', S['o'] = 'Ꭷ', S['p'] = 'Ꭾ', S['q'] = 'Ꭴ', S['r'] = 'Ꮢ', S['s'] = 'Ꮥ', S['t'] = 'Ꮦ', S['u'] = 'Ꮼ', S['v'] = 'Ꮙ', S['w'] = 'Ꮗ', S['x'] = 'ጀ', S['y'] = 'Ꭹ', S['z'] = 'ፚ', S['A'] = 'Ꮧ', S['B'] = 'Ᏸ', S['C'] = 'ፈ', S['D'] = 'Ꮄ', S['E'] = 'Ꮛ', S['F'] = 'Ꭶ', S['G'] = 'Ꮆ', S['H'] = 'Ꮒ', S['I'] = 'Ꭵ', S['J'] = 'Ꮰ', S['K'] = 'Ꮶ', S['L'] = 'Ꮭ', S['M'] = 'Ꮇ', S['N'] = 'Ꮑ', S['O'] = 'Ꭷ', S['P'] = 'Ꭾ', S['Q'] = 'Ꭴ', S['R'] = 'Ꮢ', S['S'] = 'Ꮥ', S['T'] = 'Ꮦ', S['U'] = 'Ꮼ', S['V'] = 'Ꮙ', S['W'] = 'Ꮗ', S['X'] = 'ጀ', S['Y'] = 'Ꭹ', S['Z'] = 'ፚ';
const squiggle4CharMap = S;
var T = {};
T['0'] = '0', T['1'] = '1', T['2'] = '2', T['3'] = '3', T['4'] = '4', T['5'] = '5', T['6'] = '6', T['7'] = '7', T['8'] = '8', T['9'] = '9', T['a'] = 'ᗩ', T['b'] = 'ᗷ', T['c'] = 'ᑕ', T['d'] = 'ᗪ', T['e'] = 'E', T['f'] = 'ᖴ', T['g'] = 'G', T['h'] = 'ᕼ', T['i'] = 'I', T['j'] = 'ᒍ', T['k'] = 'K', T['l'] = 'ᒪ', T['m'] = 'ᗰ', T['n'] = 'ᑎ', T['o'] = 'O', T['p'] = 'ᑭ', T['q'] = 'ᑫ', T['r'] = 'ᖇ', T['s'] = 'ᔕ', T['t'] = 'T', T['u'] = 'ᑌ', T['v'] = 'ᐯ', T['w'] = 'ᗯ', T['x'] = '᙭', T['y'] = 'Y', T['z'] = 'ᘔ', T['A'] = 'ᗩ', T['B'] = 'ᗷ', T['C'] = 'ᑕ', T['D'] = 'ᗪ', T['E'] = 'E', T['F'] = 'ᖴ', T['G'] = 'G', T['H'] = 'ᕼ', T['I'] = 'I', T['J'] = 'ᒍ', T['K'] = 'K', T['L'] = 'ᒪ', T['M'] = 'ᗰ', T['N'] = 'ᑎ', T['O'] = 'O', T['P'] = 'ᑭ', T['Q'] = 'ᑫ', T['R'] = 'ᖇ', T['S'] = 'ᔕ', T['T'] = 'T', T['U'] = 'ᑌ', T['V'] = 'ᐯ', T['W'] = 'ᗯ', T['X'] = '᙭', T['Y'] = 'Y', T['Z'] = 'ᘔ';
const neonCharMap = T;
var U = {};
U['0'] = '0', U['1'] = '1', U['2'] = '2', U['3'] = '3', U['4'] = '4', U['5'] = '5', U['6'] = '6', U['7'] = '7', U['8'] = '8', U['9'] = '9', U['a'] = 'ǟ', U['b'] = 'ɮ', U['c'] = 'ƈ', U['d'] = 'ɖ', U['e'] = 'ɛ', U['f'] = 'ʄ', U['g'] = 'ɢ', U['h'] = 'ɦ', U['i'] = 'ɨ', U['j'] = 'ʝ', U['k'] = 'ӄ', U['l'] = 'ʟ', U['m'] = 'ʍ', U['n'] = 'ռ', U['o'] = 'օ', U['p'] = 'ք', U['q'] = 'զ', U['r'] = 'ʀ', U['s'] = 'ֆ', U['t'] = 'ȶ', U['u'] = 'ʊ', U['v'] = 'ʋ', U['w'] = 'ա', U['x'] = 'Ӽ', U['y'] = 'ʏ', U['z'] = 'ʐ', U['A'] = 'ǟ', U['B'] = 'ɮ', U['C'] = 'ƈ', U['D'] = 'ɖ', U['E'] = 'ɛ', U['F'] = 'ʄ', U['G'] = 'ɢ', U['H'] = 'ɦ', U['I'] = 'ɨ', U['J'] = 'ʝ', U['K'] = 'ӄ', U['L'] = 'ʟ', U['M'] = 'ʍ', U['N'] = 'ռ', U['O'] = 'օ', U['P'] = 'ք', U['Q'] = 'զ', U['R'] = 'ʀ', U['S'] = 'ֆ', U['T'] = 'ȶ', U['U'] = 'ʊ', U['V'] = 'ʋ', U['W'] = 'ա', U['X'] = 'Ӽ', U['Y'] = 'ʏ', U['Z'] = 'ʐ';
const squiggle3CharMap = U;
var V = {};
V['0'] = '𝟶', V['1'] = '𝟷', V['2'] = '𝟸', V['3'] = '𝟹', V['4'] = '𝟺', V['5'] = '𝟻', V['6'] = '𝟼', V['7'] = '𝟽', V['8'] = '𝟾', V['9'] = '𝟿', V['a'] = '𝚊', V['b'] = '𝚋', V['c'] = '𝚌', V['d'] = '𝚍', V['e'] = '𝚎', V['f'] = '𝚏', V['g'] = '𝚐', V['h'] = '𝚑', V['i'] = '𝚒', V['j'] = '𝚓', V['k'] = '𝚔', V['l'] = '𝚕', V['m'] = '𝚖', V['n'] = '𝚗', V['o'] = '𝚘', V['p'] = '𝚙', V['q'] = '𝚚', V['r'] = '𝚛', V['s'] = '𝚜', V['t'] = '𝚝', V['u'] = '𝚞', V['v'] = '𝚟', V['w'] = '𝚠', V['x'] = '𝚡', V['y'] = '𝚢', V['z'] = '𝚣', V['A'] = '𝙰', V['B'] = '𝙱', V['C'] = '𝙲', V['D'] = '𝙳', V['E'] = '𝙴', V['F'] = '𝙵', V['G'] = '𝙶', V['H'] = '𝙷', V['I'] = '𝙸', V['J'] = '𝙹', V['K'] = '𝙺', V['L'] = '𝙻', V['M'] = '𝙼', V['N'] = '𝙽', V['O'] = '𝙾', V['P'] = '𝙿', V['Q'] = '𝚀', V['R'] = '𝚁', V['S'] = '𝚂', V['T'] = '𝚃', V['U'] = '𝚄', V['V'] = '𝚅', V['W'] = '𝚆', V['X'] = '𝚇', V['Y'] = '𝚈', V['Z'] = '𝚉';
const monospaceCharMap = V;
var W = {};
W['0'] = '0', W['1'] = '1', W['2'] = '2', W['3'] = '3', W['4'] = '4', W['5'] = '5', W['6'] = '6', W['7'] = '7', W['8'] = '8', W['9'] = '9', W['a'] = '𝙖', W['b'] = '𝙗', W['c'] = '𝙘', W['d'] = '𝙙', W['e'] = '𝙚', W['f'] = '𝙛', W['g'] = '𝙜', W['h'] = '𝙝', W['i'] = '𝙞', W['j'] = '𝙟', W['k'] = '𝙠', W['l'] = '𝙡', W['m'] = '𝙢', W['n'] = '𝙣', W['o'] = '𝙤', W['p'] = '𝙥', W['q'] = '𝙦', W['r'] = '𝙧', W['s'] = '𝙨', W['t'] = '𝙩', W['u'] = '𝙪', W['v'] = '𝙫', W['w'] = '𝙬', W['x'] = '𝙭', W['y'] = '𝙮', W['z'] = '𝙯', W['A'] = '𝘼', W['B'] = '𝘽', W['C'] = '𝘾', W['D'] = '𝘿', W['E'] = '𝙀', W['F'] = '𝙁', W['G'] = '𝙂', W['H'] = '𝙃', W['I'] = '𝙄', W['J'] = '𝙅', W['K'] = '𝙆', W['L'] = '𝙇', W['M'] = '𝙈', W['N'] = '𝙉', W['O'] = '𝙊', W['P'] = '𝙋', W['Q'] = '𝙌', W['R'] = '𝙍', W['S'] = '𝙎', W['T'] = '𝙏', W['U'] = '𝙐', W['V'] = '𝙑', W['W'] = '𝙒', W['X'] = '𝙓', W['Y'] = '𝙔', W['Z'] = '𝙕';
const boldItalicCharMap = W;
var X = {};
X['0'] = '𝟎', X['1'] = '𝟏', X['2'] = '𝟐', X['3'] = '𝟑', X['4'] = '𝟒', X['5'] = '𝟓', X['6'] = '𝟔', X['7'] = '𝟕', X['8'] = '𝟖', X['9'] = '𝟗', X['a'] = '𝐚', X['b'] = '𝐛', X['c'] = '𝐜', X['d'] = '𝐝', X['e'] = '𝐞', X['f'] = '𝐟', X['g'] = '𝐠', X['h'] = '𝐡', X['i'] = '𝐢', X['j'] = '𝐣', X['k'] = '𝐤', X['l'] = '𝐥', X['m'] = '𝐦', X['n'] = '𝐧', X['o'] = '𝐨', X['p'] = '𝐩', X['q'] = '𝐪', X['r'] = '𝐫', X['s'] = '𝐬', X['t'] = '𝐭', X['u'] = '𝐮', X['v'] = '𝐯', X['w'] = '𝐰', X['x'] = '𝐱', X['y'] = '𝐲', X['z'] = '𝐳', X['A'] = '𝐀', X['B'] = '𝐁', X['C'] = '𝐂', X['D'] = '𝐃', X['E'] = '𝐄', X['F'] = '𝐅', X['G'] = '𝐆', X['H'] = '𝐇', X['I'] = '𝐈', X['J'] = '𝐉', X['K'] = '𝐊', X['L'] = '𝐋', X['M'] = '𝐌', X['N'] = '𝐍', X['O'] = '𝐎', X['P'] = '𝐏', X['Q'] = '𝐐', X['R'] = '𝐑', X['S'] = '𝐒', X['T'] = '𝐓', X['U'] = '𝐔', X['V'] = '𝐕', X['W'] = '𝐖', X['X'] = '𝐗', X['Y'] = '𝐘', X['Z'] = '𝐙';
const boldCharMap = X;
var Y = {};
Y['0'] = '0', Y['1'] = '1', Y['2'] = '2', Y['3'] = '3', Y['4'] = '4', Y['5'] = '5', Y['6'] = '6', Y['7'] = '7', Y['8'] = '8', Y['9'] = '9', Y['a'] = '𝘢', Y['b'] = '𝘣', Y['c'] = '𝘤', Y['d'] = '𝘥', Y['e'] = '𝘦', Y['f'] = '𝘧', Y['g'] = '𝘨', Y['h'] = '𝘩', Y['i'] = '𝘪', Y['j'] = '𝘫', Y['k'] = '𝘬', Y['l'] = '𝘭', Y['m'] = '𝘮', Y['n'] = '𝘯', Y['o'] = '𝘰', Y['p'] = '𝘱', Y['q'] = '𝘲', Y['r'] = '𝘳', Y['s'] = '𝘴', Y['t'] = '𝘵', Y['u'] = '𝘶', Y['v'] = '𝘷', Y['w'] = '𝘸', Y['x'] = '𝘹', Y['y'] = '𝘺', Y['z'] = '𝘻', Y['A'] = '𝘈', Y['B'] = '𝘉', Y['C'] = '𝘊', Y['D'] = '𝘋', Y['E'] = '𝘌', Y['F'] = '𝘍', Y['G'] = '𝘎', Y['H'] = '𝘏', Y['I'] = '𝘐', Y['J'] = '𝘑', Y['K'] = '𝘒', Y['L'] = '𝘓', Y['M'] = '𝘔', Y['N'] = '𝘕', Y['O'] = '𝘖', Y['P'] = '𝘗', Y['Q'] = '𝘘', Y['R'] = '𝘙', Y['S'] = '𝘚', Y['T'] = '𝘛', Y['U'] = '𝘜', Y['V'] = '𝘝', Y['W'] = '𝘞', Y['X'] = '𝘟', Y['Y'] = '𝘠', Y['Z'] = '𝘡';
const italicCharMap = Y;
var Z = {};
Z['0'] = '0', Z['1'] = '1', Z['2'] = '2', Z['3'] = '3', Z['4'] = '4', Z['5'] = '5', Z['6'] = '6', Z['7'] = '7', Z['8'] = '8', Z['9'] = '9', Z['a'] = 'α', Z['b'] = 'Ⴆ', Z['c'] = 'ƈ', Z['d'] = 'ԃ', Z['e'] = 'ҽ', Z['f'] = 'ϝ', Z['g'] = 'ɠ', Z['h'] = 'ԋ', Z['i'] = 'ι', Z['j'] = 'ʝ', Z['k'] = 'ƙ', Z['l'] = 'ʅ', Z['m'] = 'ɱ', Z['n'] = 'ɳ', Z['o'] = 'σ', Z['p'] = 'ρ', Z['q'] = 'ϙ', Z['r'] = 'ɾ', Z['s'] = 'ʂ', Z['t'] = 'ƚ', Z['u'] = 'υ', Z['v'] = 'ʋ', Z['w'] = 'ɯ', Z['x'] = 'x', Z['y'] = 'ყ', Z['z'] = 'ȥ', Z['A'] = 'A', Z['B'] = 'B', Z['C'] = 'C', Z['D'] = 'D', Z['E'] = 'E', Z['F'] = 'F', Z['G'] = 'G', Z['H'] = 'H', Z['I'] = 'I', Z['J'] = 'J', Z['K'] = 'K', Z['L'] = 'L', Z['M'] = 'M', Z['N'] = 'N', Z['O'] = 'O', Z['P'] = 'P', Z['Q'] = 'Q', Z['R'] = 'R', Z['S'] = 'S', Z['T'] = 'T', Z['U'] = 'U', Z['V'] = 'V', Z['W'] = 'W', Z['X'] = 'X', Z['Y'] = 'Y', Z['Z'] = 'Z';
const squiggle2CharMap = Z;
var a0 = {};
a0['0'] = '0', a0['1'] = '1', a0['2'] = '2', a0['3'] = '3', a0['4'] = '4', a0['5'] = '5', a0['6'] = '6', a0['7'] = '7', a0['8'] = '8', a0['9'] = '9', a0['a'] = '₳', a0['b'] = '฿', a0['c'] = '₵', a0['d'] = 'Đ', a0['e'] = 'Ɇ', a0['f'] = '₣', a0['g'] = '₲', a0['h'] = 'Ⱨ', a0['i'] = 'ł', a0['j'] = 'J', a0['k'] = '₭', a0['l'] = 'Ⱡ', a0['m'] = '₥', a0['n'] = '₦', a0['o'] = 'Ø', a0['p'] = '₱', a0['q'] = 'Q', a0['r'] = 'Ɽ', a0['s'] = '₴', a0['t'] = '₮', a0['u'] = 'Ʉ', a0['v'] = 'V', a0['w'] = '₩', a0['x'] = 'Ӿ', a0['y'] = 'Ɏ', a0['z'] = 'Ⱬ', a0['A'] = '₳', a0['B'] = '฿', a0['C'] = '₵', a0['D'] = 'Đ', a0['E'] = 'Ɇ', a0['F'] = '₣', a0['G'] = '₲', a0['H'] = 'Ⱨ', a0['I'] = 'ł', a0['J'] = 'J', a0['K'] = '₭', a0['L'] = 'Ⱡ', a0['M'] = '₥', a0['N'] = '₦', a0['O'] = 'Ø', a0['P'] = '₱', a0['Q'] = 'Q', a0['R'] = 'Ɽ', a0['S'] = '₴', a0['T'] = '₮', a0['U'] = 'Ʉ', a0['V'] = 'V', a0['W'] = '₩', a0['X'] = 'Ӿ', a0['Y'] = 'Ɏ', a0['Z'] = 'Ⱬ';
const currencyCharMap = a0;
var a1 = {};
a1['0'] = '0', a1['1'] = '1', a1['2'] = '2', a1['3'] = '3', a1['4'] = '4', a1['5'] = '5', a1['6'] = '6', a1['7'] = '7', a1['8'] = '8', a1['9'] = '9', a1['a'] = 'å', a1['b'] = 'ß', a1['c'] = '¢', a1['d'] = 'Ð', a1['e'] = 'ê', a1['f'] = '£', a1['g'] = 'g', a1['h'] = 'h', a1['i'] = 'ï', a1['j'] = 'j', a1['k'] = 'k', a1['l'] = 'l', a1['m'] = 'm', a1['n'] = 'ñ', a1['o'] = 'ð', a1['p'] = 'þ', a1['q'] = 'q', a1['r'] = 'r', a1['s'] = '§', a1['t'] = '†', a1['u'] = 'µ', a1['v'] = 'v', a1['w'] = 'w', a1['x'] = 'x', a1['y'] = '¥', a1['z'] = 'z', a1['A'] = 'Ä', a1['B'] = 'ß', a1['C'] = 'Ç', a1['D'] = 'Ð', a1['E'] = 'È', a1['F'] = '£', a1['G'] = 'G', a1['H'] = 'H', a1['I'] = 'Ì', a1['J'] = 'J', a1['K'] = 'K', a1['L'] = 'L', a1['M'] = 'M', a1['N'] = 'ñ', a1['O'] = 'Ö', a1['P'] = 'þ', a1['Q'] = 'Q', a1['R'] = 'R', a1['S'] = '§', a1['T'] = '†', a1['U'] = 'Ú', a1['V'] = 'V', a1['W'] = 'W', a1['X'] = '×', a1['Y'] = '¥', a1['Z'] = 'Z';
const symbolsCharMap = a1;
var a2 = {};
a2['0'] = '0', a2['1'] = '1', a2['2'] = '2', a2['3'] = '3', a2['4'] = '4', a2['5'] = '5', a2['6'] = '6', a2['7'] = '7', a2['8'] = '8', a2['9'] = '9', a2['a'] = 'α', a2['b'] = 'в', a2['c'] = '¢', a2['d'] = '∂', a2['e'] = 'є', a2['f'] = 'ƒ', a2['g'] = 'g', a2['h'] = 'н', a2['i'] = 'ι', a2['j'] = 'נ', a2['k'] = 'к', a2['l'] = 'ℓ', a2['m'] = 'м', a2['n'] = 'η', a2['o'] = 'σ', a2['p'] = 'ρ', a2['q'] = 'q', a2['r'] = 'я', a2['s'] = 'ѕ', a2['t'] = 'т', a2['u'] = 'υ', a2['v'] = 'ν', a2['w'] = 'ω', a2['x'] = 'χ', a2['y'] = 'у', a2['z'] = 'z', a2['A'] = 'α', a2['B'] = 'в', a2['C'] = '¢', a2['D'] = '∂', a2['E'] = 'є', a2['F'] = 'ƒ', a2['G'] = 'g', a2['H'] = 'н', a2['I'] = 'ι', a2['J'] = 'נ', a2['K'] = 'к', a2['L'] = 'ℓ', a2['M'] = 'м', a2['N'] = 'η', a2['O'] = 'σ', a2['P'] = 'ρ', a2['Q'] = 'q', a2['R'] = 'я', a2['S'] = 'ѕ', a2['T'] = 'т', a2['U'] = 'υ', a2['V'] = 'ν', a2['W'] = 'ω', a2['X'] = 'χ', a2['Y'] = 'у', a2['Z'] = 'z';
const greekCharMap = a2;
var a3 = {};
a3['0'] = '⊘', a3['1'] = '𝟙', a3['2'] = 'ϩ', a3['3'] = 'Ӡ', a3['4'] = '५', a3['5'] = 'Ƽ', a3['6'] = 'Ϭ', a3['7'] = '7', a3['8'] = '𝟠', a3['9'] = '९', a3['a'] = 'ą', a3['b'] = 'ҍ', a3['c'] = 'ç', a3['d'] = 'ժ', a3['e'] = 'ҽ', a3['f'] = 'ƒ', a3['g'] = 'ց', a3['h'] = 'հ', a3['i'] = 'ì', a3['j'] = 'ʝ', a3['k'] = 'ҟ', a3['l'] = 'Ӏ', a3['m'] = 'ʍ', a3['n'] = 'ղ', a3['o'] = 'օ', a3['p'] = 'ք', a3['q'] = 'զ', a3['r'] = 'ɾ', a3['s'] = 'ʂ', a3['t'] = 'է', a3['u'] = 'մ', a3['v'] = 'ѵ', a3['w'] = 'ա', a3['x'] = '×', a3['y'] = 'վ', a3['z'] = 'Հ', a3['A'] = 'Ⱥ', a3['B'] = 'β', a3['C'] = '↻', a3['D'] = 'Ꭰ', a3['E'] = 'Ɛ', a3['F'] = 'Ƒ', a3['G'] = 'Ɠ', a3['H'] = 'Ƕ', a3['I'] = 'į', a3['J'] = 'ل', a3['K'] = 'Ҡ', a3['L'] = 'Ꝉ', a3['M'] = 'Ɱ', a3['N'] = 'ហ', a3['O'] = 'ට', a3['P'] = 'φ', a3['Q'] = 'Ҩ', a3['R'] = 'འ', a3['S'] = 'Ϛ', a3['T'] = 'Ͳ', a3['U'] = 'Ա', a3['V'] = 'Ỽ', a3['W'] = 'చ', a3['X'] = 'ჯ', a3['Y'] = 'Ӌ', a3['Z'] = 'ɀ';
const bentTextCharMap = a3;
var a4 = {};
a4['0'] = '0', a4['1'] = '1', a4['2'] = '2', a4['3'] = '3', a4['4'] = '4', a4['5'] = '5', a4['6'] = '6', a4['7'] = '7', a4['8'] = '8', a4['9'] = '9', a4['a'] = 'Λ', a4['b'] = 'B', a4['c'] = 'ᄃ', a4['d'] = 'D', a4['e'] = 'Σ', a4['f'] = 'F', a4['g'] = 'G', a4['h'] = 'Ή', a4['i'] = 'I', a4['j'] = 'J', a4['k'] = 'K', a4['l'] = 'ᄂ', a4['m'] = 'M', a4['n'] = 'П', a4['o'] = 'Ө', a4['p'] = 'P', a4['q'] = 'Q', a4['r'] = 'Я', a4['s'] = 'Ƨ', a4['t'] = 'Ƭ', a4['u'] = 'Ц', a4['v'] = 'V', a4['w'] = 'Щ', a4['x'] = 'X', a4['y'] = 'Y', a4['z'] = 'Z', a4['A'] = 'Λ', a4['B'] = 'B', a4['C'] = 'ᄃ', a4['D'] = 'D', a4['E'] = 'Σ', a4['F'] = 'F', a4['G'] = 'G', a4['H'] = 'Ή', a4['I'] = 'I', a4['J'] = 'J', a4['K'] = 'K', a4['L'] = 'ᄂ', a4['M'] = 'M', a4['N'] = 'П', a4['O'] = 'Ө', a4['P'] = 'P', a4['Q'] = 'Q', a4['R'] = 'Я', a4['S'] = 'Ƨ', a4['T'] = 'Ƭ', a4['U'] = 'Ц', a4['V'] = 'V', a4['W'] = 'Щ', a4['X'] = 'X', a4['Y'] = 'Y', a4['Z'] = 'Z';
const upperAnglesCharMap = a4;
var a5 = {};
a5['0'] = '₀', a5['1'] = '₁', a5['2'] = '₂', a5['3'] = '₃', a5['4'] = '₄', a5['5'] = '₅', a5['6'] = '₆', a5['7'] = '₇', a5['8'] = '₈', a5['9'] = '₉', a5['a'] = 'ₐ', a5['b'] = 'b', a5['c'] = 'c', a5['d'] = 'd', a5['e'] = 'ₑ', a5['f'] = 'f', a5['g'] = 'g', a5['h'] = 'ₕ', a5['i'] = 'ᵢ', a5['j'] = 'ⱼ', a5['k'] = 'ₖ', a5['l'] = 'ₗ', a5['m'] = 'ₘ', a5['n'] = 'ₙ', a5['o'] = 'ₒ', a5['p'] = 'ₚ', a5['q'] = 'q', a5['r'] = 'ᵣ', a5['s'] = 'ₛ', a5['t'] = 'ₜ', a5['u'] = 'ᵤ', a5['v'] = 'ᵥ', a5['w'] = 'w', a5['x'] = 'ₓ', a5['y'] = 'y', a5['z'] = 'z', a5['A'] = 'ₐ', a5['B'] = 'B', a5['C'] = 'C', a5['D'] = 'D', a5['E'] = 'ₑ', a5['F'] = 'F', a5['G'] = 'G', a5['H'] = 'ₕ', a5['I'] = 'ᵢ', a5['J'] = 'ⱼ', a5['K'] = 'ₖ', a5['L'] = 'ₗ', a5['M'] = 'ₘ', a5['N'] = 'ₙ', a5['O'] = 'ₒ', a5['P'] = 'ₚ', a5['Q'] = 'Q', a5['R'] = 'ᵣ', a5['S'] = 'ₛ', a5['T'] = 'ₜ', a5['U'] = 'ᵤ', a5['V'] = 'ᵥ', a5['W'] = 'W', a5['X'] = 'ₓ', a5['Y'] = 'Y', a5['Z'] = 'Z', a5['+'] = '₊', a5['-'] = '₋', a5['='] = '₌', a5['('] = '₍', a5[')'] = '₎';
const subscriptCharMap = a5;
var a6 = {};
a6['0'] = '⁰', a6['1'] = '¹', a6['2'] = '²', a6['3'] = '³', a6['4'] = '⁴', a6['5'] = '⁵', a6['6'] = '⁶', a6['7'] = '⁷', a6['8'] = '⁸', a6['9'] = '⁹', a6['a'] = 'ᵃ', a6['b'] = 'ᵇ', a6['c'] = 'ᶜ', a6['d'] = 'ᵈ', a6['e'] = 'ᵉ', a6['f'] = 'ᶠ', a6['g'] = 'ᵍ', a6['h'] = 'ʰ', a6['i'] = 'ⁱ', a6['j'] = 'ʲ', a6['k'] = 'ᵏ', a6['l'] = 'ˡ', a6['m'] = 'ᵐ', a6['n'] = 'ⁿ', a6['o'] = 'ᵒ', a6['p'] = 'ᵖ', a6['q'] = 'q', a6['r'] = 'ʳ', a6['s'] = 'ˢ', a6['t'] = 'ᵗ', a6['u'] = 'ᵘ', a6['v'] = 'ᵛ', a6['w'] = 'ʷ', a6['x'] = 'ˣ', a6['y'] = 'ʸ', a6['z'] = 'ᶻ', a6['A'] = 'ᴬ', a6['B'] = 'ᴮ', a6['C'] = 'ᶜ', a6['D'] = 'ᴰ', a6['E'] = 'ᴱ', a6['F'] = 'ᶠ', a6['G'] = 'ᴳ', a6['H'] = 'ᴴ', a6['I'] = 'ᴵ', a6['J'] = 'ᴶ', a6['K'] = 'ᴷ', a6['L'] = 'ᴸ', a6['M'] = 'ᴹ', a6['N'] = 'ᴺ', a6['O'] = 'ᴼ', a6['P'] = 'ᴾ', a6['Q'] = 'Q', a6['R'] = 'ᴿ', a6['S'] = 'ˢ', a6['T'] = 'ᵀ', a6['U'] = 'ᵁ', a6['V'] = 'ⱽ', a6['W'] = 'ᵂ', a6['X'] = 'ˣ', a6['Y'] = 'ʸ', a6['Z'] = 'ᶻ', a6['+'] = '⁺', a6['-'] = '⁻', a6['='] = '⁼', a6['('] = '⁽', a6[')'] = '⁾';
const superscriptCharMap = a6;
var a7 = {};
a7['0'] = '0', a7['1'] = '1', a7['2'] = '2', a7['3'] = '3', a7['4'] = '4', a7['5'] = '5', a7['6'] = '6', a7['7'] = '7', a7['8'] = '8', a7['9'] = '9', a7['a'] = 'ค', a7['b'] = '๒', a7['c'] = 'ς', a7['d'] = '๔', a7['e'] = 'є', a7['f'] = 'Ŧ', a7['g'] = 'ﻮ', a7['h'] = 'ђ', a7['i'] = 'เ', a7['j'] = 'ן', a7['k'] = 'к', a7['l'] = 'ɭ', a7['m'] = '๓', a7['n'] = 'ภ', a7['o'] = '๏', a7['p'] = 'ק', a7['q'] = 'ợ', a7['r'] = 'г', a7['s'] = 'ร', a7['t'] = 'Շ', a7['u'] = 'ย', a7['v'] = 'ש', a7['w'] = 'ฬ', a7['x'] = 'א', a7['y'] = 'ץ', a7['z'] = 'չ', a7['A'] = 'ค', a7['B'] = '๒', a7['C'] = 'ς', a7['D'] = '๔', a7['E'] = 'є', a7['F'] = 'Ŧ', a7['G'] = 'ﻮ', a7['H'] = 'ђ', a7['I'] = 'เ', a7['J'] = 'ן', a7['K'] = 'к', a7['L'] = 'ɭ', a7['M'] = '๓', a7['N'] = 'ภ', a7['O'] = '๏', a7['P'] = 'ק', a7['Q'] = 'ợ', a7['R'] = 'г', a7['S'] = 'ร', a7['T'] = 'Շ', a7['U'] = 'ย', a7['V'] = 'ש', a7['W'] = 'ฬ', a7['X'] = 'א', a7['Y'] = 'ץ', a7['Z'] = 'չ';
const squiggleCharMap = a7;
var a8 = {};
a8['0'] = '𝟘', a8['1'] = '𝟙', a8['2'] = '𝟚', a8['3'] = '𝟛', a8['4'] = '𝟜', a8['5'] = '𝟝', a8['6'] = '𝟞', a8['7'] = '𝟟', a8['8'] = '𝟠', a8['9'] = '𝟡', a8['a'] = '𝕒', a8['b'] = '𝕓', a8['c'] = '𝕔', a8['d'] = '𝕕', a8['e'] = '𝕖', a8['f'] = '𝕗', a8['g'] = '𝕘', a8['h'] = '𝕙', a8['i'] = '𝕚', a8['j'] = '𝕛', a8['k'] = '𝕜', a8['l'] = '𝕝', a8['m'] = '𝕞', a8['n'] = '𝕟', a8['o'] = '𝕠', a8['p'] = '𝕡', a8['q'] = '𝕢', a8['r'] = '𝕣', a8['s'] = '𝕤', a8['t'] = '𝕥', a8['u'] = '𝕦', a8['v'] = '𝕧', a8['w'] = '𝕨', a8['x'] = '𝕩', a8['y'] = '𝕪', a8['z'] = '𝕫', a8['A'] = '𝔸', a8['B'] = '𝔹', a8['C'] = 'ℂ', a8['D'] = '𝔻', a8['E'] = '𝔼', a8['F'] = '𝔽', a8['G'] = '𝔾', a8['H'] = 'ℍ', a8['I'] = '𝕀', a8['J'] = '𝕁', a8['K'] = '𝕂', a8['L'] = '𝕃', a8['M'] = '𝕄', a8['N'] = 'ℕ', a8['O'] = '𝕆', a8['P'] = 'ℙ', a8['Q'] = 'ℚ', a8['R'] = 'ℝ', a8['S'] = '𝕊', a8['T'] = '𝕋', a8['U'] = '𝕌', a8['V'] = '𝕍', a8['W'] = '𝕎', a8['X'] = '𝕏', a8['Y'] = '𝕐', a8['Z'] = 'ℤ';
const doubleStruckCharMap = a8;
var a9 = {};
a9['0'] = '0', a9['1'] = '1', a9['2'] = '2', a9['3'] = '3', a9['4'] = '4', a9['5'] = '5', a9['6'] = '6', a9['7'] = '7', a9['8'] = '8', a9['9'] = '9', a9['a'] = '𝖆', a9['b'] = '𝖇', a9['c'] = '𝖈', a9['d'] = '𝖉', a9['e'] = '𝖊', a9['f'] = '𝖋', a9['g'] = '𝖌', a9['h'] = '𝖍', a9['i'] = '𝖎', a9['j'] = '𝖏', a9['k'] = '𝖐', a9['l'] = '𝖑', a9['m'] = '𝖒', a9['n'] = '𝖓', a9['o'] = '𝖔', a9['p'] = '𝖕', a9['q'] = '𝖖', a9['r'] = '𝖗', a9['s'] = '𝖘', a9['t'] = '𝖙', a9['u'] = '𝖚', a9['v'] = '𝖛', a9['w'] = '𝖜', a9['x'] = '𝖝', a9['y'] = '𝖞', a9['z'] = '𝖟', a9['A'] = '𝕬', a9['B'] = '𝕭', a9['C'] = '𝕮', a9['D'] = '𝕯', a9['E'] = '𝕰', a9['F'] = '𝕱', a9['G'] = '𝕲', a9['H'] = '𝕳', a9['I'] = '𝕴', a9['J'] = '𝕵', a9['K'] = '𝕶', a9['L'] = '𝕷', a9['M'] = '𝕸', a9['N'] = '𝕹', a9['O'] = '𝕺', a9['P'] = '𝕻', a9['Q'] = '𝕼', a9['R'] = '𝕽', a9['S'] = '𝕾', a9['T'] = '𝕿', a9['U'] = '𝖀', a9['V'] = '𝖁', a9['W'] = '𝖂', a9['X'] = '𝖃', a9['Y'] = '𝖄', a9['Z'] = '𝖅';
const medievalCharMap = a9;
var aa = {};
aa['q'] = '🆀', aa['w'] = '🆆', aa['e'] = '🅴', aa['r'] = '🆁', aa['t'] = '🆃', aa['y'] = '🆈', aa['u'] = '🆄', aa['i'] = '🅸', aa['o'] = '🅾', aa['p'] = '🅿', aa['a'] = '🅰', aa['s'] = '🆂', aa['d'] = '🅳', aa['f'] = '🅵', aa['g'] = '🅶', aa['h'] = '🅷', aa['j'] = '🅹', aa['k'] = '🅺', aa['l'] = '🅻', aa['z'] = '🆉', aa['x'] = '🆇', aa['c'] = '🅲', aa['v'] = '🆅', aa['b'] = '🅱', aa['n'] = '🅽', aa['m'] = '🅼';
const invertedSquaresCharMap = aa;
var ab = {};
ab['0'] = '0', ab['1'] = '1', ab['2'] = '2', ab['3'] = '3', ab['4'] = '4', ab['5'] = '5', ab['6'] = '6', ab['7'] = '7', ab['8'] = '8', ab['9'] = '9', ab['a'] = '𝓪', ab['b'] = '𝓫', ab['c'] = '𝓬', ab['d'] = '𝓭', ab['e'] = '𝓮', ab['f'] = '𝓯', ab['g'] = '𝓰', ab['h'] = '𝓱', ab['i'] = '𝓲', ab['j'] = '𝓳', ab['k'] = '𝓴', ab['l'] = '𝓵', ab['m'] = '𝓶', ab['n'] = '𝓷', ab['o'] = '𝓸', ab['p'] = '𝓹', ab['q'] = '𝓺', ab['r'] = '𝓻', ab['s'] = '𝓼', ab['t'] = '𝓽', ab['u'] = '𝓾', ab['v'] = '𝓿', ab['w'] = '𝔀', ab['x'] = '𝔁', ab['y'] = '𝔂', ab['z'] = '𝔃', ab['A'] = '𝓐', ab['B'] = '𝓑', ab['C'] = '𝓒', ab['D'] = '𝓓', ab['E'] = '𝓔', ab['F'] = '𝓕', ab['G'] = '𝓖', ab['H'] = '𝓗', ab['I'] = '𝓘', ab['J'] = '𝓙', ab['K'] = '𝓚', ab['L'] = '𝓛', ab['M'] = '𝓜', ab['N'] = '𝓝', ab['O'] = '𝓞', ab['P'] = '𝓟', ab['Q'] = '𝓠', ab['R'] = '𝓡', ab['S'] = '𝓢', ab['T'] = '𝓣', ab['U'] = '𝓤', ab['V'] = '𝓥', ab['W'] = '𝓦', ab['X'] = '𝓧', ab['Y'] = '𝓨', ab['Z'] = '𝓩';
const cursiveCharMap = ab;
var ac = {};
ac['a'] = '𝔞', ac['b'] = '𝔟', ac['c'] = '𝔠', ac['d'] = '𝔡', ac['e'] = '𝔢', ac['f'] = '𝔣', ac['g'] = '𝔤', ac['h'] = '𝔥', ac['i'] = '𝔦', ac['j'] = '𝔧', ac['k'] = '𝔨', ac['l'] = '𝔩', ac['m'] = '𝔪', ac['n'] = '𝔫', ac['o'] = '𝔬', ac['p'] = '𝔭', ac['q'] = '𝔮', ac['r'] = '𝔯', ac['s'] = '𝔰', ac['t'] = '𝔱', ac['u'] = '𝔲', ac['v'] = '𝔳', ac['w'] = '𝔴', ac['x'] = '𝔵', ac['y'] = '𝔶', ac['z'] = '𝔷', ac['A'] = '𝔄', ac['B'] = '𝔅', ac['C'] = 'ℭ', ac['D'] = '𝔇', ac['E'] = '𝔈', ac['F'] = '𝔉', ac['G'] = '𝔊', ac['H'] = 'ℌ', ac['I'] = 'ℑ', ac['J'] = '𝔍', ac['K'] = '𝔎', ac['L'] = '𝔏', ac['M'] = '𝔐', ac['N'] = '𝔑', ac['O'] = '𝔒', ac['P'] = '𝔓', ac['Q'] = '𝔔', ac['R'] = 'ℜ', ac['S'] = '𝔖', ac['T'] = '𝔗', ac['U'] = '𝔘', ac['V'] = '𝔙', ac['W'] = '𝔚', ac['X'] = '𝔛', ac['Y'] = '𝔜', ac['Z'] = 'ℨ';
const oldEnglishCharMap = ac;
var ad = {};
ad['`'] = '`', ad['1'] = '１', ad['2'] = '２', ad['3'] = '３', ad['4'] = '４', ad['5'] = '５', ad['6'] = '６', ad['7'] = '７', ad['8'] = '８', ad['9'] = '９', ad['0'] = '０', ad['-'] = '－', ad['='] = '＝', ad['~'] = '~', ad['!'] = '！', ad['@'] = '＠', ad['#'] = '＃', ad['$'] = '＄', ad['%'] = '％', ad['^'] = '^', ad['&'] = '＆', ad['*'] = '＊', ad['('] = '（', ad[')'] = '）', ad['_'] = '_', ad['+'] = '＋', ad['q'] = 'ｑ', ad['w'] = 'ｗ', ad['e'] = 'ｅ', ad['r'] = 'ｒ', ad['t'] = 'ｔ', ad['y'] = 'ｙ', ad['u'] = 'ｕ', ad['i'] = 'ｉ', ad['o'] = 'ｏ', ad['p'] = 'ｐ', ad['['] = '[', ad[']'] = ']', ad['\x5c'] = '\x5c', ad['Q'] = 'Ｑ', ad['W'] = 'Ｗ', ad['E'] = 'Ｅ', ad['R'] = 'Ｒ', ad['T'] = 'Ｔ', ad['Y'] = 'Ｙ', ad['U'] = 'Ｕ', ad['I'] = 'Ｉ', ad['O'] = 'Ｏ', ad['P'] = 'Ｐ', ad['{'] = '{', ad['}'] = '}', ad['|'] = '|', ad['a'] = 'ａ', ad['s'] = 'ｓ', ad['d'] = 'ｄ', ad['f'] = 'ｆ', ad['g'] = 'ｇ', ad['h'] = 'ｈ', ad['j'] = 'ｊ', ad['k'] = 'ｋ', ad['l'] = 'ｌ', ad[';'] = '；', ad['\x27'] = '＇', ad['A'] = 'Ａ', ad['S'] = 'Ｓ', ad['D'] = 'Ｄ', ad['F'] = 'Ｆ', ad['G'] = 'Ｇ', ad['H'] = 'Ｈ', ad['J'] = 'Ｊ', ad['K'] = 'Ｋ', ad['L'] = 'Ｌ', ad[':'] = '：', ad['\x22'] = '\x22', ad['z'] = 'ｚ', ad['x'] = 'ｘ', ad['c'] = 'ｃ', ad['v'] = 'ｖ', ad['b'] = 'ｂ', ad['n'] = 'ｎ', ad['m'] = 'ｍ', ad[','] = '，', ad['.'] = '．', ad['/'] = '／', ad['Z'] = 'Ｚ', ad['X'] = 'Ｘ', ad['C'] = 'Ｃ', ad['V'] = 'Ｖ', ad['B'] = 'Ｂ', ad['N'] = 'Ｎ', ad['M'] = 'Ｍ', ad['<'] = '<', ad['>'] = '>', ad['?'] = '？';
const wideTextCharMap = ad;

function Lunicode() {
    var _0x2983bb = _0x1f4662,
        _0xebb873 = {};
    _0xebb873['a'] = 'ɐ', _0xebb873['b'] = 'q', _0xebb873['c'] = 'ɔ', _0xebb873['d'] = 'p', _0xebb873['e'] = 'ǝ', _0xebb873['f'] = 'ɟ', _0xebb873['g'] = 'ɓ', _0xebb873['h'] = 'ɥ', _0xebb873['i'] = 'ı', _0xebb873['j'] = 'ɾ', _0xebb873['k'] = 'ʞ', _0xebb873['l'] = 'l', _0xebb873['m'] = 'ɯ', _0xebb873['n'] = 'u', _0xebb873['r'] = 'ɹ', _0xebb873['t'] = 'ʇ', _0xebb873['v'] = 'ʌ', _0xebb873['w'] = 'ʍ', _0xebb873['y'] = 'ʎ', _0xebb873['A'] = '∀', _0xebb873['B'] = 'ᙠ', _0xebb873['C'] = 'Ɔ', _0xebb873['D'] = 'ᗡ', _0xebb873['E'] = 'Ǝ', _0xebb873['F'] = 'Ⅎ', _0xebb873['G'] = '⅁', _0xebb873['J'] = 'ſ', _0xebb873['K'] = '⋊', _0xebb873['L'] = '˥', _0xebb873['M'] = 'W', _0xebb873['P'] = 'Ԁ', _0xebb873['Q'] = 'Ό', _0xebb873['R'] = 'ᴚ', _0xebb873['T'] = '⊥', _0xebb873['U'] = '∩', _0xebb873['V'] = 'Λ', _0xebb873['Y'] = '⅄', _0xebb873['1'] = '⇂', _0xebb873['2'] = 'ᄅ', _0xebb873['3'] = 'Ɛ', _0xebb873['4'] = 'ㄣ', _0xebb873['5'] = 'ގ', _0xebb873['6'] = '9', _0xebb873['7'] = 'ㄥ', _0xebb873['&'] = '⅋', _0xebb873['.'] = '˙', _0xebb873['\x22'] = '„', _0xebb873[';'] = '؛', _0xebb873['['] = ']', _0xebb873['('] = ')', _0xebb873['{'] = '}', _0xebb873['?'] = '¿', _0xebb873['!'] = '¡', _0xebb873['\x27'] = ',', _0xebb873['<'] = '>', _0xebb873['‾'] = '_', _0xebb873['¯'] = '_', _0xebb873['‿'] = '⁀', _0xebb873['⁅'] = '⁆', _0xebb873['∴'] = '∵', _0xebb873['\x0d'] = '\x0a', _0xebb873['ß'] = 'ᙠ', _0xebb873['̈'] = '̤', _0xebb873['ä'] = 'ɐ̤', _0xebb873['ö'] = 'o̤', _0xebb873['ü'] = 'n̤', _0xebb873['Ä'] = '∀̤', _0xebb873['Ö'] = 'O̤', _0xebb873['Ü'] = '∩̤', _0xebb873['´'] = '\x20̗', _0xebb873['é'] = 'ǝ̗', _0xebb873['á'] = 'ɐ̗', _0xebb873['ó'] = 'o̗', _0xebb873['ú'] = 'n̗', _0xebb873['É'] = 'Ǝ̗', _0xebb873['Á'] = '∀̗', _0xebb873['Ó'] = 'O̗', _0xebb873['Ú'] = '∩̗', _0xebb873['`'] = '\x20̖', _0xebb873['è'] = 'ǝ̖', _0xebb873['à'] = 'ɐ̖', _0xebb873['ò'] = 'o̖', _0xebb873['ù'] = 'n̖', _0xebb873['È'] = 'Ǝ̖', _0xebb873['À'] = '∀̖', _0xebb873['Ò'] = 'O̖', _0xebb873['Ù'] = '∩̖', _0xebb873['^'] = '\x20̮', _0xebb873['ê'] = 'ǝ̮', _0xebb873['â'] = 'ɐ̮', _0xebb873['ô'] = 'o̮', _0xebb873['û'] = 'n̮', _0xebb873['Ê'] = 'Ǝ̮', _0xebb873['Â'] = '∀̮', _0xebb873['Ô'] = 'O̮', _0xebb873['Û'] = '∩̮';
    var _0x998298 = {};
    _0x998298[_0x2983bb(0x50e)] = function() {
        var _0x98ac55 = _0x2983bb;
        for (i in this[_0x98ac55(0x51e)]) this[_0x98ac55(0x51e)][this[_0x98ac55(0x51e)][i]] = i;
    }, _0x998298['encode'] = function(_0x13ed7b) {
        var _0x5dcafd = _0x2983bb;
        for (var _0x4c154a, _0x54b76e = [], _0x4ecc73 = 0x0, _0x5a03e0 = _0x13ed7b[_0x5dcafd(0x4cd)]; _0x5a03e0 > _0x4ecc73; _0x4ecc73++) _0x4c154a = _0x13ed7b['charAt'](_0x4ecc73), _0x4ecc73 > 0x0 && ('̤' == _0x4c154a || '̗' == _0x4c154a || '̖' == _0x4c154a || '̮' == _0x4c154a) ? (_0x4c154a = this[_0x5dcafd(0x51e)][_0x13ed7b[_0x5dcafd(0x49f)](_0x4ecc73 - 0x1) + _0x4c154a], _0x54b76e[_0x5dcafd(0x473)]()) : (_0x4c154a = this[_0x5dcafd(0x51e)][_0x4c154a], 'undefined' == typeof _0x4c154a && (_0x4c154a = _0x13ed7b[_0x5dcafd(0x49f)](_0x4ecc73))), _0x54b76e[_0x5dcafd(0x15f)](_0x4c154a);
        return _0x54b76e[_0x5dcafd(0x1ce)]()[_0x5dcafd(0x36d)]('');
    }, _0x998298[_0x2983bb(0x2a5)] = function(_0x40de9a) {
        var _0x55fd7b = _0x2983bb;
        for (var _0x24b782, _0x7d525 = [], _0x539c67 = 0x0, _0x256cfa = _0x40de9a[_0x55fd7b(0x4cd)]; _0x256cfa > _0x539c67; _0x539c67++) _0x24b782 = _0x40de9a[_0x55fd7b(0x49f)](_0x539c67), _0x539c67 > 0x0 && ('̤' == _0x24b782 || '̗' == _0x24b782 || '̖' == _0x24b782 || '̮' == _0x24b782) ? (_0x24b782 = this[_0x55fd7b(0x51e)][_0x40de9a[_0x55fd7b(0x49f)](_0x539c67 - 0x1) + _0x24b782], _0x7d525[_0x55fd7b(0x473)]()) : (_0x24b782 = this['map'][_0x24b782], 'undefined' == typeof _0x24b782 && (_0x24b782 = _0x40de9a['charAt'](_0x539c67))), _0x7d525[_0x55fd7b(0x15f)](_0x24b782);
        return _0x7d525[_0x55fd7b(0x1ce)]()[_0x55fd7b(0x36d)]('');
    }, _0x998298[_0x2983bb(0x51e)] = _0xebb873;
    var _0x22dd99 = {};
    _0x22dd99['a'] = 'ɒ', _0x22dd99['b'] = 'd', _0x22dd99['c'] = 'ɔ', _0x22dd99['e'] = 'ɘ', _0x22dd99['f'] = 'Ꮈ', _0x22dd99['g'] = 'ǫ', _0x22dd99['h'] = 'ʜ', _0x22dd99['j'] = 'ꞁ', _0x22dd99['k'] = 'ʞ', _0x22dd99['l'] = '|', _0x22dd99['n'] = 'ᴎ', _0x22dd99['p'] = 'q', _0x22dd99['r'] = 'ɿ', _0x22dd99['s'] = 'ꙅ', _0x22dd99['t'] = 'ƚ', _0x22dd99['y'] = 'ʏ', _0x22dd99['z'] = 'ƹ', _0x22dd99['B'] = 'ᙠ', _0x22dd99['C'] = 'Ɔ', _0x22dd99['D'] = 'ᗡ', _0x22dd99['E'] = 'Ǝ', _0x22dd99['F'] = 'ꟻ', _0x22dd99['G'] = 'Ꭾ', _0x22dd99['J'] = 'Ⴑ', _0x22dd99['K'] = '⋊', _0x22dd99['L'] = '⅃', _0x22dd99['N'] = 'Ͷ', _0x22dd99['P'] = 'ꟼ', _0x22dd99['Q'] = 'Ọ', _0x22dd99['R'] = 'Я', _0x22dd99['S'] = 'Ꙅ', _0x22dd99['Z'] = 'Ƹ', _0x22dd99['1'] = '', _0x22dd99['2'] = '', _0x22dd99['3'] = '', _0x22dd99['4'] = '', _0x22dd99['5'] = '', _0x22dd99['6'] = '', _0x22dd99['7'] = '', _0x22dd99['&'] = '', _0x22dd99[';'] = '', _0x22dd99['['] = ']', _0x22dd99['('] = ')', _0x22dd99['{'] = '}', _0x22dd99['?'] = '⸮', _0x22dd99['<'] = '>', _0x22dd99['ä'] = 'ɒ̈', _0x22dd99['ß'] = 'ᙠ', _0x22dd99['´'] = '`', _0x22dd99['é'] = 'ɘ̀', _0x22dd99['á'] = 'ɒ̀', _0x22dd99['ó'] = 'ò', _0x22dd99['ú'] = 'ù', _0x22dd99['É'] = 'Ǝ̀', _0x22dd99['Á'] = 'À', _0x22dd99['Ó'] = 'Ò', _0x22dd99['Ú'] = 'Ù', _0x22dd99['`'] = '´', _0x22dd99['è'] = 'ɘ́', _0x22dd99['à'] = 'ɒ́', _0x22dd99['È'] = 'Ǝ́', _0x22dd99['ê'] = 'ɘ̂', _0x22dd99['â'] = 'ɒ̂', _0x22dd99['Ê'] = 'Ǝ̂', _0x22dd99['Ø'] = 'ᴓ', _0x22dd99['ø'] = 'ᴓ';
    var _0x528cf5 = {};
    _0x528cf5[_0x2983bb(0x50e)] = function() {
        var _0x27514b = _0x2983bb;
        for (i in this['map']) this[_0x27514b(0x51e)][this['map'][i]] = i;
    }, _0x528cf5[_0x2983bb(0x1a1)] = function(_0x482fdb) {
        var _0x50806d = _0x2983bb;
        for (var _0x474075, _0x18f333 = [], _0x2099d9 = [], _0x372422 = 0x0, _0x25680f = _0x482fdb[_0x50806d(0x4cd)]; _0x25680f > _0x372422; _0x372422++) _0x474075 = _0x482fdb['charAt'](_0x372422), _0x372422 > 0x0 && ('̈' == _0x474075 || '̀' == _0x474075 || '́' == _0x474075 || '̂' == _0x474075) ? (_0x474075 = this[_0x50806d(0x51e)][_0x482fdb[_0x50806d(0x49f)](_0x372422 - 0x1) + _0x474075], _0x18f333[_0x50806d(0x473)]()) : (_0x474075 = this[_0x50806d(0x51e)][_0x474075], _0x50806d(0x4cb) == typeof _0x474075 && (_0x474075 = _0x482fdb[_0x50806d(0x49f)](_0x372422))), '\x0a' == _0x474075 ? (_0x2099d9[_0x50806d(0x15f)](_0x18f333[_0x50806d(0x1ce)]()['join']('')), _0x18f333 = []) : _0x18f333[_0x50806d(0x15f)](_0x474075);
        return _0x2099d9[_0x50806d(0x15f)](_0x18f333[_0x50806d(0x1ce)]()['join']('')), _0x2099d9[_0x50806d(0x36d)]('\x0a');
    }, _0x528cf5['decode'] = function(_0x49d0d9) {
        var _0x27649b = _0x2983bb;
        for (var _0x282929, _0x327ee8 = [], _0x212d53 = [], _0xa081d3 = 0x0, _0x59003a = _0x49d0d9[_0x27649b(0x4cd)]; _0x59003a > _0xa081d3; _0xa081d3++) _0x282929 = _0x49d0d9[_0x27649b(0x49f)](_0xa081d3), _0xa081d3 > 0x0 && ('̈' == _0x282929 || '̀' == _0x282929 || '́' == _0x282929 || '̂' == _0x282929) ? (_0x282929 = this[_0x27649b(0x51e)][_0x49d0d9[_0x27649b(0x49f)](_0xa081d3 - 0x1) + _0x282929], _0x327ee8[_0x27649b(0x473)]()) : (_0x282929 = this[_0x27649b(0x51e)][_0x282929], _0x27649b(0x4cb) == typeof _0x282929 && (_0x282929 = _0x49d0d9['charAt'](_0xa081d3))), '\x0a' == _0x282929 ? (_0x212d53[_0x27649b(0x15f)](_0x327ee8[_0x27649b(0x1ce)]()['join']('')), _0x327ee8 = []) : _0x327ee8[_0x27649b(0x15f)](_0x282929);
        return _0x212d53[_0x27649b(0x15f)](_0x327ee8[_0x27649b(0x1ce)]()['join']('')), _0x212d53[_0x27649b(0x36d)]('\x0a');
    }, _0x528cf5[_0x2983bb(0x51e)] = _0x22dd99;
    var _0x29b12a = {};
    _0x29b12a[_0x2983bb(0x546)] = !0x0, _0x29b12a['middle'] = !0x0, _0x29b12a[_0x2983bb(0x610)] = !0x0, _0x29b12a[_0x2983bb(0x32c)] = 0xf, _0x29b12a[_0x2983bb(0x5ea)] = 0x64;
    var _0x35cd6f = {};
    _0x35cd6f[_0x2983bb(0x50e)] = function() {
        var _0x494cd7 = _0x2983bb;
        for (var _0x4c35d1 = 0x300; 0x315 >= _0x4c35d1; _0x4c35d1++) this['diacriticsTop']['push'](String[_0x494cd7(0x4d3)](_0x4c35d1));
        for (var _0x4c35d1 = 0x316; 0x333 >= _0x4c35d1; _0x4c35d1++) 0x31a != _0x4c35d1 && 0x31b != _0x4c35d1 && this[_0x494cd7(0x247)][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](_0x4c35d1));
        this['diacriticsTop']['push'](String[_0x494cd7(0x4d3)](0x31a)), this[_0x494cd7(0x1dd)]['push'](String[_0x494cd7(0x4d3)](0x31b));
        for (var _0x4c35d1 = 0x334; 0x338 >= _0x4c35d1; _0x4c35d1++) this[_0x494cd7(0x573)][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](_0x4c35d1));
        for (var _0x4c35d1 = 0x339; 0x33c >= _0x4c35d1; _0x4c35d1++) this[_0x494cd7(0x247)]['push'](String[_0x494cd7(0x4d3)](_0x4c35d1));
        for (var _0x4c35d1 = 0x33d; 0x344 >= _0x4c35d1; _0x4c35d1++) this['diacriticsTop'][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](_0x4c35d1));
        this[_0x494cd7(0x1dd)]['push'](String[_0x494cd7(0x4d3)](0x344)), this[_0x494cd7(0x247)][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x345)), this['diacriticsTop'][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x346)), this['diacriticsBottom'][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x347)), this[_0x494cd7(0x247)][_0x494cd7(0x15f)](String['fromCharCode'](0x348)), this['diacriticsBottom'][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x349)), this[_0x494cd7(0x1dd)]['push'](String['fromCharCode'](0x34a)), this[_0x494cd7(0x1dd)][_0x494cd7(0x15f)](String['fromCharCode'](0x34b)), this[_0x494cd7(0x1dd)][_0x494cd7(0x15f)](String['fromCharCode'](0x34c)), this['diacriticsBottom']['push'](String[_0x494cd7(0x4d3)](0x34d)), this['diacriticsBottom'][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x34e)), this['diacriticsTop'][_0x494cd7(0x15f)](String['fromCharCode'](0x350)), this['diacriticsTop']['push'](String[_0x494cd7(0x4d3)](0x351)), this['diacriticsTop'][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x352)), this[_0x494cd7(0x247)][_0x494cd7(0x15f)](String['fromCharCode'](0x353)), this[_0x494cd7(0x247)][_0x494cd7(0x15f)](String['fromCharCode'](0x354)), this['diacriticsBottom'][_0x494cd7(0x15f)](String['fromCharCode'](0x355)), this['diacriticsBottom']['push'](String[_0x494cd7(0x4d3)](0x356)), this['diacriticsTop'][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x357)), this[_0x494cd7(0x1dd)]['push'](String['fromCharCode'](0x358)), this[_0x494cd7(0x247)][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x359)), this[_0x494cd7(0x247)][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x35a)), this['diacriticsTop']['push'](String[_0x494cd7(0x4d3)](0x35b)), this[_0x494cd7(0x247)][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x35c)), this[_0x494cd7(0x1dd)][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x35d)), this['diacriticsTop'][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x35d)), this[_0x494cd7(0x247)]['push'](String['fromCharCode'](0x35f)), this[_0x494cd7(0x1dd)][_0x494cd7(0x15f)](String[_0x494cd7(0x4d3)](0x360)), this[_0x494cd7(0x1dd)]['push'](String[_0x494cd7(0x4d3)](0x361));
    }, _0x35cd6f[_0x2983bb(0x1a1)] = function(_0x1d5195) {
        var _0x294c52 = _0x2983bb,
            _0x5ad80a, _0x35c6d0 = '';
        for (i in _0x1d5195) {
            if (_0x5ad80a = _0x1d5195[i], this[_0x294c52(0x163)]['middle'] && (_0x5ad80a += this[_0x294c52(0x573)][Math['floor'](Math[_0x294c52(0x2ce)]() * this[_0x294c52(0x573)]['length'])]), this[_0x294c52(0x163)][_0x294c52(0x546)]) {
                for (var _0x5aa397 = this['diacriticsTop']['length'] - 0x1, _0x2f9a79 = 0x0, _0x583427 = this['options'][_0x294c52(0x32c)] - Math[_0x294c52(0x2ce)]() * (this[_0x294c52(0x163)]['randomization'] / 0x64 * this[_0x294c52(0x163)][_0x294c52(0x32c)]); _0x583427 > _0x2f9a79; _0x2f9a79++) _0x5ad80a += this[_0x294c52(0x1dd)][Math[_0x294c52(0x28b)](Math['random']() * _0x5aa397)];
            }
            if (this[_0x294c52(0x163)][_0x294c52(0x610)]) {
                for (var _0x4edaf2 = this[_0x294c52(0x247)][_0x294c52(0x4cd)] - 0x1, _0x2f9a79 = 0x0, _0x583427 = this['options'][_0x294c52(0x32c)] - Math[_0x294c52(0x2ce)]() * (this['options'][_0x294c52(0x5ea)] / 0x64 * this[_0x294c52(0x163)][_0x294c52(0x32c)]); _0x583427 > _0x2f9a79; _0x2f9a79++) _0x5ad80a += this[_0x294c52(0x247)][Math[_0x294c52(0x28b)](Math[_0x294c52(0x2ce)]() * _0x4edaf2)];
            }
            _0x35c6d0 += _0x5ad80a;
        }
        return _0x35c6d0;
    }, _0x35cd6f[_0x2983bb(0x2a5)] = function(_0x5b1273) {
        var _0x30eb49 = _0x2983bb,
            _0x3c8da7, _0x4f95a4 = '';
        for (i in _0x5b1273) _0x3c8da7 = _0x5b1273[i][_0x30eb49(0x5da)](0x0), (0x300 > _0x3c8da7 || _0x3c8da7 > 0x361) && (_0x4f95a4 += _0x5b1273[i]);
        return _0x4f95a4;
    }, _0x35cd6f[_0x2983bb(0x1dd)] = [], _0x35cd6f[_0x2983bb(0x573)] = [], _0x35cd6f[_0x2983bb(0x247)] = [], _0x35cd6f['options'] = _0x29b12a;
    var _0x162976 = {};
    _0x162976[_0x2983bb(0x50e)] = function() {
        var _0x364d9c = _0x2983bb;
        for (var _0x1ff95a = 0x31; 0x39 >= _0x1ff95a; _0x1ff95a++) this[_0x364d9c(0x51e)][String[_0x364d9c(0x4d3)](_0x1ff95a)] = String[_0x364d9c(0x4d3)](_0x1ff95a + 0x242f);
        this[_0x364d9c(0x51e)][0x0] = '⓪';
        for (var _0x1ff95a = 0x41; 0x5a >= _0x1ff95a; _0x1ff95a++) this[_0x364d9c(0x51e)][String[_0x364d9c(0x4d3)](_0x1ff95a)] = String[_0x364d9c(0x4d3)](_0x1ff95a + 0x2475);
        for (var _0x1ff95a = 0x61; 0x7a >= _0x1ff95a; _0x1ff95a++) this['map'][String[_0x364d9c(0x4d3)](_0x1ff95a)] = String[_0x364d9c(0x4d3)](_0x1ff95a + 0x246f);
        for (_0x1ff95a in this['map']) this[_0x364d9c(0x362)][this['map'][_0x1ff95a]] = _0x1ff95a;
    }, _0x162976[_0x2983bb(0x1a1)] = function(_0x315105) {
        var _0x5e8152 = _0x2983bb,
            _0x5d00ae, _0x39c14c = '',
            _0xc78b98 = !0x0;
        for (i in _0x315105) _0x5d00ae = this[_0x5e8152(0x51e)][_0x315105[i]], _0x5e8152(0x4cb) == typeof _0x5d00ae && (_0x315105[i][_0x5e8152(0x5da)](0x0) >= 0x21 ? (_0x5d00ae = _0x315105[i] + String['fromCharCode'](0x20dd), _0xc78b98 || (_0x5d00ae = String[_0x5e8152(0x4d3)](0x202f) + String['fromCharCode'](0xa0) + String[_0x5e8152(0x4d3)](0xa0) + String[_0x5e8152(0x4d3)](0x202f) + _0x5d00ae)) : _0x5d00ae = _0x315105[i]), _0x39c14c += _0x5d00ae, _0xc78b98 = '\x0a' == _0x5d00ae;
        return _0x39c14c;
    }, _0x162976['decode'] = function(_0xdd7d8) {
        var _0x5ade58 = _0x2983bb,
            _0x776724, _0x19f174 = '',
            _0x33cf02 = '';
        for (i in _0xdd7d8) _0x776724 = this[_0x5ade58(0x362)][_0xdd7d8[i]], _0x19f174 += _0x5ade58(0x4cb) == typeof _0x776724 ? _0xdd7d8[i] : _0x776724;
        for (i in _0x19f174) _0x776724 = _0x19f174[i][_0x5ade58(0x5da)](0x0), 0xa0 != _0x776724 && 0x202f != _0x776724 && 0x20dd != _0x776724 && (_0x33cf02 += _0x19f174[i]);
        return _0x33cf02;
    }, _0x162976['map'] = {}, _0x162976['mapInverse'] = {};
    var _0x3c8a2e = {};
    _0x3c8a2e[_0x2983bb(0x50e)] = function() {}, _0x3c8a2e['encode'] = function(_0x2a300c) {
        var _0xa3f4f = _0x2983bb,
            _0x5df450, _0xef4c26 = '',
            _0x4bc7d6 = !0x0;
        for (i in _0x2a300c) _0x2a300c[i][_0xa3f4f(0x5da)](0x0) >= 0x21 ? (_0x5df450 = _0x2a300c[i] + String[_0xa3f4f(0x4d3)](0x20de), _0x4bc7d6 || (_0x5df450 = String[_0xa3f4f(0x4d3)](0x202f) + String[_0xa3f4f(0x4d3)](0xa0) + String[_0xa3f4f(0x4d3)](0xa0) + String[_0xa3f4f(0x4d3)](0x202f) + _0x5df450)) : _0x5df450 = _0x2a300c[i], _0xef4c26 += _0x5df450, _0x4bc7d6 = '\x0a' == _0x5df450;
        return _0xef4c26;
    }, _0x3c8a2e[_0x2983bb(0x2a5)] = function(_0x484024) {
        var _0xfb2dc9 = _0x2983bb,
            _0x599107, _0x5c5940 = '';
        for (i in _0x484024) _0x599107 = _0x484024[i][_0xfb2dc9(0x5da)](0x0), 0xa0 != _0x599107 && 0x202f != _0x599107 && 0x20de != _0x599107 && (_0x5c5940 += _0x484024[i]);
        return _0x5c5940;
    };
    var _0x5e1bae = {};
    _0x5e1bae['init'] = function() {}, _0x5e1bae[_0x2983bb(0x1a1)] = function(_0x204d5a) {
        var _0x963c9 = _0x2983bb,
            _0x2698ad, _0x3e5c10 = '',
            _0x37e7f8 = !0x0;
        for (i in _0x204d5a) _0x204d5a[i][_0x963c9(0x5da)](0x0) >= 0x21 ? (_0x2698ad = _0x204d5a[i] + String[_0x963c9(0x4d3)](0x20e3), _0x37e7f8 || (_0x2698ad = String['fromCharCode'](0xa0) + String['fromCharCode'](0xa0) + String[_0x963c9(0x4d3)](0xa0) + _0x2698ad)) : _0x2698ad = _0x204d5a[i], _0x3e5c10 += _0x2698ad, _0x37e7f8 = '\x0a' == _0x2698ad;
        return _0x3e5c10;
    }, _0x5e1bae[_0x2983bb(0x2a5)] = function(_0x4297e1) {
        var _0x5137fd, _0x33ed4a = '';
        for (i in _0x4297e1) _0x5137fd = _0x4297e1[i]['charCodeAt'](0x0), 0xa0 != _0x5137fd && 0x202f != _0x5137fd && 0x20e3 != _0x5137fd && (_0x33ed4a += _0x4297e1[i]);
        return _0x33ed4a;
    };
    var _0x36045a = {};
    _0x36045a['a'] = 'ą', _0x36045a['b'] = 'ҍ', _0x36045a['c'] = 'ç', _0x36045a['d'] = 'ժ', _0x36045a['e'] = 'ҽ', _0x36045a['f'] = 'ƒ', _0x36045a['g'] = 'ց', _0x36045a['h'] = 'հ', _0x36045a['i'] = 'ì', _0x36045a['j'] = 'ʝ', _0x36045a['k'] = 'ҟ', _0x36045a['l'] = 'Ӏ', _0x36045a['m'] = 'ʍ', _0x36045a['n'] = 'ղ', _0x36045a['o'] = 'օ', _0x36045a['p'] = 'ք', _0x36045a['q'] = 'զ', _0x36045a['r'] = 'ɾ', _0x36045a['s'] = 'ʂ', _0x36045a['t'] = 'է', _0x36045a['u'] = 'մ', _0x36045a['v'] = 'ѵ', _0x36045a['w'] = 'ա', _0x36045a['x'] = '×', _0x36045a['y'] = 'վ', _0x36045a['z'] = 'Հ', _0x36045a['A'] = 'Ⱥ', _0x36045a['B'] = 'β', _0x36045a['C'] = '↻', _0x36045a['D'] = 'Ꭰ', _0x36045a['E'] = 'Ɛ', _0x36045a['F'] = 'Ƒ', _0x36045a['G'] = 'Ɠ', _0x36045a['H'] = 'Ƕ', _0x36045a['I'] = 'į', _0x36045a['J'] = 'ل', _0x36045a['K'] = 'Ҡ', _0x36045a['L'] = 'Ꝉ', _0x36045a['M'] = 'Ɱ', _0x36045a['N'] = 'ហ', _0x36045a['O'] = 'ට', _0x36045a['P'] = 'φ', _0x36045a['Q'] = 'Ҩ', _0x36045a['R'] = 'འ', _0x36045a['S'] = 'Ϛ', _0x36045a['T'] = 'Ͳ', _0x36045a['U'] = 'Ա', _0x36045a['V'] = 'Ỽ', _0x36045a['W'] = 'చ', _0x36045a['X'] = 'ჯ', _0x36045a['Y'] = 'Ӌ', _0x36045a['Z'] = 'ɀ', _0x36045a['0'] = '⊘', _0x36045a['1'] = _0x2983bb(0x3d3), _0x36045a['2'] = 'ϩ', _0x36045a['3'] = 'Ӡ', _0x36045a['4'] = '५', _0x36045a['5'] = 'Ƽ', _0x36045a['6'] = 'Ϭ', _0x36045a['7'] = '7', _0x36045a['8'] = _0x2983bb(0x3d3), _0x36045a['9'] = '९', _0x36045a['&'] = '⅋', _0x36045a['('] = '{', _0x36045a[')'] = '}', _0x36045a['{'] = '(', _0x36045a['}'] = ')', _0x36045a['ä'] = 'ą̈', _0x36045a['ö'] = 'օ̈', _0x36045a['ü'] = 'մ̈', _0x36045a['Ä'] = 'Ⱥ̈', _0x36045a['Ö'] = 'ට̈', _0x36045a['Ü'] = 'Ա̈', _0x36045a['é'] = 'ҽ́', _0x36045a['á'] = 'ą́', _0x36045a['ó'] = 'օ́', _0x36045a['ú'] = 'մ́', _0x36045a['É'] = 'Ɛ́', _0x36045a['Á'] = 'Ⱥ́', _0x36045a['Ó'] = 'ට́', _0x36045a['Ú'] = 'Ա́', _0x36045a['è'] = 'ҽ̀', _0x36045a['à'] = 'ą̀', _0x36045a['ò'] = 'օ̀', _0x36045a['ù'] = 'մ̀', _0x36045a['È'] = 'Ɛ̀', _0x36045a['À'] = 'Ⱥ̀', _0x36045a['Ò'] = 'ට̀', _0x36045a['Ù'] = 'Ա̀', _0x36045a['ê'] = 'ҽ̂', _0x36045a['â'] = 'ą̂', _0x36045a['ô'] = 'օ̂', _0x36045a['û'] = 'մ̂', _0x36045a['Ê'] = 'Ɛ̂', _0x36045a['Â'] = 'Ⱥ̂', _0x36045a['Ô'] = 'ට̂', _0x36045a['Û'] = 'Ա̂';
    var _0x5c83a3 = {};
    _0x5c83a3['init'] = function() {
        var _0x3fd32 = _0x2983bb;
        for (i in this[_0x3fd32(0x51e)]) this[_0x3fd32(0x51e)][this[_0x3fd32(0x51e)][i]] = i;
    }, _0x5c83a3[_0x2983bb(0x1a1)] = function(_0x20a727) {
        var _0x70a784 = _0x2983bb;
        for (var _0x272feb, _0x1663df = '', _0x4f0be4 = 0x0, _0x15735e = _0x20a727['length']; _0x15735e > _0x4f0be4; _0x4f0be4++) _0x272feb = this[_0x70a784(0x51e)][_0x20a727[_0x70a784(0x49f)](_0x4f0be4)], _0x70a784(0x4cb) == typeof _0x272feb && (_0x272feb = _0x20a727['charAt'](_0x4f0be4)), _0x1663df += _0x272feb;
        return _0x1663df;
    }, _0x5c83a3[_0x2983bb(0x2a5)] = function(_0x2a1a23) {
        var _0x8d77b7 = _0x2983bb;
        for (var _0x2b9180, _0x155b52 = '', _0x49caff = 0x0, _0xf3ed5e = _0x2a1a23[_0x8d77b7(0x4cd)]; _0xf3ed5e > _0x49caff; _0x49caff++) _0x2b9180 = this[_0x8d77b7(0x51e)][_0x2a1a23['charAt'](_0x49caff)], _0x8d77b7(0x4cb) == typeof _0x2b9180 && (_0x2b9180 = _0x2a1a23['charAt'](_0x49caff)), _0x155b52 += _0x2b9180;
        return _0x155b52;
    }, _0x5c83a3[_0x2983bb(0x51e)] = _0x36045a;
    var _0xe0e9a3 = {};
    _0xe0e9a3['A'] = 'ᴀ', _0xe0e9a3['B'] = 'ʙ', _0xe0e9a3['C'] = 'ᴄ', _0xe0e9a3['D'] = 'ᴅ', _0xe0e9a3['E'] = 'ᴇ', _0xe0e9a3['F'] = 'ꜰ', _0xe0e9a3['G'] = 'ɢ', _0xe0e9a3['H'] = 'ʜ', _0xe0e9a3['I'] = 'ɪ', _0xe0e9a3['J'] = 'ᴊ', _0xe0e9a3['K'] = 'ᴋ', _0xe0e9a3['L'] = 'ʟ', _0xe0e9a3['M'] = 'ᴍ', _0xe0e9a3['N'] = 'ɴ', _0xe0e9a3['O'] = 'ᴏ', _0xe0e9a3['P'] = 'ᴘ', _0xe0e9a3['Q'] = 'Q', _0xe0e9a3['R'] = 'ʀ', _0xe0e9a3['S'] = 'ꜱ', _0xe0e9a3['T'] = 'ᴛ', _0xe0e9a3['U'] = 'ᴜ', _0xe0e9a3['V'] = 'ᴠ', _0xe0e9a3['W'] = 'ᴡ', _0xe0e9a3['X'] = 'x', _0xe0e9a3['Y'] = 'ʏ', _0xe0e9a3['Z'] = 'ᴢ';
    var _0x3c1363 = {};
    _0x3c1363[_0x2983bb(0x50e)] = function() {
        var _0x25c686 = _0x2983bb;
        for (i in this[_0x25c686(0x51e)]) this[_0x25c686(0x51e)][this['map'][i]] = i;
    }, _0x3c1363[_0x2983bb(0x1a1)] = function(_0x44bfe) {
        var _0xaf2edb = _0x2983bb,
            _0x4b577f, _0x1f5a48 = '';
        _0x44bfe = _0x44bfe[_0xaf2edb(0x5ef)]();
        for (var _0x56774d = 0x0, _0x2890e5 = _0x44bfe['length']; _0x2890e5 > _0x56774d; _0x56774d++) _0x4b577f = this[_0xaf2edb(0x51e)][_0x44bfe[_0xaf2edb(0x49f)](_0x56774d)], _0xaf2edb(0x4cb) == typeof _0x4b577f && (_0x4b577f = _0x44bfe['charAt'](_0x56774d)), _0x1f5a48 += _0x4b577f;
        return _0x1f5a48;
    }, _0x3c1363['decode'] = function(_0x41ade1) {
        var _0x592959 = _0x2983bb;
        for (var _0x4fec18, _0x1d7aa3 = '', _0x2df588 = 0x0, _0x4e9218 = _0x41ade1[_0x592959(0x4cd)]; _0x4e9218 > _0x2df588; _0x2df588++) _0x4fec18 = this['map'][_0x41ade1[_0x592959(0x49f)](_0x2df588)], _0x592959(0x4cb) == typeof _0x4fec18 && (_0x4fec18 = _0x41ade1[_0x592959(0x49f)](_0x2df588)), _0x1d7aa3 += _0x4fec18;
        return _0x1d7aa3;
    }, _0x3c1363[_0x2983bb(0x51e)] = _0xe0e9a3;
    var _0x256b2f = {};
    _0x256b2f[_0x2983bb(0x5e2)] = _0x998298, _0x256b2f['mirror'] = _0x528cf5, _0x256b2f[_0x2983bb(0x27e)] = _0x35cd6f, _0x256b2f['bubbles'] = _0x162976, _0x256b2f[_0x2983bb(0x33c)] = _0x3c8a2e, _0x256b2f['roundsquares'] = _0x5e1bae, _0x256b2f['bent'] = _0x5c83a3, _0x256b2f[_0x2983bb(0x34e)] = _0x3c1363, this['tools'] = _0x256b2f;
    for (i in this['tools']) this[_0x2983bb(0x21f)][i][_0x2983bb(0x50e)]();
    this[_0x2983bb(0x2cf)] = function(_0x2acd85) {
        var _0x453725 = _0x2983bb;
        for (var _0x8bd201, _0x3556b4 = '', _0x313a5c = !0x0, _0x55d0c1 = 0x0, _0x1010ac = 0x0, _0x28972b = 0x0, _0x371bfd = _0x2acd85[_0x453725(0x4cd)]; _0x371bfd > _0x28972b; _0x28972b++) _0x8bd201 = _0x2acd85[_0x453725(0x5da)](_0x28972b), 0xa == _0x8bd201 || 0xd == _0x8bd201 ? (_0x3556b4 += _0x453725(0x28e), _0x313a5c = !0x0) : 0x20 == _0x8bd201 ? _0x313a5c ? (_0x3556b4 += '\x20', _0x313a5c = !0x1) : (_0x3556b4 += '\x20', _0x313a5c = !0x0) : (_0x8bd201 >= 0xd800 && 0xdbff >= _0x8bd201 ? (_0x55d0c1 = _0x8bd201, _0x1010ac = 0x0) : _0x55d0c1 > 0x0 ? (_0x8bd201 >= 0xdc00 && 0xdfff >= _0x8bd201 && (_0x1010ac = 0x400 * (_0x55d0c1 - 0xd800) + (_0x8bd201 - 0xdc00) + 0x10000), _0x55d0c1 = 0x0) : _0x1010ac = _0x8bd201, 0x0 != _0x1010ac && (_0x3556b4 += _0x453725(0x218) + _0x1010ac['toString'](0x10) + ';', _0x313a5c = !0x0));
        return _0x3556b4;
    };
}

function cuteText(_0x33b0f7) {
    var _0x1014b5 = _0x1f4662;
    if (_0x33b0f7[_0x1014b5(0x534)]() === '') return '';
    qi = -0x1;
    var _0x5edca2 = boundingString(Math[_0x1014b5(0x28b)](Math[_0x1014b5(0x2ce)]() * 0x2) + 0x1);
    return _0x5edca2 + _0x1014b5(0x3c0) + _0x33b0f7[_0x1014b5(0x540)](/([!?.]+)/gi)[_0x1014b5(0x51e)](cuteSentence)[_0x1014b5(0x36d)]('') + _0x1014b5(0x3c0) + esrever['reverse'](_0x5edca2);
}

function cuteSentence(_0x3646b8) {
    var _0x4b337f = _0x1f4662;
    return _0x3646b8[_0x4b337f(0x540)](/([\s,]+)/gi)[_0x4b337f(0x51e)](cuteWord)['join']('');
}

function cuteWord(_0x4d6d54) {
    var _0x4e789d = _0x1f4662;
    if (_0x4d6d54 === '' || /[[!?.\s,]+]/gi [_0x4e789d(0x2ba)](_0x4d6d54)) return _0x4d6d54;
    return _0x4d6d54 = roundReplace(_0x4d6d54), _0x4d6d54 = punctReplace(_0x4d6d54), _0x4d6d54 = emojiReplace(_0x4d6d54), scriptify(_0x4d6d54);
}
var qi = -0x1,
    qa = ['❝', '❞'];

function quotes() {
    qi++;
    if (qi === 0x2) qi = 0x0;
    return qa[qi];
}

function punctReplace(_0x4ffc49) {
    var _0x4e621a = _0x1f4662;
    return _0x4ffc49[_0x4e621a(0x540)]('')['map'](function(_0x361b84) {
        if (_0x361b84 === '!') return randomElement(['❣', '❢']);
        else {
            if (_0x361b84 === '?') return randomElement(['¿', '?']);
            else {
                if (_0x361b84 === '\x22') return quotes();
                else return _0x361b84;
            }
        }
    })[_0x4e621a(0x36d)]('');
}

function emojiReplace(_0x211d9b) {
    var _0x335aeb = _0x1f4662;
    return _0x211d9b[_0x335aeb(0x5c6)](':)', randomElement(emoji[':)']))['replace']('(:', randomElement(emoji[':)']))['replace']('^^', randomElement(emoji['^^']))[_0x335aeb(0x5c6)](':P', randomElement(emoji[':p']))[_0x335aeb(0x5c6)](':p', randomElement(emoji[':p']))[_0x335aeb(0x5c6)](':D', randomElement(emoji[':D']))[_0x335aeb(0x5c6)]('<3', randomElement(emoji['<3']))[_0x335aeb(0x5c6)]('(y)', randomElement(emoji[_0x335aeb(0x24a)]))[_0x335aeb(0x5c6)]('(Y)', randomElement(emoji[_0x335aeb(0x24a)]));
}

function roundReplace(_0x55d36d) {
    var _0x6d4a36 = _0x1f4662;
    return _0x55d36d[_0x6d4a36(0x540)]('')[_0x6d4a36(0x51e)](function(_0x38b0d0) {
        var _0x344571 = _0x6d4a36;
        return _0x38b0d0[_0x344571(0x311)]() === 'o' || _0x38b0d0 === '0' ? randomElement(round) : _0x38b0d0;
    })[_0x6d4a36(0x36d)]('');
}
var ar = {};
ar[':)'] = [_0x1f4662(0x5e3), '(•◡•)', _0x1f4662(0x5fd), _0x1f4662(0x1e8), _0x1f4662(0x431), _0x1f4662(0x617), '◕‿◕', '😍', 'ツ', '(✿ヘᴥヘ)', _0x1f4662(0x437), _0x1f4662(0x4b1), _0x1f4662(0x5e0), _0x1f4662(0x5a3), _0x1f4662(0x3d5), _0x1f4662(0x1f2), '◔◡◔'], ar['^^'] = [_0x1f4662(0x152), _0x1f4662(0x224), _0x1f4662(0x550), 'ᵔᴥᵔ', _0x1f4662(0x558), _0x1f4662(0x371), '^ㅂ^', _0x1f4662(0x593), _0x1f4662(0x58e), _0x1f4662(0x1fb), ''], ar[':p'] = [':Þ', ''], ar[':D'] = [_0x1f4662(0x24d), _0x1f4662(0x40f), _0x1f4662(0x4a3)], ar['<3'] = ['♡', '❤', '♥', '❥', '💘', '💙', '💗', '💖', '💕', '💓', '💞', '💝', '💟'], ar[_0x1f4662(0x24a)] = ['👍', '👌'];
var emoji = ar,
    round = ['❁', '🌺', '❀', '💮', '🏵', '🌸', '☯', '😍', '♡', '🍩', '🍬', '💙', '🌞', '💍', '🍪', '❤', '💗', '🍑', '💞'],
    food = ['🍬', '🍭', '🍒', '🍎', '🍉', '🍇', '🍓', '🍌', '🍑', '🍰', '🎂', '🍩', '🍪', '🍧', '🍦', '🍫', '🍡'],
    flowers = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    twinkles = ['⚛', '🌌', '🌠', '*', ':', '｡', '･ﾟ', '✧', '✮', '★', '✩', '⋆', '.', '°', '`', '✴', '｡', '✴', '⋆', '✳', '✶', '✷', '❈'],
    animals = ['🐯', '🐎', '🐖', '🐷', '🐏', '🐑', '🐐', '🐫', '🐘', '🐭', '🐁', '🐀', '🐹', '🐰', '🐇', '🐿', '🐻', '🐨', '🐼', '🐾', '🐔', '🐓', '🐣', '🐤', '🐥', '🐦', '🐧', '🕊', '🐸', '🐢', '🐳', '🐋', '🐬', '🐟', '🐠', '🐡', '🐙', '🐚', '🐌', '🐞'],
    plants = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    misc = ['🌌', '🌠', '🎉', '🎊', '🎈', '💌', '🎎', '🎁', '🎀', '🕯', '🔮', '🛀', '🎖', '🏆', '🏅', '👑', '💍', '👶', '👼', '👸', '👯', '👒', '👻'],
    music = ['♫', '♬', '♪', '♩', '°', '｡', '✧', '🎻', '🎺', '🎸', '🎷', '📯'],
    flourish = ['•?((¯°·._.•\x20', _0x1f4662(0x3a4), _0x1f4662(0x326), _0x1f4662(0x2a2), '•´¯`•.\x20', '×º°”˜`”°º×\x20', _0x1f4662(0x1fc), _0x1f4662(0x256), _0x1f4662(0x3f6), _0x1f4662(0x47f), _0x1f4662(0x26b), _0x1f4662(0x412), _0x1f4662(0x158), _0x1f4662(0x5c9), _0x1f4662(0x1b1), _0x1f4662(0x1cb), '(¯´•._.•\x20', '••¤(`×', _0x1f4662(0x1cc), '`•.,¸¸,.•´¯\x20', '¸,ø¤º°`°º¤ø,¸\x20', _0x1f4662(0x14e), _0x1f4662(0x49e), _0x1f4662(0x227), _0x1f4662(0x5d5), _0x1f4662(0x4b6), _0x1f4662(0x5ff), _0x1f4662(0x1e3), _0x1f4662(0x2c6), '-漫~*\x27¨¯¨\x27*·舞~\x20', _0x1f4662(0x4a8), _0x1f4662(0x426), _0x1f4662(0x19c), _0x1f4662(0x3ae)];

function boundingString(_0x458fce) {
    return randomElement([foodString, twinkleString, animalString, flourishString])(_0x458fce);
}

function foodString(_0x14d6ac) {
    var _0x47a4fe = _0x1f4662;
    return new Array(_0x14d6ac + 0x1)[_0x47a4fe(0x36d)]('0')[_0x47a4fe(0x540)]('')[_0x47a4fe(0x51e)](function(_0x3bc370) {
        return randomElement(food);
    })[_0x47a4fe(0x36d)](_0x47a4fe(0x44b));
}

function twinkleString(_0x1b097d) {
    var _0x4dc78f = _0x1f4662;
    return new Array(_0x1b097d + 0x1)['join']('0')[_0x4dc78f(0x540)]('')[_0x4dc78f(0x51e)](function() {
        return randomElement(twinkles);
    })[_0x4dc78f(0x36d)]('');
}

function animalString(_0x35e1ba) {
    var _0x5c363b = _0x1f4662;
    return new Array(_0x35e1ba + 0x1)[_0x5c363b(0x36d)]('0')[_0x5c363b(0x540)]('')[_0x5c363b(0x51e)](function(_0x2e240c) {
        return randomElement(animals);
    })[_0x5c363b(0x36d)](_0x5c363b(0x44b));
}

function flourishString(_0x2707e5) {
    return randomElement(flourish);
}

function scriptify(_0x5b9cf8) {
    var _0x4abbe5 = _0x1f4662,
        _0x52ecb0 = {};
    _0x52ecb0['0'] = '𝟢', _0x52ecb0['1'] = '𝟣', _0x52ecb0['2'] = '𝟤', _0x52ecb0['3'] = '𝟥', _0x52ecb0['4'] = '𝟦', _0x52ecb0['5'] = '𝟧', _0x52ecb0['6'] = '𝟨', _0x52ecb0['7'] = '𝟩', _0x52ecb0['8'] = '𝟪', _0x52ecb0['9'] = '𝟫', _0x52ecb0['a'] = '𝒶', _0x52ecb0['b'] = '𝒷', _0x52ecb0['c'] = '𝒸', _0x52ecb0['d'] = '𝒹', _0x52ecb0['e'] = '𝑒', _0x52ecb0['f'] = '𝒻', _0x52ecb0['g'] = '𝑔', _0x52ecb0['h'] = '𝒽', _0x52ecb0['i'] = '𝒾', _0x52ecb0['j'] = '𝒿', _0x52ecb0['k'] = '𝓀', _0x52ecb0['l'] = '𝓁', _0x52ecb0['m'] = '𝓂', _0x52ecb0['n'] = '𝓃', _0x52ecb0['o'] = '𝑜', _0x52ecb0['p'] = '𝓅', _0x52ecb0['q'] = '𝓆', _0x52ecb0['r'] = '𝓇', _0x52ecb0['s'] = '𝓈', _0x52ecb0['t'] = '𝓉', _0x52ecb0['u'] = '𝓊', _0x52ecb0['v'] = '𝓋', _0x52ecb0['w'] = '𝓌', _0x52ecb0['x'] = '𝓍', _0x52ecb0['y'] = '𝓎', _0x52ecb0['z'] = '𝓏', _0x52ecb0['A'] = '𝒜', _0x52ecb0['B'] = '𝐵', _0x52ecb0['C'] = '𝒞', _0x52ecb0['D'] = '𝒟', _0x52ecb0['E'] = '𝐸', _0x52ecb0['F'] = '𝐹', _0x52ecb0['G'] = '𝒢', _0x52ecb0['H'] = '𝐻', _0x52ecb0['I'] = '𝐼', _0x52ecb0['J'] = '𝒥', _0x52ecb0['K'] = '𝒦', _0x52ecb0['L'] = '𝐿', _0x52ecb0['M'] = '𝑀', _0x52ecb0['N'] = '𝒩', _0x52ecb0['O'] = '𝒪', _0x52ecb0['P'] = '𝒫', _0x52ecb0['Q'] = '𝒬', _0x52ecb0['R'] = '𝑅', _0x52ecb0['S'] = '𝒮', _0x52ecb0['T'] = '𝒯', _0x52ecb0['U'] = '𝒰', _0x52ecb0['V'] = '𝒱', _0x52ecb0['W'] = '𝒲', _0x52ecb0['X'] = '𝒳', _0x52ecb0['Y'] = '𝒴', _0x52ecb0['Z'] = '𝒵';
    var _0xc75b46 = _0x52ecb0,
        _0x3431ee = _0x5b9cf8['split']('');
    for (var _0xbece6 = 0x0; _0xbece6 < _0x3431ee[_0x4abbe5(0x4cd)]; _0xbece6++) {
        _0xc75b46[_0x3431ee[_0xbece6][_0x4abbe5(0x311)]()] && (_0x3431ee[_0xbece6] = _0xc75b46[_0x3431ee[_0xbece6]]);
    }
    return _0x5b9cf8 = _0x3431ee[_0x4abbe5(0x36d)](''), _0x5b9cf8;
}

function shuffleArray(_0x54d36b) {
    var _0xf68000 = _0x1f4662,
        _0x30cbae = _0x54d36b[_0xf68000(0x4cd)],
        _0x587100, _0x45f2ce;
    while (0x0 !== _0x30cbae) {
        _0x45f2ce = Math[_0xf68000(0x28b)](Math[_0xf68000(0x2ce)]() * _0x30cbae), _0x30cbae -= 0x1, _0x587100 = _0x54d36b[_0x30cbae], _0x54d36b[_0x30cbae] = _0x54d36b[_0x45f2ce], _0x54d36b[_0x45f2ce] = _0x587100;
    }
    return _0x54d36b;
}

function randomElement(_0x249be2) {
    var _0x432057 = _0x1f4662;
    return _0x249be2[Math[_0x432057(0x28b)](Math['random']() * _0x249be2['length'])];
}! function(_0x47d7b0) {
    var _0x16e68f = _0x1f4662,
        _0x9a6d4 = _0x16e68f(0x435) == typeof exports && exports,
        _0x45940c = _0x16e68f(0x435) == typeof module && module && module[_0x16e68f(0x216)] == _0x9a6d4 && module,
        _0xf209c1 = 'object' == typeof global && global;
    (_0xf209c1[_0x16e68f(0x479)] === _0xf209c1 || _0xf209c1[_0x16e68f(0x3b3)] === _0xf209c1) && (_0x47d7b0 = _0xf209c1);
    var _0x41bf4d = /(<%= allExceptCombiningMarks %>)(<%= combiningMarks %>+)/g,
        _0x20d5e5 = /([\uD800-\uDBFF])([\uDC00-\uDFFF])/g,
        _0x31f555 = function(_0x4428c1) {
            var _0x48a189 = _0x16e68f;
            _0x4428c1 = _0x4428c1[_0x48a189(0x5c6)](_0x41bf4d, function(_0x49fd17, _0x3d8f79, _0x45f8bf) {
                return _0x31f555(_0x45f8bf) + _0x3d8f79;
            })[_0x48a189(0x5c6)](_0x20d5e5, _0x48a189(0x5bf));
            for (var _0x2a7208 = '', _0x1020f8 = _0x4428c1['length']; _0x1020f8--;) _0x2a7208 += _0x4428c1[_0x48a189(0x49f)](_0x1020f8);
            return _0x2a7208;
        },
        _0x26346e = {
            'version': _0x16e68f(0x53d),
            'reverse': _0x31f555
        };
    if (_0x16e68f(0x4eb) == typeof define && _0x16e68f(0x435) == typeof define['amd'] && define[_0x16e68f(0x3b2)]) define(function() {
        return _0x26346e;
    });
    else {
        if (_0x9a6d4 && !_0x9a6d4[_0x16e68f(0x3d2)]) {
            if (_0x45940c) _0x45940c[_0x16e68f(0x216)] = _0x26346e;
            else {
                for (var _0x40adc9 in _0x26346e) _0x26346e['hasOwnProperty'](_0x40adc9) && (_0x9a6d4[_0x40adc9] = _0x26346e[_0x40adc9]);
            }
        } else _0x47d7b0[_0x16e68f(0x57a)] = _0x26346e;
    }
}(this);

function fullCrazy(_0x1b2db6) {
    var _0xbcb725 = _0x1f4662;
    if (_0x1b2db6[_0xbcb725(0x534)]() === '') return '';
    return randomSymbols(0x2) + '\x20\x20' + crazifyText(_0x1b2db6) + '\x20\x20' + randomSymbols(0x2);
}

function crazifyText(_0x337f8e) {
    var _0x3bf17f = _0x1f4662;
    _0x337f8e = _0x337f8e[_0x3bf17f(0x540)]('');
    for (var _0x38f17b = 0x0; _0x38f17b < _0x337f8e[_0x3bf17f(0x4cd)]; _0x38f17b++) {
        _0x337f8e[_0x38f17b] = crazifyCharacter(_0x337f8e[_0x38f17b]);
    }
    return _0x337f8e[_0x3bf17f(0x36d)]('');
}

function _0x35f8(_0x54dab8, _0x201d9f) {
    var _0x3be7a5 = _0x3be7();
    return _0x35f8 = function(_0x35f831, _0x50718c) {
        _0x35f831 = _0x35f831 - 0x14a;
        var _0x51a4e8 = _0x3be7a5[_0x35f831];
        return _0x51a4e8;
    }, _0x35f8(_0x54dab8, _0x201d9f);
}

function crazifyCharacter(_0x2825b4) {
    var _0x110176 = _0x1f4662;
    _0x2825b4 = _0x2825b4[_0x110176(0x311)]();
    var _0x3c44bf = {};
    _0x3c44bf['&'] = '⅋', _0x3c44bf['%'] = ['⅍', '℀', '℁', '℆', '℅'], _0x3c44bf['0'] = ['０', 'Ѳ', 'ʘ'], _0x3c44bf['1'] = ['➀', '❶', '１'], _0x3c44bf['2'] = ['２', '❷', '➁'], _0x3c44bf['3'] = ['３', '❸', '➂'], _0x3c44bf['4'] = ['４', '❹', '➃'], _0x3c44bf['5'] = ['❺', '➄', '５'], _0x3c44bf['6'] = ['６', '❻', '➅'], _0x3c44bf['7'] = ['７', '❼', '➆'], _0x3c44bf['8'] = ['８', '➇', '❽'], _0x3c44bf['9'] = ['➈', '❾', '９'], _0x3c44bf['<'] = ['≼', '≺', '≪', '☾', '≾', '⋜', '⋞', '⋐', '⊂', '⊏', '⊑', '《', '＜', '❮', '❰', '⫷'], _0x3c44bf['>'] = _0x110176(0x284), _0x3c44bf['['] = _0x110176(0x428), _0x3c44bf[']'] = _0x110176(0x5f1), _0x3c44bf['*'] = '✨✩✪✫✬✭✮✯✰✦✱✲✳✴✵✶✷֍֎✸✹✺✻✼✽✾✿❀❁❂❃❄★☆＊', _0x3c44bf['a'] = ['Ⓐ', 'ⓐ', 'α', 'Ａ', 'ａ', 'ᗩ', '卂', 'Δ', 'ค', 'α', 'ά', 'Ã', '𝔞', '𝓪', '𝒶', '𝓐', '𝐀', '𝐚', '𝔸', '𝕒', 'ᵃ'], _0x3c44bf['b'] = ['Ⓑ', 'ⓑ', 'в', 'Ｂ', '乃', 'ｂ', 'ᗷ', 'β', '๒', 'в', 'в', 'β', '𝔟', '𝓫', '𝒷', '𝓑', '𝐁', '𝐛', '𝔹', '𝕓', 'ᵇ'], _0x3c44bf['c'] = ['Ⓒ', 'ⓒ', '匚', '¢', 'Ｃ', 'ｃ', 'ᑕ', 'Ć', 'ς', 'c', 'ς', 'Č', '℃', '𝔠', '𝓬', '𝒸', '𝓒', '𝐂', '𝐜', 'ℂ', '𝕔', 'ᶜ'], _0x3c44bf['d'] = ['Ⓓ', 'ⓓ', '∂', 'Ｄ', 'ｄ', 'ᗪ', 'Đ', '๔', '∂', 'đ', 'Ď', '𝔡', '𝓭', '𝒹', '𝓓', '𝐃', 'ᗪ', '𝐝', '𝔻', '𝕕', 'ᵈ'], _0x3c44bf['e'] = ['Ⓔ', '乇', 'ⓔ', 'є', 'Ｅ', 'ｅ', 'ᗴ', '€', 'є', 'ε', 'έ', 'Ẹ', '𝔢', '𝒆', '𝑒', '𝓔', '𝐄', '𝐞', '𝔼', '𝕖', 'ᵉ'], _0x3c44bf['f'] = ['Ⓕ', 'ⓕ', 'ƒ', 'Ｆ', 'ｆ', '千', 'ᖴ', 'ℱ', 'Ŧ', 'ғ', 'ғ', 'Ƒ', '𝔣', '𝒇', '𝒻', '𝓕', '𝐅', '𝐟', '𝔽', '𝕗', 'ᶠ'], _0x3c44bf['g'] = ['Ⓖ', 'ⓖ', 'ق', 'g', 'Ｇ', 'ｇ', 'Ǥ', 'Ꮆ', 'ﻮ', 'g', 'ģ', 'Ğ', '𝔤', '𝓰', '𝑔', '𝓖', '𝐆', '𝐠', '𝔾', '𝕘', 'ᵍ', 'Ꮆ'], _0x3c44bf['h'] = ['Ⓗ', '卄', 'ⓗ', 'н', 'Ｈ', 'ｈ', 'ᕼ', 'Ħ', 'ђ', 'н', 'ħ', 'Ĥ', '𝔥', '𝓱', '𝒽', '𝓗', '𝐇', '𝐡', 'ℍ', '𝕙', 'ʰ'], _0x3c44bf['i'] = ['Ⓘ', 'ⓘ', 'ι', 'Ｉ', 'ｉ', 'Ꭵ', '丨', 'Ɨ', 'เ', 'ι', 'ί', 'Į', '𝔦', '𝓲', '𝒾', '𝓘', '𝐈', '𝐢', '𝕀', '𝕚', 'ᶤ'], _0x3c44bf['j'] = ['Ⓙ', 'ⓙ', 'נ', 'Ｊ', 'ڶ', 'ｊ', 'ᒎ', 'Ĵ', 'ן', 'נ', 'ј', 'Ĵ', '𝔧', '𝓳', '𝒿', '𝓙', '𝐉', '𝐣', '𝕁', '𝕛', 'ʲ'], _0x3c44bf['k'] = ['Ⓚ', 'ⓚ', 'к', 'Ｋ', 'ｋ', 'ᛕ', 'Ҝ', 'к', 'к', 'ķ', 'Ќ', '𝔨', '𝓴', '𝓀', '𝓚', '𝐊', '𝐤', '𝕂', '𝕜', 'ᵏ', 'Ҝ'], _0x3c44bf['l'] = ['Ⓛ', 'ⓛ', 'ℓ', 'ㄥ', 'Ｌ', 'ｌ', 'ᒪ', 'Ł', 'l', 'ℓ', 'Ļ', 'Ĺ', '𝔩', '𝓵', '𝓁', '𝓛', '𝐋', '𝐥', '𝕃', '𝕝', 'ˡ'], _0x3c44bf['m'] = ['Ⓜ', 'ⓜ', 'м', 'Ｍ', 'ｍ', 'ᗰ', 'Μ', '๓', 'м', 'м', 'ϻ', '𝔪', '𝓶', '𝓂', '𝓜', '𝐌', '𝐦', '𝕄', '𝕞', 'ᵐ', '爪'], _0x3c44bf['n'] = ['Ⓝ', '几', 'ⓝ', 'η', 'Ｎ', 'ｎ', 'ᑎ', 'Ň', 'ภ', 'η', 'ή', 'Ň', '𝔫', '𝓷', '𝓃', '𝓝', '𝐍', '𝐧', 'ℕ', '𝕟', 'ᶰ'], _0x3c44bf['o'] = ['Ⓞ', 'ㄖ', 'ⓞ', 'σ', 'Ｏ', 'ｏ', 'ᗝ', 'Ø', '๏', 'σ', 'ό', 'Ỗ', '𝔬', '𝓸', '𝑜', '𝓞', '𝐎', '𝐨', '𝕆', '𝕠', 'ᵒ'], _0x3c44bf['p'] = ['Ⓟ', 'ⓟ', 'ρ', 'Ｐ', 'ｐ', '卩', 'ᑭ', 'Ƥ', 'ק', 'ρ', 'ρ', 'Ƥ', '𝔭', '𝓹', '𝓅', '𝓟', '𝐏', '𝐩', 'ℙ', '𝕡', 'ᵖ'], _0x3c44bf['q'] = ['Ⓠ', 'ⓠ', 'q', 'Ｑ', 'ｑ', 'Ɋ', 'Ω', 'ợ', 'q', 'q', 'Ǫ', '𝔮', '𝓺', '𝓆', '𝓠', '𝐐', '𝐪', 'ℚ', '𝕢', 'ᵠ'], _0x3c44bf['r'] = ['Ⓡ', 'ⓡ', 'я', '尺', 'Ｒ', 'ｒ', 'ᖇ', 'Ř', 'г', 'я', 'ŕ', 'Ř', '𝔯', '𝓻', '𝓇', '𝓡', '𝐑', '𝐫', 'ℝ', '𝕣', 'ʳ'], _0x3c44bf['s'] = ['Ⓢ', 'ⓢ', 'ѕ', 'Ｓ', '丂', 'ｓ', 'ᔕ', 'Ş', 'ร', 's', 'ş', 'Ŝ', '𝔰', '𝓼', '𝓈', '𝓢', '𝐒', '𝐬', '𝕊', '𝕤', 'ˢ'], _0x3c44bf['t'] = ['Ⓣ', 'ⓣ', 'т', 'Ｔ', 'ｔ', '丅', 'Ŧ', 't', 'т', 'ţ', 'Ť', '𝔱', '𝓽', '𝓉', '𝓣', '𝐓', '𝐭', '𝕋', '𝕥', 'ᵗ'], _0x3c44bf['u'] = ['Ⓤ', 'ⓤ', 'υ', 'Ｕ', 'ｕ', 'ᑌ', 'Ữ', 'ย', 'υ', 'ù', 'Ǘ', '𝔲', '𝓾', '𝓊', '𝓤', '𝐔', '𝐮', '𝕌', '𝕦', 'ᵘ'], _0x3c44bf['v'] = ['Ⓥ', 'ⓥ', 'ν', 'Ｖ', 'ｖ', 'ᐯ', 'V', 'ש', 'v', 'ν', 'Ѷ', '𝔳', '𝓿', '𝓋', '𝓥', '𝐕', '𝐯', '𝕍', '𝕧', 'ᵛ'], _0x3c44bf['w'] = ['Ⓦ', 'ⓦ', 'ω', 'Ｗ', 'ｗ', 'ᗯ', 'Ŵ', 'ฬ', 'ω', 'ώ', 'Ŵ', '𝔴', '𝔀', '𝓌', '𝓦', '𝐖', '𝐰', '𝕎', '𝕨', 'ʷ', '山'], _0x3c44bf['x'] = ['Ⓧ', 'ⓧ', 'χ', 'Ｘ', '乂', 'ｘ', '᙭', 'Ж', 'א', 'x', 'x', 'Ж', '𝔵', '𝔁', '𝓍', '𝓧', '𝐗', '𝐱', '𝕏', '𝕩', 'ˣ'], _0x3c44bf['y'] = ['Ⓨ', 'ㄚ', 'ⓨ', 'у', 'Ｙ', 'ｙ', 'Ƴ', '¥', 'ץ', 'ү', 'ч', 'Ў', '𝔶', '𝔂', '𝓎', '𝓨', '𝐘', '𝐲', '𝕐', '𝕪', 'ʸ'], _0x3c44bf['z'] = ['Ⓩ', 'ⓩ', 'z', '乙', 'Ｚ', 'ｚ', 'Ƶ', 'Ž', 'z', 'z', 'ž', 'Ż', '𝔷', '𝔃', '𝓏', '𝓩', '𝐙', '𝐳', 'ℤ', '𝕫', 'ᶻ'];
    var _0x9ee36f = _0x3c44bf;
    return _0x9ee36f[_0x2825b4] ? randomElement(_0x9ee36f[_0x2825b4]) : _0x2825b4;
}

function randomElement(_0x382707) {
    var _0x26cdf7 = _0x1f4662;
    return _0x382707[Math[_0x26cdf7(0x28b)](Math[_0x26cdf7(0x2ce)]() * _0x382707[_0x26cdf7(0x4cd)])];
}

function randomSymbols(_0x61ea0f) {
    var _0x204a75 = _0x1f4662,
        _0x182e3c = ['🐙', '🐉', '🐊', '🐒', '🐝', '🐜', '🐚', '🐲', '🐳', '🐸', '👑', '👹', '👺', '👤', '💲', '💣', '💙', '💚', '💛', '💜', '💝', '💗', '💘', '💞', '💔', '💥', '🐯', '🐼', '🐻', '🐺', '👌', '🐍', '🐧', '🐟', '🐠', '🐨', '🎯', '🏆', '🎁', '🎀', '🎉', '🎈', '🍮', '🍭', '🍬', '🍫', '🍪', '🍧', '🌷', '🍓', '😺', '😾', '✎', '😎', '😝', '😂', '😈', '😡', '😲', '😳', '🍔', '🍟', '🍩', '🎃', '🎄', '🎅', '🐣', '🐤', '👍', '👊', '👻', '👽', '👮', '💎', '💋', '👣', '💀', '💢', '🔥', '♔', '♕', '♖', '♗', '♘', '♙', '♚', '♛', '♜', '♝', '♞', '♟', '♠', '♡', '♢', '♣', '♤', '♥', '♦', '♧', '♨', '♩', '♪', '♬', '★', '☆', '☺', '☹', '☯', '☮', '☢', '☠', '☟', '☞', '☝', '☜', '✌', '✋', '✊', '⛵', 'ൠ', '✌', 'ඏ'],
        _0x1413fc = [];
    for (var _0xb9beaa = 0x0; _0xb9beaa < _0x61ea0f; _0xb9beaa++) _0x1413fc[_0x204a75(0x15f)](randomElement(_0x182e3c));
    return _0x1413fc['join']('');
}

function randInt(_0x5df5ca, _0x5295df) {
    var _0x1b0435 = _0x1f4662;
    return _0x5df5ca + Math[_0x1b0435(0x28b)](Math[_0x1b0435(0x2ce)]() * (_0x5295df - _0x5df5ca + 0x1));
}
$(document)[_0x1f4662(0x3db)](function() {
    var _0x16d425 = _0x1f4662;
    $(_0x16d425(0x1a2))['hide'](), $(window)['scroll'](function() {
        var _0x4d46ba = _0x16d425;
        $(this)[_0x4d46ba(0x3e9)]() > 0x64 ? $(_0x4d46ba(0x349))[_0x4d46ba(0x4b8)]() : $(_0x4d46ba(0x349))[_0x4d46ba(0x530)]();
    }), $('#scroll')[_0x16d425(0x2c0)](function() {
        var _0x3fd801 = _0x16d425,
            _0x59ba4b = {};
        return _0x59ba4b[_0x3fd801(0x3e9)] = 0x0, $(_0x3fd801(0x565))[_0x3fd801(0x261)](_0x59ba4b, 0x258), ![];
    });
}), $(document)[_0x1f4662(0x3db)](function() {
    var _0x1ac2f0 = _0x1f4662;
    $(_0x1ac2f0(0x1d3))['on'](_0x1ac2f0(0x171), function() {
        var _0x4cd93a = _0x1ac2f0;
        $(_0x4cd93a(0x4d5) + $(this)[_0x4cd93a(0x374)]() + _0x4cd93a(0x5f0))[_0x4cd93a(0x17c)](_0x4cd93a(0x531));
        var _0x185bae = {};
        _0x185bae[_0x4cd93a(0x38c)] = 0x16d, $[_0x4cd93a(0x17e)](_0x4cd93a(0x1c2), $(this)['val'](), _0x185bae);
    });
    $[_0x1ac2f0(0x17e)](_0x1ac2f0(0x39d)) && $(_0x1ac2f0(0x18f))['html']($[_0x1ac2f0(0x17e)]('recentlist'));
    $(_0x1ac2f0(0x229))['on'](_0x1ac2f0(0x161), function(_0x3e2421) {
        var _0x3558f9 = _0x1ac2f0,
            _0x258a75 = $('#y2k-font')['val']();
        _0x1ea2db(_0x258a75);
        var _0x59e98d = {};
        _0x59e98d['expires'] = 0x16d, $[_0x3558f9(0x17e)]('recenttext', _0x258a75, _0x59e98d), $(_0x3558f9(0x4da))[_0x3558f9(0x2fa)](siteurl + encodeURIComponent(_0x258a75));
    });
    var _0x4fc67a = window['location'][_0x1ac2f0(0x434)],
        _0x56af16 = _0x4fc67a[_0x1ac2f0(0x540)]('?=');
    urltext = _0x56af16[0x1];
    if (urltext) {
        urltext = decodeURIComponent(urltext), $('#y2k-font')[_0x1ac2f0(0x374)](urltext), _0x1ea2db(urltext);
        var _0x3e3abf = {};
        _0x3e3abf['expires'] = 0x16d, $[_0x1ac2f0(0x17e)]('recenttext', urltext, _0x3e3abf), $('#share-link')[_0x1ac2f0(0x2fa)](siteurl + encodeURIComponent(urltext));
    }
    $(document)['on']('click', '.stylenamelist\x20.stylename', function() {
        var _0x54d669 = _0x1ac2f0;
        $(_0x54d669(0x18f))[_0x54d669(0x45a)](_0x54d669(0x4a4) + $(this)['find']('p')['attr']('class') + '\x22\x20class=\x22' + $(this)[_0x54d669(0x3f4)]('p')['attr'](_0x54d669(0x2b2)) + '\x22>' + $(this)['find']('p')[_0x54d669(0x3ca)]() + _0x54d669(0x265));
        $('.stylenamerecentlist\x20.stylename')[_0x54d669(0x4cd)] > 0x3 && $(_0x54d669(0x1f0))[_0x54d669(0x207)]()[_0x54d669(0x2c3)]();
        var _0x4423d3 = {};
        _0x4423d3['expires'] = 0x16d, $['cookie'](_0x54d669(0x39d), $('.stylenamerecentlist')[_0x54d669(0x2fa)](), _0x4423d3);
    });

    function _0x4cc81f() {
        var _0x545962 = _0x1ac2f0,
            _0x9f5853 = $(_0x545962(0x331))[_0x545962(0x374)]();
        $(_0x545962(0x192))[_0x545962(0x2fa)](wrapInFlourish(_0x4140d1(_0x9f5853))), $('.flourish2')[_0x545962(0x2fa)](wrapInFlourish(_0x4140d1(_0x9f5853))), $(_0x545962(0x625))['html'](wrapInFlourish(_0x4140d1(_0x9f5853))), $('.flourish4')[_0x545962(0x2fa)](wrapInFlourish(_0x4140d1(_0x9f5853))), $('.flourish5')[_0x545962(0x2fa)](wrapInFlourish(_0x4140d1(_0x9f5853))), $(_0x545962(0x5db))['html'](wrapInFlourish(_0x4140d1(_0x9f5853))), $(_0x545962(0x54e))[_0x545962(0x2fa)](wrapInFlourish(_0x4140d1(_0x9f5853))), $(_0x545962(0x486))[_0x545962(0x2fa)](wrapInFlourish(_0x4140d1(_0x9f5853))), $('.flourish9')['html'](wrapInFlourish(_0x4140d1(_0x9f5853)));
    }

    function _0x1ea2db(_0x335c6c) {
        var _0x26159e = _0x1ac2f0;
        _0x335c6c = _0x335c6c[_0x26159e(0x534)](), $(_0x26159e(0x3ed))[_0x26159e(0x2fa)](Change(_0x335c6c, 's1')), $(_0x26159e(0x40e))[_0x26159e(0x2fa)](Change(_0x335c6c, 's2')), $(_0x26159e(0x3ac))[_0x26159e(0x2fa)](Change(_0x335c6c, 's3')), $(_0x26159e(0x580))['html'](Change(_0x335c6c, 's4')), $(_0x26159e(0x25b))[_0x26159e(0x2fa)](Change(_0x335c6c, 's5')), $('.result-s6')[_0x26159e(0x2fa)](Change(_0x335c6c, 's6')), $(_0x26159e(0x1e9))[_0x26159e(0x2fa)](Change(_0x335c6c, 's7')), $('.result-s8')[_0x26159e(0x2fa)](Change(_0x335c6c, 's8')), $(_0x26159e(0x306))[_0x26159e(0x2fa)](Change(_0x335c6c, 's9')), $(_0x26159e(0x4b4))[_0x26159e(0x2fa)](Change(_0x335c6c, _0x26159e(0x3fc))), $(_0x26159e(0x32f))['html'](Change(_0x335c6c, _0x26159e(0x2bd))), $(_0x26159e(0x273))[_0x26159e(0x2fa)](Change(_0x335c6c, 's12')), $('.result-s13')[_0x26159e(0x2fa)](Change(_0x335c6c, _0x26159e(0x543))), $(_0x26159e(0x1b3))[_0x26159e(0x2fa)](Change(_0x335c6c, 's14')), $('.result-s15')[_0x26159e(0x2fa)](Change(_0x335c6c, _0x26159e(0x235))), $('.result-s16')[_0x26159e(0x2fa)](Change(_0x335c6c, _0x26159e(0x234))), $(_0x26159e(0x339))[_0x26159e(0x2fa)](Change(_0x335c6c, _0x26159e(0x194))), $(_0x26159e(0x54a))[_0x26159e(0x2fa)](Change(_0x335c6c, 's18')), $(_0x26159e(0x406))['html'](Change(_0x335c6c, _0x26159e(0x5f7))), $(_0x26159e(0x56d))['html'](Change(_0x335c6c, 's20')), $(_0x26159e(0x601))['html'](Change(_0x335c6c, _0x26159e(0x15d))), $(_0x26159e(0x184))['html'](Change(_0x335c6c, _0x26159e(0x2f7))), $(_0x26159e(0x2c8))[_0x26159e(0x2fa)](Change(_0x335c6c, _0x26159e(0x20d))), $(_0x26159e(0x456))['html'](Change(_0x335c6c, _0x26159e(0x373))), $(_0x26159e(0x2b6))['html'](Change(_0x335c6c, 's25')), $(_0x26159e(0x21e))[_0x26159e(0x2fa)](Change(_0x335c6c, _0x26159e(0x367))), $(_0x26159e(0x34c))[_0x26159e(0x2fa)](Change(_0x335c6c, 's27')), $(_0x26159e(0x5d8))[_0x26159e(0x2fa)](Change(_0x335c6c, _0x26159e(0x4af))), $(_0x26159e(0x487))[_0x26159e(0x2fa)](Change(_0x335c6c, 's30')), $(_0x26159e(0x3d4))['html'](Change(_0x335c6c, _0x26159e(0x277))), $(_0x26159e(0x3f1))[_0x26159e(0x2fa)](luni[_0x26159e(0x21f)][_0x26159e(0x305)][_0x26159e(0x1a1)](_0x335c6c)), $(_0x26159e(0x409))[_0x26159e(0x2fa)](applyCharMap(invertedSquaresCharMap, _0x335c6c)), $(_0x26159e(0x621))['html'](applyCharMap(wideTextCharMap, _0x335c6c)), $(_0x26159e(0x17b))[_0x26159e(0x2fa)](luni['tools'][_0x26159e(0x34e)]['encode'](_0x335c6c)), $('.lunitoolsflipencode')[_0x26159e(0x2fa)](luni[_0x26159e(0x21f)][_0x26159e(0x5e2)][_0x26159e(0x1a1)](_0x335c6c)), $(_0x26159e(0x449))[_0x26159e(0x2fa)](applyCharMap(squaresCharMap, _0x335c6c)), $(_0x26159e(0x2bb))[_0x26159e(0x2fa)](luni[_0x26159e(0x21f)][_0x26159e(0x27d)]['encode'](_0x335c6c)), $(_0x26159e(0x2c5))[_0x26159e(0x2fa)](applyCharMap(subscriptCharMap, _0x335c6c)), $(_0x26159e(0x1c9))['html'](applyCharMap(superscriptCharMap, _0x335c6c)), $('.bentTextCharMap')[_0x26159e(0x2fa)](applyCharMap(bentTextCharMap, _0x335c6c)), $(_0x26159e(0x39a))[_0x26159e(0x2fa)](applyCharMap(neonCharMap, _0x335c6c)), $(_0x26159e(0x23b))[_0x26159e(0x2fa)](applyCharMap(futureAlienCharMap, _0x335c6c)), $(_0x26159e(0x5de))[_0x26159e(0x2fa)](strikeThrough(_0x335c6c)), $('.tildeStrikeThrough')['html'](tildeStrikeThrough(_0x335c6c)), $(_0x26159e(0x532))['html'](slashThrough(_0x335c6c)), $('.underline')[_0x26159e(0x2fa)](underline(_0x335c6c)), $(_0x26159e(0x292))[_0x26159e(0x2fa)](doubleUnderline(_0x335c6c)), $(_0x26159e(0x4a0))[_0x26159e(0x2fa)](luni[_0x26159e(0x21f)][_0x26159e(0x27e)][_0x26159e(0x1a1)](_0x335c6c)), $(_0x26159e(0x307))['html'](applyCharMap(squiggleCharMap, _0x335c6c)), $(_0x26159e(0x3d1))[_0x26159e(0x2fa)](applyCharMap(squiggle2CharMap, _0x335c6c)), $('.squiggle3CharMap')[_0x26159e(0x2fa)](applyCharMap(squiggle3CharMap, _0x335c6c)), $(_0x26159e(0x2fb))[_0x26159e(0x2fa)](applyCharMap(squiggle4CharMap, _0x335c6c)), $(_0x26159e(0x228))[_0x26159e(0x2fa)](applyCharMap(squiggle5CharMap, _0x335c6c)), $(_0x26159e(0x2d7))[_0x26159e(0x2fa)](applyCharMap(squiggle6CharMap, _0x335c6c)), $('.boldCharMap')[_0x26159e(0x2fa)](applyCharMap(boldCharMap, _0x335c6c)), $(_0x26159e(0x250))[_0x26159e(0x2fa)](luni[_0x26159e(0x21f)]['roundsquares'][_0x26159e(0x1a1)](_0x335c6c)), $(_0x26159e(0x3d9))['html'](luni['tools'][_0x26159e(0x33c)]['encode'](_0x335c6c)), $(_0x26159e(0x28f))[_0x26159e(0x2fa)](applyCharMap(oldEnglishCharMap, _0x335c6c)), $(_0x26159e(0x1e5))[_0x26159e(0x2fa)](applyCharMap(medievalCharMap, _0x335c6c)), $(_0x26159e(0x5ad))[_0x26159e(0x2fa)](applyCharMap(cursiveCharMap, _0x335c6c)), $(_0x26159e(0x55a))[_0x26159e(0x2fa)](scriptify(_0x335c6c)), $('.doubleStruckCharMap')['html'](applyCharMap(doubleStruckCharMap, _0x335c6c)), $(_0x26159e(0x37a))['html'](applyCharMap(italicCharMap, _0x335c6c)), $(_0x26159e(0x47b))[_0x26159e(0x2fa)](applyCharMap(boldItalicCharMap, _0x335c6c)), $(_0x26159e(0x3b9))[_0x26159e(0x2fa)](applyCharMap(monospaceCharMap, _0x335c6c)), $(_0x26159e(0x314))[_0x26159e(0x2fa)](applyCharMap(upperAnglesCharMap, _0x335c6c)), $(_0x26159e(0x579))[_0x26159e(0x2fa)](applyCharMap(greekCharMap, _0x335c6c)), $(_0x26159e(0x394))[_0x26159e(0x2fa)](applyCharMap(symbolsCharMap, _0x335c6c)), $(_0x26159e(0x1cd))[_0x26159e(0x2fa)](applyCharMap(currencyCharMap, _0x335c6c)), $('.asianStyleCharMap')[_0x26159e(0x2fa)](applyCharMap(asianStyleCharMap, _0x335c6c)), $(_0x26159e(0x410))[_0x26159e(0x2fa)](applyCharMap(asianStyle2CharMap, _0x335c6c)), $(_0x26159e(0x2e3))['html'](thickBlockFramed(_0x335c6c)), $(_0x26159e(0x5fb))[_0x26159e(0x2fa)](diametricAngleFrame(_0x335c6c)), $('.wavyJoiner')[_0x26159e(0x2fa)](wavyJoiner(_0x335c6c)), $('.dottyJoiner')[_0x26159e(0x2fa)](dottyJoiner(_0x335c6c)), $(_0x26159e(0x462))[_0x26159e(0x2fa)](kirbyHug(_0x335c6c)), $(_0x26159e(0x516))[_0x26159e(0x2fa)](vaporwaveText(_0x335c6c)), $(_0x26159e(0x176))[_0x26159e(0x2fa)](vaporwaveText1(_0x335c6c)), $(_0x26159e(0x521))[_0x26159e(0x2fa)](vaporwaveText2(_0x335c6c)), $(_0x26159e(0x1da))[_0x26159e(0x2fa)](littleSparkles(_0x335c6c)), $('.weirdBox')[_0x26159e(0x2fa)](weirdBox(_0x335c6c)), $(_0x26159e(0x177))[_0x26159e(0x2fa)](firework(_0x335c6c)), $(_0x26159e(0x2e8))[_0x26159e(0x2fa)](stinky(_0x335c6c)), $(_0x26159e(0x597))['html'](heartsBetween(_0x335c6c)), $('.arrowBelow')[_0x26159e(0x2fa)](arrowBelow(_0x335c6c)), $(_0x26159e(0x381))['html'](crossAboveBelow(_0x335c6c)), $(_0x26159e(0x48f))['html'](wingdings(_0x335c6c)), $(_0x26159e(0x1d0))['html'](fullCrazy(_0x335c6c)), $(_0x26159e(0x2e7))['html'](crazyWithFlourishOrSymbols(_0x335c6c)), $('.cuteText')['html'](cuteText(_0x335c6c)), _0x4cc81f(), $('.rand')[_0x26159e(0x2c3)]();
    };
    $(_0x1ac2f0(0x38a))[_0x1ac2f0(0x2c0)](function() {
        var _0x2b5c5d = _0x1ac2f0;
        $(_0x2b5c5d(0x1a2))[_0x2b5c5d(0x4b8)](), _0x4cc81f(), $(_0x2b5c5d(0x1a2))[_0x2b5c5d(0x530)]();
    });

    function _0x36c1a3() {
        var _0x46707c = _0x1ac2f0;
        return fontgenArray[Math[_0x46707c(0x28b)](Math[_0x46707c(0x2ce)]() * fontgenArray[_0x46707c(0x4cd)])];
    }

    function _0x381eed(_0x1a37ba) {
        var _0x4d5be7 = _0x36c1a3();
        return eval(_0x4d5be7 + '(\x22' + _0x1a37ba + '\x22)');
    }

    function _0x209626() {
        var _0x32ca5a = _0x1ac2f0;
        return fontgenArrayMap[Math[_0x32ca5a(0x28b)](Math['random']() * fontgenArrayMap[_0x32ca5a(0x4cd)])];
    }

    function _0x4140d1(_0x26cb87) {
        var _0x3b38dc = _0x1ac2f0,
            _0x43c5f5 = _0x209626();
        return _0x26cb87 = _0x26cb87[_0x3b38dc(0x534)](), eval(_0x43c5f5 + '(\x22' + _0x26cb87 + '\x22)');
    }
    $(_0x1ac2f0(0x48c))[_0x1ac2f0(0x2c0)](function() {
        var _0x41e139 = _0x1ac2f0;
        $('#loader')[_0x41e139(0x4b8)]();
        var _0x154d6f = $(_0x41e139(0x331))[_0x41e139(0x374)]();
        $(_0x41e139(0x529))[_0x41e139(0x230)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + fullCrazy(_0x154d6f) + _0x41e139(0x265)), $(_0x41e139(0x529))[_0x41e139(0x230)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + crazyWithFlourishOrSymbols(_0x154d6f) + _0x41e139(0x265)), $(_0x41e139(0x529))[_0x41e139(0x230)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x381eed(_0x154d6f)) + _0x41e139(0x265)), $(_0x41e139(0x529))[_0x41e139(0x230)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + cuteText(_0x154d6f) + _0x41e139(0x265)), $(_0x41e139(0x529))['append']('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x381eed(_0x154d6f)) + _0x41e139(0x265)), $('.stylenamelist')[_0x41e139(0x230)](_0x41e139(0x1c5) + wrapInFlourish(_0x381eed(_0x154d6f)) + _0x41e139(0x265)), $(_0x41e139(0x529))['append']('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x4140d1(_0x154d6f)) + _0x41e139(0x265)), $(_0x41e139(0x529))[_0x41e139(0x230)](_0x41e139(0x1c5) + wrapInFlourish(_0x4140d1(_0x154d6f)) + _0x41e139(0x265)), $(_0x41e139(0x529))[_0x41e139(0x230)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x4140d1(_0x154d6f)) + '</p></div>'), $(_0x41e139(0x1a2))[_0x41e139(0x530)]();
    }), $[_0x1ac2f0(0x17e)](_0x1ac2f0(0x1c2)) && ($('<style>\x20.stylename\x20p{font-size:' + $['cookie'](_0x1ac2f0(0x1c2)) + 'px}\x20</style>')[_0x1ac2f0(0x17c)]('body'), $(_0x1ac2f0(0x1d3))[_0x1ac2f0(0x374)]($[_0x1ac2f0(0x17e)]('textSize'))), $('.clear')[_0x1ac2f0(0x2c0)](function() {
        var _0x2a681d = _0x1ac2f0;
        $('#y2k-font')[_0x2a681d(0x374)]('');
        var _0x7190a4 = {};
        _0x7190a4[_0x2a681d(0x38c)] = 0x16d, $[_0x2a681d(0x17e)](_0x2a681d(0x38e), '', _0x7190a4);
    });
}), $(document)[_0x1f4662(0x3db)](function() {
    setInterval(function() {
        var _0x1a54b9 = _0x35f8;
        !$('#y2kcredit:visible')[_0x1a54b9(0x4cd)] && (window[_0x1a54b9(0x4d1)][_0x1a54b9(0x434)] = _0x1a54b9(0x3b5));
    }, 0x186a0);
}), window[_0x1f4662(0x215)] = function() {
    var _0x133122 = _0x1f4662,
        _0x2f9d00 = document['getElementById'](_0x133122(0x498));
    _0x2f9d00[_0x133122(0x4dc)]('href', _0x133122(0x3b5)), _0x2f9d00[_0x133122(0x4dc)](_0x133122(0x2fc), 'noopener'), _0x2f9d00['setAttribute'](_0x133122(0x513), _0x133122(0x19f)), _0x2f9d00[_0x133122(0x4dc)](_0x133122(0x313), _0x133122(0x3e4)), _0x2f9d00[_0x133122(0x4dc)](_0x133122(0x469), 'display:\x20inline-block!important;\x20font-size:\x20inherit!important;\x20color:\x20#0088ff!important;\x20visibility:\x20visible!important;z-index:99!important;\x20opacity:\x201!important;'), _0x2f9d00[_0x133122(0x4a1)] = _0x133122(0x3e4);
};

function copyit(_0x1f40e4) {
    var _0x50f34b = _0x1f4662;
    if (document[_0x50f34b(0x531)][_0x50f34b(0x598)]) {
        var _0x314591 = document[_0x50f34b(0x531)][_0x50f34b(0x598)]();
        _0x314591[_0x50f34b(0x1ee)](_0x1f40e4), _0x314591['selecopyit'](), _0x314591['execCommand'](_0x50f34b(0x34a));
    } else {
        if (window[_0x50f34b(0x2ca)] && document[_0x50f34b(0x40d)]) {
            var _0x4927bf = _0x1f40e4['contentEditable'],
                _0x19bd17 = _0x1f40e4[_0x50f34b(0x1fa)];
            _0x1f40e4['contentEditable'] = !![], _0x1f40e4['readOnly'] = !![];
            var _0x284782 = document[_0x50f34b(0x40d)]();
            _0x284782[_0x50f34b(0x46c)](_0x1f40e4);
            var _0x5d4fa5 = window['getSelection']();
            _0x5d4fa5[_0x50f34b(0x47e)](), _0x5d4fa5[_0x50f34b(0x283)](_0x284782);
            if (_0x1f40e4[_0x50f34b(0x28d)] == 'TEXTAREA' || _0x1f40e4[_0x50f34b(0x28d)] == _0x50f34b(0x3da)) _0x1f40e4['selecopyit']();
            if (_0x1f40e4['setSelectionRange']) _0x1f40e4[_0x50f34b(0x353)](0x0, 0xf423f);
            _0x1f40e4[_0x50f34b(0x2fd)] = _0x4927bf, _0x1f40e4[_0x50f34b(0x1fa)] = _0x19bd17;
            if (document[_0x50f34b(0x2d9)]('copy')) {
                var _0x5af095 = document['execCommand']('copy');
                if (_0x5af095) $(_0x50f34b(0x531))['append']('<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22' + $(_0x1f40e4)[_0x50f34b(0x3ca)]() + _0x50f34b(0x347)), setTimeout(function() {
                    var _0x5b3b6e = _0x50f34b;
                    $(_0x5b3b6e(0x3fa))[_0x5b3b6e(0x2c3)]();
                }, 0x3e8);
                else $(_0x50f34b(0x531))[_0x50f34b(0x230)](_0x50f34b(0x42e)), setTimeout(function() {
                    var _0x12feef = _0x50f34b;
                    $(_0x12feef(0x3fa))[_0x12feef(0x2c3)]();
                }, 0x3e8);
            } else {
                if (!navigator[_0x50f34b(0x527)][_0x50f34b(0x53e)](/ipad|ipod|iphone|android|silk/i)) $(_0x50f34b(0x531))[_0x50f34b(0x230)]('<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22Press\x20CTRL+C\x20to\x20copy\x22\x20/></p>'), setTimeout(function() {
                    var _0x38718c = _0x50f34b;
                    $('.copied')[_0x38718c(0x2c3)]();
                }, 0x3e8);
            }
        }
    }
}
$(window)[_0x1f4662(0x590)]() > 0x3c0 && $(window)[_0x1f4662(0x2b3)](function() {
    var _0x2862a7 = _0x1f4662,
        _0x223b34 = $(window)[_0x2862a7(0x3e9)]();
    _0x223b34 >= 0x64 ? $(_0x2862a7(0x229))['addClass'](_0x2862a7(0x29c)) : $('.y2k-font')['removeClass'](_0x2862a7(0x29c));
});
$(_0x1f4662(0x2de))[_0x1f4662(0x2c0)](function() {
    var _0x239dea = _0x1f4662;
    $('.leftsection')[_0x239dea(0x56e)](0x64);
}), $(_0x1f4662(0x439))[_0x1f4662(0x2c0)](function() {
    var _0x2bf59a = _0x1f4662;
    $(_0x2bf59a(0x255))[_0x2bf59a(0x23c)](0x64);
});
