var _0x55dc6e = _0x4a74;
(function(_0x490149, _0x51fcb2) {
    var _0x98123f = _0x4a74,
        _0x129719 = _0x490149();
    while (!![]) {
        try {
            var _0x22d5f0 = parseInt(_0x98123f(0x27e)) / 0x1 + parseInt(_0x98123f(0x1b1)) / 0x2 + parseInt(_0x98123f(0x4d7)) / 0x3 + -parseInt(_0x98123f(0x40e)) / 0x4 + parseInt(_0x98123f(0x27f)) / 0x5 + parseInt(_0x98123f(0x538)) / 0x6 + -parseInt(_0x98123f(0x248)) / 0x7;
            if (_0x22d5f0 === _0x51fcb2) break;
            else _0x129719['push'](_0x129719['shift']());
        } catch (_0x381ca5) {
            _0x129719['push'](_0x129719['shift']());
        }
    }
}(_0x523c, 0xb9b72));
var normal = _0x55dc6e(0x66a);
const fontgenArray = [_0x55dc6e(0x2d9), _0x55dc6e(0x1bf), 'littleSparkles', _0x55dc6e(0x623), _0x55dc6e(0x40f), _0x55dc6e(0x437), _0x55dc6e(0x2a4), _0x55dc6e(0x50a), _0x55dc6e(0x2c2), _0x55dc6e(0x425), _0x55dc6e(0x5ba), _0x55dc6e(0x451), 'strikeThrough', _0x55dc6e(0x1ac), 'underline', _0x55dc6e(0x5af), 'slashThrough', _0x55dc6e(0x3ac)],
    fontgenArrayMap = [_0x55dc6e(0x237), _0x55dc6e(0x1cf), _0x55dc6e(0x4e7), _0x55dc6e(0x3e6), _0x55dc6e(0x55e), _0x55dc6e(0x4c2), _0x55dc6e(0x509), _0x55dc6e(0x47b), _0x55dc6e(0x503), 'squiggle3CharMapFun', _0x55dc6e(0x479), _0x55dc6e(0x21a), _0x55dc6e(0x625), _0x55dc6e(0x4ee), 'oldEnglishCharMapFun', 'medievalCharMapFun', _0x55dc6e(0x35a), _0x55dc6e(0x4c4), _0x55dc6e(0x4f3), _0x55dc6e(0x376), _0x55dc6e(0x660), _0x55dc6e(0x28f), _0x55dc6e(0x2a7), 'symbolsCharMapFun', _0x55dc6e(0x5bb), _0x55dc6e(0x26c), _0x55dc6e(0x3d4)];

function applyCharMap(_0x3ee811, _0x2b96cc) {
    var _0x1895f7 = _0x55dc6e;
    let _0x471e9d = '';
    for (let _0x3beebe of _0x2b96cc['split']('')) {
        if (_0x3ee811[_0x3beebe] !== undefined) _0x471e9d += _0x3ee811[_0x3beebe];
        else {
            if (_0x3ee811[_0x3beebe[_0x1895f7(0x458)]()] !== undefined) _0x471e9d += _0x3ee811[_0x3beebe[_0x1895f7(0x458)]()];
            else _0x471e9d += _0x3beebe;
        }
    }
    return _0x471e9d;
}

function invertedSquaresCharMapFun(_0x516031) {
    return applyCharMap(invertedSquaresCharMap, _0x516031);
}

function wideTextCharMapFun(_0x23976e) {
    return applyCharMap(wideTextCharMap, _0x23976e);
}

function squaresCharMapFun(_0x1a8483) {
    return applyCharMap(squaresCharMap, _0x1a8483);
}

function subscriptCharMapFun(_0x270555) {
    return applyCharMap(subscriptCharMap, _0x270555);
}

function bentTextCharMapFun(_0x1f4d83) {
    return applyCharMap(bentTextCharMap, _0x1f4d83);
}

function neonCharMapFun(_0x4d0c7b) {
    return applyCharMap(neonCharMap, _0x4d0c7b);
}

function futureAlienCharMapFun(_0x3f22fa) {
    return applyCharMap(futureAlienCharMap, _0x3f22fa);
}

function squiggleCharMapFun(_0x1af52a) {
    return applyCharMap(squiggleCharMap, _0x1af52a);
}

function squiggle2CharMapFun(_0x54b269) {
    return applyCharMap(squiggle2CharMap, _0x54b269);
}

function squiggle3CharMapFun(_0x578a4f) {
    return applyCharMap(squiggle3CharMap, _0x578a4f);
}

function squiggle4CharMapFun(_0x1665c6) {
    return applyCharMap(squiggle4CharMap, _0x1665c6);
}

function squiggle5CharMapFun(_0x2d7154) {
    return applyCharMap(squiggle5CharMap, _0x2d7154);
}

function squiggle6CharMapFun(_0x48589a) {
    return applyCharMap(squiggle6CharMap, _0x48589a);
}

function boldCharMapFun(_0x141816) {
    return applyCharMap(boldCharMap, _0x141816);
}

function oldEnglishCharMapFun(_0x5d26b3) {
    return applyCharMap(oldEnglishCharMap, _0x5d26b3);
}

function medievalCharMapFun(_0x479733) {
    return applyCharMap(medievalCharMap, _0x479733);
}

function cursiveCharMapFun(_0x4da947) {
    return applyCharMap(cursiveCharMap, _0x4da947);
}

function doubleStruckCharMapFun(_0x319049) {
    return applyCharMap(doubleStruckCharMap, _0x319049);
}

function italicCharMapFun(_0x28dbbc) {
    return applyCharMap(italicCharMap, _0x28dbbc);
}

function boldItalicCharMapFun(_0x1bc40e) {
    return applyCharMap(boldItalicCharMap, _0x1bc40e);
}

function _0x523c() {
    var _0x2bf7d1 = ['H&#828;', '<style>\x20.stylename\x20p{font-size:', '(⌒‿⌒)', 'fadeOut', 'y&#838;', '8&#838;', 'find', '&#387;', '&eta;', '&#10124;', '&#4317;', 'p&#866;', 'g&#829;&#851;', '&#323;', '(^▽^)', '&#974;', '.cursiveCharMap', '&#1095;', 'noopener', '&#374;', '&#596;', '`•.¸¸.•´´¯`••._.•\x20[[text]]\x20•._.••`¯´´•.¸¸.•`', '6&#857;', '&#41686;', '&#41042;', '.•♫•♬•\x20[[text]]\x20•♬•♫•.', 'b&#866;', 'R&#866;', 'k&#829;&#851;', 'undefined', 'N&#830;', '(ㅅꈍ﹃ꈍ)*\x20[[text]]\x20*(ꈍ﹃ꈍㅅ)♡', '↤↤↤↤↤\x20[[text]]\x20↦↦↦↦↦', '&#41807;', '.luniroundsquares', 's17', 'x&#838;', '&#9791;', '&#4325;', 'C&#866;', 'Schrift\x20Generator', '&#42131;', 's24', '.upperAnglesCharMap', '📪︎', '&#294;', 'doubleUnderline', 'o&#866;', 'R&#846;', 'S&#826;', '🕖︎', '&#9739;', '&#120481;&#823;', '&#10125;', 'b&#838;', '7&#828;', '&#41766;', 'arrowBelow', 'currencyCharMapFun', '&scaron;', 'V&#826;', '&#41976;', 'y&#866;', '&#5229;', 'B&#829;&#851;', '&#1356;', '&#5500;', '.flourish9', 'title', '&#647;', '.wavyJoiner', 'v&#830;', 'global', '&#41833;', '&#42171;', 'i&#799;', '&iuml;', 'Z&#846;', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20[[text]]\x20°º¤ø,¸¸,ø¤º°`°º¤ø,¸', '&#615;', 'u&#829;&#851;', '&#411;', 'M&#857;', 'x&#846;', '3&#857;', 'H&#866;', 'u&#799;', 'q&#799;', '&#41733;', '【〖〘〚［', '&#120826;&#823;', 'o&#830;', 'P&#826;', '.squiggle5CharMap', 'B&#838;', '&#1352;', 'hasOwnProperty', '&#1349;', 'u&#846;', '&#942;', 'A&#826;', 'j&#830;', 'E&#829;&#851;', 'V&#828;', 'selecopyit', '&#120829;&#823;', '.result-s24', '6&#830;', '&#413;', '&#490;', '2&#826;', 'T&#829;&#851;', '2&#838;', 'B&#799;', '&#258;', '&#4308;', '&#1291;', '🌘‿🌘', '&#120464;&#823;', 'reverse', '&#120452;&#823;', '&iota;', 'J&#846;', '&#41016;', 'html', '.weirdBox', '🕿︎', '9&#829;&#851;', '&#548;', 'a&#828;', '●‿●', 'y&#799;', '☽≫≻≽≿⋝⋟⋑⊃⊐⊒⫸》＞❯❱', 'm&#828;', '&#340;', '4&#846;', '&omega;', '&#1347;', '&#40984;', 'v&#857;', '&#42128;', 'V&#857;', 'top', '.result-s3', '&#404;', 'ᕕ(ᐛ)ᕗ', '¤\x20(¯´☆✭.¸_)¤\x20[[text]]\x20¤(_¸.✭☆´¯)\x20¤', 'Y&#799;', '&#65434;', '(•◡•)', '#textSize', '\x20\x20🎀\x20\x20', 'scroll', '.currencyCharMap', 'd&#866;', 'Y&#866;', 'z&#866;', 'z&#830;', '&#1050;', '⚔️\x20[[text]]\x20⚔️', '5&#826;', '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', 'diametricAngleFrame', '&#4306;', 'squiggle6CharMapFun', '&#592;', 'N&#866;', 'tools', '&#408;', 'u&#828;', 'expires', 'createTextRange', '°·.¸.·°¯°·.¸.·°¯°·.¸.->\x20', '-漫~*\x27¨¯¨\x27*·舞~\x20', 'm&#826;', 'N&#829;&#851;', '&#623;', '&#1506;', 'charAt', '.vaporwaveText1', 'd&#857;', '(¯´•._.•\x20[[text]]\x20•._.•´¯)', 'o&#829;&#851;', '&#1192;', '↫↫↫↫↫\x20[[text]]\x20↬↬↬↬↬', '&#41426;', '1&#828;', '&#5167;', '<%=\x20version\x20%>', '🕘︎', '&#652;', '✨✩✪✫✬✭✮✯✰✦✱✲✳✴✵✶✷֍֎✸✹✺✻✼✽✾✿❀❁❂❃❄★☆＊', 'style', '&Omega;', '1&#826;', '&#3182;', '🕚︎', 'T&#866;', '&#41660;', '������', '&#586;', '&#41575;', '&#1051;', 'h&#829;&#851;', '.fullCrazy', '&#1044;', 'M&#838;', 'd&#846;', 'm&#829;&#851;', '▀▄▀▄▀▄\x20[[text]]\x20▄▀▄▀▄▀', '&rho;', 'D&#799;', '&#941;', '&#120477;&#823;', '(✿╹◡╹)', '&#418;', 'P&#830;', '&#344;', '◦•●◉✿\x20[[text]]\x20✿◉●•◦', '&#321;', 'E&#846;', 'diacriticsTop', '&#1180;', 'monospaceCharMapFun', '&#42181;', 'diacriticsBottom', 'B&#828;', '&#394;', 'val', '&#477;', '&#9796;', '&#8355;', '🖳︎', 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890', '&#545;', '6&#846;', '&#646;', 'O&#846;', 'html,\x20body', 's13', 'v&#829;&#851;', '&#576;', 'getElementById', 'e&#826;', '&#41045;', '(\x20ﾟ∀ﾟ)ﾉ【[[text]]】', 'V&#846;', '&#120458;&#823;', '&#41532;', '&#372;', 'P&#838;', 'input\x20change', '&#41769;', 'H&#857;', '&#1046;', 'C&#799;', '&#998;', '&#120830;&#823;', '🖲︎', 'e&#830;', 'i&#830;', 'c&#828;', 'G&#799;', 'W&#857;', '&Delta;', '&#642;', 'l&#828;', '&Xi;', 'E&#826;', 'x&#799;', '&#120825;&#823;', '0&#846;', '&#653;', '&#41126;', 'r&#828;', '&#1377;', '&#9442;', '6&#826;', '&#10127;', 'o&#828;', 'e&#846;', 'Z&#838;', 'display:\x20inline-block!important;\x20font-size:\x20inherit!important;\x20color:\x20#0088ff!important;\x20visibility:\x20visible!important;z-index:99!important;\x20opacity:\x201!important;', '&#41731;', '⫷\x20[[text]]\x20⫸', 'join', '&#268;', 'Q&#866;', '&#9812;', 'input', '&#341;', 'q&#846;', 'tildeStrikeThrough', '&#310;', 'innerHTML', 'P&#846;', 'V&#799;', '1379394TTVwip', '&dagger;', '&#355;', 'l&#846;', '#font-generator', '\x22\x20/><span\x20class=\x22copybtn\x22>✔\x20Copas\x20!</span></p>', '.result-s20', '📂︎', '0&#866;', 'R&#826;', '2&#857;', '◠◡◠', '&ETH;', 'bubbles', 'weirdBox', '&#401;', '➶➶➶➶➶\x20[[text]]\x20➷➷➷➷➷', 's29', '&#41008;', 's&#799;', '0&#828;', '¤¸¸.•´¯`•¸¸.•..>>\x20', '<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>', '&#120455;&#823;', '9&#799;', '•°¯`••\x20[[text]]\x20••´¯°•', '&Gamma;', '.heartsBetween', '&#1097;', '&#41296;', 'wideTextCharMapFun', 'u&#826;', '&#41204;', 'remove', 'Z&#829;&#851;', '4&#829;&#851;', '&#120447;&#823;', '&#42014;', '.symbolsCharMap', 'm&#838;', '&#595;', 'W&#799;', '\x20.o0×X×0o.\x20[[text]]\x20.o0×X×0o.', '&#3619;', 'attr', 'Q&#799;', '6&#799;', '`•.,¸¸,.•´¯\x20[[text]]\x20¯`•.,¸¸,.•´', 'f&#846;', '.stylenamelist\x20.stylename', 'I&#826;', 'W&#866;', '&#1141;', '(っ◔◡◔)っ\x20♥\x20', '<div\x20class=\x22stylename\x22><span>Recently\x20Used</span><p\x20onclick=\x22copyit(this)\x22\x20data-clipboard-target=\x22.', '˜”*°•.˜”*°•\x20', 'round', 'j&#799;', 'textSize', '&#41427;', 'h&#799;', '.futureAlienCharMap', '1&#866;', '&#406;', '•]••´º´•»\x20[[text]]\x20«•´º´••[•', '&#41508;', '.result-s2', '.flourish3', '😐︎', 'rel', 'https://fontcuping.com/', 'Q&#857;', 'M&#828;', '1&#830;', '&#1028;', 'K&#828;', '★·.·´¯`·.·★\x20', '⎝⎝✧GͥOͣDͫ✧⎠⎠\x20[[text]]\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', 'v&#846;', '&#120440;&#823;', 'I&#838;', 'p&#799;', 'R&#857;', '&#41081;', 'middle', '•°¯`••\x20', '&#1344;', '9&#830;', '5&#829;&#851;', 'Q&#826;', '&#41105;', '&#10003;', '&#9835;', '&#5741;', '&#410;', 'Q&#846;', 'pop', '.tildeStrikeThrough', 'T&#857;', 'G&#857;', 'randomization', '&#5511;', 'random', '(人◕‿◕)', '&#120435;&#823;', 'squiggle5CharMapFun', '&#1085;', '🕮︎', '&#391;', '&#9687;', '&#1065;', '&#120471;&#823;', 'I&#857;', '&#385;', 'M&#866;', 'c&#866;', 't&#826;', '&#120454;&#823;', 'U&#829;&#851;', '&#120465;&#823;', 'b&#829;&#851;', '\x22\x20class=\x22', '.lunitoolsmirrorencode', 'n&#846;', '5&#828;', '&#351;', '&#41203;', '&#1179;', 'i&#828;', 's&#826;', 'I&#829;&#851;', '^ㅂ^', '&#41433;', 'I&#828;', 'invertedSquaresCharMapFun', 'n&#826;', 'test', '&#541;', '&#120445;&#823;', 'flip', '🖰︎', '9&#826;', '.flourish8', 'd&#829;&#851;', '&#12579;', 'squares', 'c&#857;', '.squaresCharMap', ']|I{•------»\x20[[text]]\x20«------•}I|[', '&#120461;&#823;', '💧︎', '2575118kclQiN', '.underline', '&#3923;', 'animate', '&kappa;', 'ᵔ⌣ᵔ', 'N&#857;', 'L&#866;', '.result-s25', '#y2kcredit:visible', 'X&#838;', '&#1340;', '&#19973;', '&#41555;', '&#9837;', 'h&#857;', 'i&#829;&#851;', '&#3588;', '&#42148;', '&#400;', '9&#838;', '.flourish4', 'i&#857;', '&#41029;', '▌│█║▌║▌║\x20', '&#4357;', '&#614;', '&#1047;', 'h&#830;', 'toUpperCase', '&#41295;', 'U&#866;', 'S&#828;', '&#315;', '&#41037;', '4&#857;', 'asianStyleCharMapFun', 'bottom', '&#1063;', '&#327;', '.result-s7', 'q&#857;', '📫︎', 'q&#829;&#851;', 'N&#799;', 'x&#826;', 'w&#857;', 's25', '.scriptify', 'リサフランク現代のコンピュ竹内\x20まりや若者が履く流行のスニーカー真夜中のドアホットドッグマスターストライカーソニーブギ新しい日の誕生ライフ\x20-\x20ヒスイ蒸気波\x20無線゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゙゚゛゜ゝゞゟ亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育壱逸茨芋引印因咽姻員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科', '&#972;', 'G&#828;', '&#1178;', 'p&#846;', '1142261kTdPVp', '1800940MvpSxj', 'U&#857;', 'Y&#828;', '.•°¤*(¯`★´¯)*¤°\x20', 'H&#826;', 'r&#846;', '5&#866;', '&#41240;', '💣︎', '&#608;', '&#1193;', 'z&#799;', '&#5205;', '&#40996;', '&#9736;', '&#291;', 'upperAnglesCharMapFun', '•._.••´¯``•.¸¸.•`\x20', 'cookie', '0&#799;', 'c&#830;', '&#120462;&#823;', 'contentEditable', 'k&#866;', '&#613;', '&#5196;', 't&#830;', 'O&#828;', 'Z&#799;', '&#549;', 'f&#866;', 'V&#838;', 'e&#829;&#851;', 'y&#826;', 't&#846;', '3&#838;', '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', 'kirbyHug', '&sigma;', '🖴︎', 'greekCharMapFun', '&#x', '★·.·´¯`·.·★\x20[[text]]\x20★·.·´¯`·.·★', '«-(¯`v´¯)-«\x20[[text]]\x20»-(¯`v´¯)-»', 'k&#828;', '&#651;', 'K&#866;', '&#4329;', 'o&#799;', 'charCodeAt', '••.•´¯`•.••\x20', 'c&#838;', '&fnof;', '๑۞๑,¸¸,ø¤º°`°๑۩\x20', 's21', '&#41571;', 'v&#826;', '&#416;', '&psi;', '🕈︎', '8&#846;', '&#2749;', '<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22Press\x20CTRL+C\x20to\x20copy\x22\x20/></p>', 'N&#846;', 'c&#829;&#851;', '&#484;', '🖂︎', 'wavyJoiner', '.squiggle4CharMap', '&Mu;', '&#40983;', '&#1358;', '&#120446;&#823;', '3&#829;&#851;', '(Y)', 'y&#846;', 'U&#830;', '.result-s14', 'F&#799;', 'a&#866;', '&#41556;', '&#1090;', '&szlig;', '&#41074;', '(≧◡≦)', '&#41708;', '.lunisquares', '2&#866;', 'm&#857;', 'Y&#857;', 'firework', 'recenttext', '•´¯`•.\x20[[text]]\x20.•´¯`•', 'Z&#866;', '&#8467;', 'r&#857;', '•]••´º´•»\x20', 'y&#829;&#851;', 'K&#826;', '&#9730;', 'b&#857;', 'u&#838;', 'J&#830;', '&#276;', '♪ღ♪*•.¸¸.•*¨¨*•.♪\x20[[text]]\x20♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪', '&#422;', '&#1079;', '&#10122;', 'i&#826;', '&#2797;', '&#987;', '🕆︎', '.flourish2', 'w&#828;', '&#1223;', '&#41005;', 'i&#838;', 'q&#866;', 'n&#830;', '&sigmaf;', 'px}\x20</style>', '&#625;', 'd&#830;', '&#2794;', '&#120480;&#823;', '&#120451;&#823;', 'ready', 'fadeIn', 'B&#866;', '.oldEnglishCharMap', 's19', '&#412;', '&#618;', '&#447;', 'P&#828;', 'P&#799;', '&#7990;', 'roundsquares', 'l&#866;', '(y)', '&#428;', 'a&#846;', '&chi;', 'U&#826;', '&#392;', '&#12425;', '&#381;', 'show', '&#120828;&#823;', 'F&#846;', 'createRange', 's16', '#loader', 'h&#828;', '°°°·.°·..·°¯°·._.·\x20', '.lunicreepify', '&#645;', 's23', 'U&#838;', '&#1139;', 'O&#799;', '1&#846;', '&#41706;', 'A&#846;', '&part;', '&#1185;', 'maxHeight', '【$1】', '••¤(`×[¤\x20[[text]]\x20¤]×´)¤••', '&#1059;', '&#639;', 'C&#838;', '&#272;', 's20', '2&#799;', '🗄︎', '&otilde;', '&#41922;', '0&#830;', '&#7828;', '&#23610;', 'W&#828;', 'B&#826;', 'L&#826;', '&Oslash;', '.asianStyleCharMap', '7&#830;', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20[[text]]\x20¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', '&#40974;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20[[text]]\x20█\x20▇\x20▆\x20▅\x20▄\x20▂\x20▁', 'recentlist', 's10', '.result-s15', 's31', 'X&#857;', 'X&#846;', 'trim', 'w&#799;', 'j&#828;', '&#670;', 'decode', 'B&#846;', 'm&#799;', '.greekCharMap', '&#409;', '&#356;', 'w&#830;', '📭︎', 'hide', 'd&#838;', '¸¸♬·¯·♩¸¸♪·¯·♫¸¸\x20[[text]]\x20¸¸♫·¯·♪¸¸♩·¯·♬¸¸', '&nu;', 'L&#838;', 'nodeName', '&#5623;', '&#5597;', '.result-s26', '&#2798;', '.firework', 'cursiveCharMapFun', '&#10128;', 'amd', 't&#829;&#851;', '&#5029;', '&#120459;&#823;', '&#41674;', '📁︎', '&#1333;', '.result-s31', '👍︎', '&#5615;', '<br>\x0a', '.subscriptCharMap', 'readOnly', '&euro;', 'Y&#846;', '&#2790;', '&#9815;', '&#120432;&#823;', 'getSelection', '&#1060;', '&#1360;', '&#423;', '&#1348;', 's(^‿^)-b', '&#1094;', '&#10129;', 'boldItalicCharMapFun', '.boldItalicCharMap', 'W&#829;&#851;', 'F&#828;', 'p&#826;', 'x&#866;', '&#2799;', '&#8627;', 'creepify', 'floor', '&#120434;&#823;', '&#120473;&#823;', 'selectNodeContents', '&#1488;', 'encode', '&#120457;&#823;', 'S&#838;', 'U&#799;', '6&#829;&#851;', '8&#826;', 'moveToElementText', 'C&#830;', 'O&#829;&#851;', 'fixedtop', '&phi;', '&#120827;&#823;', '🕓︎', 'J&#866;', '&#358;', '0&#838;', '0&#829;&#851;', 'p&#857;', '.result-s11', 'object', '&#10123;', '░▒▓█\x20[[text]]\x20█▓▒░', 'Y&#829;&#851;', '&#9761;', '&#41346;', '&#638;', 'D&#838;', 'K&#829;&#851;', '5&#830;', '&#336;', '&#1138;', '꧁𓊈𒆜\x20[[text]]\x20𒆜𓊉꧂', '—(••÷', '(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧', 'F&#829;&#851;', '.invertedSquaresCharMap', 'addRange', '&#943;', '.squiggle3CharMap', 'j&#826;', 'scriptify', '&#41266;', 'options', '&#41141;', 'Z&#830;', '&#438;', 'w&#846;', 'C&#829;&#851;', '&#985;', 'tiny', 'init', 'addClass', '&#1071;', '.result-s5', 'G&#826;', '🖮︎', '&#8857;', '4&#799;', '\x20⋆\x20', '&#1171;', '.stylenamerecentlist\x20.stylename', 'copy', '&#1008;', 'R&#830;', 'M&#830;', '&#1048;', '&#41157;', 'w&#866;', 'D&#857;', 'userAgent', '&#20057;', '&#1074;', 'ᵔᴥᵔ', '&#5198;', '&#5397;', 's22', 'z&#846;', 'replace', 'removeAllRanges', 'mapInverse', 'asianStyle2CharMapFun', '🖫︎', 'd&#826;', '&#120479;&#823;', '.bentTextCharMap', 'e&#828;', '&#120824;&#823;', 'j&#866;', 'F&#866;', 'Y&#838;', '&#350;', 'S&#846;', '`•.,¸¸,.•´¯\x20', '&#1062;', '.stylenamelist', '◥꧁ད\x20ॐ卐[[text]]\x20卐ॐ\x20ཌ꧂◤', '❀◕‿◕❀', 'l&#830;', 'subscriptCharMapFun', '.copied', '.result-s29', 'j&#846;', 'H&#838;', 'execCommand', '6&#828;', '&#120470;&#823;', '(-_-)\x20[[text]]\x20(-_-)', 'n&#838;', '.flourish5', '&#5262;', 'g&#857;', 'split', 'body', 'v&#828;', '&#5620;', '9&#828;', '.lunitoolsflipencode', 'click', 'w&#838;', 'v&#866;', '_blank', 'Y&#826;', '&#2792;', '&#120438;&#823;', '1&#857;', '-·=»‡«=·-\x20[[text]]\x20-·=»‡«=·-', '&#1283;', '(｡◕‿◕｡)', 'href', '.result-s1', '&#1052;', 'J&#828;', '&#41053;', '.result-s10', '&#120478;&#823;', '</p></div>', '&#41392;', '&#41804;', '5644212QyHTeo', 'heartsBetween', '&#1041;', 's11', '&#120466;&#823;', '.clear', 'w&#829;&#851;', '&#1140;', '&#2414;', '&#41007;', '┗(^o^\x20)┓三\x20[[text]]\x20三\x20┗(^o^\x20)┓', '&#42150;', '&#435;', 'E&#830;', 'j&#857;', '&#1331;', '&#9834;', 'y&#830;', '&#41991;', 'd&#799;', 'K&#846;', '&#120472;&#823;', '$2$1', 'vaporwaveText', '.littleSparkles', '&#5609;', 'W&#838;', '&#41079;', '∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ\x20[[text]]\x20ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙', '&alpha;', 'i&#846;', 'P&#857;', '&#1210;', '🗐︎', '&#41712;', '.thickBlockFramed', '.rand', '◥꧁ད\x20[[text]]\x20ཌ꧂◤', '&#311;', '🕐︎', 'Q&#838;', 'fullCrazy', '&#407;', 'y&#857;', '&#403;', 'class', 's30', '`•.¸¸.•´´¯`••._.•\x20', '&#988;', '(¯´•._.•\x20', 'r&#826;', 's&#866;', '[̲̅$1]', '🖃︎', 'v&#799;', '&#41246;', '&#1337;', '&#120442;&#823;', '.flourish6', 'Q&#829;&#851;', '6&#838;', 'g&#838;', 'K&#857;', '.result-s4', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', 'I&#846;', '&#5290;', 'crossAboveBelow', '🏱︎', 'e&#866;', 'X&#828;', 'f&#799;', '꧁༒༻☬ད\x20[[text]]\x20ཌ☬༺༒꧂', 't&#799;', 'toLowerCase', 'a&#826;', 'T&#826;', 'q&#830;', 'r&#830;', '.stylenamerecentlist', 'J&#857;', '&#1359;', 'I&#799;', 'ღ(¯`◕‿◕´¯)\x20♫\x20♪\x20♫\x20[[text]]\x20♫\x20♪\x20♫\x20(¯`◕‿◕´¯)ღ', '&#377;', 'T&#846;', '(¯`*•.¸,¤°´✿.｡.:*\x20[[text]]\x20*.:｡.✿`°¤,¸.•*´¯)', 'O&#838;', '◕‿◕', '&#120453;&#823;', 'k&#838;', 'j&#838;', 'fromCharCode', 'e&#838;', '&#633;', '5&#857;', 'c&#799;', '•?((¯°·._.•\x20[[text]]\x20•._.·°¯))؟•', '(¯`·.¸¸.->\x20°º\x20', '••.•´¯`•.••\x20[[text]]\x20••.•´¯`•.••', '&#12552;', '&#8134;', '&#9773;', '&#1351;', '.stinky', '7&#866;', '.monospaceCharMap', 'squiggle4CharMapFun', '&#627;', 'squiggleCharMapFun', '2&#828;', '&#989;', '&#1338;', '&#1202;', 'A&#799;', '&#41648;', 'length', '&#9450;', '5&#799;', '&#292;', '&#120437;&#823;', 'G&#829;&#851;', '9&#846;', '.wingdings', '4&#838;', '╚»★«╝\x20[[text]]\x20╚»★«╝', 'Q&#830;', 'p&#830;', '7&#826;', '&#429;', 't&#857;', 'b&#826;', 'L&#830;', 'O&#830;', '&epsilon;', '&#1092;', '&#3057;', '&#41823;', '🕑︎', '4&#866;', '&#607;', '.flourish1', '&#654;', '4&#830;', '.kirbyHug', 'B&#830;', 'A&#828;', '.result-s19', '.italicCharMap', 'S&#799;', '.leftsection', '｡*ﾟ.*.｡(っ\x20ᐛ\x20)っ✂╰⋃╯\x20[[text]]', '🕭︎', '&#1040;', 'J&#826;', 'indexOf', 'R&#829;&#851;', '&#434;', '&#4331;', '&#382;', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', '8&#866;', 'E&#828;', 's26', '&#41751;', '&#262;', '&#8023;', '7&#846;', 'Z&#857;', 'h&#838;', 'H&#846;', 'c&#846;', '¸,ø¤º°`°º¤ø,¸\x20[[text]]\x20¸,ø¤º°`°º¤ø,¸', 'h&#866;', 'g&#828;', '5&#846;', 'ıllıllı\x20', '&#313;', 'f&#826;', '&yen;', 'neonCharMapFun', '&#120831;&#823;', 'doubleStruckCharMapFun', 'l&#838;', '&#1084;', 'B&#857;', 'M&#799;', 'text', 'd&#828;', 'mirror', 's&#829;&#851;', 'z&#838;', '#load-more', '✿.｡.:*\x20☆:**:.\x20[[text]]\x20.:**:.☆*.:｡.✿', 'g&#846;', '&#996;', '&#420;', '&#4330;', 'A&#857;', 'R&#838;', '<:::::[]=¤\x20[[text]]\x20(▀̿̿Ĺ̯̿̿▀̿\x20̿)', '359109CSAYPE', 's&#838;', '&#41754;', 'X&#799;', 'L&#828;', '.result-s8', 'Z&#828;', '&#42130;', '-漫~*\x27¨¯¨\x27*·舞~\x20[[text]]\x20~舞*\x27¨¯¨\x27*·~漫-', '&#286;', 'prepend', '[[text]]', '&#5845;', '&#8984;', '&#120456;&#823;', '&#1350;', 'squaresCharMapFun', ',-*\x27^\x27~*-.,_,.-*~\x20', '&#1078;', '&#65420;', 'E&#866;', 'f&#829;&#851;', 't&#866;', 'boldCharMapFun', '&#120475;&#823;', 'l&#829;&#851;', '2&#829;&#851;', 'g&#826;', 'italicCharMapFun', '&#940;', 'm&#846;', '&#1103;', '&#3648;', 'push', 'q&#826;', '§.•´¨\x27°÷•..×\x20', '&ugrave;', 'x&#830;', 'A&#866;', '.dottyJoiner', 'map', '|!¤*\x27~``~\x27*¤!|\x20[[text]]\x20|!¤*\x27~``~\x27*¤!|', '٩(˘◡˘)۶', '&#120823;&#823;', 'squiggle2CharMapFun', 'C&#857;', 'setSelectionRange', 'S&#866;', '&oplus;', 'setAttribute', 'futureAlienCharMapFun', 'dottyJoiner', '(ɔ◔‿◔)ɔ', '【｡_｡】\x20[[text]]\x20【｡_｡】', '.leftsection\x20.close', '◔◡◔', 'b&#828;', '&#7433;', '&#295;', '🗏︎', '&#7918;', '】〗〙〛］', '.result-s6', '¸„.-•~¹°”ˆ˜¨\x20', '&#1330;', '&#669;', '.superscriptCharMap', '🕙︎', '7&#838;', '&#1056;', 'T&#828;', '&thorn;', '&#4335;', '&Uacute;', '&#1342;', '&#4315;', 'H&#799;', '░▒▓█►─═\x20\x20[[text]]\x20═─◄█▓▒░', '(づ｡◕‿‿◕｡)づ', '&#4336;', 'G&#866;', '&#120469;&#823;', '▀▄▀▄▀▄\x20', 'a&#857;', 'Q&#828;', '.lunitoolstinyencode', 'U&#828;', '&#2670;', '&#42180;', '.result-s22', 'K&#799;', 'diacriticsMiddle', '&#41949;', 'location', '&#4318;', '2&#830;', '4&#826;', '1366608DNQYlD', '(✿◕ᗜ◕)━♫.*･｡ﾟ', 'k&#857;', '—(••÷[\x20[[text]]\x20]÷••)—', '🕗︎', '&#120822;&#823;', '2&#846;', 'append', '&#4327;', '&#42075;', '.result-s27', '&#308;', 'F&#826;', 'b&#846;', 'o&#857;', 'f&#857;', 'D&#846;', '&#1397;', '(✿^▽^)', '3&#866;', '.wideTextCharMap', '#scroll', '&#10081;', '§.•´¨\x27°÷•..×\x20[[text]]\x20×,.•´¨\x27°÷•..§', 'q&#828;', '&beta;', '&#1112;', '&#5616;', '&#120474;&#823;', '&#41155;', '&#41120;', '&upsilon;', 'R&#799;', 'I&#830;', '&micro;', '.font-generator', 'K&#830;', 'max', 'bentTextCharMapFun', '&#41863;', 'z&#826;', ',-*\x27\x20^\x20\x27~*-.,_,.-*~\x20[[text]]\x20~*-.,_,.-*~\x27\x20^\x20\x27*-,', '&#42015;', '୧(•̀ᗝ•́)૭\x20[[text]]\x20୧(⇀‸↼‶)૭', '•´¯`•.\x20', '『$1』', '¸,ø¤º°`°º¤ø,¸\x20', 'V&#830;', '&#1213;', 'h&#846;', '&#41076;', '🕒︎', '&#120450;&#823;', 'A&#830;', 'n&#829;&#851;', '5&#838;', '•?((¯°·._.•\x20', 'c&#826;', '&#296;', 'f&#830;', 'a&#830;', '&#5610;', '👎︎', '.crossAboveBelow', '#mobile-fly-menu', '(/◔◡◔)/', 'insertBefore', '&#41080;', '▌│█║▌║▌║\x20[[text]]\x20║▌║▌║█│▌', '*•.¸♡\x20[[text]]\x20♡¸.•*', 'C&#826;', '&#120444;&#823;', '.slashThrough'];
    _0x523c = function() {
        return _0x2bf7d1;
    };
    return _0x523c();
}

function monospaceCharMapFun(_0x413798) {
    return applyCharMap(monospaceCharMap, _0x413798);
}

function upperAnglesCharMapFun(_0x55565b) {
    return applyCharMap(upperAnglesCharMap, _0x55565b);
}

function greekCharMapFun(_0x448f84) {
    return applyCharMap(greekCharMap, _0x448f84);
}

function symbolsCharMapFun(_0x2b6492) {
    return applyCharMap(symbolsCharMap, _0x2b6492);
}

function currencyCharMapFun(_0x5e07f8) {
    return applyCharMap(currencyCharMap, _0x5e07f8);
}

function asianStyleCharMapFun(_0x51e0ee) {
    return applyCharMap(asianStyleCharMap, _0x51e0ee);
}

function asianStyle2CharMapFun(_0x2e492c) {
    return applyCharMap(asianStyle2CharMap, _0x2e492c);
}
var luni = new Lunicode();
luni[_0x55dc6e(0x628)]['creepify']['options'][_0x55dc6e(0x325)] = 0xa;

function crazyWithFlourishOrSymbols(_0x306f8a) {
    var _0x2a5e44 = _0x55dc6e;
    if (Math[_0x2a5e44(0x217)]() < 0.7) return wrapInSymbols(crazifyText(_0x306f8a), 0x2);
    else return wrapInFlourish(crazifyText(_0x306f8a), 0x2);
}

function strikeThrough(_0x1c75e0) {
    var _0x360f7f = _0x55dc6e;
    return _0x1c75e0[_0x360f7f(0x3f3)]('')[_0x360f7f(0x1a5)]('̶') + '̶';
}

function tildeStrikeThrough(_0x1e9f9b) {
    var _0x2d40a5 = _0x55dc6e;
    return _0x1e9f9b[_0x2d40a5(0x3f3)]('')[_0x2d40a5(0x1a5)]('̴') + '̴';
}

function underline(_0x5e6393) {
    var _0x5509ce = _0x55dc6e;
    return _0x5e6393['split']('')[_0x5509ce(0x1a5)]('̲') + '̲';
}

function doubleUnderline(_0x19d2aa) {
    var _0x2b4d45 = _0x55dc6e;
    return _0x19d2aa[_0x2b4d45(0x3f3)]('')[_0x2b4d45(0x1a5)]('̳') + '̳';
}

function slashThrough(_0x4db933) {
    var _0x316d6c = _0x55dc6e;
    return _0x4db933[_0x316d6c(0x3f3)]('')[_0x316d6c(0x1a5)]('̷') + '̷';
}

function stinky(_0x11319a) {
    var _0x502cb6 = _0x55dc6e;
    return _0x11319a[_0x502cb6(0x3f3)]('')[_0x502cb6(0x1a5)]('̾') + '̾';
}

function heartsBetween(_0x3488d8) {
    var _0x58e0b3 = _0x55dc6e;
    return _0x3488d8[_0x58e0b3(0x3f3)]('')['join']('♥');
}

function arrowBelow(_0x5f383e) {
    var _0xd0b5cc = _0x55dc6e;
    return _0x5f383e['split']('')[_0xd0b5cc(0x1a5)]('͎') + '͎';
}

function crossAboveBelow(_0x3612b0) {
    var _0x3dcb54 = _0x55dc6e;
    return _0x3612b0[_0x3dcb54(0x3f3)]('')['join']('͓̽') + '͓̽';
}
var f = {};

function _0x4a74(_0x59c802, _0x4c94e1) {
    var _0x523c8f = _0x523c();
    return _0x4a74 = function(_0x4a745b, _0x36d5c6) {
        _0x4a745b = _0x4a745b - 0x194;
        var _0x3455f0 = _0x523c8f[_0x4a745b];
        return _0x3455f0;
    }, _0x4a74(_0x59c802, _0x4c94e1);
}
f['0'] = _0x55dc6e(0x361), f['1'] = _0x55dc6e(0x1b8), f['2'] = '📄︎', f['3'] = _0x55dc6e(0x512), f['4'] = _0x55dc6e(0x42f), f['5'] = _0x55dc6e(0x32e), f['6'] = '⌛︎', f['7'] = _0x55dc6e(0x3bb), f['8'] = _0x55dc6e(0x23d), f['9'] = _0x55dc6e(0x683), f['!'] = '✏︎', f['\x22'] = '✂︎', f['#'] = '✁︎', f['$'] = '👓︎', f['%'] = _0x55dc6e(0x4a6), f['&'] = _0x55dc6e(0x21c), f['\x27'] = '🕯︎', f['('] = _0x55dc6e(0x5ff), f[')'] = '✆︎', f['*'] = _0x55dc6e(0x2c1), f['+'] = _0x55dc6e(0x443), f[','] = _0x55dc6e(0x5ad), f['-'] = _0x55dc6e(0x272), f['.'] = '📬︎', f['/'] = _0x55dc6e(0x34e), f[':'] = _0x55dc6e(0x669), f[';'] = _0x55dc6e(0x2a6), f['<'] = _0x55dc6e(0x3d5), f['='] = '🖬︎', f['>'] = '✇︎', f['?'] = '✍︎', f['A'] = '✌︎', f['B'] = '👌︎', f['C'] = _0x55dc6e(0x364), f['D'] = _0x55dc6e(0x576), f['E'] = '☜︎', f['F'] = '☞︎', f['G'] = '☝︎', f['H'] = '☟︎', f['I'] = '✋︎', f['J'] = '☺︎', f['K'] = _0x55dc6e(0x1f5), f['L'] = '☹︎', f['M'] = _0x55dc6e(0x287), f['N'] = '☠︎', f['O'] = '⚐︎', f['P'] = _0x55dc6e(0x452), f['Q'] = '✈︎', f['R'] = '☼︎', f['S'] = _0x55dc6e(0x247), f['T'] = '❄︎', f['U'] = _0x55dc6e(0x2ee), f['V'] = '✞︎', f['W'] = _0x55dc6e(0x2ba), f['X'] = '✠︎', f['Y'] = '✡︎', f['Z'] = '☪︎', f['['] = '☯︎', f['\x5c'] = 'ॐ︎', f[']'] = '☸︎', f['^'] = '♈︎', f['_'] = '♉︎', f['`'] = '♊︎', f['a'] = '♋︎', f['b'] = '♌︎', f['c'] = '♍︎', f['d'] = '♎︎', f['e'] = '♏︎', f['f'] = '♐︎', f['g'] = '♑︎', f['h'] = '♒︎', f['i'] = '♓︎', f['j'] = '🙰', f['k'] = '🙵', f['l'] = '●︎', f['m'] = '❍︎', f['n'] = '■︎', f['o'] = '□︎', f['p'] = '◻︎', f['q'] = '❑︎', f['r'] = '❒︎', f['s'] = '⬧︎', f['t'] = '⧫︎', f['u'] = '◆︎', f['v'] = '❖︎', f['w'] = '⬥︎', f['x'] = '⌧︎', f['y'] = '⍓︎', f['z'] = '⌘︎', f['{'] = '❀︎', f['|'] = '✿︎', f['}'] = '❝︎', f['~'] = '❞︎', f['\x20'] = '▯︎', f['€'] = '⓪︎', f['\x20'] = '①︎', f['‚'] = '②︎', f['ƒ'] = '③︎', f['„'] = '④︎', f['…'] = '⑤︎', f['†'] = '⑥︎', f['‡'] = '⑦︎', f['ˆ'] = '⑧︎', f['‰'] = '⑨︎', f['Š'] = '⑩︎', f['‹'] = '⓿︎', f['Œ'] = '❶︎', f['\x20'] = '❷︎', f['Ž'] = '❸︎', f['\x20'] = '❹︎', f['\x20'] = '❺︎', f['‘'] = '❻︎', f['’'] = '❼︎', f['“'] = '❽︎', f['”'] = '❾︎', f['•'] = '❿︎', f['–'] = '◻︎', f['—'] = '◻︎', f['˜'] = '◻︎', f['™'] = '◻︎', f['š'] = '◻︎', f['›'] = '◻︎', f['œ'] = '◻︎', f['\x20'] = '◻︎', f['ž'] = '·︎', f['Ÿ'] = '•︎', f['¡'] = '○︎', f['¢'] = '⭕︎', f['£'] = '◻︎', f['¤'] = '◉︎', f['¥'] = '◎︎', f['¦'] = '◻︎', f['§'] = '▪︎', f['¨'] = '◻︎', f['©'] = '◻︎', f['ª'] = '✦︎', f['«'] = '★︎', f['¬'] = '✶︎', f['®'] = '✹︎', f['¯'] = '✵︎', f['°'] = '◻︎', f['±'] = '⌖︎', f['²'] = '⟡︎', f['³'] = '⌑︎', f['´'] = '◻︎', f['µ'] = '✪︎', f['¶'] = '✰︎', f['·'] = _0x55dc6e(0x435), f['¸'] = _0x55dc6e(0x498), f['¹'] = _0x55dc6e(0x56b), f['º'] = _0x55dc6e(0x390), f['»'] = '🕔︎', f['¼'] = '🕕︎', f['½'] = _0x55dc6e(0x5b3), f['¾'] = _0x55dc6e(0x53c), f['¿'] = _0x55dc6e(0x63e), f['À'] = _0x55dc6e(0x51a), f['Á'] = _0x55dc6e(0x645), f['Â'] = '🕛︎', f['Ã'] = '◻︎', f['Ä'] = '◻︎', f['Å'] = '◻︎', f['Æ'] = '◻︎', f['Ç'] = '◻︎', f['È'] = '◻︎', f['É'] = '◻︎', f['Ê'] = '◻︎', f['Ë'] = '◻︎', f['Ì'] = '◻︎', f['Í'] = '◻︎', f['Î'] = '◻︎', f['Ï'] = '◻︎', f['Ð'] = '◻︎', f['Ñ'] = '◻︎', f['Ò'] = '◻︎', f['Ó'] = '◻︎', f['Ô'] = '◻︎', f['Õ'] = '⌫︎', f['Ö'] = '⌦︎', f['×'] = '◻︎', f['Ø'] = '➢︎', f['Ù'] = '◻︎', f['Ú'] = '◻︎', f['Û'] = '◻︎', f['Ü'] = '➲︎', f['Ý'] = '◻︎', f['Þ'] = '◻︎', f['ß'] = '◻︎', f['à'] = '◻︎', f['á'] = '◻︎', f['â'] = '◻︎', f['ã'] = '◻︎', f['ä'] = '◻︎', f['å'] = '◻︎', f['æ'] = '◻︎', f['ç'] = '◻︎', f['è'] = '➔︎', f['é'] = '◻︎', f['ê'] = '◻︎', f['ë'] = '◻︎', f['ì'] = '◻︎', f['í'] = '◻︎', f['î'] = '◻︎', f['ï'] = '⇦︎', f['ð'] = '⇨︎', f['ñ'] = '⇧︎', f['ò'] = '⇩︎', f['ó'] = '⬄︎', f['ô'] = '⇳︎', f['õ'] = '⬀︎', f['ö'] = '⬁︎', f['÷'] = '⬃︎', f['ø'] = '⬂︎', f['ù'] = '▭︎', f['ú'] = '▫︎', f['û'] = '✗︎', f['ü'] = '✓︎', f['ý'] = '☒︎', f['þ'] = '☑︎', f['ÿ'] = '◻︎';
const wingdingsCharMap = f;

function wingdings(_0x5462e8) {
    var _0x3b1780 = _0x55dc6e;
    return _0x5462e8[_0x3b1780(0x3f3)]('')[_0x3b1780(0x4ff)](function(_0x42e013) {
        return wingdingsCharMap[_0x42e013] ? wingdingsCharMap[_0x42e013] : _0x42e013;
    })[_0x3b1780(0x1a5)]('');
}
var g = {};
g['\x20'] = '\u3000', g['`'] = '`', g['1'] = '１', g['2'] = '２', g['3'] = '３', g['4'] = '４', g['5'] = '５', g['6'] = '６', g['7'] = '７', g['8'] = '８', g['9'] = '９', g['0'] = '０', g['-'] = '－', g['='] = '＝', g['~'] = '~', g['!'] = '！', g['@'] = '＠', g['#'] = '＃', g['$'] = '＄', g['%'] = '％', g['^'] = '^', g['&'] = '＆', g['*'] = '＊', g['('] = '（', g[')'] = '）', g['_'] = '_', g['+'] = '＋', g['q'] = 'ｑ', g['w'] = 'ｗ', g['e'] = 'ｅ', g['r'] = 'ｒ', g['t'] = 'ｔ', g['y'] = 'ｙ', g['u'] = 'ｕ', g['i'] = 'ｉ', g['o'] = 'ｏ', g['p'] = 'ｐ', g['['] = '[', g[']'] = ']', g['\x5c'] = '\x5c', g['Q'] = 'Ｑ', g['W'] = 'Ｗ', g['E'] = 'Ｅ', g['R'] = 'Ｒ', g['T'] = 'Ｔ', g['Y'] = 'Ｙ', g['U'] = 'Ｕ', g['I'] = 'Ｉ', g['O'] = 'Ｏ', g['P'] = 'Ｐ', g['{'] = '{', g['}'] = '}', g['|'] = '|', g['a'] = 'ａ', g['s'] = 'ｓ', g['d'] = 'ｄ', g['f'] = 'ｆ', g['g'] = 'ｇ', g['h'] = 'ｈ', g['j'] = 'ｊ', g['k'] = 'ｋ', g['l'] = 'ｌ', g[';'] = '；', g['\x27'] = '＇', g['A'] = 'Ａ', g['S'] = 'Ｓ', g['D'] = 'Ｄ', g['F'] = 'Ｆ', g['G'] = 'Ｇ', g['H'] = 'Ｈ', g['J'] = 'Ｊ', g['K'] = 'Ｋ', g['L'] = 'Ｌ', g[':'] = '：', g['\x22'] = '\x22', g['z'] = 'ｚ', g['x'] = 'ｘ', g['c'] = 'ｃ', g['v'] = 'ｖ', g['b'] = 'ｂ', g['n'] = 'ｎ', g['m'] = 'ｍ', g[','] = '，', g['.'] = '．', g['/'] = '／', g['Z'] = 'Ｚ', g['X'] = 'Ｘ', g['C'] = 'Ｃ', g['V'] = 'Ｖ', g['B'] = 'Ｂ', g['N'] = 'Ｎ', g['M'] = 'Ｍ', g['<'] = '<', g['>'] = '>', g['?'] = '？';
const vaporwaveCharMap = g;

function vaporwaveText(_0x7063da) {
    var _0x3dab13 = _0x55dc6e,
        _0x187ff3 = _0x7063da[_0x3dab13(0x3f3)]('\x20')['length'];
    _0x7063da = applyCharMap(vaporwaveCharMap, _0x7063da);
    var _0xc94911 = getAsianChars(Math[_0x3dab13(0x55d)](0x3, _0x187ff3));
    if (_0x187ff3 > 0x6) _0xc94911 = _0xc94911[_0x3dab13(0x3f3)]('')[_0x3dab13(0x4ff)](_0x1ce733 => _0x1ce733 + ['', ''][Math[_0x3dab13(0x1e9)](Math[_0x3dab13(0x217)]() * 0.6)])['join']('');
    var _0x3793a9 = [];
    return _0x3793a9['push'](_0x7063da), _0x3793a9[_0x3dab13(0x1a5)]();
}

function vaporwaveText1(_0x8dbeb1) {
    var _0x1e1118 = _0x55dc6e,
        _0x4cd27f = _0x8dbeb1[_0x1e1118(0x3f3)]('\x20')['length'];
    _0x8dbeb1 = applyCharMap(vaporwaveCharMap, _0x8dbeb1);
    var _0x37655e = getAsianChars(Math['max'](0x3, _0x4cd27f));
    if (_0x4cd27f > 0x6) _0x37655e = _0x37655e[_0x1e1118(0x3f3)]('')[_0x1e1118(0x4ff)](_0x2f8bbd => _0x2f8bbd + ['', ''][Math[_0x1e1118(0x1e9)](Math['random']() * 0.6)])[_0x1e1118(0x1a5)]('');
    var _0x5d418b = [];
    return _0x5d418b['push'](_0x8dbeb1[_0x1e1118(0x3d1)](/　/g, '░')['replace'](/ａｅ/, 'æ')[_0x1e1118(0x3d1)](/Ａ/g, 'Λ')[_0x1e1118(0x3d1)](/Ｅ/g, function() {
        return Math['random']() > 0.5 ? 'Ξ' : 'Σ';
    })[_0x1e1118(0x3d1)](/Ｏ/g, '♢')), _0x5d418b['join']();
}

function vaporwaveText2(_0x4819d8) {
    var _0x250dbf = _0x55dc6e,
        _0x22f077 = _0x4819d8[_0x250dbf(0x3f3)]('\x20')[_0x250dbf(0x482)];
    _0x4819d8 = applyCharMap(vaporwaveCharMap, _0x4819d8);
    var _0x2cf239 = getAsianChars(Math[_0x250dbf(0x55d)](0x3, _0x22f077));
    if (_0x22f077 > 0x6) _0x2cf239 = _0x2cf239[_0x250dbf(0x3f3)]('')['map'](_0x36c4bd => _0x36c4bd + ['', ''][Math['round'](Math[_0x250dbf(0x217)]() * 0.6)])['join']('');
    var _0x342d9b = [];
    return _0x342d9b[_0x250dbf(0x4f8)]('【\ufeff' + _0x4819d8 + '】'), _0x342d9b[_0x250dbf(0x1a5)]();
}

function getAsianChars(_0x8900e0) {
    var _0x1cc347 = _0x55dc6e;
    if (!_0x8900e0) _0x8900e0 = 0x1;
    var _0x4a1dec = _0x1cc347(0x279),
        _0x4e028c = '';
    for (var _0x1885b0 = 0x0; _0x1885b0 < _0x8900e0; _0x1885b0++) {
        _0x4e028c += _0x4a1dec[Math[_0x1cc347(0x37f)](Math[_0x1cc347(0x217)]() * _0x4a1dec['length'])];
    }
    return _0x4e028c;
}
const flourishArray = ['꧁༒☬\x20[[text]]\x20☬༒꧂', _0x55dc6e(0x433), _0x55dc6e(0x2a9), _0x55dc6e(0x620), _0x55dc6e(0x456), _0x55dc6e(0x2e7), _0x55dc6e(0x3e3), _0x55dc6e(0x676), 'ღƪ(ˆ◡ˆ)ʃ♡\x20[[text]]\x20♡ƪ(ˆ◡ˆ)ʃ♪', '[[text]]\x20☜(`o´)', _0x55dc6e(0x1fe), _0x55dc6e(0x4d6), _0x55dc6e(0x4a5), _0x55dc6e(0x418), _0x55dc6e(0x5a0), _0x55dc6e(0x33a), _0x55dc6e(0x563), _0x55dc6e(0x33c), '°°°·.°·..·°¯°·._.·\x20[[text]]\x20·._.·°¯°·.·°\x20.·°°°', _0x55dc6e(0x5cf), 'ıllıllı\x20[[text]]\x20ıllıllı', _0x55dc6e(0x46f), _0x55dc6e(0x57c), '×º°”˜`”°º×\x20[[text]]\x20×º°”˜`”°º×', _0x55dc6e(0x1f1), _0x55dc6e(0x57d), '╰☆☆\x20[[text]]\x20☆☆╮', _0x55dc6e(0x4ae), _0x55dc6e(0x636), _0x55dc6e(0x622), _0x55dc6e(0x399), _0x55dc6e(0x524), '★彡\x20[[text]]\x20彡★', _0x55dc6e(0x2db), _0x55dc6e(0x54f), _0x55dc6e(0x1ca), _0x55dc6e(0x464), _0x55dc6e(0x500), '•._.••´¯``•.¸¸.•`\x20[[text]]\x20`•.¸¸.•´´¯`••._.•', _0x55dc6e(0x622), _0x55dc6e(0x636), _0x55dc6e(0x327), '•´¯`•»\x20[[text]]\x20«•´¯`•', _0x55dc6e(0x1db), _0x55dc6e(0x2a3), _0x55dc6e(0x53b), _0x55dc6e(0x4ba), _0x55dc6e(0x596), _0x55dc6e(0x561), _0x55dc6e(0x1e0), _0x55dc6e(0x5a1), _0x55dc6e(0x1c1), _0x55dc6e(0x639), '·.¸¸.·♩♪♫\x20[[text]]\x20♫♪♩·.¸¸.·', _0x55dc6e(0x50c), _0x55dc6e(0x245), _0x55dc6e(0x652), _0x55dc6e(0x3ee), _0x55dc6e(0x2db), _0x55dc6e(0x4df), '๑۞๑,¸¸,ø¤º°`°๑۩\x20[[text]]\x20๑۩\x20,¸¸,ø¤º°`°๑۞๑', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', _0x55dc6e(0x471), _0x55dc6e(0x2a3), _0x55dc6e(0x65b), _0x55dc6e(0x3a3), _0x55dc6e(0x48b), _0x55dc6e(0x1a4), _0x55dc6e(0x401), _0x55dc6e(0x42a), _0x55dc6e(0x351), 'ஜ۩۞۩ஜ\x20[[text]]\x20ஜ۩۞۩ஜ', _0x55dc6e(0x613), '(¯`·.¸¸.·´¯`·.¸¸.->\x20[[text]]\x20<-.¸¸.·´¯`·.¸¸.·´¯)', _0x55dc6e(0x4cf), _0x55dc6e(0x59a), _0x55dc6e(0x461), _0x55dc6e(0x2aa)];

function wrapInFlourish(_0x5d56b6) {
    var _0x3e7ad5 = _0x55dc6e;
    return flourishArray[Math[_0x3e7ad5(0x37f)](Math[_0x3e7ad5(0x217)]() * flourishArray[_0x3e7ad5(0x482)])][_0x3e7ad5(0x3d1)](_0x3e7ad5(0x4e2), _0x5d56b6);
}

function Flourishlist(_0x2ff21a, _0x44b974) {
    var _0x53147f = _0x55dc6e;
    return flourishArray[_0x2ff21a][_0x53147f(0x3d1)]('[[text]]', _0x44b974);
}

function wrapInSymbols(_0x4e859a, _0x1bc03e) {
    return randomSymbols(_0x1bc03e) + '\x20\x20' + _0x4e859a + '\x20\x20' + randomSymbols(_0x1bc03e);
}

function firework(_0x2c3f55) {
    var _0x27dadb = _0x55dc6e;
    return _0x2c3f55[_0x27dadb(0x3f3)]('')[_0x27dadb(0x1a5)]('҉') + '҉';
}

function weirdBox(_0x146efc) {
    var _0x5b6230 = _0x55dc6e;
    return _0x146efc['replace'](/([^\s])/g, _0x5b6230(0x442));
}

function littleSparkles(_0x36946b) {
    var _0x2457d2 = _0x55dc6e;
    return _0x2457d2(0x1e8) + _0x36946b + '\x20•°*”˜.•°*”˜';
}

function kirbyHug(_0x5b2b56) {
    var _0x390d96 = _0x55dc6e;
    return _0x390d96(0x1e6) + _0x5b2b56 + '\x20♥';
}

function dottyJoiner(_0x18ec08) {
    return '░' + _0x18ec08['split']('')['join']('░') + '░';
}

function wavyJoiner(_0x4cf6eb) {
    var _0x210aac = _0x55dc6e;
    return '≋' + _0x4cf6eb[_0x210aac(0x3f3)]('')[_0x210aac(0x1a5)]('≋') + '≋';
}

function diametricAngleFrame(_0x5ba047) {
    var _0x148e75 = _0x55dc6e;
    return _0x5ba047[_0x148e75(0x3d1)](/([^\s])/g, _0x148e75(0x565));
}

function thickBlockFramed(_0x1b8d59) {
    var _0x379ad8 = _0x55dc6e;
    return _0x1b8d59[_0x379ad8(0x3d1)](/([^\s])/g, _0x379ad8(0x326));
}
var h = {};
h['1'] = '&alpha;', h['2'] = '&#4310;', h['3'] = _0x55dc6e(0x30f), h['4'] = _0x55dc6e(0x402), h['5'] = _0x55dc6e(0x568), h['6'] = _0x55dc6e(0x47d), h['7'] = '&#608;', h['8'] = _0x55dc6e(0x5f5), h['9'] = _0x55dc6e(0x5fa), h['10'] = _0x55dc6e(0x518), h['11'] = '&#409;', h['12'] = _0x55dc6e(0x31b), h['13'] = _0x55dc6e(0x2f8), h['14'] = _0x55dc6e(0x47a), h['15'] = '&sigma;', h['16'] = '&rho;', h['17'] = _0x55dc6e(0x3b4), h['18'] = _0x55dc6e(0x39d), h['19'] = _0x55dc6e(0x68a), h['20'] = _0x55dc6e(0x20f), h['21'] = _0x55dc6e(0x557), h['22'] = _0x55dc6e(0x2ac), h['23'] = '&#623;', h['24'] = 'x', h['25'] = _0x55dc6e(0x540), h['26'] = _0x55dc6e(0x29c), h['27'] = 'A', h['28'] = 'B', h['29'] = 'C', h['30'] = 'D', h['31'] = 'E', h['32'] = 'F', h['33'] = 'G', h['34'] = 'H', h['35'] = 'I', h['36'] = 'J', h['37'] = 'K', h['38'] = 'L', h['39'] = 'M', h['40'] = 'N', h['41'] = 'O', h['42'] = 'P', h['43'] = 'Q', h['44'] = 'R', h['45'] = 'S', h['46'] = 'T', h['47'] = 'U', h['48'] = 'V', h['49'] = 'W', h['50'] = 'X', h['51'] = 'Y', h['52'] = 'Z', h['53'] = '1', h['54'] = '2', h['55'] = '3', h['56'] = '4', h['57'] = '5', h['58'] = '6', h['59'] = '7', h['60'] = '8', h['61'] = '9', h['62'] = '0';
var i = {};
i['1'] = _0x55dc6e(0x5a2), i['2'] = _0x55dc6e(0x256), i['3'] = '&#9790;', i['4'] = _0x55dc6e(0x21e), i['5'] = _0x55dc6e(0x369), i['6'] = '&#988;', i['7'] = _0x55dc6e(0x54e), i['8'] = _0x55dc6e(0x667), i['9'] = _0x55dc6e(0x36c), i['10'] = _0x55dc6e(0x41e), i['11'] = _0x55dc6e(0x3c2), i['12'] = _0x55dc6e(0x37d), i['13'] = _0x55dc6e(0x1a8), i['14'] = _0x55dc6e(0x20d), i['15'] = _0x55dc6e(0x3bc), i['16'] = _0x55dc6e(0x653), i['17'] = _0x55dc6e(0x474), i['18'] = _0x55dc6e(0x28d), i['19'] = _0x55dc6e(0x19c), i['20'] = _0x55dc6e(0x2e2), i['21'] = _0x55dc6e(0x5b4), i['22'] = _0x55dc6e(0x20c), i['23'] = '&omega;', i['24'] = _0x55dc6e(0x4e4), i['25'] = _0x55dc6e(0x5a6), i['26'] = _0x55dc6e(0x39b), i['27'] = _0x55dc6e(0x5a2), i['28'] = _0x55dc6e(0x256), i['29'] = '&#9790;', i['30'] = _0x55dc6e(0x21e), i['31'] = _0x55dc6e(0x369), i['32'] = _0x55dc6e(0x43e), i['33'] = _0x55dc6e(0x54e), i['34'] = _0x55dc6e(0x667), i['35'] = _0x55dc6e(0x36c), i['36'] = '&#9834;', i['37'] = _0x55dc6e(0x3c2), i['38'] = _0x55dc6e(0x37d), i['39'] = '&#9812;', i['40'] = _0x55dc6e(0x20d), i['41'] = _0x55dc6e(0x3bc), i['42'] = _0x55dc6e(0x653), i['43'] = _0x55dc6e(0x474), i['44'] = _0x55dc6e(0x28d), i['45'] = _0x55dc6e(0x19c), i['46'] = _0x55dc6e(0x2e2), i['47'] = _0x55dc6e(0x5b4), i['48'] = _0x55dc6e(0x20c), i['49'] = _0x55dc6e(0x609), i['50'] = '&#8984;', i['51'] = _0x55dc6e(0x5a6), i['52'] = '&#9761;', i['53'] = _0x55dc6e(0x2ea), i['54'] = _0x55dc6e(0x398), i['55'] = _0x55dc6e(0x58a), i['56'] = _0x55dc6e(0x5b6), i['57'] = '&#10126;', i['58'] = _0x55dc6e(0x19e), i['59'] = _0x55dc6e(0x35b), i['60'] = _0x55dc6e(0x375), i['61'] = '&#10130;', i['62'] = _0x55dc6e(0x483);
var j = {};
j['1'] = _0x55dc6e(0x5f3), j['2'] = _0x55dc6e(0x551), j['3'] = _0x55dc6e(0x1a6), j['4'] = '&#270;', j['5'] = _0x55dc6e(0x2e6), j['6'] = '&#358;', j['7'] = _0x55dc6e(0x4e0), j['8'] = '&#292;', j['9'] = _0x55dc6e(0x572), j['10'] = '&#308;', j['11'] = '&#310;', j['12'] = _0x55dc6e(0x4bf), j['13'] = _0x55dc6e(0x406), j['14'] = _0x55dc6e(0x58e), j['15'] = _0x55dc6e(0x3a1), j['16'] = _0x55dc6e(0x51c), j['17'] = 'Q', j['18'] = _0x55dc6e(0x607), j['19'] = '&#346;', j['20'] = '&#356;', j['21'] = _0x55dc6e(0x520), j['22'] = 'V', j['23'] = _0x55dc6e(0x67a), j['24'] = '&#1046;', j['25'] = _0x55dc6e(0x594), j['26'] = _0x55dc6e(0x462), j['27'] = _0x55dc6e(0x5f3), j['28'] = _0x55dc6e(0x551), j['29'] = '&#268;', j['30'] = '&#270;', j['31'] = _0x55dc6e(0x2e6), j['32'] = _0x55dc6e(0x392), j['33'] = _0x55dc6e(0x4e0), j['34'] = _0x55dc6e(0x485), j['35'] = _0x55dc6e(0x572), j['36'] = _0x55dc6e(0x543), j['37'] = _0x55dc6e(0x1ad), j['38'] = '&#313;', j['39'] = _0x55dc6e(0x406), j['40'] = _0x55dc6e(0x58e), j['41'] = _0x55dc6e(0x3a1), j['42'] = '&#1056;', j['43'] = 'Q', j['44'] = '&#340;', j['45'] = '&#346;', j['46'] = '&#356;', j['47'] = '&Uacute;', j['48'] = 'V', j['49'] = _0x55dc6e(0x67a), j['50'] = _0x55dc6e(0x67f), j['51'] = '&#374;', j['52'] = _0x55dc6e(0x462), j['53'] = '1', j['54'] = '2', j['55'] = '3', j['56'] = '4', j['57'] = '5', j['58'] = '6', j['59'] = '7', j['60'] = '8', j['61'] = '9', j['62'] = '0';
var k = {};
k['1'] = '&#592;', k['2'] = 'q', k['3'] = '&#596;', k['4'] = 'p', k['5'] = '&#477;', k['6'] = _0x55dc6e(0x49a), k['7'] = _0x55dc6e(0x588), k['8'] = _0x55dc6e(0x297), k['9'] = _0x55dc6e(0x510), k['10'] = '&#638;', k['11'] = _0x55dc6e(0x346), k['12'] = 'l', k['13'] = _0x55dc6e(0x631), k['14'] = 'u', k['15'] = 'o', k['16'] = 'd', k['17'] = 'b', k['18'] = '&#633;', k['19'] = 's', k['20'] = _0x55dc6e(0x5c6), k['21'] = 'n', k['22'] = '&#652;', k['23'] = _0x55dc6e(0x198), k['24'] = 'x', k['25'] = _0x55dc6e(0x49c), k['26'] = 'z', k['27'] = _0x55dc6e(0x626), k['28'] = 'q', k['29'] = _0x55dc6e(0x595), k['30'] = 'p', k['31'] = _0x55dc6e(0x666), k['32'] = _0x55dc6e(0x49a), k['33'] = _0x55dc6e(0x588), k['34'] = '&#613;', k['35'] = _0x55dc6e(0x510), k['36'] = _0x55dc6e(0x39d), k['37'] = _0x55dc6e(0x346), k['38'] = 'l', k['39'] = '&#623;', k['40'] = 'u', k['41'] = 'o', k['42'] = 'd', k['43'] = 'b', k['44'] = _0x55dc6e(0x46c), k['45'] = 's', k['46'] = _0x55dc6e(0x5c6), k['47'] = 'n', k['48'] = _0x55dc6e(0x63f), k['49'] = '&#653;', k['50'] = 'x', k['51'] = _0x55dc6e(0x49c), k['52'] = 'z', k['53'] = _0x55dc6e(0x1f0), k['54'] = _0x55dc6e(0x261), k['55'] = _0x55dc6e(0x25b), k['56'] = _0x55dc6e(0x241), k['57'] = _0x55dc6e(0x2ed), k['58'] = '9', k['59'] = '&#12581;', k['60'] = '8', k['61'] = '6', k['62'] = '0';
var l = {};
l['1'] = '&Delta;', l['2'] = _0x55dc6e(0x551), l['3'] = '&#262;', l['4'] = _0x55dc6e(0x32b), l['5'] = _0x55dc6e(0x369), l['6'] = _0x55dc6e(0x668), l['7'] = _0x55dc6e(0x2c0), l['8'] = _0x55dc6e(0x5ae), l['9'] = _0x55dc6e(0x438), l['10'] = '&#308;', l['11'] = _0x55dc6e(0x65f), l['12'] = '&#321;', l['13'] = '&Mu;', l['14'] = _0x55dc6e(0x26f), l['15'] = '&Oslash;', l['16'] = '&#420;', l['17'] = _0x55dc6e(0x642), l['18'] = _0x55dc6e(0x65a), l['19'] = _0x55dc6e(0x3de), l['20'] = _0x55dc6e(0x392), l['21'] = _0x55dc6e(0x513), l['22'] = 'V', l['23'] = '&#372;', l['24'] = '&#1046;', l['25'] = _0x55dc6e(0x4c1), l['26'] = _0x55dc6e(0x311), l['27'] = _0x55dc6e(0x689), l['28'] = _0x55dc6e(0x551), l['29'] = _0x55dc6e(0x4b3), l['30'] = _0x55dc6e(0x32b), l['31'] = _0x55dc6e(0x369), l['32'] = _0x55dc6e(0x668), l['33'] = _0x55dc6e(0x2c0), l['34'] = _0x55dc6e(0x5ae), l['35'] = '&#407;', l['36'] = _0x55dc6e(0x543), l['37'] = _0x55dc6e(0x65f), l['38'] = _0x55dc6e(0x65c), l['39'] = _0x55dc6e(0x2c4), l['40'] = _0x55dc6e(0x26f), l['41'] = '&Oslash;', l['42'] = _0x55dc6e(0x4d2), l['43'] = _0x55dc6e(0x642), l['44'] = _0x55dc6e(0x65a), l['45'] = '&#350;', l['46'] = '&#358;', l['47'] = _0x55dc6e(0x513), l['48'] = 'V', l['49'] = '&#372;', l['50'] = _0x55dc6e(0x67f), l['51'] = _0x55dc6e(0x4c1), l['52'] = _0x55dc6e(0x311), l['53'] = '1', l['54'] = '2', l['55'] = '3', l['56'] = '4', l['57'] = '5', l['58'] = '6', l['59'] = '7', l['60'] = '8', l['61'] = '9', l['62'] = '0';
var m = {};
m['1'] = '&alpha;', m['2'] = _0x55dc6e(0x1d9), m['3'] = _0x55dc6e(0x358), m['4'] = '&part;', m['5'] = _0x55dc6e(0x494), m['6'] = _0x55dc6e(0x2b3), m['7'] = _0x55dc6e(0x288), m['8'] = _0x55dc6e(0x262), m['9'] = _0x55dc6e(0x4f7), m['10'] = _0x55dc6e(0x518), m['11'] = _0x55dc6e(0x324), m['12'] = _0x55dc6e(0x2dd), m['13'] = _0x55dc6e(0x2f8), m['14'] = _0x55dc6e(0x47a), m['15'] = _0x55dc6e(0x2a5), m['16'] = '&rho;', m['17'] = _0x55dc6e(0x38e), m['18'] = _0x55dc6e(0x3fe), m['19'] = _0x55dc6e(0x1dc), m['20'] = _0x55dc6e(0x48f), m['21'] = _0x55dc6e(0x55a), m['22'] = _0x55dc6e(0x1e5), m['23'] = _0x55dc6e(0x609), m['24'] = '&#1488;', m['25'] = _0x55dc6e(0x540), m['26'] = '&#438;', m['27'] = _0x55dc6e(0x42b), m['28'] = _0x55dc6e(0x1d9), m['29'] = _0x55dc6e(0x358), m['30'] = _0x55dc6e(0x323), m['31'] = '&epsilon;', m['32'] = _0x55dc6e(0x2b3), m['33'] = _0x55dc6e(0x288), m['34'] = _0x55dc6e(0x262), m['35'] = _0x55dc6e(0x4f7), m['36'] = _0x55dc6e(0x518), m['37'] = _0x55dc6e(0x324), m['38'] = _0x55dc6e(0x2dd), m['39'] = '&#625;', m['40'] = _0x55dc6e(0x47a), m['41'] = _0x55dc6e(0x2a5), m['42'] = _0x55dc6e(0x653), m['43'] = _0x55dc6e(0x38e), m['44'] = _0x55dc6e(0x3fe), m['45'] = _0x55dc6e(0x1dc), m['46'] = _0x55dc6e(0x48f), m['47'] = _0x55dc6e(0x55a), m['48'] = _0x55dc6e(0x1e5), m['49'] = _0x55dc6e(0x609), m['50'] = _0x55dc6e(0x383), m['51'] = '&#4327;', m['52'] = _0x55dc6e(0x3b1), m['53'] = '1', m['54'] = '2', m['55'] = '3', m['56'] = '4', m['57'] = '5', m['58'] = '6', m['59'] = '7', m['60'] = '8', m['61'] = '9', m['62'] = '0';
var n = {};
n['1'] = _0x55dc6e(0x427), n['2'] = _0x55dc6e(0x355), n['3'] = _0x55dc6e(0x28b), n['4'] = _0x55dc6e(0x575), n['5'] = _0x55dc6e(0x3f6), n['6'] = '&#5556;', n['7'] = _0x55dc6e(0x2c0), n['8'] = _0x55dc6e(0x5c3), n['9'] = _0x55dc6e(0x35e), n['10'] = '&#5262;', n['11'] = _0x55dc6e(0x4e3), n['12'] = '&#5290;', n['13'] = '&#5616;', n['14'] = _0x55dc6e(0x3cd), n['15'] = _0x55dc6e(0x356), n['16'] = _0x55dc6e(0x5c0), n['17'] = _0x55dc6e(0x649), n['18'] = _0x55dc6e(0x216), n['19'] = _0x55dc6e(0x3ce), n['20'] = '&#19973;', n['21'] = _0x55dc6e(0x298), n['22'] = _0x55dc6e(0x63c), n['23'] = _0x55dc6e(0x365), n['24'] = _0x55dc6e(0x20e), n['25'] = _0x55dc6e(0x41a), n['26'] = _0x55dc6e(0x3ca), n['27'] = _0x55dc6e(0x427), n['28'] = _0x55dc6e(0x355), n['29'] = _0x55dc6e(0x28b), n['30'] = '&#5610;', n['31'] = _0x55dc6e(0x3f6), n['32'] = '&#5556;', n['33'] = _0x55dc6e(0x2c0), n['34'] = _0x55dc6e(0x5c3), n['35'] = _0x55dc6e(0x35e), n['36'] = _0x55dc6e(0x3f1), n['37'] = _0x55dc6e(0x4e3), n['38'] = _0x55dc6e(0x450), n['39'] = _0x55dc6e(0x553), n['40'] = '&#5198;', n['41'] = _0x55dc6e(0x356), n['42'] = _0x55dc6e(0x5c0), n['43'] = _0x55dc6e(0x649), n['44'] = _0x55dc6e(0x216), n['45'] = _0x55dc6e(0x3ce), n['46'] = _0x55dc6e(0x254), n['47'] = _0x55dc6e(0x298), n['48'] = _0x55dc6e(0x63c), n['49'] = '&#5615;', n['50'] = _0x55dc6e(0x20e), n['51'] = _0x55dc6e(0x41a), n['52'] = _0x55dc6e(0x3ca), n['53'] = '1', n['54'] = '2', n['55'] = '3', n['56'] = '4', n['57'] = '5', n['58'] = '6', n['59'] = '7', n['60'] = '8', n['61'] = '9', n['62'] = '0';
var o = {};
o['1'] = '&#4315;', o['2'] = _0x55dc6e(0x2ae), o['3'] = _0x55dc6e(0x5f4), o['4'] = '&#4331;', o['5'] = _0x55dc6e(0x535), o['6'] = 'f', o['7'] = _0x55dc6e(0x4d3), o['8'] = 'h', o['9'] = '&#7990;', o['10'] = _0x55dc6e(0x5a7), o['11'] = _0x55dc6e(0x24c), o['12'] = 'l', o['13'] = '&#4317;', o['14'] = '&#8134;', o['15'] = _0x55dc6e(0x32f), o['16'] = _0x55dc6e(0x653), o['17'] = _0x55dc6e(0x624), o['18'] = _0x55dc6e(0x1cb), o['19'] = _0x55dc6e(0x526), o['20'] = _0x55dc6e(0x24a), o['21'] = _0x55dc6e(0x557), o['22'] = _0x55dc6e(0x4b4), o['23'] = 'w', o['24'] = _0x55dc6e(0x51f), o['25'] = _0x55dc6e(0x540), o['26'] = _0x55dc6e(0x672), o['27'] = _0x55dc6e(0x522), o['28'] = '&#4329;', o['29'] = _0x55dc6e(0x5f4), o['30'] = '&#4331;', o['31'] = _0x55dc6e(0x535), o['32'] = 'f', o['33'] = _0x55dc6e(0x4d3), o['34'] = 'h', o['35'] = _0x55dc6e(0x307), o['36'] = _0x55dc6e(0x5a7), o['37'] = _0x55dc6e(0x24c), o['38'] = 'l', o['39'] = _0x55dc6e(0x58b), o['40'] = _0x55dc6e(0x473), o['41'] = _0x55dc6e(0x32f), o['42'] = '&rho;', o['43'] = _0x55dc6e(0x624), o['44'] = _0x55dc6e(0x1cb), o['45'] = _0x55dc6e(0x526), o['46'] = '&#3923;', o['47'] = '&upsilon;', o['48'] = _0x55dc6e(0x4b4), o['49'] = 'w', o['50'] = _0x55dc6e(0x51f), o['51'] = _0x55dc6e(0x540), o['52'] = _0x55dc6e(0x672), o['53'] = '1', o['54'] = '2', o['55'] = '3', o['56'] = '4', o['57'] = '5', o['58'] = '6', o['59'] = '7', o['60'] = '8', o['61'] = '9', o['62'] = '0';
var p = {};
p['1'] = _0x55dc6e(0x4f4), p['2'] = _0x55dc6e(0x3cb), p['3'] = _0x55dc6e(0x2f6), p['4'] = _0x55dc6e(0x66b), p['5'] = '&#941;', p['6'] = _0x55dc6e(0x3bf), p['7'] = _0x55dc6e(0x28e), p['8'] = _0x55dc6e(0x511), p['9'] = '&#943;', p['10'] = _0x55dc6e(0x552), p['11'] = _0x55dc6e(0x434), p['12'] = _0x55dc6e(0x269), p['13'] = _0x55dc6e(0x4c6), p['14'] = _0x55dc6e(0x5e4), p['15'] = _0x55dc6e(0x27a), p['16'] = _0x55dc6e(0x653), p['17'] = 'q', p['18'] = '&#341;', p['19'] = '&#351;', p['20'] = _0x55dc6e(0x1b3), p['21'] = _0x55dc6e(0x4fb), p['22'] = '&nu;', p['23'] = _0x55dc6e(0x590), p['24'] = 'x', p['25'] = '&#1095;', p['26'] = _0x55dc6e(0x4ad), p['27'] = '&#940;', p['28'] = _0x55dc6e(0x3cb), p['29'] = _0x55dc6e(0x2f6), p['30'] = _0x55dc6e(0x66b), p['31'] = _0x55dc6e(0x655), p['32'] = _0x55dc6e(0x3bf), p['33'] = '&#291;', p['34'] = _0x55dc6e(0x511), p['35'] = _0x55dc6e(0x3a9), p['36'] = _0x55dc6e(0x552), p['37'] = _0x55dc6e(0x434), p['38'] = _0x55dc6e(0x269), p['39'] = _0x55dc6e(0x4c6), p['40'] = '&#942;', p['41'] = '&#972;', p['42'] = _0x55dc6e(0x653), p['43'] = 'q', p['44'] = _0x55dc6e(0x1aa), p['45'] = _0x55dc6e(0x22e), p['46'] = _0x55dc6e(0x1b3), p['47'] = '&ugrave;', p['48'] = _0x55dc6e(0x352), p['49'] = _0x55dc6e(0x590), p['50'] = 'x', p['51'] = _0x55dc6e(0x592), p['52'] = _0x55dc6e(0x4ad), p['53'] = '1', p['54'] = '2', p['55'] = '3', p['56'] = '4', p['57'] = '5', p['58'] = '6', p['59'] = '7', p['60'] = '8', p['61'] = '9', p['62'] = '0';
var q = {};
q['1'] = '&#41707;', q['2'] = _0x55dc6e(0x555), q['3'] = _0x55dc6e(0x5be), q['4'] = _0x55dc6e(0x675), q['5'] = '&#41823;', q['6'] = _0x55dc6e(0x286), q['7'] = '&#41037;', q['8'] = _0x55dc6e(0x541), q['9'] = _0x55dc6e(0x20b), q['10'] = _0x55dc6e(0x2f2), q['11'] = '&#40983;', q['12'] = _0x55dc6e(0x4de), q['13'] = _0x55dc6e(0x599), q['14'] = '&#41081;', q['15'] = _0x55dc6e(0x39c), q['16'] = _0x55dc6e(0x2b6), q['17'] = _0x55dc6e(0x57b), q['18'] = '&#42131;', q['19'] = '&#41754;', q['20'] = _0x55dc6e(0x661), q['21'] = _0x55dc6e(0x420), q['22'] = '&#41949;', q['23'] = _0x55dc6e(0x1ce), q['24'] = _0x55dc6e(0x1ec), q['25'] = _0x55dc6e(0x562), q['26'] = '&#41076;', q['27'] = '&#41707;', q['28'] = '&#41155;', q['29'] = '&#41976;', q['30'] = _0x55dc6e(0x675), q['31'] = _0x55dc6e(0x497), q['32'] = _0x55dc6e(0x286), q['33'] = _0x55dc6e(0x26a), q['34'] = _0x55dc6e(0x541), q['35'] = '&#41105;', q['36'] = '&#41005;', q['37'] = _0x55dc6e(0x2c5), q['38'] = '&#42130;', q['39'] = _0x55dc6e(0x599), q['40'] = _0x55dc6e(0x204), q['41'] = _0x55dc6e(0x39c), q['42'] = _0x55dc6e(0x2b6), q['43'] = '&#41080;', q['44'] = _0x55dc6e(0x5aa), q['45'] = _0x55dc6e(0x4d9), q['46'] = '&#42181;', q['47'] = _0x55dc6e(0x420), q['48'] = _0x55dc6e(0x533), q['49'] = _0x55dc6e(0x1ce), q['50'] = _0x55dc6e(0x1ec), q['51'] = _0x55dc6e(0x562), q['52'] = _0x55dc6e(0x56a), q['53'] = '1', q['54'] = '2', q['55'] = '3', q['56'] = '4', q['57'] = '5', q['58'] = '6', q['59'] = '7', q['60'] = '8', q['61'] = '9', q['62'] = '0';
var r = {};
r['1'] = '&#1044;', r['2'] = _0x55dc6e(0x410), r['3'] = 'C', r['4'] = 'D', r['5'] = _0x55dc6e(0x68c), r['6'] = 'F', r['7'] = 'G', r['8'] = 'H', r['9'] = 'I', r['10'] = 'J', r['11'] = _0x55dc6e(0x65f), r['12'] = 'L', r['13'] = 'M', r['14'] = _0x55dc6e(0x3c5), r['15'] = _0x55dc6e(0x36f), r['16'] = 'P', r['17'] = _0x55dc6e(0x5ee), r['18'] = _0x55dc6e(0x3b8), r['19'] = 'S', r['20'] = _0x55dc6e(0x1cb), r['21'] = _0x55dc6e(0x3e1), r['22'] = 'V', r['23'] = _0x55dc6e(0x21f), r['24'] = _0x55dc6e(0x67f), r['25'] = _0x55dc6e(0x328), r['26'] = 'Z', r['27'] = _0x55dc6e(0x64e), r['28'] = _0x55dc6e(0x410), r['29'] = 'C', r['30'] = 'D', r['31'] = _0x55dc6e(0x68c), r['32'] = 'F', r['33'] = 'G', r['34'] = 'H', r['35'] = 'I', r['36'] = 'J', r['37'] = _0x55dc6e(0x65f), r['38'] = 'L', r['39'] = 'M', r['40'] = _0x55dc6e(0x3c5), r['41'] = _0x55dc6e(0x36f), r['42'] = 'P', r['43'] = _0x55dc6e(0x5ee), r['44'] = '&#1071;', r['45'] = 'S', r['46'] = _0x55dc6e(0x1cb), r['47'] = _0x55dc6e(0x3e1), r['48'] = 'V', r['49'] = _0x55dc6e(0x21f), r['50'] = _0x55dc6e(0x67f), r['51'] = _0x55dc6e(0x328), r['52'] = 'Z', r['53'] = '1', r['54'] = '2', r['55'] = '3', r['56'] = '4', r['57'] = '5', r['58'] = '6', r['59'] = '7', r['60'] = '8', r['61'] = '9', r['62'] = '0';
var s = {};
s['1'] = _0x55dc6e(0x5a2), s['2'] = '&#41731;', s['3'] = _0x55dc6e(0x255), s['4'] = _0x55dc6e(0x5fc), s['5'] = '&#41823;', s['6'] = '&#41863;', s['7'] = '&#41029;', s['8'] = _0x55dc6e(0x3c6), s['9'] = _0x55dc6e(0x28c), s['10'] = _0x55dc6e(0x2f2), s['11'] = _0x55dc6e(0x60b), s['12'] = _0x55dc6e(0x4de), s['13'] = '&#41141;', s['14'] = _0x55dc6e(0x1f2), s['15'] = _0x55dc6e(0x199), s['16'] = _0x55dc6e(0x2b6), s['17'] = _0x55dc6e(0x40c), s['18'] = _0x55dc6e(0x321), s['19'] = _0x55dc6e(0x4b2), s['20'] = _0x55dc6e(0x52f), s['21'] = '&#40974;', s['22'] = _0x55dc6e(0x1d1), s['23'] = '&#41295;', s['24'] = _0x55dc6e(0x647), s['25'] = _0x55dc6e(0x67d), s['26'] = _0x55dc6e(0x56a), s['27'] = _0x55dc6e(0x5a2), s['28'] = _0x55dc6e(0x1a3), s['29'] = '&#41555;', s['30'] = _0x55dc6e(0x5fc), s['31'] = _0x55dc6e(0x497), s['32'] = _0x55dc6e(0x55f), s['33'] = _0x55dc6e(0x25f), s['34'] = _0x55dc6e(0x3c6), s['35'] = _0x55dc6e(0x28c), s['36'] = _0x55dc6e(0x2f2), s['37'] = _0x55dc6e(0x60b), s['38'] = '&#42130;', s['39'] = _0x55dc6e(0x3af), s['40'] = _0x55dc6e(0x1f2), s['41'] = _0x55dc6e(0x199), s['42'] = _0x55dc6e(0x2b6), s['43'] = _0x55dc6e(0x40c), s['44'] = _0x55dc6e(0x321), s['45'] = _0x55dc6e(0x4b2), s['46'] = '&#42180;', s['47'] = _0x55dc6e(0x33b), s['48'] = _0x55dc6e(0x1d1), s['49'] = _0x55dc6e(0x266), s['50'] = _0x55dc6e(0x647), s['51'] = '&#41769;', s['52'] = _0x55dc6e(0x56a), s['53'] = '1', s['54'] = '2', s['55'] = '3', s['56'] = '4', s['57'] = '5', s['58'] = '6', s['59'] = '7', s['60'] = '8', s['61'] = '9', s['62'] = '0';
var t = {};
t['1'] = '&#41708;', t['2'] = '&#41203;', t['3'] = '&#41556;', t['4'] = '&#42159;', t['5'] = _0x55dc6e(0x330), t['6'] = '&#41648;', t['7'] = _0x55dc6e(0x40d), t['8'] = _0x55dc6e(0x408), t['9'] = _0x55dc6e(0x60d), t['10'] = '&#42171;', t['11'] = '&#40984;', t['12'] = _0x55dc6e(0x4de), t['13'] = _0x55dc6e(0x3af), t['14'] = _0x55dc6e(0x360), t['15'] = _0x55dc6e(0x3ad), t['16'] = _0x55dc6e(0x2b6), t['17'] = _0x55dc6e(0x40c), t['18'] = _0x55dc6e(0x321), t['19'] = _0x55dc6e(0x235), t['20'] = '&#42180;', t['21'] = _0x55dc6e(0x25a), t['22'] = _0x55dc6e(0x419), t['23'] = _0x55dc6e(0x1ce), t['24'] = '&#41575;', t['25'] = _0x55dc6e(0x5b9), t['26'] = _0x55dc6e(0x56a), t['27'] = _0x55dc6e(0x2d4), t['28'] = _0x55dc6e(0x22f), t['29'] = _0x55dc6e(0x2cf), t['30'] = '&#42159;', t['31'] = '&#41922;', t['32'] = _0x55dc6e(0x481), t['33'] = _0x55dc6e(0x40d), t['34'] = _0x55dc6e(0x408), t['35'] = _0x55dc6e(0x60d), t['36'] = _0x55dc6e(0x5cb), t['37'] = '&#40984;', t['38'] = _0x55dc6e(0x4de), t['39'] = _0x55dc6e(0x3af), t['40'] = _0x55dc6e(0x360), t['41'] = _0x55dc6e(0x3ad), t['42'] = _0x55dc6e(0x2b6), t['43'] = _0x55dc6e(0x40c), t['44'] = '&#41706;', t['45'] = _0x55dc6e(0x235), t['46'] = _0x55dc6e(0x52f), t['47'] = _0x55dc6e(0x25a), t['48'] = '&#42150;', t['49'] = _0x55dc6e(0x1ce), t['50'] = _0x55dc6e(0x64a), t['51'] = _0x55dc6e(0x5b9), t['52'] = _0x55dc6e(0x56a), t['53'] = '1', t['54'] = '2', t['55'] = '3', t['56'] = '4', t['57'] = '5', t['58'] = '6', t['59'] = '7', t['60'] = '8', t['61'] = '9', t['62'] = '0';
var u = {};
u['1'] = '&Lambda;', u['2'] = _0x55dc6e(0x681), u['3'] = '&#12552;', u['4'] = _0x55dc6e(0x1bd), u['5'] = _0x55dc6e(0x25b), u['6'] = 'F', u['7'] = _0x55dc6e(0x43a), u['8'] = _0x55dc6e(0x21b), u['9'] = _0x55dc6e(0x303), u['10'] = _0x55dc6e(0x4ea), u['11'] = _0x55dc6e(0x27c), u['12'] = _0x55dc6e(0x65c), u['13'] = _0x55dc6e(0x496), u['14'] = '&#1051;', u['15'] = _0x55dc6e(0x337), u['16'] = _0x55dc6e(0x51e), u['17'] = _0x55dc6e(0x638), u['18'] = _0x55dc6e(0x333), u['19'] = _0x55dc6e(0x310), u['20'] = _0x55dc6e(0x34c), u['21'] = '&#1062;', u['22'] = _0x55dc6e(0x611), u['23'] = '&#412;', u['24'] = _0x55dc6e(0x30d), u['25'] = _0x55dc6e(0x4d1), u['26'] = _0x55dc6e(0x332), u['27'] = '&Lambda;', u['28'] = '&#998;', u['29'] = _0x55dc6e(0x472), u['30'] = _0x55dc6e(0x1bd), u['31'] = _0x55dc6e(0x25b), u['32'] = 'F', u['33'] = _0x55dc6e(0x43a), u['34'] = '&#1085;', u['35'] = _0x55dc6e(0x303), u['36'] = _0x55dc6e(0x4ea), u['37'] = _0x55dc6e(0x27c), u['38'] = _0x55dc6e(0x65c), u['39'] = _0x55dc6e(0x496), u['40'] = _0x55dc6e(0x64b), u['41'] = '&Oslash;', u['42'] = _0x55dc6e(0x51e), u['43'] = _0x55dc6e(0x638), u['44'] = _0x55dc6e(0x333), u['45'] = '&#12425;', u['46'] = _0x55dc6e(0x34c), u['47'] = _0x55dc6e(0x3e1), u['48'] = _0x55dc6e(0x611), u['49'] = _0x55dc6e(0x302), u['50'] = _0x55dc6e(0x30d), u['51'] = '&#996;', u['52'] = _0x55dc6e(0x332), u['53'] = '1', u['54'] = '2', u['55'] = '3', u['56'] = '4', u['57'] = '5', u['58'] = '6', u['59'] = '7', u['60'] = '8', u['61'] = '9', u['62'] = '0';
var v = {};
v['1'] = _0x55dc6e(0x5d2), v['2'] = '&#385;', v['3'] = _0x55dc6e(0x21d), v['4'] = '&#394;', v['5'] = _0x55dc6e(0x1fb), v['6'] = _0x55dc6e(0x1c0), v['7'] = _0x55dc6e(0x43a), v['8'] = _0x55dc6e(0x2f1), v['9'] = _0x55dc6e(0x1f0), v['10'] = '&#646;', v['11'] = _0x55dc6e(0x629), v['12'] = _0x55dc6e(0x253), v['13'] = 'M', v['14'] = _0x55dc6e(0x5ed), v['15'] = _0x55dc6e(0x2b8), v['16'] = _0x55dc6e(0x4d2), v['17'] = '&#418;', v['18'] = _0x55dc6e(0x2e8), v['19'] = '&#423;', v['20'] = '&#428;', v['21'] = _0x55dc6e(0x4ab), v['22'] = _0x55dc6e(0x611), v['23'] = _0x55dc6e(0x302), v['24'] = '&#1202;', v['25'] = '&#435;', v['26'] = _0x55dc6e(0x601), v['27'] = '&#411;', v['28'] = _0x55dc6e(0x222), v['29'] = _0x55dc6e(0x21d), v['30'] = _0x55dc6e(0x664), v['31'] = _0x55dc6e(0x1fb), v['32'] = _0x55dc6e(0x1c0), v['33'] = '&#403;', v['34'] = _0x55dc6e(0x2f1), v['35'] = _0x55dc6e(0x1f0), v['36'] = _0x55dc6e(0x66d), v['37'] = _0x55dc6e(0x629), v['38'] = _0x55dc6e(0x253), v['39'] = 'M', v['40'] = _0x55dc6e(0x5ed), v['41'] = _0x55dc6e(0x2b8), v['42'] = _0x55dc6e(0x4d2), v['43'] = _0x55dc6e(0x658), v['44'] = '&#422;', v['45'] = _0x55dc6e(0x371), v['46'] = _0x55dc6e(0x30b), v['47'] = _0x55dc6e(0x4ab), v['48'] = _0x55dc6e(0x611), v['49'] = _0x55dc6e(0x302), v['50'] = _0x55dc6e(0x47f), v['51'] = _0x55dc6e(0x41a), v['52'] = '&#548;', v['53'] = '1', v['54'] = '2', v['55'] = '3', v['56'] = '4', v['57'] = '5', v['58'] = '6', v['59'] = '7', v['60'] = '8', v['61'] = '9', v['62'] = '0';
var w = {};
w['1'] = _0x55dc6e(0x2d2), w['2'] = _0x55dc6e(0x430), w['3'] = _0x55dc6e(0x417), w['4'] = _0x55dc6e(0x556), w['5'] = _0x55dc6e(0x679), w['6'] = _0x55dc6e(0x445), w['7'] = _0x55dc6e(0x25f), w['8'] = _0x55dc6e(0x5ca), w['9'] = '&#41105;', w['10'] = _0x55dc6e(0x5cb), w['11'] = '&#40983;', w['12'] = _0x55dc6e(0x4de), w['13'] = _0x55dc6e(0x3af), w['14'] = _0x55dc6e(0x360), w['15'] = _0x55dc6e(0x199), w['16'] = '&#41571;', w['17'] = _0x55dc6e(0x429), w['18'] = _0x55dc6e(0x5d9), w['19'] = '&#41754;', w['20'] = '&#41686;', w['21'] = _0x55dc6e(0x420), w['22'] = _0x55dc6e(0x1c3), w['23'] = _0x55dc6e(0x266), w['24'] = _0x55dc6e(0x63a), w['25'] = _0x55dc6e(0x1d6), w['26'] = _0x55dc6e(0x56a), w['27'] = '&#41074;', w['28'] = '&#41712;', w['29'] = _0x55dc6e(0x417), w['30'] = _0x55dc6e(0x556), w['31'] = _0x55dc6e(0x679), w['32'] = _0x55dc6e(0x445), w['33'] = _0x55dc6e(0x25f), w['34'] = '&#41833;', w['35'] = _0x55dc6e(0x20b), w['36'] = _0x55dc6e(0x5cb), w['37'] = _0x55dc6e(0x2c5), w['38'] = _0x55dc6e(0x4de), w['39'] = _0x55dc6e(0x3af), w['40'] = '&#41674;', w['41'] = _0x55dc6e(0x199), w['42'] = _0x55dc6e(0x2b6), w['43'] = _0x55dc6e(0x429), w['44'] = _0x55dc6e(0x5d9), w['45'] = '&#41754;', w['46'] = _0x55dc6e(0x598), w['47'] = _0x55dc6e(0x420), w['48'] = _0x55dc6e(0x1c3), w['49'] = '&#41295;', w['50'] = _0x55dc6e(0x63a), w['51'] = _0x55dc6e(0x1d6), w['52'] = '&#41076;', w['53'] = '1', w['54'] = '2', w['55'] = '3', w['56'] = '4', w['57'] = '5', w['58'] = '6', w['59'] = '7', w['60'] = '8', w['61'] = '9', w['62'] = '0';
var x = {};
x['1'] = _0x55dc6e(0x446), x['2'] = _0x55dc6e(0x5e2), x['3'] = '&#1351;', x['4'] = _0x55dc6e(0x47e), x['5'] = _0x55dc6e(0x23a), x['6'] = _0x55dc6e(0x517), x['7'] = _0x55dc6e(0x41d), x['8'] = _0x55dc6e(0x5d0), x['9'] = '&#639;', x['10'] = '&#669;', x['11'] = _0x55dc6e(0x34b), x['12'] = _0x55dc6e(0x31b), x['13'] = _0x55dc6e(0x198), x['14'] = _0x55dc6e(0x5c2), x['15'] = _0x55dc6e(0x521), x['16'] = _0x55dc6e(0x653), x['17'] = _0x55dc6e(0x38e), x['18'] = _0x55dc6e(0x370), x['19'] = '&#1359;', x['20'] = _0x55dc6e(0x362), x['21'] = _0x55dc6e(0x372), x['22'] = '&#1506;', x['23'] = _0x55dc6e(0x19b), x['24'] = _0x55dc6e(0x60a), x['25'] = _0x55dc6e(0x2c6), x['26'] = _0x55dc6e(0x207), x['27'] = _0x55dc6e(0x446), x['28'] = '&#1349;', x['29'] = _0x55dc6e(0x475), x['30'] = _0x55dc6e(0x47e), x['31'] = _0x55dc6e(0x23a), x['32'] = _0x55dc6e(0x517), x['33'] = _0x55dc6e(0x41d), x['34'] = '&#615;', x['35'] = _0x55dc6e(0x329), x['36'] = '&#669;', x['37'] = '&#409;', x['38'] = _0x55dc6e(0x31b), x['39'] = _0x55dc6e(0x198), x['40'] = _0x55dc6e(0x5c2), x['41'] = _0x55dc6e(0x521), x['42'] = '&rho;', x['43'] = _0x55dc6e(0x38e), x['44'] = _0x55dc6e(0x370), x['45'] = _0x55dc6e(0x45f), x['46'] = _0x55dc6e(0x362), x['47'] = '&#1348;', x['48'] = _0x55dc6e(0x632), x['49'] = _0x55dc6e(0x19b), x['50'] = _0x55dc6e(0x60a), x['51'] = _0x55dc6e(0x2c6), x['52'] = _0x55dc6e(0x207), x['53'] = '1', x['54'] = '2', x['55'] = '3', x['56'] = '4', x['57'] = '5', x['58'] = '6', x['59'] = '7', x['60'] = '8', x['61'] = '9', x['62'] = '0';
var y = {};
y['1'] = '&alpha;', y['2'] = _0x55dc6e(0x2d1), y['3'] = _0x55dc6e(0x2f6), y['4'] = 'd', y['5'] = _0x55dc6e(0x494), y['6'] = _0x55dc6e(0x2b3), y['7'] = 'g', y['8'] = 'h', y['9'] = _0x55dc6e(0x5cd), y['10'] = _0x55dc6e(0x549), y['11'] = '&kappa;', y['12'] = _0x55dc6e(0x615), y['13'] = 'm', y['14'] = '&eta;', y['15'] = _0x55dc6e(0x507), y['16'] = 'p', y['17'] = _0x55dc6e(0x642), y['18'] = 'r', y['19'] = '&scaron;', y['20'] = _0x55dc6e(0x1b2), y['21'] = 'u', y['22'] = '&forall;', y['23'] = _0x55dc6e(0x609), y['24'] = 'x', y['25'] = _0x55dc6e(0x2b9), y['26'] = 'z', y['27'] = _0x55dc6e(0x42b), y['28'] = '&szlig;', y['29'] = '&sigmaf;', y['30'] = 'd', y['31'] = _0x55dc6e(0x494), y['32'] = _0x55dc6e(0x2b3), y['33'] = 'g', y['34'] = 'h', y['35'] = '&iuml;', y['36'] = _0x55dc6e(0x549), y['37'] = '&kappa;', y['38'] = _0x55dc6e(0x615), y['39'] = 'm', y['40'] = _0x55dc6e(0x589), y['41'] = '&oplus;', y['42'] = 'p', y['43'] = '&Omega;', y['44'] = 'r', y['45'] = _0x55dc6e(0x5bc), y['46'] = _0x55dc6e(0x1b2), y['47'] = 'u', y['48'] = '&forall;', y['49'] = _0x55dc6e(0x609), y['50'] = 'x', y['51'] = _0x55dc6e(0x2b9), y['52'] = 'z', y['53'] = '1', y['54'] = '2', y['55'] = '3', y['56'] = '4', y['57'] = '5', y['58'] = '6', y['59'] = '7', y['60'] = '8', y['61'] = '9', y['62'] = '0';
var z = {};
z['1'] = _0x55dc6e(0x259), z['2'] = _0x55dc6e(0x4d3), z['3'] = _0x55dc6e(0x416), z['4'] = _0x55dc6e(0x4ac), z['5'] = _0x55dc6e(0x37c), z['6'] = _0x55dc6e(0x517), z['7'] = _0x55dc6e(0x2ec), z['8'] = _0x55dc6e(0x42e), z['9'] = _0x55dc6e(0x329), z['10'] = _0x55dc6e(0x66d), z['11'] = _0x55dc6e(0x230), z['12'] = '&#1350;', z['13'] = _0x55dc6e(0x2f8), z['14'] = _0x55dc6e(0x5e0), z['15'] = _0x55dc6e(0x36b), z['16'] = _0x55dc6e(0x304), z['17'] = _0x55dc6e(0x289), z['18'] = _0x55dc6e(0x370), z['19'] = _0x55dc6e(0x2f6), z['20'] = '&#2670;', z['21'] = '&upsilon;', z['22'] = '&#3182;', z['23'] = _0x55dc6e(0x609), z['24'] = _0x55dc6e(0x2fa), z['25'] = '&#1506;', z['26'] = '&#2749;', z['27'] = '&#3588;', z['28'] = _0x55dc6e(0x4d3), z['29'] = _0x55dc6e(0x416), z['30'] = _0x55dc6e(0x4ac), z['31'] = _0x55dc6e(0x37c), z['32'] = _0x55dc6e(0x517), z['33'] = '&#2797;', z['34'] = '&#1210;', z['35'] = _0x55dc6e(0x329), z['36'] = _0x55dc6e(0x66d), z['37'] = _0x55dc6e(0x230), z['38'] = _0x55dc6e(0x4e6), z['39'] = _0x55dc6e(0x2f8), z['40'] = _0x55dc6e(0x5e0), z['41'] = '&#2790;', z['42'] = _0x55dc6e(0x304), z['43'] = _0x55dc6e(0x289), z['44'] = _0x55dc6e(0x370), z['45'] = _0x55dc6e(0x2f6), z['46'] = _0x55dc6e(0x52e), z['47'] = '&upsilon;', z['48'] = _0x55dc6e(0x644), z['49'] = _0x55dc6e(0x609), z['50'] = _0x55dc6e(0x2fa), z['51'] = _0x55dc6e(0x632), z['52'] = _0x55dc6e(0x2bc), z['53'] = '1', z['54'] = '2', z['55'] = '3', z['56'] = '4', z['57'] = '5', z['58'] = '6', z['59'] = '7', z['60'] = '8', z['61'] = '9', z['62'] = '0';
var A = {};
A['1'] = '&#1072;', A['2'] = '&#1073;', A['3'] = 'c', A['4'] = '&#1076;', A['5'] = '&#1105;', A['6'] = 'f', A['7'] = 'g', A['8'] = _0x55dc6e(0x21b), A['9'] = '&#1111;', A['10'] = 'j', A['11'] = '&#1082;', A['12'] = '&#1075;', A['13'] = '&#1131;', A['14'] = '&#1087;', A['15'] = _0x55dc6e(0x31e), A['16'] = 'p', A['17'] = _0x55dc6e(0x495), A['18'] = _0x55dc6e(0x4f6), A['19'] = '$', A['20'] = _0x55dc6e(0x2d0), A['21'] = _0x55dc6e(0x374), A['22'] = _0x55dc6e(0x1e5), A['23'] = _0x55dc6e(0x1cd), A['24'] = _0x55dc6e(0x4e9), A['25'] = _0x55dc6e(0x592), A['26'] = _0x55dc6e(0x2e9), A['27'] = _0x55dc6e(0x4a7), A['28'] = '&#1041;', A['29'] = 'C', A['30'] = '&#1044;', A['31'] = _0x55dc6e(0x1fb), A['32'] = 'F', A['33'] = 'G', A['34'] = 'H', A['35'] = '&#1031;', A['36'] = 'J', A['37'] = _0x55dc6e(0x61f), A['38'] = '&#1043;', A['39'] = '&#1130;', A['40'] = '&#1049;', A['41'] = _0x55dc6e(0x3a2), A['42'] = 'P', A['43'] = _0x55dc6e(0x36f), A['44'] = _0x55dc6e(0x3b8), A['45'] = '$', A['46'] = 'T', A['47'] = _0x55dc6e(0x3e1), A['48'] = _0x55dc6e(0x415), A['49'] = '&#1064;', A['50'] = _0x55dc6e(0x67f), A['51'] = _0x55dc6e(0x26e), A['52'] = _0x55dc6e(0x263), A['53'] = '1', A['54'] = '2', A['55'] = '3', A['56'] = '4', A['57'] = '5', A['58'] = '6', A['59'] = '7', A['60'] = '8', A['61'] = '9', A['62'] = '0';
var B = {};
B['1'] = _0x55dc6e(0x574), B['2'] = 'b&#830;', B['3'] = _0x55dc6e(0x293), B['4'] = _0x55dc6e(0x2f9), B['5'] = _0x55dc6e(0x684), B['6'] = _0x55dc6e(0x573), B['7'] = 'g&#830;', B['8'] = _0x55dc6e(0x264), B['9'] = _0x55dc6e(0x685), B['10'] = _0x55dc6e(0x5e6), B['11'] = 'k&#830;', B['12'] = _0x55dc6e(0x3e5), B['13'] = 'm&#830;', B['14'] = _0x55dc6e(0x2f5), B['15'] = _0x55dc6e(0x5dc), B['16'] = _0x55dc6e(0x48d), B['17'] = _0x55dc6e(0x45b), B['18'] = _0x55dc6e(0x45c), B['19'] = 's&#830;', B['20'] = _0x55dc6e(0x299), B['21'] = 'u&#830;', B['22'] = _0x55dc6e(0x5c8), B['23'] = _0x55dc6e(0x34d), B['24'] = _0x55dc6e(0x4fc), B['25'] = _0x55dc6e(0x41f), B['26'] = _0x55dc6e(0x61e), B['27'] = _0x55dc6e(0x56d), B['28'] = _0x55dc6e(0x49f), B['29'] = _0x55dc6e(0x38b), B['30'] = 'D&#830;', B['31'] = _0x55dc6e(0x41b), B['32'] = 'F&#830;', B['33'] = 'G&#830;', B['34'] = 'H&#830;', B['35'] = _0x55dc6e(0x559), B['36'] = _0x55dc6e(0x2e5), B['37'] = _0x55dc6e(0x55c), B['38'] = _0x55dc6e(0x492), B['39'] = _0x55dc6e(0x3c4), B['40'] = _0x55dc6e(0x59f), B['41'] = _0x55dc6e(0x493), B['42'] = _0x55dc6e(0x659), B['43'] = _0x55dc6e(0x48c), B['44'] = _0x55dc6e(0x3c3), B['45'] = 'S&#830;', B['46'] = 'T&#830;', B['47'] = _0x55dc6e(0x2cb), B['48'] = _0x55dc6e(0x567), B['49'] = 'W&#830;', B['50'] = 'X&#830;', B['51'] = 'Y&#830;', B['52'] = _0x55dc6e(0x3b0), B['53'] = _0x55dc6e(0x1fa), B['54'] = _0x55dc6e(0x536), B['55'] = '3&#830;', B['56'] = _0x55dc6e(0x49d), B['57'] = _0x55dc6e(0x3a0), B['58'] = _0x55dc6e(0x5ec), B['59'] = _0x55dc6e(0x339), B['60'] = '8&#830;', B['61'] = _0x55dc6e(0x208), B['62'] = _0x55dc6e(0x331);
var C = {};
C['1'] = 'a&#838;', C['2'] = _0x55dc6e(0x5b7), C['3'] = _0x55dc6e(0x2b2), C['4'] = _0x55dc6e(0x350), C['5'] = _0x55dc6e(0x46b), C['6'] = 'f&#838;', C['7'] = _0x55dc6e(0x44b), C['8'] = _0x55dc6e(0x4b7), C['9'] = _0x55dc6e(0x2f3), C['10'] = _0x55dc6e(0x469), C['11'] = _0x55dc6e(0x468), C['12'] = _0x55dc6e(0x4c5), C['13'] = _0x55dc6e(0x1d8), C['14'] = _0x55dc6e(0x3ef), C['15'] = 'o&#838;', C['16'] = 'p&#838;', C['17'] = 'q&#838;', C['18'] = 'r&#838;', C['19'] = _0x55dc6e(0x4d8), C['20'] = 't&#838;', C['21'] = _0x55dc6e(0x2e4), C['22'] = 'v&#838;', C['23'] = _0x55dc6e(0x3fa), C['24'] = _0x55dc6e(0x5a5), C['25'] = _0x55dc6e(0x585), C['26'] = _0x55dc6e(0x4cd), C['27'] = 'A&#838;', C['28'] = _0x55dc6e(0x5df), C['29'] = _0x55dc6e(0x32a), C['30'] = _0x55dc6e(0x39e), C['31'] = 'E&#838;', C['32'] = 'F&#838;', C['33'] = 'G&#838;', C['34'] = _0x55dc6e(0x3ea), C['35'] = _0x55dc6e(0x201), C['36'] = 'J&#838;', C['37'] = 'K&#838;', C['38'] = _0x55dc6e(0x353), C['39'] = _0x55dc6e(0x64f), C['40'] = 'N&#838;', C['41'] = _0x55dc6e(0x465), C['42'] = _0x55dc6e(0x67b), C['43'] = _0x55dc6e(0x436), C['44'] = _0x55dc6e(0x4d5), C['45'] = _0x55dc6e(0x386), C['46'] = 'T&#838;', C['47'] = _0x55dc6e(0x31d), C['48'] = _0x55dc6e(0x29e), C['49'] = _0x55dc6e(0x428), C['50'] = _0x55dc6e(0x252), C['51'] = _0x55dc6e(0x3dd), C['52'] = _0x55dc6e(0x1a1), C['53'] = '1&#838;', C['54'] = _0x55dc6e(0x5f1), C['55'] = _0x55dc6e(0x2a2), C['56'] = _0x55dc6e(0x48a), C['57'] = _0x55dc6e(0x56f), C['58'] = _0x55dc6e(0x44a), C['59'] = _0x55dc6e(0x51b), C['60'] = _0x55dc6e(0x586), C['61'] = _0x55dc6e(0x25c), C['62'] = _0x55dc6e(0x393);
var D = {};
D['1'] = _0x55dc6e(0x459), D['2'] = _0x55dc6e(0x491), D['3'] = _0x55dc6e(0x571), D['4'] = _0x55dc6e(0x3d6), D['5'] = _0x55dc6e(0x674), D['6'] = _0x55dc6e(0x4c0), D['7'] = _0x55dc6e(0x4f2), D['8'] = 'h&#826;', D['9'] = _0x55dc6e(0x2eb), D['10'] = _0x55dc6e(0x3ab), D['11'] = 'k&#826;', D['12'] = 'l&#826;', D['13'] = _0x55dc6e(0x62f), D['14'] = _0x55dc6e(0x238), D['15'] = 'o&#826;', D['16'] = _0x55dc6e(0x37a), D['17'] = _0x55dc6e(0x4f9), D['18'] = _0x55dc6e(0x440), D['19'] = _0x55dc6e(0x232), D['20'] = _0x55dc6e(0x225), D['21'] = _0x55dc6e(0x1d0), D['22'] = _0x55dc6e(0x2b7), D['23'] = 'w&#826;', D['24'] = _0x55dc6e(0x275), D['25'] = _0x55dc6e(0x2a0), D['26'] = _0x55dc6e(0x560), D['27'] = _0x55dc6e(0x5e5), D['28'] = _0x55dc6e(0x335), D['29'] = _0x55dc6e(0x57e), D['30'] = 'D&#826;', D['31'] = _0x55dc6e(0x194), D['32'] = _0x55dc6e(0x544), D['33'] = _0x55dc6e(0x3ba), D['34'] = _0x55dc6e(0x283), D['35'] = _0x55dc6e(0x1e3), D['36'] = _0x55dc6e(0x4a8), D['37'] = _0x55dc6e(0x2e1), D['38'] = _0x55dc6e(0x336), D['39'] = 'M&#826;', D['40'] = 'N&#826;', D['41'] = 'O&#826;', D['42'] = _0x55dc6e(0x5dd), D['43'] = _0x55dc6e(0x20a), D['44'] = _0x55dc6e(0x1ba), D['45'] = _0x55dc6e(0x5b2), D['46'] = _0x55dc6e(0x45a), D['47'] = _0x55dc6e(0x30e), D['48'] = _0x55dc6e(0x5bd), D['49'] = 'W&#826;', D['50'] = 'X&#826;', D['51'] = _0x55dc6e(0x3fd), D['52'] = 'Z&#826;', D['53'] = _0x55dc6e(0x643), D['54'] = _0x55dc6e(0x5ef), D['55'] = '3&#826;', D['56'] = _0x55dc6e(0x537), D['57'] = _0x55dc6e(0x621), D['58'] = _0x55dc6e(0x19d), D['59'] = _0x55dc6e(0x48e), D['60'] = _0x55dc6e(0x389), D['61'] = _0x55dc6e(0x23e), D['62'] = '0&#826;';
var E = {};
E['1'] = _0x55dc6e(0x52a), E['2'] = _0x55dc6e(0x2e3), E['3'] = _0x55dc6e(0x243), E['4'] = _0x55dc6e(0x635), E['5'] = 'e&#857;', E['6'] = _0x55dc6e(0x547), E['7'] = _0x55dc6e(0x3f2), E['8'] = _0x55dc6e(0x257), E['9'] = _0x55dc6e(0x25e), E['10'] = _0x55dc6e(0x41c), E['11'] = _0x55dc6e(0x53a), E['12'] = 'l&#857;', E['13'] = _0x55dc6e(0x2d7), E['14'] = 'n&#857;', E['15'] = _0x55dc6e(0x546), E['16'] = _0x55dc6e(0x395), E['17'] = _0x55dc6e(0x271), E['18'] = _0x55dc6e(0x2de), E['19'] = 's&#857;', E['20'] = _0x55dc6e(0x490), E['21'] = 'u&#857;', E['22'] = _0x55dc6e(0x60c), E['23'] = _0x55dc6e(0x276), E['24'] = 'x&#857;', E['25'] = _0x55dc6e(0x439), E['26'] = 'z&#857;', E['27'] = _0x55dc6e(0x4d4), E['28'] = _0x55dc6e(0x4c7), E['29'] = _0x55dc6e(0x504), E['30'] = _0x55dc6e(0x3c8), E['31'] = 'E&#857;', E['32'] = 'F&#857;', E['33'] = _0x55dc6e(0x214), E['34'] = _0x55dc6e(0x67e), E['35'] = _0x55dc6e(0x221), E['36'] = _0x55dc6e(0x45e), E['37'] = _0x55dc6e(0x44c), E['38'] = 'L&#857;', E['39'] = _0x55dc6e(0x5d3), E['40'] = _0x55dc6e(0x24e), E['41'] = 'O&#857;', E['42'] = _0x55dc6e(0x42d), E['43'] = _0x55dc6e(0x1f8), E['44'] = _0x55dc6e(0x203), E['45'] = 'S&#857;', E['46'] = _0x55dc6e(0x213), E['47'] = _0x55dc6e(0x280), E['48'] = _0x55dc6e(0x60e), E['49'] = _0x55dc6e(0x688), E['50'] = _0x55dc6e(0x341), E['51'] = _0x55dc6e(0x2d8), E['52'] = _0x55dc6e(0x4b6), E['53'] = _0x55dc6e(0x400), E['54'] = _0x55dc6e(0x1bb), E['55'] = _0x55dc6e(0x5d5), E['56'] = _0x55dc6e(0x26b), E['57'] = _0x55dc6e(0x46d), E['58'] = _0x55dc6e(0x597), E['59'] = '7&#857;', E['60'] = '8&#857;', E['61'] = '9&#857;', E['62'] = '0&#857;';
var F = {};
F['1'] = 'a&#799;', F['2'] = 'b&#799;', F['3'] = _0x55dc6e(0x46e), F['4'] = _0x55dc6e(0x421), F['5'] = 'e&#799;', F['6'] = _0x55dc6e(0x455), F['7'] = 'g&#799;', F['8'] = _0x55dc6e(0x1ed), F['9'] = _0x55dc6e(0x5cc), F['10'] = _0x55dc6e(0x1ea), F['11'] = 'k&#799;', F['12'] = 'l&#799;', F['13'] = _0x55dc6e(0x349), F['14'] = 'n&#799;', F['15'] = _0x55dc6e(0x2af), F['16'] = _0x55dc6e(0x202), F['17'] = _0x55dc6e(0x5d8), F['18'] = 'r&#799;', F['19'] = _0x55dc6e(0x1c4), F['20'] = _0x55dc6e(0x457), F['21'] = _0x55dc6e(0x5d7), F['22'] = _0x55dc6e(0x444), F['23'] = _0x55dc6e(0x344), F['24'] = _0x55dc6e(0x195), F['25'] = _0x55dc6e(0x604), F['26'] = _0x55dc6e(0x28a), F['27'] = _0x55dc6e(0x480), F['28'] = _0x55dc6e(0x5f2), F['29'] = _0x55dc6e(0x680), F['30'] = _0x55dc6e(0x654), F['31'] = 'E&#799;', F['32'] = _0x55dc6e(0x2cd), F['33'] = _0x55dc6e(0x687), F['34'] = _0x55dc6e(0x523), F['35'] = _0x55dc6e(0x460), F['36'] = 'J&#799;', F['37'] = _0x55dc6e(0x531), F['38'] = 'L&#799;', F['39'] = _0x55dc6e(0x4c8), F['40'] = _0x55dc6e(0x274), F['41'] = _0x55dc6e(0x31f), F['42'] = _0x55dc6e(0x306), F['43'] = _0x55dc6e(0x1de), F['44'] = _0x55dc6e(0x558), F['45'] = _0x55dc6e(0x4a3), F['46'] = 'T&#799;', F['47'] = _0x55dc6e(0x387), F['48'] = _0x55dc6e(0x1b0), F['49'] = _0x55dc6e(0x1da), F['50'] = _0x55dc6e(0x4da), F['51'] = _0x55dc6e(0x614), F['52'] = _0x55dc6e(0x29b), F['53'] = '1&#799;', F['54'] = _0x55dc6e(0x32d), F['55'] = '3&#799;', F['56'] = _0x55dc6e(0x3bd), F['57'] = _0x55dc6e(0x484), F['58'] = _0x55dc6e(0x1df), F['59'] = '7&#799;', F['60'] = '8&#799;', F['61'] = _0x55dc6e(0x1c9), F['62'] = _0x55dc6e(0x292);
var G = {};
G['1'] = _0x55dc6e(0x30c), G['2'] = _0x55dc6e(0x545), G['3'] = _0x55dc6e(0x4b9), G['4'] = _0x55dc6e(0x650), G['5'] = _0x55dc6e(0x1a0), G['6'] = _0x55dc6e(0x1e1), G['7'] = _0x55dc6e(0x4d0), G['8'] = _0x55dc6e(0x569), G['9'] = _0x55dc6e(0x42c), G['10'] = _0x55dc6e(0x3e9), G['11'] = 'k&#846;', G['12'] = _0x55dc6e(0x1b4), G['13'] = _0x55dc6e(0x4f5), G['14'] = _0x55dc6e(0x22c), G['15'] = 'o&#846;', G['16'] = _0x55dc6e(0x27d), G['17'] = _0x55dc6e(0x1ab), G['18'] = _0x55dc6e(0x284), G['19'] = 's&#846;', G['20'] = _0x55dc6e(0x2a1), G['21'] = _0x55dc6e(0x5e3), G['22'] = _0x55dc6e(0x1ff), G['23'] = _0x55dc6e(0x3b2), G['24'] = _0x55dc6e(0x5d4), G['25'] = _0x55dc6e(0x2ca), G['26'] = _0x55dc6e(0x3d0), G['27'] = _0x55dc6e(0x322), G['28'] = _0x55dc6e(0x348), G['29'] = 'C&#846;', G['30'] = _0x55dc6e(0x548), G['31'] = _0x55dc6e(0x65d), G['32'] = _0x55dc6e(0x314), G['33'] = 'G&#846;', G['34'] = _0x55dc6e(0x4b8), G['35'] = _0x55dc6e(0x44f), G['36'] = _0x55dc6e(0x5fb), G['37'] = _0x55dc6e(0x422), G['38'] = 'L&#846;', G['39'] = 'M&#846;', G['40'] = _0x55dc6e(0x2be), G['41'] = _0x55dc6e(0x66e), G['42'] = _0x55dc6e(0x1af), G['43'] = _0x55dc6e(0x210), G['44'] = _0x55dc6e(0x5b1), G['45'] = _0x55dc6e(0x3df), G['46'] = _0x55dc6e(0x463), G['47'] = 'U&#846;', G['48'] = _0x55dc6e(0x677), G['49'] = 'W&#846;', G['50'] = _0x55dc6e(0x342), G['51'] = _0x55dc6e(0x36a), G['52'] = _0x55dc6e(0x5ce), G['53'] = _0x55dc6e(0x320), G['54'] = _0x55dc6e(0x53e), G['55'] = '3&#846;', G['56'] = _0x55dc6e(0x608), G['57'] = _0x55dc6e(0x4bd), G['58'] = _0x55dc6e(0x66c), G['59'] = _0x55dc6e(0x4b5), G['60'] = _0x55dc6e(0x2bb), G['61'] = _0x55dc6e(0x488), G['62'] = _0x55dc6e(0x197);
var H = {};
H['1'] = 'a&#829;&#851;', H['2'] = _0x55dc6e(0x229), H['3'] = _0x55dc6e(0x2bf), H['4'] = _0x55dc6e(0x240), H['5'] = _0x55dc6e(0x29f), H['6'] = _0x55dc6e(0x4ec), H['7'] = _0x55dc6e(0x58d), H['8'] = _0x55dc6e(0x64c), H['9'] = _0x55dc6e(0x258), H['10'] = 'j&#829;&#851;', H['11'] = _0x55dc6e(0x59d), H['12'] = _0x55dc6e(0x4f0), H['13'] = _0x55dc6e(0x651), H['14'] = _0x55dc6e(0x56e), H['15'] = _0x55dc6e(0x637), H['16'] = 'p&#829;&#851;', H['17'] = _0x55dc6e(0x273), H['18'] = 'r&#829;&#851;', H['19'] = _0x55dc6e(0x4cc), H['20'] = _0x55dc6e(0x35d), H['21'] = _0x55dc6e(0x5d1), H['22'] = _0x55dc6e(0x671), H['23'] = _0x55dc6e(0x414), H['24'] = 'x&#829;&#851;', H['25'] = _0x55dc6e(0x2e0), H['26'] = 'z&#829;&#851;', H['27'] = 'A&#829;&#851;', H['28'] = _0x55dc6e(0x5c1), H['29'] = _0x55dc6e(0x3b3), H['30'] = 'D&#829;&#851;', H['31'] = _0x55dc6e(0x5e7), H['32'] = _0x55dc6e(0x3a6), H['33'] = _0x55dc6e(0x487), H['34'] = 'H&#829;&#851;', H['35'] = _0x55dc6e(0x233), H['36'] = 'J&#829;&#851;', H['37'] = _0x55dc6e(0x39f), H['38'] = 'L&#829;&#851;', H['39'] = 'M&#829;&#851;', H['40'] = _0x55dc6e(0x630), H['41'] = _0x55dc6e(0x38c), H['42'] = 'P&#829;&#851;', H['43'] = _0x55dc6e(0x449), H['44'] = _0x55dc6e(0x4aa), H['45'] = 'S&#829;&#851;', H['46'] = _0x55dc6e(0x5f0), H['47'] = _0x55dc6e(0x227), H['48'] = 'V&#829;&#851;', H['49'] = _0x55dc6e(0x378), H['50'] = 'X&#829;&#851;', H['51'] = _0x55dc6e(0x39a), H['52'] = _0x55dc6e(0x1d3), H['53'] = '1&#829;&#851;', H['54'] = _0x55dc6e(0x4f1), H['55'] = _0x55dc6e(0x2c8), H['56'] = _0x55dc6e(0x1d4), H['57'] = _0x55dc6e(0x209), H['58'] = _0x55dc6e(0x388), H['59'] = '7&#829;&#851;', H['60'] = '8&#829;&#851;', H['61'] = _0x55dc6e(0x600), H['62'] = _0x55dc6e(0x394);
var I = {};
I['1'] = _0x55dc6e(0x678), I['2'] = _0x55dc6e(0x35f), I['3'] = '&#120460;&#823;', I['4'] = _0x55dc6e(0x246), I['5'] = _0x55dc6e(0x294), I['6'] = '&#120463;&#823;', I['7'] = _0x55dc6e(0x5f7), I['8'] = _0x55dc6e(0x228), I['9'] = _0x55dc6e(0x412), I['10'] = '&#120467;&#823;', I['11'] = '&#120468;&#823;', I['12'] = _0x55dc6e(0x528), I['13'] = _0x55dc6e(0x3ed), I['14'] = _0x55dc6e(0x220), I['15'] = _0x55dc6e(0x423), I['16'] = _0x55dc6e(0x381), I['17'] = _0x55dc6e(0x554), I['18'] = _0x55dc6e(0x4ef), I['19'] = '&#120476;&#823;', I['20'] = _0x55dc6e(0x656), I['21'] = _0x55dc6e(0x40a), I['22'] = _0x55dc6e(0x3d7), I['23'] = _0x55dc6e(0x2fb), I['24'] = _0x55dc6e(0x5b5), I['25'] = '&#120482;&#823;', I['26'] = '&#120483;&#823;', I['27'] = _0x55dc6e(0x36d), I['28'] = '&#120433;&#823;', I['29'] = _0x55dc6e(0x380), I['30'] = _0x55dc6e(0x219), I['31'] = '&#120436;&#823;', I['32'] = _0x55dc6e(0x486), I['33'] = _0x55dc6e(0x3ff), I['34'] = '&#120439;&#823;', I['35'] = _0x55dc6e(0x200), I['36'] = '&#120441;&#823;', I['37'] = _0x55dc6e(0x447), I['38'] = '&#120443;&#823;', I['39'] = _0x55dc6e(0x57f), I['40'] = _0x55dc6e(0x23b), I['41'] = _0x55dc6e(0x2c7), I['42'] = _0x55dc6e(0x1d5), I['43'] = '&#120448;&#823;', I['44'] = '&#120449;&#823;', I['45'] = _0x55dc6e(0x56c), I['46'] = _0x55dc6e(0x2fc), I['47'] = _0x55dc6e(0x5f9), I['48'] = _0x55dc6e(0x467), I['49'] = _0x55dc6e(0x226), I['50'] = _0x55dc6e(0x1c8), I['51'] = _0x55dc6e(0x4e5), I['52'] = _0x55dc6e(0x385), I['53'] = _0x55dc6e(0x502), I['54'] = _0x55dc6e(0x3da), I['55'] = _0x55dc6e(0x196), I['56'] = _0x55dc6e(0x5db), I['57'] = _0x55dc6e(0x38f), I['58'] = _0x55dc6e(0x313), I['59'] = _0x55dc6e(0x5ea), I['60'] = _0x55dc6e(0x682), I['61'] = _0x55dc6e(0x4c3), I['62'] = _0x55dc6e(0x53d);
var J = {};
J['1'] = _0x55dc6e(0x2ce), J['2'] = _0x55dc6e(0x59b), J['3'] = _0x55dc6e(0x224), J['4'] = _0x55dc6e(0x61b), J['5'] = _0x55dc6e(0x453), J['6'] = _0x55dc6e(0x29d), J['7'] = 'g&#866;', J['8'] = _0x55dc6e(0x4bb), J['9'] = 'i&#866;', J['10'] = _0x55dc6e(0x3db), J['11'] = _0x55dc6e(0x296), J['12'] = _0x55dc6e(0x309), J['13'] = 'm&#866;', J['14'] = 'n&#866;', J['15'] = _0x55dc6e(0x5b0), J['16'] = _0x55dc6e(0x58c), J['17'] = _0x55dc6e(0x2f4), J['18'] = 'r&#866;', J['19'] = _0x55dc6e(0x441), J['20'] = _0x55dc6e(0x4ed), J['21'] = 'u&#866;', J['22'] = _0x55dc6e(0x3fb), J['23'] = _0x55dc6e(0x3c7), J['24'] = _0x55dc6e(0x37b), J['25'] = _0x55dc6e(0x5bf), J['26'] = _0x55dc6e(0x61d), J['27'] = _0x55dc6e(0x4fd), J['28'] = _0x55dc6e(0x2ff), J['29'] = _0x55dc6e(0x5a8), J['30'] = 'D&#866;', J['31'] = _0x55dc6e(0x4eb), J['32'] = _0x55dc6e(0x3dc), J['33'] = _0x55dc6e(0x527), J['34'] = _0x55dc6e(0x5d6), J['35'] = 'I&#866;', J['36'] = _0x55dc6e(0x391), J['37'] = _0x55dc6e(0x2ad), J['38'] = _0x55dc6e(0x24f), J['39'] = _0x55dc6e(0x223), J['40'] = _0x55dc6e(0x627), J['41'] = 'O&#866;', J['42'] = 'P&#866;', J['43'] = _0x55dc6e(0x1a7), J['44'] = _0x55dc6e(0x59c), J['45'] = _0x55dc6e(0x506), J['46'] = _0x55dc6e(0x646), J['47'] = _0x55dc6e(0x267), J['48'] = 'V&#866;', J['49'] = _0x55dc6e(0x1e4), J['50'] = 'X&#866;', J['51'] = _0x55dc6e(0x61c), J['52'] = _0x55dc6e(0x2dc), J['53'] = _0x55dc6e(0x1ef), J['54'] = _0x55dc6e(0x2d6), J['55'] = _0x55dc6e(0x54b), J['56'] = _0x55dc6e(0x499), J['57'] = _0x55dc6e(0x285), J['58'] = '6&#866;', J['59'] = _0x55dc6e(0x477), J['60'] = _0x55dc6e(0x4af), J['61'] = '9&#866;', J['62'] = _0x55dc6e(0x1b9);
var K = {};
K['1'] = _0x55dc6e(0x602), K['2'] = _0x55dc6e(0x50f), K['3'] = _0x55dc6e(0x686), K['4'] = _0x55dc6e(0x4ca), K['5'] = _0x55dc6e(0x3d9), K['6'] = 'f&#828;', K['7'] = _0x55dc6e(0x4bc), K['8'] = _0x55dc6e(0x318), K['9'] = _0x55dc6e(0x231), K['10'] = _0x55dc6e(0x345), K['11'] = _0x55dc6e(0x2ab), K['12'] = _0x55dc6e(0x68b), K['13'] = _0x55dc6e(0x606), K['14'] = 'n&#828;', K['15'] = _0x55dc6e(0x19f), K['16'] = 'p&#828;', K['17'] = _0x55dc6e(0x550), K['18'] = _0x55dc6e(0x19a), K['19'] = 's&#828;', K['20'] = 't&#828;', K['21'] = _0x55dc6e(0x62a), K['22'] = _0x55dc6e(0x3f5), K['23'] = _0x55dc6e(0x2f0), K['24'] = 'x&#828;', K['25'] = 'y&#828;', K['26'] = 'z&#828;', K['27'] = _0x55dc6e(0x4a0), K['28'] = _0x55dc6e(0x663), K['29'] = 'C&#828;', K['30'] = 'D&#828;', K['31'] = _0x55dc6e(0x4b0), K['32'] = _0x55dc6e(0x379), K['33'] = _0x55dc6e(0x27b), K['34'] = _0x55dc6e(0x581), K['35'] = _0x55dc6e(0x236), K['36'] = _0x55dc6e(0x407), K['37'] = _0x55dc6e(0x1fc), K['38'] = _0x55dc6e(0x4db), K['39'] = _0x55dc6e(0x1f9), K['40'] = 'N&#828;', K['41'] = _0x55dc6e(0x29a), K['42'] = _0x55dc6e(0x305), K['43'] = _0x55dc6e(0x52b), K['44'] = 'R&#828;', K['45'] = _0x55dc6e(0x268), K['46'] = _0x55dc6e(0x51d), K['47'] = _0x55dc6e(0x52d), K['48'] = _0x55dc6e(0x5e8), K['49'] = _0x55dc6e(0x334), K['50'] = _0x55dc6e(0x454), K['51'] = _0x55dc6e(0x281), K['52'] = _0x55dc6e(0x4dd), K['53'] = _0x55dc6e(0x63b), K['54'] = _0x55dc6e(0x47c), K['55'] = '3&#828;', K['56'] = '4&#828;', K['57'] = _0x55dc6e(0x22d), K['58'] = _0x55dc6e(0x3ec), K['59'] = _0x55dc6e(0x5b8), K['60'] = '8&#828;', K['61'] = _0x55dc6e(0x3f7), K['62'] = _0x55dc6e(0x1c5);
var L = {};
L['s1'] = h, L['s2'] = i, L['s3'] = j, L['s4'] = k, L['s5'] = l, L['s6'] = m, L['s7'] = n, L['s8'] = o, L['s9'] = p, L[_0x55dc6e(0x33e)] = q, L[_0x55dc6e(0x411)] = r, L['s12'] = s, L[_0x55dc6e(0x670)] = t, L['s14'] = u, L['s15'] = v, L[_0x55dc6e(0x316)] = w, L[_0x55dc6e(0x5a4)] = x, L['s18'] = y, L[_0x55dc6e(0x301)] = z, L[_0x55dc6e(0x32c)] = A, L[_0x55dc6e(0x2b5)] = B, L[_0x55dc6e(0x3cf)] = C, L[_0x55dc6e(0x31c)] = D, L[_0x55dc6e(0x5ab)] = E, L[_0x55dc6e(0x277)] = F, L[_0x55dc6e(0x4b1)] = G, L['s27'] = H, L[_0x55dc6e(0x1c2)] = I, L['s30'] = J, L[_0x55dc6e(0x340)] = K;
var newtext = L;

function Change(_0x58c2be, _0x97d4c7) {
    var _0x326121 = _0x55dc6e,
        _0xbea65 = '',
        _0x58c2be = _0x58c2be;
    if (_0x58c2be[_0x326121(0x482)] == 0x0) return;
    for (i = 0x0; i < _0x58c2be[_0x326121(0x482)]; i++) {
        var _0x42c0d0 = _0x58c2be['charAt'](i),
            _0x2e499a = normal[_0x326121(0x4a9)](_0x42c0d0) + 0x1;
        if (_0x42c0d0 == '\x20') _0xbea65 += '\x20';
        else !_0x2e499a ? _0xbea65 += _0x42c0d0 : _0xbea65 += newtext[_0x97d4c7][_0x2e499a];
    }
    return _0xbea65;
}
var M = {};
M['0'] = '0', M['1'] = '1', M['2'] = '2', M['3'] = '3', M['4'] = '4', M['5'] = '5', M['6'] = '6', M['7'] = '7', M['8'] = '8', M['9'] = '9', M['a'] = 'ᗩ', M['b'] = 'ᗷ', M['c'] = 'ᑢ', M['d'] = 'ᕲ', M['e'] = 'ᘿ', M['f'] = 'ᖴ', M['g'] = 'ᘜ', M['h'] = 'ᕼ', M['i'] = 'ᓰ', M['j'] = 'ᒚ', M['k'] = 'ᖽᐸ', M['l'] = 'ᒪ', M['m'] = 'ᘻ', M['n'] = 'ᘉ', M['o'] = 'ᓍ', M['p'] = 'ᕵ', M['q'] = 'ᕴ', M['r'] = 'ᖇ', M['s'] = 'S', M['t'] = 'ᖶ', M['u'] = 'ᑘ', M['v'] = 'ᐺ', M['w'] = 'ᘺ', M['x'] = '᙭', M['y'] = 'ᖻ', M['z'] = 'ᗱ', M['A'] = 'ᗩ', M['B'] = 'ᗷ', M['C'] = 'ᑢ', M['D'] = 'ᕲ', M['E'] = 'ᘿ', M['F'] = 'ᖴ', M['G'] = 'ᘜ', M['H'] = 'ᕼ', M['I'] = 'ᓰ', M['J'] = 'ᒚ', M['K'] = 'ᖽᐸ', M['L'] = 'ᒪ', M['M'] = 'ᘻ', M['N'] = 'ᘉ', M['O'] = 'ᓍ', M['P'] = 'ᕵ', M['Q'] = 'ᕴ', M['R'] = 'ᖇ', M['S'] = 'S', M['T'] = 'ᖶ', M['U'] = 'ᑘ', M['V'] = 'ᐺ', M['W'] = 'ᘺ', M['X'] = '᙭', M['Y'] = 'ᖻ', M['Z'] = 'ᗱ';
const futureAlienCharMap = M;
var N = {};
N['0'] = '0', N['1'] = '1', N['2'] = '2', N['3'] = '3', N['4'] = '4', N['5'] = '5', N['6'] = '6', N['7'] = '7', N['8'] = '8', N['9'] = '9', N['a'] = 'ค', N['b'] = '๖', N['c'] = '¢', N['d'] = '໓', N['e'] = 'ē', N['f'] = 'f', N['g'] = 'ງ', N['h'] = 'h', N['i'] = 'i', N['j'] = 'ว', N['k'] = 'k', N['l'] = 'l', N['m'] = '๓', N['n'] = 'ຖ', N['o'] = '໐', N['p'] = 'p', N['q'] = '๑', N['r'] = 'r', N['s'] = 'Ş', N['t'] = 't', N['u'] = 'น', N['v'] = 'ง', N['w'] = 'ຟ', N['x'] = 'x', N['y'] = 'ฯ', N['z'] = 'ຊ', N['A'] = 'ค', N['B'] = '๖', N['C'] = '¢', N['D'] = '໓', N['E'] = 'ē', N['F'] = 'f', N['G'] = 'ງ', N['H'] = 'h', N['I'] = 'i', N['J'] = 'ว', N['K'] = 'k', N['L'] = 'l', N['M'] = '๓', N['N'] = 'ຖ', N['O'] = '໐', N['P'] = 'p', N['Q'] = '๑', N['R'] = 'r', N['S'] = 'Ş', N['T'] = 't', N['U'] = 'น', N['V'] = 'ง', N['W'] = 'ຟ', N['X'] = 'x', N['Y'] = 'ฯ', N['Z'] = 'ຊ';
const squiggle6CharMap = N;
var O = {};
O['0'] = '0', O['1'] = '1', O['2'] = '2', O['3'] = '3', O['4'] = '4', O['5'] = '5', O['6'] = '6', O['7'] = '7', O['8'] = '8', O['9'] = '9', O['a'] = 'ą', O['b'] = 'ც', O['c'] = 'ƈ', O['d'] = 'ɖ', O['e'] = 'ɛ', O['f'] = 'ʄ', O['g'] = 'ɠ', O['h'] = 'ɧ', O['i'] = 'ı', O['j'] = 'ʝ', O['k'] = 'ƙ', O['l'] = 'Ɩ', O['m'] = 'ɱ', O['n'] = 'ŋ', O['o'] = 'ơ', O['p'] = '℘', O['q'] = 'զ', O['r'] = 'ཞ', O['s'] = 'ʂ', O['t'] = 'ɬ', O['u'] = 'ų', O['v'] = '۷', O['w'] = 'ῳ', O['x'] = 'ҳ', O['y'] = 'ყ', O['z'] = 'ʑ', O['A'] = 'ą', O['B'] = 'ც', O['C'] = 'ƈ', O['D'] = 'ɖ', O['E'] = 'ɛ', O['F'] = 'ʄ', O['G'] = 'ɠ', O['H'] = 'ɧ', O['I'] = 'ı', O['J'] = 'ʝ', O['K'] = 'ƙ', O['L'] = 'Ɩ', O['M'] = 'ɱ', O['N'] = 'ŋ', O['O'] = 'ơ', O['P'] = '℘', O['Q'] = 'զ', O['R'] = 'ཞ', O['S'] = 'ʂ', O['T'] = 'ɬ', O['U'] = 'ų', O['V'] = '۷', O['W'] = 'ῳ', O['X'] = 'ҳ', O['Y'] = 'ყ', O['Z'] = 'ʑ';
const squiggle5CharMap = O;
var P = {};
P['0'] = '0', P['1'] = '1', P['2'] = '2', P['3'] = '3', P['4'] = '4', P['5'] = '5', P['6'] = '6', P['7'] = '7', P['8'] = '8', P['9'] = '9', P['a'] = 'ﾑ', P['b'] = '乃', P['c'] = 'ᄃ', P['d'] = 'り', P['e'] = '乇', P['f'] = 'ｷ', P['g'] = 'ム', P['h'] = 'ん', P['i'] = 'ﾉ', P['j'] = 'ﾌ', P['k'] = 'ズ', P['l'] = 'ﾚ', P['m'] = 'ﾶ', P['n'] = '刀', P['o'] = 'の', P['p'] = 'ｱ', P['q'] = 'ゐ', P['r'] = '尺', P['s'] = '丂', P['t'] = 'ｲ', P['u'] = 'ひ', P['v'] = '√', P['w'] = 'W', P['x'] = 'ﾒ', P['y'] = 'ﾘ', P['z'] = '乙', P['A'] = 'ﾑ', P['B'] = '乃', P['C'] = 'ᄃ', P['D'] = 'り', P['E'] = '乇', P['F'] = 'ｷ', P['G'] = 'ム', P['H'] = 'ん', P['I'] = 'ﾉ', P['J'] = 'ﾌ', P['K'] = 'ズ', P['L'] = 'ﾚ', P['M'] = 'ﾶ', P['N'] = '刀', P['O'] = 'の', P['P'] = 'ｱ', P['Q'] = 'ゐ', P['R'] = '尺', P['S'] = '丂', P['T'] = 'ｲ', P['U'] = 'ひ', P['V'] = '√', P['W'] = 'W', P['X'] = 'ﾒ', P['Y'] = 'ﾘ', P['Z'] = '乙';
const asianStyle2CharMap = P;
var Q = {};
Q['0'] = '0', Q['1'] = '1', Q['2'] = '2', Q['3'] = '3', Q['4'] = '4', Q['5'] = '5', Q['6'] = '6', Q['7'] = '7', Q['8'] = '8', Q['9'] = '9', Q['a'] = '卂', Q['b'] = '乃', Q['c'] = '匚', Q['d'] = 'ᗪ', Q['e'] = '乇', Q['f'] = '千', Q['g'] = 'Ꮆ', Q['h'] = '卄', Q['i'] = '丨', Q['j'] = 'ﾌ', Q['k'] = 'Ҝ', Q['l'] = 'ㄥ', Q['m'] = '爪', Q['n'] = '几', Q['o'] = 'ㄖ', Q['p'] = '卩', Q['q'] = 'Ɋ', Q['r'] = '尺', Q['s'] = '丂', Q['t'] = 'ㄒ', Q['u'] = 'ㄩ', Q['v'] = 'ᐯ', Q['w'] = '山', Q['x'] = '乂', Q['y'] = 'ㄚ', Q['z'] = '乙', Q['A'] = '卂', Q['B'] = '乃', Q['C'] = '匚', Q['D'] = 'ᗪ', Q['E'] = '乇', Q['F'] = '千', Q['G'] = 'Ꮆ', Q['H'] = '卄', Q['I'] = '丨', Q['J'] = 'ﾌ', Q['K'] = 'Ҝ', Q['L'] = 'ㄥ', Q['M'] = '爪', Q['N'] = '几', Q['O'] = 'ㄖ', Q['P'] = '卩', Q['Q'] = 'Ɋ', Q['R'] = '尺', Q['S'] = '丂', Q['T'] = 'ㄒ', Q['U'] = 'ㄩ', Q['V'] = 'ᐯ', Q['W'] = '山', Q['X'] = '乂', Q['Y'] = 'ㄚ', Q['Z'] = '乙';
const asianStyleCharMap = Q;
var R = {};
R['0'] = '0', R['1'] = '1', R['2'] = '2', R['3'] = '3', R['4'] = '4', R['5'] = '5', R['6'] = '6', R['7'] = '7', R['8'] = '8', R['9'] = '9', R['a'] = '🄰', R['b'] = '🄱', R['c'] = '🄲', R['d'] = '🄳', R['e'] = '🄴', R['f'] = '🄵', R['g'] = '🄶', R['h'] = '🄷', R['i'] = '🄸', R['j'] = '🄹', R['k'] = '🄺', R['l'] = '🄻', R['m'] = '🄼', R['n'] = '🄽', R['o'] = '🄾', R['p'] = '🄿', R['q'] = '🅀', R['r'] = '🅁', R['s'] = '🅂', R['t'] = '🅃', R['u'] = '🅄', R['v'] = '🅅', R['w'] = '🅆', R['x'] = '🅇', R['y'] = '🅈', R['z'] = '🅉', R['A'] = '🄰', R['B'] = '🄱', R['C'] = '🄲', R['D'] = '🄳', R['E'] = '🄴', R['F'] = '🄵', R['G'] = '🄶', R['H'] = '🄷', R['I'] = '🄸', R['J'] = '🄹', R['K'] = '🄺', R['L'] = '🄻', R['M'] = '🄼', R['N'] = '🄽', R['O'] = '🄾', R['P'] = '🄿', R['Q'] = '🅀', R['R'] = '🅁', R['S'] = '🅂', R['T'] = '🅃', R['U'] = '🅄', R['V'] = '🅅', R['W'] = '🅆', R['X'] = '🅇', R['Y'] = '🅈', R['Z'] = '🅉';
const squaresCharMap = R;
var S = {};
S['0'] = '0', S['1'] = '1', S['2'] = '2', S['3'] = '3', S['4'] = '4', S['5'] = '5', S['6'] = '6', S['7'] = '7', S['8'] = '8', S['9'] = '9', S['a'] = 'Ꮧ', S['b'] = 'Ᏸ', S['c'] = 'ፈ', S['d'] = 'Ꮄ', S['e'] = 'Ꮛ', S['f'] = 'Ꭶ', S['g'] = 'Ꮆ', S['h'] = 'Ꮒ', S['i'] = 'Ꭵ', S['j'] = 'Ꮰ', S['k'] = 'Ꮶ', S['l'] = 'Ꮭ', S['m'] = 'Ꮇ', S['n'] = 'Ꮑ', S['o'] = 'Ꭷ', S['p'] = 'Ꭾ', S['q'] = 'Ꭴ', S['r'] = 'Ꮢ', S['s'] = 'Ꮥ', S['t'] = 'Ꮦ', S['u'] = 'Ꮼ', S['v'] = 'Ꮙ', S['w'] = 'Ꮗ', S['x'] = 'ጀ', S['y'] = 'Ꭹ', S['z'] = 'ፚ', S['A'] = 'Ꮧ', S['B'] = 'Ᏸ', S['C'] = 'ፈ', S['D'] = 'Ꮄ', S['E'] = 'Ꮛ', S['F'] = 'Ꭶ', S['G'] = 'Ꮆ', S['H'] = 'Ꮒ', S['I'] = 'Ꭵ', S['J'] = 'Ꮰ', S['K'] = 'Ꮶ', S['L'] = 'Ꮭ', S['M'] = 'Ꮇ', S['N'] = 'Ꮑ', S['O'] = 'Ꭷ', S['P'] = 'Ꭾ', S['Q'] = 'Ꭴ', S['R'] = 'Ꮢ', S['S'] = 'Ꮥ', S['T'] = 'Ꮦ', S['U'] = 'Ꮼ', S['V'] = 'Ꮙ', S['W'] = 'Ꮗ', S['X'] = 'ጀ', S['Y'] = 'Ꭹ', S['Z'] = 'ፚ';
const squiggle4CharMap = S;
var T = {};
T['0'] = '0', T['1'] = '1', T['2'] = '2', T['3'] = '3', T['4'] = '4', T['5'] = '5', T['6'] = '6', T['7'] = '7', T['8'] = '8', T['9'] = '9', T['a'] = 'ᗩ', T['b'] = 'ᗷ', T['c'] = 'ᑕ', T['d'] = 'ᗪ', T['e'] = 'E', T['f'] = 'ᖴ', T['g'] = 'G', T['h'] = 'ᕼ', T['i'] = 'I', T['j'] = 'ᒍ', T['k'] = 'K', T['l'] = 'ᒪ', T['m'] = 'ᗰ', T['n'] = 'ᑎ', T['o'] = 'O', T['p'] = 'ᑭ', T['q'] = 'ᑫ', T['r'] = 'ᖇ', T['s'] = 'ᔕ', T['t'] = 'T', T['u'] = 'ᑌ', T['v'] = 'ᐯ', T['w'] = 'ᗯ', T['x'] = '᙭', T['y'] = 'Y', T['z'] = 'ᘔ', T['A'] = 'ᗩ', T['B'] = 'ᗷ', T['C'] = 'ᑕ', T['D'] = 'ᗪ', T['E'] = 'E', T['F'] = 'ᖴ', T['G'] = 'G', T['H'] = 'ᕼ', T['I'] = 'I', T['J'] = 'ᒍ', T['K'] = 'K', T['L'] = 'ᒪ', T['M'] = 'ᗰ', T['N'] = 'ᑎ', T['O'] = 'O', T['P'] = 'ᑭ', T['Q'] = 'ᑫ', T['R'] = 'ᖇ', T['S'] = 'ᔕ', T['T'] = 'T', T['U'] = 'ᑌ', T['V'] = 'ᐯ', T['W'] = 'ᗯ', T['X'] = '᙭', T['Y'] = 'Y', T['Z'] = 'ᘔ';
const neonCharMap = T;
var U = {};
U['0'] = '0', U['1'] = '1', U['2'] = '2', U['3'] = '3', U['4'] = '4', U['5'] = '5', U['6'] = '6', U['7'] = '7', U['8'] = '8', U['9'] = '9', U['a'] = 'ǟ', U['b'] = 'ɮ', U['c'] = 'ƈ', U['d'] = 'ɖ', U['e'] = 'ɛ', U['f'] = 'ʄ', U['g'] = 'ɢ', U['h'] = 'ɦ', U['i'] = 'ɨ', U['j'] = 'ʝ', U['k'] = 'ӄ', U['l'] = 'ʟ', U['m'] = 'ʍ', U['n'] = 'ռ', U['o'] = 'օ', U['p'] = 'ք', U['q'] = 'զ', U['r'] = 'ʀ', U['s'] = 'ֆ', U['t'] = 'ȶ', U['u'] = 'ʊ', U['v'] = 'ʋ', U['w'] = 'ա', U['x'] = 'Ӽ', U['y'] = 'ʏ', U['z'] = 'ʐ', U['A'] = 'ǟ', U['B'] = 'ɮ', U['C'] = 'ƈ', U['D'] = 'ɖ', U['E'] = 'ɛ', U['F'] = 'ʄ', U['G'] = 'ɢ', U['H'] = 'ɦ', U['I'] = 'ɨ', U['J'] = 'ʝ', U['K'] = 'ӄ', U['L'] = 'ʟ', U['M'] = 'ʍ', U['N'] = 'ռ', U['O'] = 'օ', U['P'] = 'ք', U['Q'] = 'զ', U['R'] = 'ʀ', U['S'] = 'ֆ', U['T'] = 'ȶ', U['U'] = 'ʊ', U['V'] = 'ʋ', U['W'] = 'ա', U['X'] = 'Ӽ', U['Y'] = 'ʏ', U['Z'] = 'ʐ';
const squiggle3CharMap = U;
var V = {};
V['0'] = '𝟶', V['1'] = '𝟷', V['2'] = '𝟸', V['3'] = '𝟹', V['4'] = '𝟺', V['5'] = '𝟻', V['6'] = '𝟼', V['7'] = '𝟽', V['8'] = '𝟾', V['9'] = '𝟿', V['a'] = '𝚊', V['b'] = '𝚋', V['c'] = '𝚌', V['d'] = '𝚍', V['e'] = '𝚎', V['f'] = '𝚏', V['g'] = '𝚐', V['h'] = '𝚑', V['i'] = '𝚒', V['j'] = '𝚓', V['k'] = '𝚔', V['l'] = '𝚕', V['m'] = '𝚖', V['n'] = '𝚗', V['o'] = '𝚘', V['p'] = '𝚙', V['q'] = '𝚚', V['r'] = '𝚛', V['s'] = '𝚜', V['t'] = '𝚝', V['u'] = '𝚞', V['v'] = '𝚟', V['w'] = '𝚠', V['x'] = '𝚡', V['y'] = '𝚢', V['z'] = '𝚣', V['A'] = '𝙰', V['B'] = '𝙱', V['C'] = '𝙲', V['D'] = '𝙳', V['E'] = '𝙴', V['F'] = '𝙵', V['G'] = '𝙶', V['H'] = '𝙷', V['I'] = '𝙸', V['J'] = '𝙹', V['K'] = '𝙺', V['L'] = '𝙻', V['M'] = '𝙼', V['N'] = '𝙽', V['O'] = '𝙾', V['P'] = '𝙿', V['Q'] = '𝚀', V['R'] = '𝚁', V['S'] = '𝚂', V['T'] = '𝚃', V['U'] = '𝚄', V['V'] = '𝚅', V['W'] = '𝚆', V['X'] = '𝚇', V['Y'] = '𝚈', V['Z'] = '𝚉';
const monospaceCharMap = V;
var W = {};
W['0'] = '0', W['1'] = '1', W['2'] = '2', W['3'] = '3', W['4'] = '4', W['5'] = '5', W['6'] = '6', W['7'] = '7', W['8'] = '8', W['9'] = '9', W['a'] = '𝙖', W['b'] = '𝙗', W['c'] = '𝙘', W['d'] = '𝙙', W['e'] = '𝙚', W['f'] = '𝙛', W['g'] = '𝙜', W['h'] = '𝙝', W['i'] = '𝙞', W['j'] = '𝙟', W['k'] = '𝙠', W['l'] = '𝙡', W['m'] = '𝙢', W['n'] = '𝙣', W['o'] = '𝙤', W['p'] = '𝙥', W['q'] = '𝙦', W['r'] = '𝙧', W['s'] = '𝙨', W['t'] = '𝙩', W['u'] = '𝙪', W['v'] = '𝙫', W['w'] = '𝙬', W['x'] = '𝙭', W['y'] = '𝙮', W['z'] = '𝙯', W['A'] = '𝘼', W['B'] = '𝘽', W['C'] = '𝘾', W['D'] = '𝘿', W['E'] = '𝙀', W['F'] = '𝙁', W['G'] = '𝙂', W['H'] = '𝙃', W['I'] = '𝙄', W['J'] = '𝙅', W['K'] = '𝙆', W['L'] = '𝙇', W['M'] = '𝙈', W['N'] = '𝙉', W['O'] = '𝙊', W['P'] = '𝙋', W['Q'] = '𝙌', W['R'] = '𝙍', W['S'] = '𝙎', W['T'] = '𝙏', W['U'] = '𝙐', W['V'] = '𝙑', W['W'] = '𝙒', W['X'] = '𝙓', W['Y'] = '𝙔', W['Z'] = '𝙕';
const boldItalicCharMap = W;
var X = {};
X['0'] = '𝟎', X['1'] = '𝟏', X['2'] = '𝟐', X['3'] = '𝟑', X['4'] = '𝟒', X['5'] = '𝟓', X['6'] = '𝟔', X['7'] = '𝟕', X['8'] = '𝟖', X['9'] = '𝟗', X['a'] = '𝐚', X['b'] = '𝐛', X['c'] = '𝐜', X['d'] = '𝐝', X['e'] = '𝐞', X['f'] = '𝐟', X['g'] = '𝐠', X['h'] = '𝐡', X['i'] = '𝐢', X['j'] = '𝐣', X['k'] = '𝐤', X['l'] = '𝐥', X['m'] = '𝐦', X['n'] = '𝐧', X['o'] = '𝐨', X['p'] = '𝐩', X['q'] = '𝐪', X['r'] = '𝐫', X['s'] = '𝐬', X['t'] = '𝐭', X['u'] = '𝐮', X['v'] = '𝐯', X['w'] = '𝐰', X['x'] = '𝐱', X['y'] = '𝐲', X['z'] = '𝐳', X['A'] = '𝐀', X['B'] = '𝐁', X['C'] = '𝐂', X['D'] = '𝐃', X['E'] = '𝐄', X['F'] = '𝐅', X['G'] = '𝐆', X['H'] = '𝐇', X['I'] = '𝐈', X['J'] = '𝐉', X['K'] = '𝐊', X['L'] = '𝐋', X['M'] = '𝐌', X['N'] = '𝐍', X['O'] = '𝐎', X['P'] = '𝐏', X['Q'] = '𝐐', X['R'] = '𝐑', X['S'] = '𝐒', X['T'] = '𝐓', X['U'] = '𝐔', X['V'] = '𝐕', X['W'] = '𝐖', X['X'] = '𝐗', X['Y'] = '𝐘', X['Z'] = '𝐙';
const boldCharMap = X;
var Y = {};
Y['0'] = '0', Y['1'] = '1', Y['2'] = '2', Y['3'] = '3', Y['4'] = '4', Y['5'] = '5', Y['6'] = '6', Y['7'] = '7', Y['8'] = '8', Y['9'] = '9', Y['a'] = '𝘢', Y['b'] = '𝘣', Y['c'] = '𝘤', Y['d'] = '𝘥', Y['e'] = '𝘦', Y['f'] = '𝘧', Y['g'] = '𝘨', Y['h'] = '𝘩', Y['i'] = '𝘪', Y['j'] = '𝘫', Y['k'] = '𝘬', Y['l'] = '𝘭', Y['m'] = '𝘮', Y['n'] = '𝘯', Y['o'] = '𝘰', Y['p'] = '𝘱', Y['q'] = '𝘲', Y['r'] = '𝘳', Y['s'] = '𝘴', Y['t'] = '𝘵', Y['u'] = '𝘶', Y['v'] = '𝘷', Y['w'] = '𝘸', Y['x'] = '𝘹', Y['y'] = '𝘺', Y['z'] = '𝘻', Y['A'] = '𝘈', Y['B'] = '𝘉', Y['C'] = '𝘊', Y['D'] = '𝘋', Y['E'] = '𝘌', Y['F'] = '𝘍', Y['G'] = '𝘎', Y['H'] = '𝘏', Y['I'] = '𝘐', Y['J'] = '𝘑', Y['K'] = '𝘒', Y['L'] = '𝘓', Y['M'] = '𝘔', Y['N'] = '𝘕', Y['O'] = '𝘖', Y['P'] = '𝘗', Y['Q'] = '𝘘', Y['R'] = '𝘙', Y['S'] = '𝘚', Y['T'] = '𝘛', Y['U'] = '𝘜', Y['V'] = '𝘝', Y['W'] = '𝘞', Y['X'] = '𝘟', Y['Y'] = '𝘠', Y['Z'] = '𝘡';
const italicCharMap = Y;
var Z = {};
Z['0'] = '0', Z['1'] = '1', Z['2'] = '2', Z['3'] = '3', Z['4'] = '4', Z['5'] = '5', Z['6'] = '6', Z['7'] = '7', Z['8'] = '8', Z['9'] = '9', Z['a'] = 'α', Z['b'] = 'Ⴆ', Z['c'] = 'ƈ', Z['d'] = 'ԃ', Z['e'] = 'ҽ', Z['f'] = 'ϝ', Z['g'] = 'ɠ', Z['h'] = 'ԋ', Z['i'] = 'ι', Z['j'] = 'ʝ', Z['k'] = 'ƙ', Z['l'] = 'ʅ', Z['m'] = 'ɱ', Z['n'] = 'ɳ', Z['o'] = 'σ', Z['p'] = 'ρ', Z['q'] = 'ϙ', Z['r'] = 'ɾ', Z['s'] = 'ʂ', Z['t'] = 'ƚ', Z['u'] = 'υ', Z['v'] = 'ʋ', Z['w'] = 'ɯ', Z['x'] = 'x', Z['y'] = 'ყ', Z['z'] = 'ȥ', Z['A'] = 'A', Z['B'] = 'B', Z['C'] = 'C', Z['D'] = 'D', Z['E'] = 'E', Z['F'] = 'F', Z['G'] = 'G', Z['H'] = 'H', Z['I'] = 'I', Z['J'] = 'J', Z['K'] = 'K', Z['L'] = 'L', Z['M'] = 'M', Z['N'] = 'N', Z['O'] = 'O', Z['P'] = 'P', Z['Q'] = 'Q', Z['R'] = 'R', Z['S'] = 'S', Z['T'] = 'T', Z['U'] = 'U', Z['V'] = 'V', Z['W'] = 'W', Z['X'] = 'X', Z['Y'] = 'Y', Z['Z'] = 'Z';
const squiggle2CharMap = Z;
var a0 = {};
a0['0'] = '0', a0['1'] = '1', a0['2'] = '2', a0['3'] = '3', a0['4'] = '4', a0['5'] = '5', a0['6'] = '6', a0['7'] = '7', a0['8'] = '8', a0['9'] = '9', a0['a'] = '₳', a0['b'] = '฿', a0['c'] = '₵', a0['d'] = 'Đ', a0['e'] = 'Ɇ', a0['f'] = '₣', a0['g'] = '₲', a0['h'] = 'Ⱨ', a0['i'] = 'ł', a0['j'] = 'J', a0['k'] = '₭', a0['l'] = 'Ⱡ', a0['m'] = '₥', a0['n'] = '₦', a0['o'] = 'Ø', a0['p'] = '₱', a0['q'] = 'Q', a0['r'] = 'Ɽ', a0['s'] = '₴', a0['t'] = '₮', a0['u'] = 'Ʉ', a0['v'] = 'V', a0['w'] = '₩', a0['x'] = 'Ӿ', a0['y'] = 'Ɏ', a0['z'] = 'Ⱬ', a0['A'] = '₳', a0['B'] = '฿', a0['C'] = '₵', a0['D'] = 'Đ', a0['E'] = 'Ɇ', a0['F'] = '₣', a0['G'] = '₲', a0['H'] = 'Ⱨ', a0['I'] = 'ł', a0['J'] = 'J', a0['K'] = '₭', a0['L'] = 'Ⱡ', a0['M'] = '₥', a0['N'] = '₦', a0['O'] = 'Ø', a0['P'] = '₱', a0['Q'] = 'Q', a0['R'] = 'Ɽ', a0['S'] = '₴', a0['T'] = '₮', a0['U'] = 'Ʉ', a0['V'] = 'V', a0['W'] = '₩', a0['X'] = 'Ӿ', a0['Y'] = 'Ɏ', a0['Z'] = 'Ⱬ';
const currencyCharMap = a0;
var a1 = {};
a1['0'] = '0', a1['1'] = '1', a1['2'] = '2', a1['3'] = '3', a1['4'] = '4', a1['5'] = '5', a1['6'] = '6', a1['7'] = '7', a1['8'] = '8', a1['9'] = '9', a1['a'] = 'å', a1['b'] = 'ß', a1['c'] = '¢', a1['d'] = 'Ð', a1['e'] = 'ê', a1['f'] = '£', a1['g'] = 'g', a1['h'] = 'h', a1['i'] = 'ï', a1['j'] = 'j', a1['k'] = 'k', a1['l'] = 'l', a1['m'] = 'm', a1['n'] = 'ñ', a1['o'] = 'ð', a1['p'] = 'þ', a1['q'] = 'q', a1['r'] = 'r', a1['s'] = '§', a1['t'] = '†', a1['u'] = 'µ', a1['v'] = 'v', a1['w'] = 'w', a1['x'] = 'x', a1['y'] = '¥', a1['z'] = 'z', a1['A'] = 'Ä', a1['B'] = 'ß', a1['C'] = 'Ç', a1['D'] = 'Ð', a1['E'] = 'È', a1['F'] = '£', a1['G'] = 'G', a1['H'] = 'H', a1['I'] = 'Ì', a1['J'] = 'J', a1['K'] = 'K', a1['L'] = 'L', a1['M'] = 'M', a1['N'] = 'ñ', a1['O'] = 'Ö', a1['P'] = 'þ', a1['Q'] = 'Q', a1['R'] = 'R', a1['S'] = '§', a1['T'] = '†', a1['U'] = 'Ú', a1['V'] = 'V', a1['W'] = 'W', a1['X'] = '×', a1['Y'] = '¥', a1['Z'] = 'Z';
const symbolsCharMap = a1;
var a2 = {};
a2['0'] = '0', a2['1'] = '1', a2['2'] = '2', a2['3'] = '3', a2['4'] = '4', a2['5'] = '5', a2['6'] = '6', a2['7'] = '7', a2['8'] = '8', a2['9'] = '9', a2['a'] = 'α', a2['b'] = 'в', a2['c'] = '¢', a2['d'] = '∂', a2['e'] = 'є', a2['f'] = 'ƒ', a2['g'] = 'g', a2['h'] = 'н', a2['i'] = 'ι', a2['j'] = 'נ', a2['k'] = 'к', a2['l'] = 'ℓ', a2['m'] = 'м', a2['n'] = 'η', a2['o'] = 'σ', a2['p'] = 'ρ', a2['q'] = 'q', a2['r'] = 'я', a2['s'] = 'ѕ', a2['t'] = 'т', a2['u'] = 'υ', a2['v'] = 'ν', a2['w'] = 'ω', a2['x'] = 'χ', a2['y'] = 'у', a2['z'] = 'z', a2['A'] = 'α', a2['B'] = 'в', a2['C'] = '¢', a2['D'] = '∂', a2['E'] = 'є', a2['F'] = 'ƒ', a2['G'] = 'g', a2['H'] = 'н', a2['I'] = 'ι', a2['J'] = 'נ', a2['K'] = 'к', a2['L'] = 'ℓ', a2['M'] = 'м', a2['N'] = 'η', a2['O'] = 'σ', a2['P'] = 'ρ', a2['Q'] = 'q', a2['R'] = 'я', a2['S'] = 'ѕ', a2['T'] = 'т', a2['U'] = 'υ', a2['V'] = 'ν', a2['W'] = 'ω', a2['X'] = 'χ', a2['Y'] = 'у', a2['Z'] = 'z';
const greekCharMap = a2;
var a3 = {};
a3['0'] = '⊘', a3['1'] = '𝟙', a3['2'] = 'ϩ', a3['3'] = 'Ӡ', a3['4'] = '५', a3['5'] = 'Ƽ', a3['6'] = 'Ϭ', a3['7'] = '7', a3['8'] = '𝟠', a3['9'] = '९', a3['a'] = 'ą', a3['b'] = 'ҍ', a3['c'] = 'ç', a3['d'] = 'ժ', a3['e'] = 'ҽ', a3['f'] = 'ƒ', a3['g'] = 'ց', a3['h'] = 'հ', a3['i'] = 'ì', a3['j'] = 'ʝ', a3['k'] = 'ҟ', a3['l'] = 'Ӏ', a3['m'] = 'ʍ', a3['n'] = 'ղ', a3['o'] = 'օ', a3['p'] = 'ք', a3['q'] = 'զ', a3['r'] = 'ɾ', a3['s'] = 'ʂ', a3['t'] = 'է', a3['u'] = 'մ', a3['v'] = 'ѵ', a3['w'] = 'ա', a3['x'] = '×', a3['y'] = 'վ', a3['z'] = 'Հ', a3['A'] = 'Ⱥ', a3['B'] = 'β', a3['C'] = '↻', a3['D'] = 'Ꭰ', a3['E'] = 'Ɛ', a3['F'] = 'Ƒ', a3['G'] = 'Ɠ', a3['H'] = 'Ƕ', a3['I'] = 'į', a3['J'] = 'ل', a3['K'] = 'Ҡ', a3['L'] = 'Ꝉ', a3['M'] = 'Ɱ', a3['N'] = 'ហ', a3['O'] = 'ට', a3['P'] = 'φ', a3['Q'] = 'Ҩ', a3['R'] = 'འ', a3['S'] = 'Ϛ', a3['T'] = 'Ͳ', a3['U'] = 'Ա', a3['V'] = 'Ỽ', a3['W'] = 'చ', a3['X'] = 'ჯ', a3['Y'] = 'Ӌ', a3['Z'] = 'ɀ';
const bentTextCharMap = a3;
var a4 = {};
a4['0'] = '0', a4['1'] = '1', a4['2'] = '2', a4['3'] = '3', a4['4'] = '4', a4['5'] = '5', a4['6'] = '6', a4['7'] = '7', a4['8'] = '8', a4['9'] = '9', a4['a'] = 'Λ', a4['b'] = 'B', a4['c'] = 'ᄃ', a4['d'] = 'D', a4['e'] = 'Σ', a4['f'] = 'F', a4['g'] = 'G', a4['h'] = 'Ή', a4['i'] = 'I', a4['j'] = 'J', a4['k'] = 'K', a4['l'] = 'ᄂ', a4['m'] = 'M', a4['n'] = 'П', a4['o'] = 'Ө', a4['p'] = 'P', a4['q'] = 'Q', a4['r'] = 'Я', a4['s'] = 'Ƨ', a4['t'] = 'Ƭ', a4['u'] = 'Ц', a4['v'] = 'V', a4['w'] = 'Щ', a4['x'] = 'X', a4['y'] = 'Y', a4['z'] = 'Z', a4['A'] = 'Λ', a4['B'] = 'B', a4['C'] = 'ᄃ', a4['D'] = 'D', a4['E'] = 'Σ', a4['F'] = 'F', a4['G'] = 'G', a4['H'] = 'Ή', a4['I'] = 'I', a4['J'] = 'J', a4['K'] = 'K', a4['L'] = 'ᄂ', a4['M'] = 'M', a4['N'] = 'П', a4['O'] = 'Ө', a4['P'] = 'P', a4['Q'] = 'Q', a4['R'] = 'Я', a4['S'] = 'Ƨ', a4['T'] = 'Ƭ', a4['U'] = 'Ц', a4['V'] = 'V', a4['W'] = 'Щ', a4['X'] = 'X', a4['Y'] = 'Y', a4['Z'] = 'Z';
const upperAnglesCharMap = a4;
var a5 = {};
a5['0'] = '₀', a5['1'] = '₁', a5['2'] = '₂', a5['3'] = '₃', a5['4'] = '₄', a5['5'] = '₅', a5['6'] = '₆', a5['7'] = '₇', a5['8'] = '₈', a5['9'] = '₉', a5['a'] = 'ₐ', a5['b'] = 'b', a5['c'] = 'c', a5['d'] = 'd', a5['e'] = 'ₑ', a5['f'] = 'f', a5['g'] = 'g', a5['h'] = 'ₕ', a5['i'] = 'ᵢ', a5['j'] = 'ⱼ', a5['k'] = 'ₖ', a5['l'] = 'ₗ', a5['m'] = 'ₘ', a5['n'] = 'ₙ', a5['o'] = 'ₒ', a5['p'] = 'ₚ', a5['q'] = 'q', a5['r'] = 'ᵣ', a5['s'] = 'ₛ', a5['t'] = 'ₜ', a5['u'] = 'ᵤ', a5['v'] = 'ᵥ', a5['w'] = 'w', a5['x'] = 'ₓ', a5['y'] = 'y', a5['z'] = 'z', a5['A'] = 'ₐ', a5['B'] = 'B', a5['C'] = 'C', a5['D'] = 'D', a5['E'] = 'ₑ', a5['F'] = 'F', a5['G'] = 'G', a5['H'] = 'ₕ', a5['I'] = 'ᵢ', a5['J'] = 'ⱼ', a5['K'] = 'ₖ', a5['L'] = 'ₗ', a5['M'] = 'ₘ', a5['N'] = 'ₙ', a5['O'] = 'ₒ', a5['P'] = 'ₚ', a5['Q'] = 'Q', a5['R'] = 'ᵣ', a5['S'] = 'ₛ', a5['T'] = 'ₜ', a5['U'] = 'ᵤ', a5['V'] = 'ᵥ', a5['W'] = 'W', a5['X'] = 'ₓ', a5['Y'] = 'Y', a5['Z'] = 'Z', a5['+'] = '₊', a5['-'] = '₋', a5['='] = '₌', a5['('] = '₍', a5[')'] = '₎';
const subscriptCharMap = a5;
var a6 = {};
a6['0'] = '⁰', a6['1'] = '¹', a6['2'] = '²', a6['3'] = '³', a6['4'] = '⁴', a6['5'] = '⁵', a6['6'] = '⁶', a6['7'] = '⁷', a6['8'] = '⁸', a6['9'] = '⁹', a6['a'] = 'ᵃ', a6['b'] = 'ᵇ', a6['c'] = 'ᶜ', a6['d'] = 'ᵈ', a6['e'] = 'ᵉ', a6['f'] = 'ᶠ', a6['g'] = 'ᵍ', a6['h'] = 'ʰ', a6['i'] = 'ⁱ', a6['j'] = 'ʲ', a6['k'] = 'ᵏ', a6['l'] = 'ˡ', a6['m'] = 'ᵐ', a6['n'] = 'ⁿ', a6['o'] = 'ᵒ', a6['p'] = 'ᵖ', a6['q'] = 'q', a6['r'] = 'ʳ', a6['s'] = 'ˢ', a6['t'] = 'ᵗ', a6['u'] = 'ᵘ', a6['v'] = 'ᵛ', a6['w'] = 'ʷ', a6['x'] = 'ˣ', a6['y'] = 'ʸ', a6['z'] = 'ᶻ', a6['A'] = 'ᴬ', a6['B'] = 'ᴮ', a6['C'] = 'ᶜ', a6['D'] = 'ᴰ', a6['E'] = 'ᴱ', a6['F'] = 'ᶠ', a6['G'] = 'ᴳ', a6['H'] = 'ᴴ', a6['I'] = 'ᴵ', a6['J'] = 'ᴶ', a6['K'] = 'ᴷ', a6['L'] = 'ᴸ', a6['M'] = 'ᴹ', a6['N'] = 'ᴺ', a6['O'] = 'ᴼ', a6['P'] = 'ᴾ', a6['Q'] = 'Q', a6['R'] = 'ᴿ', a6['S'] = 'ˢ', a6['T'] = 'ᵀ', a6['U'] = 'ᵁ', a6['V'] = 'ⱽ', a6['W'] = 'ᵂ', a6['X'] = 'ˣ', a6['Y'] = 'ʸ', a6['Z'] = 'ᶻ', a6['+'] = '⁺', a6['-'] = '⁻', a6['='] = '⁼', a6['('] = '⁽', a6[')'] = '⁾';
const superscriptCharMap = a6;
var a7 = {};
a7['0'] = '0', a7['1'] = '1', a7['2'] = '2', a7['3'] = '3', a7['4'] = '4', a7['5'] = '5', a7['6'] = '6', a7['7'] = '7', a7['8'] = '8', a7['9'] = '9', a7['a'] = 'ค', a7['b'] = '๒', a7['c'] = 'ς', a7['d'] = '๔', a7['e'] = 'є', a7['f'] = 'Ŧ', a7['g'] = 'ﻮ', a7['h'] = 'ђ', a7['i'] = 'เ', a7['j'] = 'ן', a7['k'] = 'к', a7['l'] = 'ɭ', a7['m'] = '๓', a7['n'] = 'ภ', a7['o'] = '๏', a7['p'] = 'ק', a7['q'] = 'ợ', a7['r'] = 'г', a7['s'] = 'ร', a7['t'] = 'Շ', a7['u'] = 'ย', a7['v'] = 'ש', a7['w'] = 'ฬ', a7['x'] = 'א', a7['y'] = 'ץ', a7['z'] = 'չ', a7['A'] = 'ค', a7['B'] = '๒', a7['C'] = 'ς', a7['D'] = '๔', a7['E'] = 'є', a7['F'] = 'Ŧ', a7['G'] = 'ﻮ', a7['H'] = 'ђ', a7['I'] = 'เ', a7['J'] = 'ן', a7['K'] = 'к', a7['L'] = 'ɭ', a7['M'] = '๓', a7['N'] = 'ภ', a7['O'] = '๏', a7['P'] = 'ק', a7['Q'] = 'ợ', a7['R'] = 'г', a7['S'] = 'ร', a7['T'] = 'Շ', a7['U'] = 'ย', a7['V'] = 'ש', a7['W'] = 'ฬ', a7['X'] = 'א', a7['Y'] = 'ץ', a7['Z'] = 'չ';
const squiggleCharMap = a7;
var a8 = {};
a8['0'] = '𝟘', a8['1'] = '𝟙', a8['2'] = '𝟚', a8['3'] = '𝟛', a8['4'] = '𝟜', a8['5'] = '𝟝', a8['6'] = '𝟞', a8['7'] = '𝟟', a8['8'] = '𝟠', a8['9'] = '𝟡', a8['a'] = '𝕒', a8['b'] = '𝕓', a8['c'] = '𝕔', a8['d'] = '𝕕', a8['e'] = '𝕖', a8['f'] = '𝕗', a8['g'] = '𝕘', a8['h'] = '𝕙', a8['i'] = '𝕚', a8['j'] = '𝕛', a8['k'] = '𝕜', a8['l'] = '𝕝', a8['m'] = '𝕞', a8['n'] = '𝕟', a8['o'] = '𝕠', a8['p'] = '𝕡', a8['q'] = '𝕢', a8['r'] = '𝕣', a8['s'] = '𝕤', a8['t'] = '𝕥', a8['u'] = '𝕦', a8['v'] = '𝕧', a8['w'] = '𝕨', a8['x'] = '𝕩', a8['y'] = '𝕪', a8['z'] = '𝕫', a8['A'] = '𝔸', a8['B'] = '𝔹', a8['C'] = 'ℂ', a8['D'] = '𝔻', a8['E'] = '𝔼', a8['F'] = '𝔽', a8['G'] = '𝔾', a8['H'] = 'ℍ', a8['I'] = '𝕀', a8['J'] = '𝕁', a8['K'] = '𝕂', a8['L'] = '𝕃', a8['M'] = '𝕄', a8['N'] = 'ℕ', a8['O'] = '𝕆', a8['P'] = 'ℙ', a8['Q'] = 'ℚ', a8['R'] = 'ℝ', a8['S'] = '𝕊', a8['T'] = '𝕋', a8['U'] = '𝕌', a8['V'] = '𝕍', a8['W'] = '𝕎', a8['X'] = '𝕏', a8['Y'] = '𝕐', a8['Z'] = 'ℤ';
const doubleStruckCharMap = a8;
var a9 = {};
a9['0'] = '0', a9['1'] = '1', a9['2'] = '2', a9['3'] = '3', a9['4'] = '4', a9['5'] = '5', a9['6'] = '6', a9['7'] = '7', a9['8'] = '8', a9['9'] = '9', a9['a'] = '𝖆', a9['b'] = '𝖇', a9['c'] = '𝖈', a9['d'] = '𝖉', a9['e'] = '𝖊', a9['f'] = '𝖋', a9['g'] = '𝖌', a9['h'] = '𝖍', a9['i'] = '𝖎', a9['j'] = '𝖏', a9['k'] = '𝖐', a9['l'] = '𝖑', a9['m'] = '𝖒', a9['n'] = '𝖓', a9['o'] = '𝖔', a9['p'] = '𝖕', a9['q'] = '𝖖', a9['r'] = '𝖗', a9['s'] = '𝖘', a9['t'] = '𝖙', a9['u'] = '𝖚', a9['v'] = '𝖛', a9['w'] = '𝖜', a9['x'] = '𝖝', a9['y'] = '𝖞', a9['z'] = '𝖟', a9['A'] = '𝕬', a9['B'] = '𝕭', a9['C'] = '𝕮', a9['D'] = '𝕯', a9['E'] = '𝕰', a9['F'] = '𝕱', a9['G'] = '𝕲', a9['H'] = '𝕳', a9['I'] = '𝕴', a9['J'] = '𝕵', a9['K'] = '𝕶', a9['L'] = '𝕷', a9['M'] = '𝕸', a9['N'] = '𝕹', a9['O'] = '𝕺', a9['P'] = '𝕻', a9['Q'] = '𝕼', a9['R'] = '𝕽', a9['S'] = '𝕾', a9['T'] = '𝕿', a9['U'] = '𝖀', a9['V'] = '𝖁', a9['W'] = '𝖂', a9['X'] = '𝖃', a9['Y'] = '𝖄', a9['Z'] = '𝖅';
const medievalCharMap = a9;
var aa = {};
aa['q'] = '🆀', aa['w'] = '🆆', aa['e'] = '🅴', aa['r'] = '🆁', aa['t'] = '🆃', aa['y'] = '🆈', aa['u'] = '🆄', aa['i'] = '🅸', aa['o'] = '🅾', aa['p'] = '🅿', aa['a'] = '🅰', aa['s'] = '🆂', aa['d'] = '🅳', aa['f'] = '🅵', aa['g'] = '🅶', aa['h'] = '🅷', aa['j'] = '🅹', aa['k'] = '🅺', aa['l'] = '🅻', aa['z'] = '🆉', aa['x'] = '🆇', aa['c'] = '🅲', aa['v'] = '🆅', aa['b'] = '🅱', aa['n'] = '🅽', aa['m'] = '🅼';
const invertedSquaresCharMap = aa;
var ab = {};
ab['0'] = '0', ab['1'] = '1', ab['2'] = '2', ab['3'] = '3', ab['4'] = '4', ab['5'] = '5', ab['6'] = '6', ab['7'] = '7', ab['8'] = '8', ab['9'] = '9', ab['a'] = '𝓪', ab['b'] = '𝓫', ab['c'] = '𝓬', ab['d'] = '𝓭', ab['e'] = '𝓮', ab['f'] = '𝓯', ab['g'] = '𝓰', ab['h'] = '𝓱', ab['i'] = '𝓲', ab['j'] = '𝓳', ab['k'] = '𝓴', ab['l'] = '𝓵', ab['m'] = '𝓶', ab['n'] = '𝓷', ab['o'] = '𝓸', ab['p'] = '𝓹', ab['q'] = '𝓺', ab['r'] = '𝓻', ab['s'] = '𝓼', ab['t'] = '𝓽', ab['u'] = '𝓾', ab['v'] = '𝓿', ab['w'] = '𝔀', ab['x'] = '𝔁', ab['y'] = '𝔂', ab['z'] = '𝔃', ab['A'] = '𝓐', ab['B'] = '𝓑', ab['C'] = '𝓒', ab['D'] = '𝓓', ab['E'] = '𝓔', ab['F'] = '𝓕', ab['G'] = '𝓖', ab['H'] = '𝓗', ab['I'] = '𝓘', ab['J'] = '𝓙', ab['K'] = '𝓚', ab['L'] = '𝓛', ab['M'] = '𝓜', ab['N'] = '𝓝', ab['O'] = '𝓞', ab['P'] = '𝓟', ab['Q'] = '𝓠', ab['R'] = '𝓡', ab['S'] = '𝓢', ab['T'] = '𝓣', ab['U'] = '𝓤', ab['V'] = '𝓥', ab['W'] = '𝓦', ab['X'] = '𝓧', ab['Y'] = '𝓨', ab['Z'] = '𝓩';
const cursiveCharMap = ab;
var ac = {};
ac['a'] = '𝔞', ac['b'] = '𝔟', ac['c'] = '𝔠', ac['d'] = '𝔡', ac['e'] = '𝔢', ac['f'] = '𝔣', ac['g'] = '𝔤', ac['h'] = '𝔥', ac['i'] = '𝔦', ac['j'] = '𝔧', ac['k'] = '𝔨', ac['l'] = '𝔩', ac['m'] = '𝔪', ac['n'] = '𝔫', ac['o'] = '𝔬', ac['p'] = '𝔭', ac['q'] = '𝔮', ac['r'] = '𝔯', ac['s'] = '𝔰', ac['t'] = '𝔱', ac['u'] = '𝔲', ac['v'] = '𝔳', ac['w'] = '𝔴', ac['x'] = '𝔵', ac['y'] = '𝔶', ac['z'] = '𝔷', ac['A'] = '𝔄', ac['B'] = '𝔅', ac['C'] = 'ℭ', ac['D'] = '𝔇', ac['E'] = '𝔈', ac['F'] = '𝔉', ac['G'] = '𝔊', ac['H'] = 'ℌ', ac['I'] = 'ℑ', ac['J'] = '𝔍', ac['K'] = '𝔎', ac['L'] = '𝔏', ac['M'] = '𝔐', ac['N'] = '𝔑', ac['O'] = '𝔒', ac['P'] = '𝔓', ac['Q'] = '𝔔', ac['R'] = 'ℜ', ac['S'] = '𝔖', ac['T'] = '𝔗', ac['U'] = '𝔘', ac['V'] = '𝔙', ac['W'] = '𝔚', ac['X'] = '𝔛', ac['Y'] = '𝔜', ac['Z'] = 'ℨ';
const oldEnglishCharMap = ac;
var ad = {};
ad['`'] = '`', ad['1'] = '１', ad['2'] = '２', ad['3'] = '３', ad['4'] = '４', ad['5'] = '５', ad['6'] = '６', ad['7'] = '７', ad['8'] = '８', ad['9'] = '９', ad['0'] = '０', ad['-'] = '－', ad['='] = '＝', ad['~'] = '~', ad['!'] = '！', ad['@'] = '＠', ad['#'] = '＃', ad['$'] = '＄', ad['%'] = '％', ad['^'] = '^', ad['&'] = '＆', ad['*'] = '＊', ad['('] = '（', ad[')'] = '）', ad['_'] = '_', ad['+'] = '＋', ad['q'] = 'ｑ', ad['w'] = 'ｗ', ad['e'] = 'ｅ', ad['r'] = 'ｒ', ad['t'] = 'ｔ', ad['y'] = 'ｙ', ad['u'] = 'ｕ', ad['i'] = 'ｉ', ad['o'] = 'ｏ', ad['p'] = 'ｐ', ad['['] = '[', ad[']'] = ']', ad['\x5c'] = '\x5c', ad['Q'] = 'Ｑ', ad['W'] = 'Ｗ', ad['E'] = 'Ｅ', ad['R'] = 'Ｒ', ad['T'] = 'Ｔ', ad['Y'] = 'Ｙ', ad['U'] = 'Ｕ', ad['I'] = 'Ｉ', ad['O'] = 'Ｏ', ad['P'] = 'Ｐ', ad['{'] = '{', ad['}'] = '}', ad['|'] = '|', ad['a'] = 'ａ', ad['s'] = 'ｓ', ad['d'] = 'ｄ', ad['f'] = 'ｆ', ad['g'] = 'ｇ', ad['h'] = 'ｈ', ad['j'] = 'ｊ', ad['k'] = 'ｋ', ad['l'] = 'ｌ', ad[';'] = '；', ad['\x27'] = '＇', ad['A'] = 'Ａ', ad['S'] = 'Ｓ', ad['D'] = 'Ｄ', ad['F'] = 'Ｆ', ad['G'] = 'Ｇ', ad['H'] = 'Ｈ', ad['J'] = 'Ｊ', ad['K'] = 'Ｋ', ad['L'] = 'Ｌ', ad[':'] = '：', ad['\x22'] = '\x22', ad['z'] = 'ｚ', ad['x'] = 'ｘ', ad['c'] = 'ｃ', ad['v'] = 'ｖ', ad['b'] = 'ｂ', ad['n'] = 'ｎ', ad['m'] = 'ｍ', ad[','] = '，', ad['.'] = '．', ad['/'] = '／', ad['Z'] = 'Ｚ', ad['X'] = 'Ｘ', ad['C'] = 'Ｃ', ad['V'] = 'Ｖ', ad['B'] = 'Ｂ', ad['N'] = 'Ｎ', ad['M'] = 'Ｍ', ad['<'] = '<', ad['>'] = '>', ad['?'] = '？';
const wideTextCharMap = ad;

function Lunicode() {
    var _0x295939 = _0x55dc6e,
        _0x1e4047 = {};
    _0x1e4047['a'] = 'ɐ', _0x1e4047['b'] = 'q', _0x1e4047['c'] = 'ɔ', _0x1e4047['d'] = 'p', _0x1e4047['e'] = 'ǝ', _0x1e4047['f'] = 'ɟ', _0x1e4047['g'] = 'ɓ', _0x1e4047['h'] = 'ɥ', _0x1e4047['i'] = 'ı', _0x1e4047['j'] = 'ɾ', _0x1e4047['k'] = 'ʞ', _0x1e4047['l'] = 'l', _0x1e4047['m'] = 'ɯ', _0x1e4047['n'] = 'u', _0x1e4047['r'] = 'ɹ', _0x1e4047['t'] = 'ʇ', _0x1e4047['v'] = 'ʌ', _0x1e4047['w'] = 'ʍ', _0x1e4047['y'] = 'ʎ', _0x1e4047['A'] = '∀', _0x1e4047['B'] = 'ᙠ', _0x1e4047['C'] = 'Ɔ', _0x1e4047['D'] = 'ᗡ', _0x1e4047['E'] = 'Ǝ', _0x1e4047['F'] = 'Ⅎ', _0x1e4047['G'] = '⅁', _0x1e4047['J'] = 'ſ', _0x1e4047['K'] = '⋊', _0x1e4047['L'] = '˥', _0x1e4047['M'] = 'W', _0x1e4047['P'] = 'Ԁ', _0x1e4047['Q'] = 'Ό', _0x1e4047['R'] = 'ᴚ', _0x1e4047['T'] = '⊥', _0x1e4047['U'] = '∩', _0x1e4047['V'] = 'Λ', _0x1e4047['Y'] = '⅄', _0x1e4047['1'] = '⇂', _0x1e4047['2'] = 'ᄅ', _0x1e4047['3'] = 'Ɛ', _0x1e4047['4'] = 'ㄣ', _0x1e4047['5'] = 'ގ', _0x1e4047['6'] = '9', _0x1e4047['7'] = 'ㄥ', _0x1e4047['&'] = '⅋', _0x1e4047['.'] = '˙', _0x1e4047['\x22'] = '„', _0x1e4047[';'] = '؛', _0x1e4047['['] = ']', _0x1e4047['('] = ')', _0x1e4047['{'] = '}', _0x1e4047['?'] = '¿', _0x1e4047['!'] = '¡', _0x1e4047['\x27'] = ',', _0x1e4047['<'] = '>', _0x1e4047['‾'] = '_', _0x1e4047['¯'] = '_', _0x1e4047['‿'] = '⁀', _0x1e4047['⁅'] = '⁆', _0x1e4047['∴'] = '∵', _0x1e4047['\x0d'] = '\x0a', _0x1e4047['ß'] = 'ᙠ', _0x1e4047['̈'] = '̤', _0x1e4047['ä'] = 'ɐ̤', _0x1e4047['ö'] = 'o̤', _0x1e4047['ü'] = 'n̤', _0x1e4047['Ä'] = '∀̤', _0x1e4047['Ö'] = 'O̤', _0x1e4047['Ü'] = '∩̤', _0x1e4047['´'] = '\x20̗', _0x1e4047['é'] = 'ǝ̗', _0x1e4047['á'] = 'ɐ̗', _0x1e4047['ó'] = 'o̗', _0x1e4047['ú'] = 'n̗', _0x1e4047['É'] = 'Ǝ̗', _0x1e4047['Á'] = '∀̗', _0x1e4047['Ó'] = 'O̗', _0x1e4047['Ú'] = '∩̗', _0x1e4047['`'] = '\x20̖', _0x1e4047['è'] = 'ǝ̖', _0x1e4047['à'] = 'ɐ̖', _0x1e4047['ò'] = 'o̖', _0x1e4047['ù'] = 'n̖', _0x1e4047['È'] = 'Ǝ̖', _0x1e4047['À'] = '∀̖', _0x1e4047['Ò'] = 'O̖', _0x1e4047['Ù'] = '∩̖', _0x1e4047['^'] = '\x20̮', _0x1e4047['ê'] = 'ǝ̮', _0x1e4047['â'] = 'ɐ̮', _0x1e4047['ô'] = 'o̮', _0x1e4047['û'] = 'n̮', _0x1e4047['Ê'] = 'Ǝ̮', _0x1e4047['Â'] = '∀̮', _0x1e4047['Ô'] = 'O̮', _0x1e4047['Û'] = '∩̮';
    var _0xcaf720 = {};
    _0xcaf720['init'] = function() {
        var _0xf832e8 = _0x4a74;
        for (i in this[_0xf832e8(0x4ff)]) this[_0xf832e8(0x4ff)][this[_0xf832e8(0x4ff)][i]] = i;
    }, _0xcaf720[_0x295939(0x384)] = function(_0x577647) {
        var _0x2464d7 = _0x295939;
        for (var _0x9aa132, _0x2bc0fe = [], _0x278f74 = 0x0, _0x8c04e3 = _0x577647[_0x2464d7(0x482)]; _0x8c04e3 > _0x278f74; _0x278f74++) _0x9aa132 = _0x577647[_0x2464d7(0x633)](_0x278f74), _0x278f74 > 0x0 && ('̤' == _0x9aa132 || '̗' == _0x9aa132 || '̖' == _0x9aa132 || '̮' == _0x9aa132) ? (_0x9aa132 = this[_0x2464d7(0x4ff)][_0x577647['charAt'](_0x278f74 - 0x1) + _0x9aa132], _0x2bc0fe[_0x2464d7(0x211)]()) : (_0x9aa132 = this[_0x2464d7(0x4ff)][_0x9aa132], _0x2464d7(0x59e) == typeof _0x9aa132 && (_0x9aa132 = _0x577647[_0x2464d7(0x633)](_0x278f74))), _0x2bc0fe[_0x2464d7(0x4f8)](_0x9aa132);
        return _0x2bc0fe[_0x2464d7(0x5f8)]()[_0x2464d7(0x1a5)]('');
    }, _0xcaf720[_0x295939(0x347)] = function(_0x498981) {
        var _0xb3230 = _0x295939;
        for (var _0x4cc7b8, _0xe1dd98 = [], _0x483333 = 0x0, _0x39150e = _0x498981[_0xb3230(0x482)]; _0x39150e > _0x483333; _0x483333++) _0x4cc7b8 = _0x498981['charAt'](_0x483333), _0x483333 > 0x0 && ('̤' == _0x4cc7b8 || '̗' == _0x4cc7b8 || '̖' == _0x4cc7b8 || '̮' == _0x4cc7b8) ? (_0x4cc7b8 = this[_0xb3230(0x4ff)][_0x498981['charAt'](_0x483333 - 0x1) + _0x4cc7b8], _0xe1dd98['pop']()) : (_0x4cc7b8 = this['map'][_0x4cc7b8], 'undefined' == typeof _0x4cc7b8 && (_0x4cc7b8 = _0x498981[_0xb3230(0x633)](_0x483333))), _0xe1dd98['push'](_0x4cc7b8);
        return _0xe1dd98[_0xb3230(0x5f8)]()['join']('');
    }, _0xcaf720[_0x295939(0x4ff)] = _0x1e4047;
    var _0x5003fa = {};
    _0x5003fa['a'] = 'ɒ', _0x5003fa['b'] = 'd', _0x5003fa['c'] = 'ɔ', _0x5003fa['e'] = 'ɘ', _0x5003fa['f'] = 'Ꮈ', _0x5003fa['g'] = 'ǫ', _0x5003fa['h'] = 'ʜ', _0x5003fa['j'] = 'ꞁ', _0x5003fa['k'] = 'ʞ', _0x5003fa['l'] = '|', _0x5003fa['n'] = 'ᴎ', _0x5003fa['p'] = 'q', _0x5003fa['r'] = 'ɿ', _0x5003fa['s'] = 'ꙅ', _0x5003fa['t'] = 'ƚ', _0x5003fa['y'] = 'ʏ', _0x5003fa['z'] = 'ƹ', _0x5003fa['B'] = 'ᙠ', _0x5003fa['C'] = 'Ɔ', _0x5003fa['D'] = 'ᗡ', _0x5003fa['E'] = 'Ǝ', _0x5003fa['F'] = 'ꟻ', _0x5003fa['G'] = 'Ꭾ', _0x5003fa['J'] = 'Ⴑ', _0x5003fa['K'] = '⋊', _0x5003fa['L'] = '⅃', _0x5003fa['N'] = 'Ͷ', _0x5003fa['P'] = 'ꟼ', _0x5003fa['Q'] = 'Ọ', _0x5003fa['R'] = 'Я', _0x5003fa['S'] = 'Ꙅ', _0x5003fa['Z'] = 'Ƹ', _0x5003fa['1'] = '', _0x5003fa['2'] = '', _0x5003fa['3'] = '', _0x5003fa['4'] = '', _0x5003fa['5'] = '', _0x5003fa['6'] = '', _0x5003fa['7'] = '', _0x5003fa['&'] = '', _0x5003fa[';'] = '', _0x5003fa['['] = ']', _0x5003fa['('] = ')', _0x5003fa['{'] = '}', _0x5003fa['?'] = '⸮', _0x5003fa['<'] = '>', _0x5003fa['ä'] = 'ɒ̈', _0x5003fa['ß'] = 'ᙠ', _0x5003fa['´'] = '`', _0x5003fa['é'] = 'ɘ̀', _0x5003fa['á'] = 'ɒ̀', _0x5003fa['ó'] = 'ò', _0x5003fa['ú'] = 'ù', _0x5003fa['É'] = 'Ǝ̀', _0x5003fa['Á'] = 'À', _0x5003fa['Ó'] = 'Ò', _0x5003fa['Ú'] = 'Ù', _0x5003fa['`'] = '´', _0x5003fa['è'] = 'ɘ́', _0x5003fa['à'] = 'ɒ́', _0x5003fa['È'] = 'Ǝ́', _0x5003fa['ê'] = 'ɘ̂', _0x5003fa['â'] = 'ɒ̂', _0x5003fa['Ê'] = 'Ǝ̂', _0x5003fa['Ø'] = 'ᴓ', _0x5003fa['ø'] = 'ᴓ';
    var _0x2758cb = {};
    _0x2758cb[_0x295939(0x3b6)] = function() {
        var _0x31b7be = _0x295939;
        for (i in this[_0x31b7be(0x4ff)]) this['map'][this[_0x31b7be(0x4ff)][i]] = i;
    }, _0x2758cb[_0x295939(0x384)] = function(_0x8bd531) {
        var _0x470cf6 = _0x295939;
        for (var _0x4c889f, _0x2fe1f4 = [], _0x5e1d48 = [], _0x50035b = 0x0, _0x5b6eef = _0x8bd531[_0x470cf6(0x482)]; _0x5b6eef > _0x50035b; _0x50035b++) _0x4c889f = _0x8bd531['charAt'](_0x50035b), _0x50035b > 0x0 && ('̈' == _0x4c889f || '̀' == _0x4c889f || '́' == _0x4c889f || '̂' == _0x4c889f) ? (_0x4c889f = this['map'][_0x8bd531[_0x470cf6(0x633)](_0x50035b - 0x1) + _0x4c889f], _0x2fe1f4[_0x470cf6(0x211)]()) : (_0x4c889f = this['map'][_0x4c889f], 'undefined' == typeof _0x4c889f && (_0x4c889f = _0x8bd531[_0x470cf6(0x633)](_0x50035b))), '\x0a' == _0x4c889f ? (_0x5e1d48[_0x470cf6(0x4f8)](_0x2fe1f4[_0x470cf6(0x5f8)]()[_0x470cf6(0x1a5)]('')), _0x2fe1f4 = []) : _0x2fe1f4[_0x470cf6(0x4f8)](_0x4c889f);
        return _0x5e1d48[_0x470cf6(0x4f8)](_0x2fe1f4[_0x470cf6(0x5f8)]()[_0x470cf6(0x1a5)]('')), _0x5e1d48[_0x470cf6(0x1a5)]('\x0a');
    }, _0x2758cb[_0x295939(0x347)] = function(_0x156d31) {
        var _0x17a698 = _0x295939;
        for (var _0x47e85a, _0x4d6272 = [], _0x76e188 = [], _0x2708fe = 0x0, _0x38984b = _0x156d31[_0x17a698(0x482)]; _0x38984b > _0x2708fe; _0x2708fe++) _0x47e85a = _0x156d31['charAt'](_0x2708fe), _0x2708fe > 0x0 && ('̈' == _0x47e85a || '̀' == _0x47e85a || '́' == _0x47e85a || '̂' == _0x47e85a) ? (_0x47e85a = this[_0x17a698(0x4ff)][_0x156d31[_0x17a698(0x633)](_0x2708fe - 0x1) + _0x47e85a], _0x4d6272[_0x17a698(0x211)]()) : (_0x47e85a = this[_0x17a698(0x4ff)][_0x47e85a], _0x17a698(0x59e) == typeof _0x47e85a && (_0x47e85a = _0x156d31[_0x17a698(0x633)](_0x2708fe))), '\x0a' == _0x47e85a ? (_0x76e188[_0x17a698(0x4f8)](_0x4d6272[_0x17a698(0x5f8)]()['join']('')), _0x4d6272 = []) : _0x4d6272['push'](_0x47e85a);
        return _0x76e188[_0x17a698(0x4f8)](_0x4d6272[_0x17a698(0x5f8)]()[_0x17a698(0x1a5)]('')), _0x76e188[_0x17a698(0x1a5)]('\x0a');
    }, _0x2758cb['map'] = _0x5003fa;
    var _0x1837e0 = {};
    _0x1837e0[_0x295939(0x60f)] = !0x0, _0x1837e0['middle'] = !0x0, _0x1837e0[_0x295939(0x26d)] = !0x0, _0x1837e0[_0x295939(0x325)] = 0xf, _0x1837e0[_0x295939(0x215)] = 0x64;
    var _0x3ce686 = {};
    _0x3ce686[_0x295939(0x3b6)] = function() {
        var _0x20c84c = _0x295939;
        for (var _0x1eef5e = 0x300; 0x315 >= _0x1eef5e; _0x1eef5e++) this[_0x20c84c(0x65e)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](_0x1eef5e));
        for (var _0x1eef5e = 0x316; 0x333 >= _0x1eef5e; _0x1eef5e++) 0x31a != _0x1eef5e && 0x31b != _0x1eef5e && this['diacriticsBottom'][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](_0x1eef5e));
        this[_0x20c84c(0x65e)][_0x20c84c(0x4f8)](String['fromCharCode'](0x31a)), this[_0x20c84c(0x65e)]['push'](String['fromCharCode'](0x31b));
        for (var _0x1eef5e = 0x334; 0x338 >= _0x1eef5e; _0x1eef5e++) this[_0x20c84c(0x532)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](_0x1eef5e));
        for (var _0x1eef5e = 0x339; 0x33c >= _0x1eef5e; _0x1eef5e++) this['diacriticsBottom'][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](_0x1eef5e));
        for (var _0x1eef5e = 0x33d; 0x344 >= _0x1eef5e; _0x1eef5e++) this[_0x20c84c(0x65e)]['push'](String[_0x20c84c(0x46a)](_0x1eef5e));
        this[_0x20c84c(0x65e)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x344)), this['diacriticsBottom'][_0x20c84c(0x4f8)](String['fromCharCode'](0x345)), this[_0x20c84c(0x65e)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x346)), this[_0x20c84c(0x662)][_0x20c84c(0x4f8)](String['fromCharCode'](0x347)), this[_0x20c84c(0x662)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x348)), this[_0x20c84c(0x662)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x349)), this[_0x20c84c(0x65e)]['push'](String[_0x20c84c(0x46a)](0x34a)), this[_0x20c84c(0x65e)]['push'](String[_0x20c84c(0x46a)](0x34b)), this[_0x20c84c(0x65e)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x34c)), this[_0x20c84c(0x662)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x34d)), this['diacriticsBottom']['push'](String['fromCharCode'](0x34e)), this[_0x20c84c(0x65e)][_0x20c84c(0x4f8)](String['fromCharCode'](0x350)), this['diacriticsTop'][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x351)), this['diacriticsTop'][_0x20c84c(0x4f8)](String['fromCharCode'](0x352)), this[_0x20c84c(0x662)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x353)), this[_0x20c84c(0x662)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x354)), this['diacriticsBottom'][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x355)), this['diacriticsBottom'][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x356)), this[_0x20c84c(0x65e)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x357)), this[_0x20c84c(0x65e)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x358)), this[_0x20c84c(0x662)]['push'](String[_0x20c84c(0x46a)](0x359)), this[_0x20c84c(0x662)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x35a)), this[_0x20c84c(0x65e)][_0x20c84c(0x4f8)](String['fromCharCode'](0x35b)), this[_0x20c84c(0x662)][_0x20c84c(0x4f8)](String['fromCharCode'](0x35c)), this['diacriticsTop']['push'](String[_0x20c84c(0x46a)](0x35d)), this[_0x20c84c(0x65e)]['push'](String[_0x20c84c(0x46a)](0x35d)), this['diacriticsBottom']['push'](String[_0x20c84c(0x46a)](0x35f)), this[_0x20c84c(0x65e)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x360)), this[_0x20c84c(0x65e)][_0x20c84c(0x4f8)](String[_0x20c84c(0x46a)](0x361));
    }, _0x3ce686[_0x295939(0x384)] = function(_0x3a0d66) {
        var _0x1af1e3 = _0x295939,
            _0x334efc, _0x3aae14 = '';
        for (i in _0x3a0d66) {
            if (_0x334efc = _0x3a0d66[i], this['options'][_0x1af1e3(0x205)] && (_0x334efc += this[_0x1af1e3(0x532)][Math['floor'](Math['random']() * this['diacriticsMiddle'][_0x1af1e3(0x482)])]), this['options'][_0x1af1e3(0x60f)]) {
                for (var _0x139285 = this['diacriticsTop'][_0x1af1e3(0x482)] - 0x1, _0x49b93b = 0x0, _0x4fab2f = this[_0x1af1e3(0x3ae)][_0x1af1e3(0x325)] - Math[_0x1af1e3(0x217)]() * (this[_0x1af1e3(0x3ae)][_0x1af1e3(0x215)] / 0x64 * this[_0x1af1e3(0x3ae)][_0x1af1e3(0x325)]); _0x4fab2f > _0x49b93b; _0x49b93b++) _0x334efc += this['diacriticsTop'][Math[_0x1af1e3(0x37f)](Math['random']() * _0x139285)];
            }
            if (this[_0x1af1e3(0x3ae)][_0x1af1e3(0x26d)]) {
                for (var _0x36262a = this[_0x1af1e3(0x662)][_0x1af1e3(0x482)] - 0x1, _0x49b93b = 0x0, _0x4fab2f = this[_0x1af1e3(0x3ae)][_0x1af1e3(0x325)] - Math[_0x1af1e3(0x217)]() * (this[_0x1af1e3(0x3ae)]['randomization'] / 0x64 * this[_0x1af1e3(0x3ae)][_0x1af1e3(0x325)]); _0x4fab2f > _0x49b93b; _0x49b93b++) _0x334efc += this['diacriticsBottom'][Math[_0x1af1e3(0x37f)](Math[_0x1af1e3(0x217)]() * _0x36262a)];
            }
            _0x3aae14 += _0x334efc;
        }
        return _0x3aae14;
    }, _0x3ce686['decode'] = function(_0x618af0) {
        var _0x53d50f = _0x295939,
            _0x488316, _0x877371 = '';
        for (i in _0x618af0) _0x488316 = _0x618af0[i][_0x53d50f(0x2b0)](0x0), (0x300 > _0x488316 || _0x488316 > 0x361) && (_0x877371 += _0x618af0[i]);
        return _0x877371;
    }, _0x3ce686[_0x295939(0x65e)] = [], _0x3ce686['diacriticsMiddle'] = [], _0x3ce686[_0x295939(0x662)] = [], _0x3ce686[_0x295939(0x3ae)] = _0x1837e0;
    var _0x1b97fa = {};
    _0x1b97fa['init'] = function() {
        var _0xdfeafb = _0x295939;
        for (var _0x551ef7 = 0x31; 0x39 >= _0x551ef7; _0x551ef7++) this['map'][String['fromCharCode'](_0x551ef7)] = String[_0xdfeafb(0x46a)](_0x551ef7 + 0x242f);
        this[_0xdfeafb(0x4ff)][0x0] = '⓪';
        for (var _0x551ef7 = 0x41; 0x5a >= _0x551ef7; _0x551ef7++) this['map'][String[_0xdfeafb(0x46a)](_0x551ef7)] = String[_0xdfeafb(0x46a)](_0x551ef7 + 0x2475);
        for (var _0x551ef7 = 0x61; 0x7a >= _0x551ef7; _0x551ef7++) this[_0xdfeafb(0x4ff)][String[_0xdfeafb(0x46a)](_0x551ef7)] = String['fromCharCode'](_0x551ef7 + 0x246f);
        for (_0x551ef7 in this[_0xdfeafb(0x4ff)]) this['mapInverse'][this[_0xdfeafb(0x4ff)][_0x551ef7]] = _0x551ef7;
    }, _0x1b97fa[_0x295939(0x384)] = function(_0x5b3e08) {
        var _0x532281 = _0x295939,
            _0x56a81f, _0x19257a = '',
            _0x563904 = !0x0;
        for (i in _0x5b3e08) _0x56a81f = this[_0x532281(0x4ff)][_0x5b3e08[i]], 'undefined' == typeof _0x56a81f && (_0x5b3e08[i][_0x532281(0x2b0)](0x0) >= 0x21 ? (_0x56a81f = _0x5b3e08[i] + String[_0x532281(0x46a)](0x20dd), _0x563904 || (_0x56a81f = String[_0x532281(0x46a)](0x202f) + String['fromCharCode'](0xa0) + String[_0x532281(0x46a)](0xa0) + String[_0x532281(0x46a)](0x202f) + _0x56a81f)) : _0x56a81f = _0x5b3e08[i]), _0x19257a += _0x56a81f, _0x563904 = '\x0a' == _0x56a81f;
        return _0x19257a;
    }, _0x1b97fa[_0x295939(0x347)] = function(_0x1ebbcb) {
        var _0x4f7955 = _0x295939,
            _0x4122e9, _0xa751e = '',
            _0x57e707 = '';
        for (i in _0x1ebbcb) _0x4122e9 = this[_0x4f7955(0x3d3)][_0x1ebbcb[i]], _0xa751e += _0x4f7955(0x59e) == typeof _0x4122e9 ? _0x1ebbcb[i] : _0x4122e9;
        for (i in _0xa751e) _0x4122e9 = _0xa751e[i][_0x4f7955(0x2b0)](0x0), 0xa0 != _0x4122e9 && 0x202f != _0x4122e9 && 0x20dd != _0x4122e9 && (_0x57e707 += _0xa751e[i]);
        return _0x57e707;
    }, _0x1b97fa[_0x295939(0x4ff)] = {}, _0x1b97fa['mapInverse'] = {};
    var _0x421083 = {};
    _0x421083[_0x295939(0x3b6)] = function() {}, _0x421083[_0x295939(0x384)] = function(_0x3e4116) {
        var _0x124505 = _0x295939,
            _0x38c0b4, _0x883acc = '',
            _0x1c4596 = !0x0;
        for (i in _0x3e4116) _0x3e4116[i][_0x124505(0x2b0)](0x0) >= 0x21 ? (_0x38c0b4 = _0x3e4116[i] + String[_0x124505(0x46a)](0x20de), _0x1c4596 || (_0x38c0b4 = String['fromCharCode'](0x202f) + String[_0x124505(0x46a)](0xa0) + String['fromCharCode'](0xa0) + String[_0x124505(0x46a)](0x202f) + _0x38c0b4)) : _0x38c0b4 = _0x3e4116[i], _0x883acc += _0x38c0b4, _0x1c4596 = '\x0a' == _0x38c0b4;
        return _0x883acc;
    }, _0x421083[_0x295939(0x347)] = function(_0x24d93b) {
        var _0x59eb7c = _0x295939,
            _0x3bd647, _0x1354a6 = '';
        for (i in _0x24d93b) _0x3bd647 = _0x24d93b[i][_0x59eb7c(0x2b0)](0x0), 0xa0 != _0x3bd647 && 0x202f != _0x3bd647 && 0x20de != _0x3bd647 && (_0x1354a6 += _0x24d93b[i]);
        return _0x1354a6;
    };
    var _0x1eaf61 = {};
    _0x1eaf61[_0x295939(0x3b6)] = function() {}, _0x1eaf61['encode'] = function(_0x4ede13) {
        var _0x40a812 = _0x295939,
            _0x42da19, _0x483453 = '',
            _0x40efc5 = !0x0;
        for (i in _0x4ede13) _0x4ede13[i][_0x40a812(0x2b0)](0x0) >= 0x21 ? (_0x42da19 = _0x4ede13[i] + String[_0x40a812(0x46a)](0x20e3), _0x40efc5 || (_0x42da19 = String[_0x40a812(0x46a)](0xa0) + String['fromCharCode'](0xa0) + String[_0x40a812(0x46a)](0xa0) + _0x42da19)) : _0x42da19 = _0x4ede13[i], _0x483453 += _0x42da19, _0x40efc5 = '\x0a' == _0x42da19;
        return _0x483453;
    }, _0x1eaf61[_0x295939(0x347)] = function(_0x4ada31) {
        var _0x2a1411 = _0x295939,
            _0x4632fd, _0x2d2b4a = '';
        for (i in _0x4ada31) _0x4632fd = _0x4ada31[i][_0x2a1411(0x2b0)](0x0), 0xa0 != _0x4632fd && 0x202f != _0x4632fd && 0x20e3 != _0x4632fd && (_0x2d2b4a += _0x4ada31[i]);
        return _0x2d2b4a;
    };
    var _0x3ae666 = {};
    _0x3ae666['a'] = 'ą', _0x3ae666['b'] = 'ҍ', _0x3ae666['c'] = 'ç', _0x3ae666['d'] = 'ժ', _0x3ae666['e'] = 'ҽ', _0x3ae666['f'] = 'ƒ', _0x3ae666['g'] = 'ց', _0x3ae666['h'] = 'հ', _0x3ae666['i'] = 'ì', _0x3ae666['j'] = 'ʝ', _0x3ae666['k'] = 'ҟ', _0x3ae666['l'] = 'Ӏ', _0x3ae666['m'] = 'ʍ', _0x3ae666['n'] = 'ղ', _0x3ae666['o'] = 'օ', _0x3ae666['p'] = 'ք', _0x3ae666['q'] = 'զ', _0x3ae666['r'] = 'ɾ', _0x3ae666['s'] = 'ʂ', _0x3ae666['t'] = 'է', _0x3ae666['u'] = 'մ', _0x3ae666['v'] = 'ѵ', _0x3ae666['w'] = 'ա', _0x3ae666['x'] = '×', _0x3ae666['y'] = 'վ', _0x3ae666['z'] = 'Հ', _0x3ae666['A'] = 'Ⱥ', _0x3ae666['B'] = 'β', _0x3ae666['C'] = '↻', _0x3ae666['D'] = 'Ꭰ', _0x3ae666['E'] = 'Ɛ', _0x3ae666['F'] = 'Ƒ', _0x3ae666['G'] = 'Ɠ', _0x3ae666['H'] = 'Ƕ', _0x3ae666['I'] = 'į', _0x3ae666['J'] = 'ل', _0x3ae666['K'] = 'Ҡ', _0x3ae666['L'] = 'Ꝉ', _0x3ae666['M'] = 'Ɱ', _0x3ae666['N'] = 'ហ', _0x3ae666['O'] = 'ට', _0x3ae666['P'] = 'φ', _0x3ae666['Q'] = 'Ҩ', _0x3ae666['R'] = 'འ', _0x3ae666['S'] = 'Ϛ', _0x3ae666['T'] = 'Ͳ', _0x3ae666['U'] = 'Ա', _0x3ae666['V'] = 'Ỽ', _0x3ae666['W'] = 'చ', _0x3ae666['X'] = 'ჯ', _0x3ae666['Y'] = 'Ӌ', _0x3ae666['Z'] = 'ɀ', _0x3ae666['0'] = '⊘', _0x3ae666['1'] = _0x295939(0x648), _0x3ae666['2'] = 'ϩ', _0x3ae666['3'] = 'Ӡ', _0x3ae666['4'] = '५', _0x3ae666['5'] = 'Ƽ', _0x3ae666['6'] = 'Ϭ', _0x3ae666['7'] = '7', _0x3ae666['8'] = _0x295939(0x648), _0x3ae666['9'] = '९', _0x3ae666['&'] = '⅋', _0x3ae666['('] = '{', _0x3ae666[')'] = '}', _0x3ae666['{'] = '(', _0x3ae666['}'] = ')', _0x3ae666['ä'] = 'ą̈', _0x3ae666['ö'] = 'օ̈', _0x3ae666['ü'] = 'մ̈', _0x3ae666['Ä'] = 'Ⱥ̈', _0x3ae666['Ö'] = 'ට̈', _0x3ae666['Ü'] = 'Ա̈', _0x3ae666['é'] = 'ҽ́', _0x3ae666['á'] = 'ą́', _0x3ae666['ó'] = 'օ́', _0x3ae666['ú'] = 'մ́', _0x3ae666['É'] = 'Ɛ́', _0x3ae666['Á'] = 'Ⱥ́', _0x3ae666['Ó'] = 'ට́', _0x3ae666['Ú'] = 'Ա́', _0x3ae666['è'] = 'ҽ̀', _0x3ae666['à'] = 'ą̀', _0x3ae666['ò'] = 'օ̀', _0x3ae666['ù'] = 'մ̀', _0x3ae666['È'] = 'Ɛ̀', _0x3ae666['À'] = 'Ⱥ̀', _0x3ae666['Ò'] = 'ට̀', _0x3ae666['Ù'] = 'Ա̀', _0x3ae666['ê'] = 'ҽ̂', _0x3ae666['â'] = 'ą̂', _0x3ae666['ô'] = 'օ̂', _0x3ae666['û'] = 'մ̂', _0x3ae666['Ê'] = 'Ɛ̂', _0x3ae666['Â'] = 'Ⱥ̂', _0x3ae666['Ô'] = 'ට̂', _0x3ae666['Û'] = 'Ա̂';
    var _0xb4a936 = {};
    _0xb4a936[_0x295939(0x3b6)] = function() {
        var _0x4c9e15 = _0x295939;
        for (i in this['map']) this[_0x4c9e15(0x4ff)][this[_0x4c9e15(0x4ff)][i]] = i;
    }, _0xb4a936[_0x295939(0x384)] = function(_0x4fed17) {
        var _0x4f5f87 = _0x295939;
        for (var _0x132ca8, _0x593003 = '', _0x19f959 = 0x0, _0x595f03 = _0x4fed17[_0x4f5f87(0x482)]; _0x595f03 > _0x19f959; _0x19f959++) _0x132ca8 = this['map'][_0x4fed17[_0x4f5f87(0x633)](_0x19f959)], _0x4f5f87(0x59e) == typeof _0x132ca8 && (_0x132ca8 = _0x4fed17[_0x4f5f87(0x633)](_0x19f959)), _0x593003 += _0x132ca8;
        return _0x593003;
    }, _0xb4a936[_0x295939(0x347)] = function(_0x55fd32) {
        var _0x9ca65e = _0x295939;
        for (var _0x1191a8, _0x423165 = '', _0x152936 = 0x0, _0xc9a9e9 = _0x55fd32[_0x9ca65e(0x482)]; _0xc9a9e9 > _0x152936; _0x152936++) _0x1191a8 = this[_0x9ca65e(0x4ff)][_0x55fd32[_0x9ca65e(0x633)](_0x152936)], _0x9ca65e(0x59e) == typeof _0x1191a8 && (_0x1191a8 = _0x55fd32[_0x9ca65e(0x633)](_0x152936)), _0x423165 += _0x1191a8;
        return _0x423165;
    }, _0xb4a936[_0x295939(0x4ff)] = _0x3ae666;
    var _0x1ecdb2 = {};
    _0x1ecdb2['A'] = 'ᴀ', _0x1ecdb2['B'] = 'ʙ', _0x1ecdb2['C'] = 'ᴄ', _0x1ecdb2['D'] = 'ᴅ', _0x1ecdb2['E'] = 'ᴇ', _0x1ecdb2['F'] = 'ꜰ', _0x1ecdb2['G'] = 'ɢ', _0x1ecdb2['H'] = 'ʜ', _0x1ecdb2['I'] = 'ɪ', _0x1ecdb2['J'] = 'ᴊ', _0x1ecdb2['K'] = 'ᴋ', _0x1ecdb2['L'] = 'ʟ', _0x1ecdb2['M'] = 'ᴍ', _0x1ecdb2['N'] = 'ɴ', _0x1ecdb2['O'] = 'ᴏ', _0x1ecdb2['P'] = 'ᴘ', _0x1ecdb2['Q'] = 'Q', _0x1ecdb2['R'] = 'ʀ', _0x1ecdb2['S'] = 'ꜱ', _0x1ecdb2['T'] = 'ᴛ', _0x1ecdb2['U'] = 'ᴜ', _0x1ecdb2['V'] = 'ᴠ', _0x1ecdb2['W'] = 'ᴡ', _0x1ecdb2['X'] = 'x', _0x1ecdb2['Y'] = 'ʏ', _0x1ecdb2['Z'] = 'ᴢ';
    var _0x470697 = {};
    _0x470697[_0x295939(0x3b6)] = function() {
        var _0x25f473 = _0x295939;
        for (i in this[_0x25f473(0x4ff)]) this[_0x25f473(0x4ff)][this[_0x25f473(0x4ff)][i]] = i;
    }, _0x470697[_0x295939(0x384)] = function(_0x318649) {
        var _0x2945d8 = _0x295939,
            _0x4801d7, _0x4aac4c = '';
        _0x318649 = _0x318649[_0x2945d8(0x265)]();
        for (var _0x85867 = 0x0, _0x417006 = _0x318649['length']; _0x417006 > _0x85867; _0x85867++) _0x4801d7 = this['map'][_0x318649[_0x2945d8(0x633)](_0x85867)], 'undefined' == typeof _0x4801d7 && (_0x4801d7 = _0x318649[_0x2945d8(0x633)](_0x85867)), _0x4aac4c += _0x4801d7;
        return _0x4aac4c;
    }, _0x470697['decode'] = function(_0x3ee83c) {
        var _0x2a8d70 = _0x295939;
        for (var _0x2cace2, _0x5a594d = '', _0x9a65dc = 0x0, _0x2ec304 = _0x3ee83c[_0x2a8d70(0x482)]; _0x2ec304 > _0x9a65dc; _0x9a65dc++) _0x2cace2 = this[_0x2a8d70(0x4ff)][_0x3ee83c[_0x2a8d70(0x633)](_0x9a65dc)], _0x2a8d70(0x59e) == typeof _0x2cace2 && (_0x2cace2 = _0x3ee83c[_0x2a8d70(0x633)](_0x9a65dc)), _0x5a594d += _0x2cace2;
        return _0x5a594d;
    }, _0x470697['map'] = _0x1ecdb2;
    var _0x16a850 = {};
    _0x16a850['flip'] = _0xcaf720, _0x16a850[_0x295939(0x4cb)] = _0x2758cb, _0x16a850[_0x295939(0x37e)] = _0x3ce686, _0x16a850[_0x295939(0x1be)] = _0x1b97fa, _0x16a850[_0x295939(0x242)] = _0x421083, _0x16a850[_0x295939(0x308)] = _0x1eaf61, _0x16a850['bent'] = _0xb4a936, _0x16a850['tiny'] = _0x470697, this[_0x295939(0x628)] = _0x16a850;
    for (i in this[_0x295939(0x628)]) this[_0x295939(0x628)][i][_0x295939(0x3b6)]();
    this['getHTML'] = function(_0x402cf3) {
        var _0x14f1f8 = _0x295939;
        for (var _0x45210f, _0x3c8ae1 = '', _0x105e96 = !0x0, _0x570ad4 = 0x0, _0x3f3ef2 = 0x0, _0x1bfc5a = 0x0, _0x584efe = _0x402cf3['length']; _0x584efe > _0x1bfc5a; _0x1bfc5a++) _0x45210f = _0x402cf3[_0x14f1f8(0x2b0)](_0x1bfc5a), 0xa == _0x45210f || 0xd == _0x45210f ? (_0x3c8ae1 += _0x14f1f8(0x366), _0x105e96 = !0x0) : 0x20 == _0x45210f ? _0x105e96 ? (_0x3c8ae1 += '\x20', _0x105e96 = !0x1) : (_0x3c8ae1 += '\x20', _0x105e96 = !0x0) : (_0x45210f >= 0xd800 && 0xdbff >= _0x45210f ? (_0x570ad4 = _0x45210f, _0x3f3ef2 = 0x0) : _0x570ad4 > 0x0 ? (_0x45210f >= 0xdc00 && 0xdfff >= _0x45210f && (_0x3f3ef2 = 0x400 * (_0x570ad4 - 0xd800) + (_0x45210f - 0xdc00) + 0x10000), _0x570ad4 = 0x0) : _0x3f3ef2 = _0x45210f, 0x0 != _0x3f3ef2 && (_0x3c8ae1 += _0x14f1f8(0x2a8) + _0x3f3ef2['toString'](0x10) + ';', _0x105e96 = !0x0));
        return _0x3c8ae1;
    };
}

function cuteText(_0x583b55) {
    var _0x3beecb = _0x55dc6e;
    if (_0x583b55[_0x3beecb(0x343)]() === '') return '';
    qi = -0x1;
    var _0x567ad9 = boundingString(Math['floor'](Math[_0x3beecb(0x217)]() * 0x2) + 0x1);
    return _0x567ad9 + '\x20\x20🎀\x20\x20' + _0x583b55[_0x3beecb(0x3f3)](/([!?.]+)/gi)[_0x3beecb(0x4ff)](cuteSentence)[_0x3beecb(0x1a5)]('') + _0x3beecb(0x618) + esrever['reverse'](_0x567ad9);
}

function cuteSentence(_0x115881) {
    var _0x99da78 = _0x55dc6e;
    return _0x115881['split'](/([\s,]+)/gi)['map'](cuteWord)[_0x99da78(0x1a5)]('');
}

function cuteWord(_0x543425) {
    var _0x3f4788 = _0x55dc6e;
    if (_0x543425 === '' || /[[!?.\s,]+]/gi [_0x3f4788(0x239)](_0x543425)) return _0x543425;
    return _0x543425 = roundReplace(_0x543425), _0x543425 = punctReplace(_0x543425), _0x543425 = emojiReplace(_0x543425), scriptify(_0x543425);
}
var qi = -0x1,
    qa = ['❝', '❞'];

function quotes() {
    qi++;
    if (qi === 0x2) qi = 0x0;
    return qa[qi];
}

function punctReplace(_0x17140f) {
    var _0x10436b = _0x55dc6e;
    return _0x17140f[_0x10436b(0x3f3)]('')[_0x10436b(0x4ff)](function(_0x2668bc) {
        if (_0x2668bc === '!') return randomElement(['❣', '❢']);
        else {
            if (_0x2668bc === '?') return randomElement(['¿', '?']);
            else {
                if (_0x2668bc === '\x22') return quotes();
                else return _0x2668bc;
            }
        }
    })['join']('');
}

function emojiReplace(_0x11e427) {
    var _0x59a6d9 = _0x55dc6e;
    return _0x11e427[_0x59a6d9(0x3d1)](':)', randomElement(emoji[':)']))[_0x59a6d9(0x3d1)]('(:', randomElement(emoji[':)']))[_0x59a6d9(0x3d1)]('^^', randomElement(emoji['^^']))[_0x59a6d9(0x3d1)](':P', randomElement(emoji[':p']))[_0x59a6d9(0x3d1)](':p', randomElement(emoji[':p']))['replace'](':D', randomElement(emoji[':D']))[_0x59a6d9(0x3d1)]('<3', randomElement(emoji['<3']))['replace'](_0x59a6d9(0x30a), randomElement(emoji[_0x59a6d9(0x30a)]))[_0x59a6d9(0x3d1)](_0x59a6d9(0x2c9), randomElement(emoji['(y)']));
}

function roundReplace(_0x254b82) {
    var _0x5fe2a3 = _0x55dc6e;
    return _0x254b82['split']('')[_0x5fe2a3(0x4ff)](function(_0x5172c8) {
        return _0x5172c8['toLowerCase']() === 'o' || _0x5172c8 === '0' ? randomElement(round) : _0x5172c8;
    })[_0x5fe2a3(0x1a5)]('');
}
var ar = {};
ar[':)'] = [_0x55dc6e(0x501), _0x55dc6e(0x616), _0x55dc6e(0x50b), _0x55dc6e(0x3e4), _0x55dc6e(0x403), _0x55dc6e(0x603), _0x55dc6e(0x466), '😍', 'ツ', '(✿ヘᴥヘ)', _0x55dc6e(0x5f6), _0x55dc6e(0x525), _0x55dc6e(0x579), _0x55dc6e(0x373), _0x55dc6e(0x218), _0x55dc6e(0x657), _0x55dc6e(0x50e)], ar['^^'] = [_0x55dc6e(0x58f), _0x55dc6e(0x54a), _0x55dc6e(0x24d), _0x55dc6e(0x3cc), _0x55dc6e(0x2d3), '^ㅅ^', _0x55dc6e(0x234), _0x55dc6e(0x583), _0x55dc6e(0x1bc), '⁀‿⁀', ''], ar[':p'] = [':Þ', ''], ar[':D'] = [_0x55dc6e(0x3a5), _0x55dc6e(0x539), _0x55dc6e(0x612)], ar['<3'] = ['♡', '❤', '♥', '❥', '💘', '💙', '💗', '💖', '💕', '💓', '💞', '💝', '💟'], ar['(y)'] = ['👍', '👌'];
var emoji = ar,
    round = ['❁', '🌺', '❀', '💮', '🏵', '🌸', '☯', '😍', '♡', '🍩', '🍬', '💙', '🌞', '💍', '🍪', '❤', '💗', '🍑', '💞'],
    food = ['🍬', '🍭', '🍒', '🍎', '🍉', '🍇', '🍓', '🍌', '🍑', '🍰', '🎂', '🍩', '🍪', '🍧', '🍦', '🍫', '🍡'],
    flowers = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    twinkles = ['⚛', '🌌', '🌠', '*', ':', '｡', '･ﾟ', '✧', '✮', '★', '✩', '⋆', '.', '°', '`', '✴', '｡', '✴', '⋆', '✳', '✶', '✷', '❈'],
    animals = ['🐯', '🐎', '🐖', '🐷', '🐏', '🐑', '🐐', '🐫', '🐘', '🐭', '🐁', '🐀', '🐹', '🐰', '🐇', '🐿', '🐻', '🐨', '🐼', '🐾', '🐔', '🐓', '🐣', '🐤', '🐥', '🐦', '🐧', '🕊', '🐸', '🐢', '🐳', '🐋', '🐬', '🐟', '🐠', '🐡', '🐙', '🐚', '🐌', '🐞'],
    plants = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    misc = ['🌌', '🌠', '🎉', '🎊', '🎈', '💌', '🎎', '🎁', '🎀', '🕯', '🔮', '🛀', '🎖', '🏆', '🏅', '👑', '💍', '👶', '👼', '👸', '👯', '👒', '👻'],
    music = ['♫', '♬', '♪', '♩', '°', '｡', '✧', '🎻', '🎺', '🎸', '🎷', '📯'],
    flourish = [_0x55dc6e(0x570), _0x55dc6e(0x4be), '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20', _0x55dc6e(0x319), _0x55dc6e(0x564), '×º°”˜`”°º×\x20', _0x55dc6e(0x2df), ']|I{•------»\x20', _0x55dc6e(0x4fa), _0x55dc6e(0x206), '(¯`·.¸¸.·´¯`·.¸¸.->\x20', '*´¯`*.¸¸.*´¯`*\x20', _0x55dc6e(0x470), _0x55dc6e(0x62d), _0x55dc6e(0x290), _0x55dc6e(0x516), _0x55dc6e(0x43f), '••¤(`×', '•´¯`•»\x20', _0x55dc6e(0x3e0), _0x55dc6e(0x566), '.o0×X×0o.\x20', _0x55dc6e(0x4e8), _0x55dc6e(0x43d), _0x55dc6e(0x3a4), _0x55dc6e(0x1c6), _0x55dc6e(0x2b1), _0x55dc6e(0x282), _0x55dc6e(0x2b4), _0x55dc6e(0x62e), _0x55dc6e(0x1fd), _0x55dc6e(0x44e), _0x55dc6e(0x529), _0x55dc6e(0x260)];

function boundingString(_0x29efbd) {
    return randomElement([foodString, twinkleString, animalString, flourishString])(_0x29efbd);
}

function foodString(_0x105f4f) {
    var _0x41ecae = _0x55dc6e;
    return new Array(_0x105f4f + 0x1)[_0x41ecae(0x1a5)]('0')['split']('')[_0x41ecae(0x4ff)](function(_0x38a7dc) {
        return randomElement(food);
    })[_0x41ecae(0x1a5)](_0x41ecae(0x3be));
}

function twinkleString(_0x54e313) {
    var _0x8cd14b = _0x55dc6e;
    return new Array(_0x54e313 + 0x1)[_0x8cd14b(0x1a5)]('0')[_0x8cd14b(0x3f3)]('')[_0x8cd14b(0x4ff)](function() {
        return randomElement(twinkles);
    })[_0x8cd14b(0x1a5)]('');
}

function animalString(_0x274c7d) {
    var _0x5b11e4 = _0x55dc6e;
    return new Array(_0x274c7d + 0x1)[_0x5b11e4(0x1a5)]('0')[_0x5b11e4(0x3f3)]('')[_0x5b11e4(0x4ff)](function(_0x3d1174) {
        return randomElement(animals);
    })['join'](_0x5b11e4(0x3be));
}

function flourishString(_0x2abaab) {
    return randomElement(flourish);
}

function scriptify(_0x1acd61) {
    var _0x164cea = _0x55dc6e,
        _0x207964 = {};
    _0x207964['0'] = '𝟢', _0x207964['1'] = '𝟣', _0x207964['2'] = '𝟤', _0x207964['3'] = '𝟥', _0x207964['4'] = '𝟦', _0x207964['5'] = '𝟧', _0x207964['6'] = '𝟨', _0x207964['7'] = '𝟩', _0x207964['8'] = '𝟪', _0x207964['9'] = '𝟫', _0x207964['a'] = '𝒶', _0x207964['b'] = '𝒷', _0x207964['c'] = '𝒸', _0x207964['d'] = '𝒹', _0x207964['e'] = '𝑒', _0x207964['f'] = '𝒻', _0x207964['g'] = '𝑔', _0x207964['h'] = '𝒽', _0x207964['i'] = '𝒾', _0x207964['j'] = '𝒿', _0x207964['k'] = '𝓀', _0x207964['l'] = '𝓁', _0x207964['m'] = '𝓂', _0x207964['n'] = '𝓃', _0x207964['o'] = '𝑜', _0x207964['p'] = '𝓅', _0x207964['q'] = '𝓆', _0x207964['r'] = '𝓇', _0x207964['s'] = '𝓈', _0x207964['t'] = '𝓉', _0x207964['u'] = '𝓊', _0x207964['v'] = '𝓋', _0x207964['w'] = '𝓌', _0x207964['x'] = '𝓍', _0x207964['y'] = '𝓎', _0x207964['z'] = '𝓏', _0x207964['A'] = '𝒜', _0x207964['B'] = '𝐵', _0x207964['C'] = '𝒞', _0x207964['D'] = '𝒟', _0x207964['E'] = '𝐸', _0x207964['F'] = '𝐹', _0x207964['G'] = '𝒢', _0x207964['H'] = '𝐻', _0x207964['I'] = '𝐼', _0x207964['J'] = '𝒥', _0x207964['K'] = '𝒦', _0x207964['L'] = '𝐿', _0x207964['M'] = '𝑀', _0x207964['N'] = '𝒩', _0x207964['O'] = '𝒪', _0x207964['P'] = '𝒫', _0x207964['Q'] = '𝒬', _0x207964['R'] = '𝑅', _0x207964['S'] = '𝒮', _0x207964['T'] = '𝒯', _0x207964['U'] = '𝒰', _0x207964['V'] = '𝒱', _0x207964['W'] = '𝒲', _0x207964['X'] = '𝒳', _0x207964['Y'] = '𝒴', _0x207964['Z'] = '𝒵';
    var _0xd11a62 = _0x207964,
        _0x435b42 = _0x1acd61[_0x164cea(0x3f3)]('');
    for (var _0x233eb5 = 0x0; _0x233eb5 < _0x435b42['length']; _0x233eb5++) {
        _0xd11a62[_0x435b42[_0x233eb5][_0x164cea(0x458)]()] && (_0x435b42[_0x233eb5] = _0xd11a62[_0x435b42[_0x233eb5]]);
    }
    return _0x1acd61 = _0x435b42[_0x164cea(0x1a5)](''), _0x1acd61;
}

function shuffleArray(_0x54c43b) {
    var _0x287036 = _0x55dc6e,
        _0x253373 = _0x54c43b[_0x287036(0x482)],
        _0x2c05a4, _0x24bf48;
    while (0x0 !== _0x253373) {
        _0x24bf48 = Math[_0x287036(0x37f)](Math[_0x287036(0x217)]() * _0x253373), _0x253373 -= 0x1, _0x2c05a4 = _0x54c43b[_0x253373], _0x54c43b[_0x253373] = _0x54c43b[_0x24bf48], _0x54c43b[_0x24bf48] = _0x2c05a4;
    }
    return _0x54c43b;
}

function randomElement(_0x33a18a) {
    var _0x4aa2eb = _0x55dc6e;
    return _0x33a18a[Math[_0x4aa2eb(0x37f)](Math[_0x4aa2eb(0x217)]() * _0x33a18a[_0x4aa2eb(0x482)])];
}! function(_0x4eb492) {
    var _0x518a80 = _0x55dc6e,
        _0x28a0d2 = _0x518a80(0x397) == typeof exports && exports,
        _0x59832a = _0x518a80(0x397) == typeof module && module && module['exports'] == _0x28a0d2 && module,
        _0x1dfc47 = _0x518a80(0x397) == typeof global && global;
    (_0x1dfc47[_0x518a80(0x5c9)] === _0x1dfc47 || _0x1dfc47['window'] === _0x1dfc47) && (_0x4eb492 = _0x1dfc47);
    var _0x3fe786 = /(<%= allExceptCombiningMarks %>)(<%= combiningMarks %>+)/g,
        _0x37925e = /([\uD800-\uDBFF])([\uDC00-\uDFFF])/g,
        _0x506f17 = function(_0x1be5ba) {
            var _0x2f6909 = _0x518a80;
            _0x1be5ba = _0x1be5ba[_0x2f6909(0x3d1)](_0x3fe786, function(_0x52e57a, _0x1ad5ec, _0x4d073d) {
                return _0x506f17(_0x4d073d) + _0x1ad5ec;
            })[_0x2f6909(0x3d1)](_0x37925e, _0x2f6909(0x424));
            for (var _0xc32a78 = '', _0x33c285 = _0x1be5ba[_0x2f6909(0x482)]; _0x33c285--;) _0xc32a78 += _0x1be5ba[_0x2f6909(0x633)](_0x33c285);
            return _0xc32a78;
        },
        _0x58cd12 = {
            'version': _0x518a80(0x63d),
            'reverse': _0x506f17
        };
    if ('function' == typeof define && _0x518a80(0x397) == typeof define[_0x518a80(0x35c)] && define[_0x518a80(0x35c)]) define(function() {
        return _0x58cd12;
    });
    else {
        if (_0x28a0d2 && !_0x28a0d2['nodeType']) {
            if (_0x59832a) _0x59832a['exports'] = _0x58cd12;
            else {
                for (var _0x280672 in _0x58cd12) _0x58cd12[_0x518a80(0x5e1)](_0x280672) && (_0x28a0d2[_0x280672] = _0x58cd12[_0x280672]);
            }
        } else _0x4eb492['esrever'] = _0x58cd12;
    }
}(this);

function fullCrazy(_0x35f21a) {
    var _0x2b5619 = _0x55dc6e;
    if (_0x35f21a[_0x2b5619(0x343)]() === '') return '';
    return randomSymbols(0x2) + '\x20\x20' + crazifyText(_0x35f21a) + '\x20\x20' + randomSymbols(0x2);
}

function crazifyText(_0x3eab6e) {
    var _0x5ece95 = _0x55dc6e;
    _0x3eab6e = _0x3eab6e[_0x5ece95(0x3f3)]('');
    for (var _0x556de2 = 0x0; _0x556de2 < _0x3eab6e[_0x5ece95(0x482)]; _0x556de2++) {
        _0x3eab6e[_0x556de2] = crazifyCharacter(_0x3eab6e[_0x556de2]);
    }
    return _0x3eab6e[_0x5ece95(0x1a5)]('');
}

function crazifyCharacter(_0x58be25) {
    var _0xf63eea = _0x55dc6e;
    _0x58be25 = _0x58be25[_0xf63eea(0x458)]();
    var _0x5cee3b = {};
    _0x5cee3b['&'] = '⅋', _0x5cee3b['%'] = ['⅍', '℀', '℁', '℆', '℅'], _0x5cee3b['0'] = ['０', 'Ѳ', 'ʘ'], _0x5cee3b['1'] = ['➀', '❶', '１'], _0x5cee3b['2'] = ['２', '❷', '➁'], _0x5cee3b['3'] = ['３', '❸', '➂'], _0x5cee3b['4'] = ['４', '❹', '➃'], _0x5cee3b['5'] = ['❺', '➄', '５'], _0x5cee3b['6'] = ['６', '❻', '➅'], _0x5cee3b['7'] = ['７', '❼', '➆'], _0x5cee3b['8'] = ['８', '➇', '❽'], _0x5cee3b['9'] = ['➈', '❾', '９'], _0x5cee3b['<'] = ['≼', '≺', '≪', '☾', '≾', '⋜', '⋞', '⋐', '⊂', '⊏', '⊑', '《', '＜', '❮', '❰', '⫷'], _0x5cee3b['>'] = _0xf63eea(0x605), _0x5cee3b['['] = _0xf63eea(0x5da), _0x5cee3b[']'] = _0xf63eea(0x514), _0x5cee3b['*'] = _0xf63eea(0x640), _0x5cee3b['a'] = ['Ⓐ', 'ⓐ', 'α', 'Ａ', 'ａ', 'ᗩ', '卂', 'Δ', 'ค', 'α', 'ά', 'Ã', '𝔞', '𝓪', '𝒶', '𝓐', '𝐀', '𝐚', '𝔸', '𝕒', 'ᵃ'], _0x5cee3b['b'] = ['Ⓑ', 'ⓑ', 'в', 'Ｂ', '乃', 'ｂ', 'ᗷ', 'β', '๒', 'в', 'в', 'β', '𝔟', '𝓫', '𝒷', '𝓑', '𝐁', '𝐛', '𝔹', '𝕓', 'ᵇ'], _0x5cee3b['c'] = ['Ⓒ', 'ⓒ', '匚', '¢', 'Ｃ', 'ｃ', 'ᑕ', 'Ć', 'ς', 'c', 'ς', 'Č', '℃', '𝔠', '𝓬', '𝒸', '𝓒', '𝐂', '𝐜', 'ℂ', '𝕔', 'ᶜ'], _0x5cee3b['d'] = ['Ⓓ', 'ⓓ', '∂', 'Ｄ', 'ｄ', 'ᗪ', 'Đ', '๔', '∂', 'đ', 'Ď', '𝔡', '𝓭', '𝒹', '𝓓', '𝐃', 'ᗪ', '𝐝', '𝔻', '𝕕', 'ᵈ'], _0x5cee3b['e'] = ['Ⓔ', '乇', 'ⓔ', 'є', 'Ｅ', 'ｅ', 'ᗴ', '€', 'є', 'ε', 'έ', 'Ẹ', '𝔢', '𝒆', '𝑒', '𝓔', '𝐄', '𝐞', '𝔼', '𝕖', 'ᵉ'], _0x5cee3b['f'] = ['Ⓕ', 'ⓕ', 'ƒ', 'Ｆ', 'ｆ', '千', 'ᖴ', 'ℱ', 'Ŧ', 'ғ', 'ғ', 'Ƒ', '𝔣', '𝒇', '𝒻', '𝓕', '𝐅', '𝐟', '𝔽', '𝕗', 'ᶠ'], _0x5cee3b['g'] = ['Ⓖ', 'ⓖ', 'ق', 'g', 'Ｇ', 'ｇ', 'Ǥ', 'Ꮆ', 'ﻮ', 'g', 'ģ', 'Ğ', '𝔤', '𝓰', '𝑔', '𝓖', '𝐆', '𝐠', '𝔾', '𝕘', 'ᵍ', 'Ꮆ'], _0x5cee3b['h'] = ['Ⓗ', '卄', 'ⓗ', 'н', 'Ｈ', 'ｈ', 'ᕼ', 'Ħ', 'ђ', 'н', 'ħ', 'Ĥ', '𝔥', '𝓱', '𝒽', '𝓗', '𝐇', '𝐡', 'ℍ', '𝕙', 'ʰ'], _0x5cee3b['i'] = ['Ⓘ', 'ⓘ', 'ι', 'Ｉ', 'ｉ', 'Ꭵ', '丨', 'Ɨ', 'เ', 'ι', 'ί', 'Į', '𝔦', '𝓲', '𝒾', '𝓘', '𝐈', '𝐢', '𝕀', '𝕚', 'ᶤ'], _0x5cee3b['j'] = ['Ⓙ', 'ⓙ', 'נ', 'Ｊ', 'ڶ', 'ｊ', 'ᒎ', 'Ĵ', 'ן', 'נ', 'ј', 'Ĵ', '𝔧', '𝓳', '𝒿', '𝓙', '𝐉', '𝐣', '𝕁', '𝕛', 'ʲ'], _0x5cee3b['k'] = ['Ⓚ', 'ⓚ', 'к', 'Ｋ', 'ｋ', 'ᛕ', 'Ҝ', 'к', 'к', 'ķ', 'Ќ', '𝔨', '𝓴', '𝓀', '𝓚', '𝐊', '𝐤', '𝕂', '𝕜', 'ᵏ', 'Ҝ'], _0x5cee3b['l'] = ['Ⓛ', 'ⓛ', 'ℓ', 'ㄥ', 'Ｌ', 'ｌ', 'ᒪ', 'Ł', 'l', 'ℓ', 'Ļ', 'Ĺ', '𝔩', '𝓵', '𝓁', '𝓛', '𝐋', '𝐥', '𝕃', '𝕝', 'ˡ'], _0x5cee3b['m'] = ['Ⓜ', 'ⓜ', 'м', 'Ｍ', 'ｍ', 'ᗰ', 'Μ', '๓', 'м', 'м', 'ϻ', '𝔪', '𝓶', '𝓂', '𝓜', '𝐌', '𝐦', '𝕄', '𝕞', 'ᵐ', '爪'], _0x5cee3b['n'] = ['Ⓝ', '几', 'ⓝ', 'η', 'Ｎ', 'ｎ', 'ᑎ', 'Ň', 'ภ', 'η', 'ή', 'Ň', '𝔫', '𝓷', '𝓃', '𝓝', '𝐍', '𝐧', 'ℕ', '𝕟', 'ᶰ'], _0x5cee3b['o'] = ['Ⓞ', 'ㄖ', 'ⓞ', 'σ', 'Ｏ', 'ｏ', 'ᗝ', 'Ø', '๏', 'σ', 'ό', 'Ỗ', '𝔬', '𝓸', '𝑜', '𝓞', '𝐎', '𝐨', '𝕆', '𝕠', 'ᵒ'], _0x5cee3b['p'] = ['Ⓟ', 'ⓟ', 'ρ', 'Ｐ', 'ｐ', '卩', 'ᑭ', 'Ƥ', 'ק', 'ρ', 'ρ', 'Ƥ', '𝔭', '𝓹', '𝓅', '𝓟', '𝐏', '𝐩', 'ℙ', '𝕡', 'ᵖ'], _0x5cee3b['q'] = ['Ⓠ', 'ⓠ', 'q', 'Ｑ', 'ｑ', 'Ɋ', 'Ω', 'ợ', 'q', 'q', 'Ǫ', '𝔮', '𝓺', '𝓆', '𝓠', '𝐐', '𝐪', 'ℚ', '𝕢', 'ᵠ'], _0x5cee3b['r'] = ['Ⓡ', 'ⓡ', 'я', '尺', 'Ｒ', 'ｒ', 'ᖇ', 'Ř', 'г', 'я', 'ŕ', 'Ř', '𝔯', '𝓻', '𝓇', '𝓡', '𝐑', '𝐫', 'ℝ', '𝕣', 'ʳ'], _0x5cee3b['s'] = ['Ⓢ', 'ⓢ', 'ѕ', 'Ｓ', '丂', 'ｓ', 'ᔕ', 'Ş', 'ร', 's', 'ş', 'Ŝ', '𝔰', '𝓼', '𝓈', '𝓢', '𝐒', '𝐬', '𝕊', '𝕤', 'ˢ'], _0x5cee3b['t'] = ['Ⓣ', 'ⓣ', 'т', 'Ｔ', 'ｔ', '丅', 'Ŧ', 't', 'т', 'ţ', 'Ť', '𝔱', '𝓽', '𝓉', '𝓣', '𝐓', '𝐭', '𝕋', '𝕥', 'ᵗ'], _0x5cee3b['u'] = ['Ⓤ', 'ⓤ', 'υ', 'Ｕ', 'ｕ', 'ᑌ', 'Ữ', 'ย', 'υ', 'ù', 'Ǘ', '𝔲', '𝓾', '𝓊', '𝓤', '𝐔', '𝐮', '𝕌', '𝕦', 'ᵘ'], _0x5cee3b['v'] = ['Ⓥ', 'ⓥ', 'ν', 'Ｖ', 'ｖ', 'ᐯ', 'V', 'ש', 'v', 'ν', 'Ѷ', '𝔳', '𝓿', '𝓋', '𝓥', '𝐕', '𝐯', '𝕍', '𝕧', 'ᵛ'], _0x5cee3b['w'] = ['Ⓦ', 'ⓦ', 'ω', 'Ｗ', 'ｗ', 'ᗯ', 'Ŵ', 'ฬ', 'ω', 'ώ', 'Ŵ', '𝔴', '𝔀', '𝓌', '𝓦', '𝐖', '𝐰', '𝕎', '𝕨', 'ʷ', '山'], _0x5cee3b['x'] = ['Ⓧ', 'ⓧ', 'χ', 'Ｘ', '乂', 'ｘ', '᙭', 'Ж', 'א', 'x', 'x', 'Ж', '𝔵', '𝔁', '𝓍', '𝓧', '𝐗', '𝐱', '𝕏', '𝕩', 'ˣ'], _0x5cee3b['y'] = ['Ⓨ', 'ㄚ', 'ⓨ', 'у', 'Ｙ', 'ｙ', 'Ƴ', '¥', 'ץ', 'ү', 'ч', 'Ў', '𝔶', '𝔂', '𝓎', '𝓨', '𝐘', '𝐲', '𝕐', '𝕪', 'ʸ'], _0x5cee3b['z'] = ['Ⓩ', 'ⓩ', 'z', '乙', 'Ｚ', 'ｚ', 'Ƶ', 'Ž', 'z', 'z', 'ž', 'Ż', '𝔷', '𝔃', '𝓏', '𝓩', '𝐙', '𝐳', 'ℤ', '𝕫', 'ᶻ'];
    var _0x5e4361 = _0x5cee3b;
    return _0x5e4361[_0x58be25] ? randomElement(_0x5e4361[_0x58be25]) : _0x58be25;
}

function randomElement(_0x192c4f) {
    var _0x51ab14 = _0x55dc6e;
    return _0x192c4f[Math[_0x51ab14(0x37f)](Math['random']() * _0x192c4f[_0x51ab14(0x482)])];
}

function randomSymbols(_0x296b38) {
    var _0x704015 = _0x55dc6e,
        _0x56db57 = ['🐙', '🐉', '🐊', '🐒', '🐝', '🐜', '🐚', '🐲', '🐳', '🐸', '👑', '👹', '👺', '👤', '💲', '💣', '💙', '💚', '💛', '💜', '💝', '💗', '💘', '💞', '💔', '💥', '🐯', '🐼', '🐻', '🐺', '👌', '🐍', '🐧', '🐟', '🐠', '🐨', '🎯', '🏆', '🎁', '🎀', '🎉', '🎈', '🍮', '🍭', '🍬', '🍫', '🍪', '🍧', '🌷', '🍓', '😺', '😾', '✎', '😎', '😝', '😂', '😈', '😡', '😲', '😳', '🍔', '🍟', '🍩', '🎃', '🎄', '🎅', '🐣', '🐤', '👍', '👊', '👻', '👽', '👮', '💎', '💋', '👣', '💀', '💢', '🔥', '♔', '♕', '♖', '♗', '♘', '♙', '♚', '♛', '♜', '♝', '♞', '♟', '♠', '♡', '♢', '♣', '♤', '♥', '♦', '♧', '♨', '♩', '♪', '♬', '★', '☆', '☺', '☹', '☯', '☮', '☢', '☠', '☟', '☞', '☝', '☜', '✌', '✋', '✊', '⛵', 'ൠ', '✌', 'ඏ'],
        _0x50efd5 = [];
    for (var _0x2b53af = 0x0; _0x2b53af < _0x296b38; _0x2b53af++) _0x50efd5[_0x704015(0x4f8)](randomElement(_0x56db57));
    return _0x50efd5[_0x704015(0x1a5)]('');
}

function randInt(_0x5d68ce, _0x5e2b84) {
    var _0x159e50 = _0x55dc6e;
    return _0x5d68ce + Math[_0x159e50(0x37f)](Math[_0x159e50(0x217)]() * (_0x5e2b84 - _0x5d68ce + 0x1));
}
$(document)[_0x55dc6e(0x2fd)](function() {
    var _0x324e45 = _0x55dc6e;
    $(_0x324e45(0x317))[_0x324e45(0x34f)](), $(window)['scroll'](function() {
        var _0x494513 = _0x324e45;
        $(this)['scrollTop']() > 0x64 ? $(_0x494513(0x54d))[_0x494513(0x2fe)]() : $(_0x494513(0x54d))[_0x494513(0x584)]();
    }), $(_0x324e45(0x54d))['click'](function() {
        var _0x133780 = _0x324e45,
            _0x56e463 = {};
        return _0x56e463['scrollTop'] = 0x0, $(_0x133780(0x66f))[_0x133780(0x24b)](_0x56e463, 0x258), ![];
    });
}), $(document)[_0x55dc6e(0x2fd)](function() {
    var _0x1bfef6 = _0x55dc6e;
    $(_0x1bfef6(0x617))['on'](_0x1bfef6(0x67c), function() {
        var _0x467590 = _0x1bfef6;
        $('<style>\x20.stylename\x20p{font-size:' + $(this)[_0x467590(0x665)]() + _0x467590(0x2f7))[_0x467590(0x57a)](_0x467590(0x3f4));
        var _0x1d76ae = {};
        _0x1d76ae[_0x467590(0x62b)] = 0x16d, $[_0x467590(0x291)](_0x467590(0x1eb), $(this)['val'](), _0x1d76ae);
    });
    $[_0x1bfef6(0x291)](_0x1bfef6(0x33d)) && $(_0x1bfef6(0x45d))['html']($['cookie'](_0x1bfef6(0x33d)));
    $('.font-generator')['on'](_0x1bfef6(0x1a9), function(_0x4106e0) {
        var _0x55b761 = _0x1bfef6,
            _0x47edc8 = $(_0x55b761(0x1b5))[_0x55b761(0x665)]();
        _0x3ea40d(_0x47edc8);
        var _0x302586 = {};
        _0x302586['expires'] = 0x16d, $[_0x55b761(0x291)](_0x55b761(0x2da), _0x47edc8, _0x302586), $('#share-link')[_0x55b761(0x5fd)](siteurl + encodeURIComponent(_0x47edc8));
    });
    var _0x315f84 = window[_0x1bfef6(0x534)][_0x1bfef6(0x404)],
        _0x889468 = _0x315f84['split']('?=');
    urltext = _0x889468[0x1];
    if (urltext) {
        urltext = decodeURIComponent(urltext), $(_0x1bfef6(0x1b5))[_0x1bfef6(0x665)](urltext), _0x3ea40d(urltext);
        var _0x3716db = {};
        _0x3716db['expires'] = 0x16d, $[_0x1bfef6(0x291)](_0x1bfef6(0x2da), urltext, _0x3716db), $('#share-link')[_0x1bfef6(0x5fd)](siteurl + encodeURIComponent(urltext));
    }
    $(document)['on']('click', _0x1bfef6(0x1e2), function() {
        var _0x5d3978 = _0x1bfef6;
        $('.stylenamerecentlist')[_0x5d3978(0x4e1)](_0x5d3978(0x1e7) + $(this)[_0x5d3978(0x587)]('p')[_0x5d3978(0x1dd)](_0x5d3978(0x43b)) + _0x5d3978(0x22a) + $(this)['find']('p')[_0x5d3978(0x1dd)](_0x5d3978(0x43b)) + '\x22>' + $(this)[_0x5d3978(0x587)]('p')['text']() + '</p></div>');
        $('.stylenamerecentlist\x20.stylename')[_0x5d3978(0x482)] > 0x3 && $(_0x5d3978(0x3c0))['last']()[_0x5d3978(0x1d2)]();
        var _0x47dbc7 = {};
        _0x47dbc7['expires'] = 0x16d, $[_0x5d3978(0x291)](_0x5d3978(0x33d), $('.stylenamerecentlist')['html'](), _0x47dbc7);
    });

    function _0x1cdf4c() {
        var _0x19ef8d = _0x1bfef6,
            _0x36f748 = $(_0x19ef8d(0x1b5))[_0x19ef8d(0x665)]();
        $(_0x19ef8d(0x49b))[_0x19ef8d(0x5fd)](wrapInFlourish(_0x445147(_0x36f748))), $(_0x19ef8d(0x2ef))[_0x19ef8d(0x5fd)](wrapInFlourish(_0x445147(_0x36f748))), $(_0x19ef8d(0x1f4))['html'](wrapInFlourish(_0x445147(_0x36f748))), $(_0x19ef8d(0x25d))['html'](wrapInFlourish(_0x445147(_0x36f748))), $(_0x19ef8d(0x3f0))['html'](wrapInFlourish(_0x445147(_0x36f748))), $(_0x19ef8d(0x448))['html'](wrapInFlourish(_0x445147(_0x36f748))), $('.flourish7')[_0x19ef8d(0x5fd)](wrapInFlourish(_0x445147(_0x36f748))), $(_0x19ef8d(0x23f))[_0x19ef8d(0x5fd)](wrapInFlourish(_0x445147(_0x36f748))), $(_0x19ef8d(0x5c4))[_0x19ef8d(0x5fd)](wrapInFlourish(_0x445147(_0x36f748)));
    }

    function _0x3ea40d(_0xcf97ad) {
        var _0x30d88a = _0x1bfef6;
        _0xcf97ad = _0xcf97ad[_0x30d88a(0x343)](), $(_0x30d88a(0x405))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's1')), $(_0x30d88a(0x1f3))['html'](Change(_0xcf97ad, 's2')), $(_0x30d88a(0x610))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's3')), $(_0x30d88a(0x44d))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's4')), $(_0x30d88a(0x3b9))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's5')), $(_0x30d88a(0x515))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's6')), $(_0x30d88a(0x270))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's7')), $(_0x30d88a(0x4dc))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's8')), $('.result-s9')[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's9')), $(_0x30d88a(0x409))[_0x30d88a(0x5fd)](Change(_0xcf97ad, _0x30d88a(0x33e))), $(_0x30d88a(0x396))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's11')), $('.result-s12')[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's12')), $('.result-s13')[_0x30d88a(0x5fd)](Change(_0xcf97ad, _0x30d88a(0x670))), $(_0x30d88a(0x2cc))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's14')), $(_0x30d88a(0x33f))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's15')), $('.result-s16')[_0x30d88a(0x5fd)](Change(_0xcf97ad, _0x30d88a(0x316))), $('.result-s17')[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's17')), $('.result-s18')[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's18')), $(_0x30d88a(0x4a1))[_0x30d88a(0x5fd)](Change(_0xcf97ad, _0x30d88a(0x301))), $(_0x30d88a(0x1b7))[_0x30d88a(0x5fd)](Change(_0xcf97ad, _0x30d88a(0x32c))), $('.result-s21')[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's21')), $(_0x30d88a(0x530))[_0x30d88a(0x5fd)](Change(_0xcf97ad, _0x30d88a(0x3cf))), $('.result-s23')[_0x30d88a(0x5fd)](Change(_0xcf97ad, _0x30d88a(0x31c))), $(_0x30d88a(0x5eb))['html'](Change(_0xcf97ad, _0x30d88a(0x5ab))), $(_0x30d88a(0x250))[_0x30d88a(0x5fd)](Change(_0xcf97ad, _0x30d88a(0x277))), $(_0x30d88a(0x357))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's26')), $(_0x30d88a(0x542))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's27')), $(_0x30d88a(0x3e8))[_0x30d88a(0x5fd)](Change(_0xcf97ad, _0x30d88a(0x1c2))), $('.result-s30')[_0x30d88a(0x5fd)](Change(_0xcf97ad, _0x30d88a(0x43c))), $(_0x30d88a(0x363))[_0x30d88a(0x5fd)](Change(_0xcf97ad, 's31')), $('.lunitoolsbubbles')['html'](luni['tools'][_0x30d88a(0x1be)][_0x30d88a(0x384)](_0xcf97ad)), $(_0x30d88a(0x3a7))[_0x30d88a(0x5fd)](applyCharMap(invertedSquaresCharMap, _0xcf97ad)), $(_0x30d88a(0x54c))['html'](applyCharMap(wideTextCharMap, _0xcf97ad)), $(_0x30d88a(0x52c))[_0x30d88a(0x5fd)](luni[_0x30d88a(0x628)][_0x30d88a(0x3b5)][_0x30d88a(0x384)](_0xcf97ad)), $(_0x30d88a(0x3f8))[_0x30d88a(0x5fd)](luni['tools'][_0x30d88a(0x23c)][_0x30d88a(0x384)](_0xcf97ad)), $(_0x30d88a(0x244))['html'](applyCharMap(squaresCharMap, _0xcf97ad)), $(_0x30d88a(0x22b))['html'](luni['tools'][_0x30d88a(0x4cb)][_0x30d88a(0x384)](_0xcf97ad)), $(_0x30d88a(0x367))['html'](applyCharMap(subscriptCharMap, _0xcf97ad)), $(_0x30d88a(0x519))[_0x30d88a(0x5fd)](applyCharMap(superscriptCharMap, _0xcf97ad)), $(_0x30d88a(0x3d8))[_0x30d88a(0x5fd)](applyCharMap(bentTextCharMap, _0xcf97ad)), $('.neonCharMap')[_0x30d88a(0x5fd)](applyCharMap(neonCharMap, _0xcf97ad)), $(_0x30d88a(0x1ee))['html'](applyCharMap(futureAlienCharMap, _0xcf97ad)), $('.strikeThrough')[_0x30d88a(0x5fd)](strikeThrough(_0xcf97ad)), $(_0x30d88a(0x212))[_0x30d88a(0x5fd)](tildeStrikeThrough(_0xcf97ad)), $(_0x30d88a(0x580))[_0x30d88a(0x5fd)](slashThrough(_0xcf97ad)), $(_0x30d88a(0x249))['html'](underline(_0xcf97ad)), $('.doubleUnderline')[_0x30d88a(0x5fd)](doubleUnderline(_0xcf97ad)), $(_0x30d88a(0x31a))[_0x30d88a(0x5fd)](luni['tools']['creepify']['encode'](_0xcf97ad)), $('.squiggleCharMap')[_0x30d88a(0x5fd)](applyCharMap(squiggleCharMap, _0xcf97ad)), $('.squiggle2CharMap')['html'](applyCharMap(squiggle2CharMap, _0xcf97ad)), $(_0x30d88a(0x3aa))[_0x30d88a(0x5fd)](applyCharMap(squiggle3CharMap, _0xcf97ad)), $(_0x30d88a(0x2c3))['html'](applyCharMap(squiggle4CharMap, _0xcf97ad)), $(_0x30d88a(0x5de))['html'](applyCharMap(squiggle5CharMap, _0xcf97ad)), $('.squiggle6CharMap')[_0x30d88a(0x5fd)](applyCharMap(squiggle6CharMap, _0xcf97ad)), $('.boldCharMap')['html'](applyCharMap(boldCharMap, _0xcf97ad)), $(_0x30d88a(0x5a3))[_0x30d88a(0x5fd)](luni[_0x30d88a(0x628)][_0x30d88a(0x308)]['encode'](_0xcf97ad)), $(_0x30d88a(0x2d5))['html'](luni[_0x30d88a(0x628)][_0x30d88a(0x242)][_0x30d88a(0x384)](_0xcf97ad)), $(_0x30d88a(0x300))[_0x30d88a(0x5fd)](applyCharMap(oldEnglishCharMap, _0xcf97ad)), $('.medievalCharMap')[_0x30d88a(0x5fd)](applyCharMap(medievalCharMap, _0xcf97ad)), $(_0x30d88a(0x591))['html'](applyCharMap(cursiveCharMap, _0xcf97ad)), $(_0x30d88a(0x278))[_0x30d88a(0x5fd)](scriptify(_0xcf97ad)), $('.doubleStruckCharMap')[_0x30d88a(0x5fd)](applyCharMap(doubleStruckCharMap, _0xcf97ad)), $(_0x30d88a(0x4a2))[_0x30d88a(0x5fd)](applyCharMap(italicCharMap, _0xcf97ad)), $(_0x30d88a(0x377))[_0x30d88a(0x5fd)](applyCharMap(boldItalicCharMap, _0xcf97ad)), $(_0x30d88a(0x478))[_0x30d88a(0x5fd)](applyCharMap(monospaceCharMap, _0xcf97ad)), $(_0x30d88a(0x5ac))[_0x30d88a(0x5fd)](applyCharMap(upperAnglesCharMap, _0xcf97ad)), $(_0x30d88a(0x34a))['html'](applyCharMap(greekCharMap, _0xcf97ad)), $(_0x30d88a(0x1d7))[_0x30d88a(0x5fd)](applyCharMap(symbolsCharMap, _0xcf97ad)), $(_0x30d88a(0x61a))[_0x30d88a(0x5fd)](applyCharMap(currencyCharMap, _0xcf97ad)), $(_0x30d88a(0x338))['html'](applyCharMap(asianStyleCharMap, _0xcf97ad)), $('.asianStyle2CharMap')[_0x30d88a(0x5fd)](applyCharMap(asianStyle2CharMap, _0xcf97ad)), $(_0x30d88a(0x431))['html'](thickBlockFramed(_0xcf97ad)), $('.diametricAngleFrame')['html'](diametricAngleFrame(_0xcf97ad)), $(_0x30d88a(0x5c7))[_0x30d88a(0x5fd)](wavyJoiner(_0xcf97ad)), $(_0x30d88a(0x4fe))['html'](dottyJoiner(_0xcf97ad)), $(_0x30d88a(0x49e))['html'](kirbyHug(_0xcf97ad)), $('.vaporwaveText')['html'](vaporwaveText(_0xcf97ad)), $(_0x30d88a(0x634))[_0x30d88a(0x5fd)](vaporwaveText1(_0xcf97ad)), $('.vaporwaveText2')[_0x30d88a(0x5fd)](vaporwaveText2(_0xcf97ad)), $(_0x30d88a(0x426))[_0x30d88a(0x5fd)](littleSparkles(_0xcf97ad)), $(_0x30d88a(0x5fe))['html'](weirdBox(_0xcf97ad)), $(_0x30d88a(0x359))[_0x30d88a(0x5fd)](firework(_0xcf97ad)), $(_0x30d88a(0x476))[_0x30d88a(0x5fd)](stinky(_0xcf97ad)), $(_0x30d88a(0x1cc))['html'](heartsBetween(_0xcf97ad)), $('.arrowBelow')['html'](arrowBelow(_0xcf97ad)), $(_0x30d88a(0x577))['html'](crossAboveBelow(_0xcf97ad)), $(_0x30d88a(0x489))['html'](wingdings(_0xcf97ad)), $(_0x30d88a(0x64d))[_0x30d88a(0x5fd)](fullCrazy(_0xcf97ad)), $('.crazyWithFlourishOrSymbols')['html'](crazyWithFlourishOrSymbols(_0xcf97ad)), $('.cuteText')[_0x30d88a(0x5fd)](cuteText(_0xcf97ad)), _0x1cdf4c(), $(_0x30d88a(0x432))[_0x30d88a(0x1d2)]();
    };
    $('#random')['click'](function() {
        var _0xbb34ba = _0x1bfef6;
        $(_0xbb34ba(0x317))['fadeIn'](), _0x1cdf4c(), $(_0xbb34ba(0x317))[_0xbb34ba(0x584)]();
    });

    function _0x3a4212() {
        var _0x44c4f4 = _0x1bfef6;
        return fontgenArray[Math[_0x44c4f4(0x37f)](Math['random']() * fontgenArray[_0x44c4f4(0x482)])];
    }

    function _0x471494(_0x2ac5cb) {
        var _0x1d2adb = _0x3a4212();
        return eval(_0x1d2adb + '(\x22' + _0x2ac5cb + '\x22)');
    }

    function _0x203a5d() {
        var _0x167685 = _0x1bfef6;
        return fontgenArrayMap[Math[_0x167685(0x37f)](Math[_0x167685(0x217)]() * fontgenArrayMap[_0x167685(0x482)])];
    }

    function _0x445147(_0x143010) {
        var _0x3e5c39 = _0x203a5d();
        return _0x143010 = _0x143010['trim'](), eval(_0x3e5c39 + '(\x22' + _0x143010 + '\x22)');
    }
    $(_0x1bfef6(0x4ce))['click'](function() {
        var _0x47151e = _0x1bfef6;
        $(_0x47151e(0x317))[_0x47151e(0x2fe)]();
        var _0x325934 = $(_0x47151e(0x1b5))[_0x47151e(0x665)]();
        $(_0x47151e(0x3e2))[_0x47151e(0x53f)](_0x47151e(0x1c7) + fullCrazy(_0x325934) + _0x47151e(0x40b)), $(_0x47151e(0x3e2))[_0x47151e(0x53f)](_0x47151e(0x1c7) + crazyWithFlourishOrSymbols(_0x325934) + _0x47151e(0x40b)), $(_0x47151e(0x3e2))[_0x47151e(0x53f)](_0x47151e(0x1c7) + wrapInFlourish(_0x471494(_0x325934)) + _0x47151e(0x40b)), $(_0x47151e(0x3e2))[_0x47151e(0x53f)](_0x47151e(0x1c7) + cuteText(_0x325934) + _0x47151e(0x40b)), $(_0x47151e(0x3e2))[_0x47151e(0x53f)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x471494(_0x325934)) + _0x47151e(0x40b)), $(_0x47151e(0x3e2))[_0x47151e(0x53f)](_0x47151e(0x1c7) + wrapInFlourish(_0x471494(_0x325934)) + _0x47151e(0x40b)), $(_0x47151e(0x3e2))[_0x47151e(0x53f)](_0x47151e(0x1c7) + wrapInFlourish(_0x445147(_0x325934)) + '</p></div>'), $(_0x47151e(0x3e2))[_0x47151e(0x53f)](_0x47151e(0x1c7) + wrapInFlourish(_0x445147(_0x325934)) + _0x47151e(0x40b)), $(_0x47151e(0x3e2))['append'](_0x47151e(0x1c7) + wrapInFlourish(_0x445147(_0x325934)) + _0x47151e(0x40b)), $(_0x47151e(0x317))['fadeOut']();
    }), $[_0x1bfef6(0x291)](_0x1bfef6(0x1eb)) && ($(_0x1bfef6(0x582) + $['cookie']('textSize') + _0x1bfef6(0x2f7))[_0x1bfef6(0x57a)](_0x1bfef6(0x3f4)), $(_0x1bfef6(0x617))[_0x1bfef6(0x665)]($[_0x1bfef6(0x291)]('textSize'))), $(_0x1bfef6(0x413))[_0x1bfef6(0x3f9)](function() {
        var _0xb23784 = _0x1bfef6;
        $('#font-generator')[_0xb23784(0x665)]('');
        var _0x3ceb32 = {};
        _0x3ceb32[_0xb23784(0x62b)] = 0x16d, $[_0xb23784(0x291)](_0xb23784(0x2da), '', _0x3ceb32);
    });
}), $(document)[_0x55dc6e(0x2fd)](function() {
    setInterval(function() {
        var _0x58055d = _0x4a74;
        !$(_0x58055d(0x251))[_0x58055d(0x482)] && (window['location'][_0x58055d(0x404)] = _0x58055d(0x1f7));
    }, 0x186a0);
}), window['onload'] = function() {
    var _0x4acd7c = _0x55dc6e,
        _0x115b7d = document[_0x4acd7c(0x673)]('y2kcredit');
    _0x115b7d['setAttribute'](_0x4acd7c(0x404), 'https://fontcuping.com/'), _0x115b7d[_0x4acd7c(0x508)](_0x4acd7c(0x1f6), _0x4acd7c(0x593)), _0x115b7d[_0x4acd7c(0x508)]('target', _0x4acd7c(0x3fc)), _0x115b7d[_0x4acd7c(0x508)](_0x4acd7c(0x5c5), _0x4acd7c(0x5a9)), _0x115b7d[_0x4acd7c(0x508)](_0x4acd7c(0x641), _0x4acd7c(0x1a2)), _0x115b7d[_0x4acd7c(0x1ae)] = 'Schrift\x20Generator';
};

function copyit(_0x475f30) {
    var _0x1aa8f9 = _0x55dc6e;
    if (document[_0x1aa8f9(0x3f4)][_0x1aa8f9(0x62c)]) {
        var _0x9d14a4 = document[_0x1aa8f9(0x3f4)]['createTextRange']();
        _0x9d14a4[_0x1aa8f9(0x38a)](_0x475f30), _0x9d14a4['selecopyit'](), _0x9d14a4[_0x1aa8f9(0x3eb)]('Copy');
    } else {
        if (window[_0x1aa8f9(0x36e)] && document[_0x1aa8f9(0x315)]) {
            var _0x2d94af = _0x475f30[_0x1aa8f9(0x295)],
                _0xd9370 = _0x475f30[_0x1aa8f9(0x368)];
            _0x475f30[_0x1aa8f9(0x295)] = !![], _0x475f30[_0x1aa8f9(0x368)] = !![];
            var _0x32cc07 = document[_0x1aa8f9(0x315)]();
            _0x32cc07[_0x1aa8f9(0x382)](_0x475f30);
            var _0x1f4ab4 = window[_0x1aa8f9(0x36e)]();
            _0x1f4ab4[_0x1aa8f9(0x3d2)](), _0x1f4ab4[_0x1aa8f9(0x3a8)](_0x32cc07);
            if (_0x475f30['nodeName'] == 'TEXTAREA' || _0x475f30[_0x1aa8f9(0x354)] == 'INPUT') _0x475f30[_0x1aa8f9(0x5e9)]();
            if (_0x475f30[_0x1aa8f9(0x505)]) _0x475f30[_0x1aa8f9(0x505)](0x0, 0xf423f);
            _0x475f30['contentEditable'] = _0x2d94af, _0x475f30[_0x1aa8f9(0x368)] = _0xd9370;
            if (document['queryCommandSupported']('copy')) {
                var _0x2e529d = document[_0x1aa8f9(0x3eb)](_0x1aa8f9(0x3c1));
                if (_0x2e529d) $(_0x1aa8f9(0x3f4))['append']('<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22' + $(_0x475f30)[_0x1aa8f9(0x4c9)]() + _0x1aa8f9(0x1b6)), setTimeout(function() {
                    var _0x1e2e93 = _0x1aa8f9;
                    $(_0x1e2e93(0x3e7))[_0x1e2e93(0x1d2)]();
                }, 0x3e8);
                else $(_0x1aa8f9(0x3f4))[_0x1aa8f9(0x53f)](_0x1aa8f9(0x2bd)), setTimeout(function() {
                    var _0x1ab2ed = _0x1aa8f9;
                    $('.copied')[_0x1ab2ed(0x1d2)]();
                }, 0x3e8);
            } else {
                if (!navigator[_0x1aa8f9(0x3c9)]['match'](/ipad|ipod|iphone|android|silk/i)) $('body')[_0x1aa8f9(0x53f)](_0x1aa8f9(0x2bd)), setTimeout(function() {
                    var _0x5aa596 = _0x1aa8f9;
                    $(_0x5aa596(0x3e7))['remove']();
                }, 0x3e8);
            }
        }
    }
}
$(window)['width']() > 0x3c0 && $(window)[_0x55dc6e(0x619)](function() {
    var _0x5a6283 = _0x55dc6e,
        _0x43f8d8 = $(window)['scrollTop']();
    _0x43f8d8 >= 0x64 ? $(_0x5a6283(0x55b))[_0x5a6283(0x3b7)](_0x5a6283(0x38d)) : $(_0x5a6283(0x55b))['removeClass'](_0x5a6283(0x38d));
});
$(_0x55dc6e(0x578))[_0x55dc6e(0x3f9)](function() {
    var _0x591764 = _0x55dc6e;
    $(_0x591764(0x4a4))[_0x591764(0x312)](0x64);
}), $(_0x55dc6e(0x50d))[_0x55dc6e(0x3f9)](function() {
    var _0x447829 = _0x55dc6e;
    $('.leftsection')[_0x447829(0x34f)](0x64);
});
