var _0x46b0bf = _0x40a5;
(function(_0x12b982, _0x1875de) {
    var _0xe4f23c = _0x40a5,
        _0x544a27 = _0x12b982();
    while (!![]) {
        try {
            var _0x585354 = parseInt(_0xe4f23c(0x2ca)) / 0x1 * (-parseInt(_0xe4f23c(0x18f)) / 0x2) + -parseInt(_0xe4f23c(0x4a5)) / 0x3 + parseInt(_0xe4f23c(0x25d)) / 0x4 * (-parseInt(_0xe4f23c(0x370)) / 0x5) + parseInt(_0xe4f23c(0x56c)) / 0x6 * (-parseInt(_0xe4f23c(0x270)) / 0x7) + parseInt(_0xe4f23c(0x436)) / 0x8 + parseInt(_0xe4f23c(0x16f)) / 0x9 * (parseInt(_0xe4f23c(0x2dc)) / 0xa) + -parseInt(_0xe4f23c(0x4d9)) / 0xb * (-parseInt(_0xe4f23c(0x199)) / 0xc);
            if (_0x585354 === _0x1875de) break;
            else _0x544a27['push'](_0x544a27['shift']());
        } catch (_0x515b10) {
            _0x544a27['push'](_0x544a27['shift']());
        }
    }
}(_0x4799, 0x41996));
var normal = _0x46b0bf(0x615);
const fontgenArray = [_0x46b0bf(0x165), _0x46b0bf(0x17f), 'littleSparkles', _0x46b0bf(0x1dc), _0x46b0bf(0x5f1), 'fullCrazy', _0x46b0bf(0x295), _0x46b0bf(0x257), _0x46b0bf(0x240), _0x46b0bf(0x39c), _0x46b0bf(0x2de), _0x46b0bf(0x53f), _0x46b0bf(0x346), _0x46b0bf(0x58d), _0x46b0bf(0x3d2), _0x46b0bf(0x440), _0x46b0bf(0x618), 'scriptify'],
    fontgenArrayMap = [_0x46b0bf(0x591), _0x46b0bf(0x1ea), 'squaresCharMapFun', _0x46b0bf(0x30f), 'bentTextCharMapFun', _0x46b0bf(0x56f), _0x46b0bf(0x45d), 'squiggleCharMapFun', _0x46b0bf(0x26b), _0x46b0bf(0x5ba), _0x46b0bf(0x396), _0x46b0bf(0x3cb), _0x46b0bf(0x1d6), _0x46b0bf(0x51c), _0x46b0bf(0x42e), _0x46b0bf(0x24c), 'cursiveCharMapFun', _0x46b0bf(0x3cf), 'italicCharMapFun', 'boldItalicCharMapFun', _0x46b0bf(0x233), 'upperAnglesCharMapFun', _0x46b0bf(0x259), _0x46b0bf(0x5f6), _0x46b0bf(0x1c5), _0x46b0bf(0x415), _0x46b0bf(0x3dc)];

function _0x4799() {
    var _0x4fd0dd = ['encode', '&#9761;', '&#41240;', 'V&#846;', '&#3182;', '.flourish7', '&psi;', '&Omega;', 'U&#828;', '&dagger;', 'l&#799;', '&#987;', '&#42171;', '(≧◡≦)', 's11', '&#41707;', '&#120827;&#823;', 's31', '&#1079;', 'S&#828;', '&#372;', 't&#838;', '📄︎', 'g&#829;&#851;', '&#988;', '§.•´¨\x27°÷•..×\x20[[text]]\x20×,.•´¨\x27°÷•..§', '&#120454;&#823;', '&#595;', '.result-s30', '&#647;', '7&#826;', '➶➶➶➶➶\x20[[text]]\x20➷➷➷➷➷', 'm&#828;', 'o&#846;', '&#409;', '.result-s5', '👓︎', '&#1074;', 'K&#857;', 'Y2k\x20Font', '&#41008;', 'squares', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', '&#41433;', 'V&#829;&#851;', '&#40984;', '.vaporwaveText2', '.oldEnglishCharMap', '&chi;', '&#41203;', '『$1』', 'val', 'R&#866;', 'Y&#846;', 'object', 'b&#846;', 't&#828;', 'r&#830;', '&#120457;&#823;', '&#1180;', '696726xrkckg', 'l&#857;', '&#291;', '[[text]]', '&Gamma;', '(✿^▽^)', '.dottyJoiner', '&#41833;', '&#120480;&#823;', '&#41712;', '&#41076;', 'Y&#826;', '&#613;', '&#1338;', 'toUpperCase', 'A&#799;', '(人◕‿◕)', '.invertedSquaresCharMap', 'R&#826;', 'L&#866;', '&#120825;&#823;', '&#484;', '&#586;', 'title', 'addClass', '4&#826;', 'J&#826;', 'W&#826;', '6&#857;', '&#23610;', '&#351;', '&yen;', '[̲̅$1]', '••¤(`×[¤\x20[[text]]\x20¤]×´)¤••', '&#1377;', '&#41105;', '&#8857;', '&#356;', '.result-s23', '6&#829;&#851;', 'S&#866;', '&#120476;&#823;', '.lunitoolsbubbles', 'toLowerCase', 'D&#826;', '&#490;', 'P&#857;', '6&#828;', 'B&#799;', '&rho;', 'scroll', '&Oslash;', '15716657DZAHAb', 'l&#830;', 'F&#838;', '.flourish2', '&#258;', 'z&#857;', '&#2794;', 'G&#838;', 'B&#830;', 'g&#866;', '.diametricAngleFrame', '.lunitoolstinyencode', '.result-s31', '&#1049;', 'recentlist', '&#1059;', '4&#838;', 'D&#838;', 'j&#838;', '.crossAboveBelow', '&#41648;', '9&#826;', 'm&#857;', '(っ◔◡◔)っ\x20♥\x20', 'P&#826;', '🖰︎', '🖬︎', '⎝⎝✧GͥOͣDͫ✧⎠⎠\x20[[text]]\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', '.luniroundsquares', '^ㅅ^', '•°¯`••\x20[[text]]\x20••´¯°•', 'm&#829;&#851;', '·.¸¸.·♩♪♫\x20[[text]]\x20♫♪♩·.¸¸.·', '.flourish9', 'i&#857;', '&#1008;', '¸,ø¤º°`°º¤ø,¸\x20[[text]]\x20¸,ø¤º°`°º¤ø,¸', 'class', 'W&#857;', '&#19973;', 't&#857;', 's23', 'T&#829;&#851;', 'html', 'prepend', '📁︎', '&#120436;&#823;', '.lunicreepify', '&#1087;', '&#1064;', '&sigma;', '<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22', 'r&#828;', '&#943;', '7&#846;', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20[[text]]\x20¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', '\x20⋆\x20', '&#1349;', 'U&#826;', '.boldCharMap', 'u&#826;', 'x&#828;', '7&#829;&#851;', '&Delta;', '3&#829;&#851;', '&nu;', 'click', 'boldCharMapFun', '&#5029;', 'tiny', '&#418;', 'U&#857;', '8&#830;', '.squiggle4CharMap', '&#40974;', '&#1051;', '<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22Press\x20CTRL+C\x20to\x20copy\x22\x20/></p>', '&#972;', '🖂︎', '.result-s3', '.weirdBox', 'C&#846;', 'cookie', 'm&#830;', 'd&#830;', 'J&#838;', '&euro;', '&#41080;', 'attr', '&#41155;', '&#9736;', '&#65434;', '<style>\x20.stylename\x20p{font-size:', '&#412;', '5&#799;', '&#7433;', 'K&#829;&#851;', 'reverse', 'w&#799;', '.result-s4', '\x20•°*”˜.•°*”˜', 'j&#826;', 'crossAboveBelow', '&#41754;', '&#41120;', 'e&#826;', 'b&#857;', 'I&#857;', 'S&#799;', '🖳︎', '•]••´º´•»\x20', '&#344;', 'W&#830;', '&#3619;', '&sigmaf;', '&#120475;&#823;', '&#9834;', 'userAgent', 'U&#838;', '••.•´¯`•.••\x20', '#random', 'b&#799;', '&#294;', 'i&#846;', 'mirror', 'onload', '×º°”˜`”°º×\x20', 'd&#828;', 'createTextRange', 'target', 'F&#829;&#851;', '&#541;', '5&#857;', '&#41823;', '&#321;', '&#9837;', '&#41571;', '0&#826;', 'p&#830;', '1&#799;', 'g&#838;', '&#1210;', '&#292;', '&#1103;', '&#1283;', '&#120433;&#823;', '&#1342;', '54YbYwET', '&#377;', '&#10127;', 'neonCharMapFun', '&iota;', 'location', 'v&#829;&#851;', '&#315;', '&#942;', '&#5623;', 'L&#857;', '.•♫•♬•\x20[[text]]\x20•♬•♫•.', '&#1130;', '&#1506;', '°·.¸.·°¯°·.¸.·°¯°·.¸.->\x20', 'e&#829;&#851;', 'F&#830;', 'j&#829;&#851;', '.subscriptCharMap', '3&#828;', '&#8984;', '&#1333;', 'C&#799;', '6&#799;', '&#1094;', 'queryCommandSupported', '&#1213;', '(Y)', '&#1340;', '&#941;', 'ஜ۩۞۩ஜ\x20[[text]]\x20ஜ۩۞۩ஜ', '.copied', '•´¯`•»\x20[[text]]\x20«•´¯`•', 'tildeStrikeThrough', 'flip', '1&#866;', 'l&#828;', 'invertedSquaresCharMapFun', 'f&#828;', 'o&#838;', 'T&#857;', 'insertBefore', '&#5741;', '&#1076;', '7&#838;', '&#120461;&#823;', '2&#799;', 'Z&#857;', '&#633;', 'join', 'M&#830;', 'O&#799;', '&#42130;', '&#9815;', 'O&#830;', 'y&#846;', 'toString', 'bottom', 'c&#857;', 'options', 'N&#857;', 'decode', '•._.••´¯``•.¸¸.•`\x20[[text]]\x20`•.¸¸.•´´¯`••._.•', 'c&#838;', 'J&#857;', 'body', '&#1111;', 'charAt', '&#120462;&#823;', 'z&#799;', 's&#828;', 'round', 'o&#866;', '&#1071;', '&#1028;', '&#41733;', '.squiggle6CharMap', '&#406;', 'squiggle3CharMapFun', '*´¯`*.¸¸.*´¯`*\x20', '&#1048;', 'C&#828;', 'fadeIn', '&#270;', '.result-s8', '&#670;', '4&#830;', 'Q&#857;', '&#262;', 'selectNodeContents', '&#3588;', '👎︎', '&#120831;&#823;', '&#411;', 'L&#799;', 'z&#846;', '&#42180;', '\x20.o0×X×0o.\x20[[text]]\x20.o0×X×0o.', '&#276;', '&#120830;&#823;', '&#4330;', 's18', 's&#829;&#851;', 't&#866;', '&#1331;', '▀▄▀▄▀▄\x20[[text]]\x20▄▀▄▀▄▀', 'H&#828;', '&#9687;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', 'I&#846;', '&#391;', '#share-link', '§.•´¨\x27°÷•..×\x20', '&#5556;', 'O&#846;', '.arrowBelow', '&#120432;&#823;', 'p&#826;', '.leftsection\x20.close', '&#8467;', '&#4318;', 'textSize', '&#120447;&#823;', 'M&#826;', '⁀‿⁀', 'L&#830;', 'j&#830;', '&#350;', 'G&#799;', 't&#799;', 'm&#846;', 'z&#829;&#851;', 'L&#828;', 'heartsBetween', 'E&#846;', '&#1350;', 'ready', '🕘︎', 'symbolsCharMapFun', '&#1192;', '&#408;', '&#41686;', '&#5205;', 'v&#866;', '.stylenamelist\x20.stylename', '&#42181;', '&#3923;', '°°°·.°·..·°¯°·._.·\x20[[text]]\x20·._.·°¯°·.·°\x20.·°°°', 'b&#828;', '������', 'maxHeight', '&#623;', '(✿◕ᗜ◕)━♫.*･｡ﾟ', '&#1092;', '&#387;', 'creepify', '&#41731;', 'a&#830;', 'z&#838;', 'v&#846;', '&#41053;', '&kappa;', '&#41674;', 'U&#799;', '#y2kcredit:visible', 'H&#838;', 's24', '&#2798;', '◕‿◕', 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890', 'X&#828;', 'getElementById', 'slashThrough', '(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧', 'k&#838;', 'z&#828;', '&#42075;', 'J&#829;&#851;', 'T&#866;', '`•.,¸¸,.•´¯\x20', 'E&#857;', 'f&#799;', '&#9812;', '&#627;', 'J&#830;', '*•.¸♡\x20[[text]]\x20♡¸.•*', '&#323;', 'N&#830;', 'M&#838;', 'E&#799;', '&#401;', '&#120456;&#823;', 'setAttribute', '๑۞๑,¸¸,ø¤º°`°๑۩\x20[[text]]\x20๑۩\x20,¸¸,ø¤º°`°๑۞๑', 'recenttext', '【$1】', 'f&#866;', 's&#799;', '&#416;', 'Q&#866;', 'L&#838;', 'w&#829;&#851;', '&#1041;', '<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>', 'fromCharCode', 'J&#846;', '1&#830;', '&#311;', '&#41296;', '9&#846;', '&#120828;&#823;', '&#42148;', 'length', 'firework', '&#7918;', 'k&#829;&#851;', '&#41266;', '.firework', '&#5615;', '&#404;', '.result-s12', '&#120826;&#823;', 'J&#799;', '275022NxwBmc', '(^▽^)', '7&#857;', '&#8627;', '&#120440;&#823;', '_blank', 'g&#826;', '↤↤↤↤↤\x20[[text]]\x20↦↦↦↦↦', '🖴︎', '&Xi;', '&#1139;', 's17', '&#1056;', '&#41769;', '꧁𓊈𒆜\x20[[text]]\x20𒆜𓊉꧂', 'g&#846;', 'weirdBox', 't&#846;', '•´¯`•.\x20[[text]]\x20.•´¯`•', '&#1040;', '.result-s25', 'h&#866;', '&#548;', '&#120441;&#823;', 'W&#838;', '.result-s7', '&oplus;', '✨✩✪✫✬✭✮✯✰✦✱✲✳✴✵✶✷֍֎✸✹✺✻✼✽✾✿❀❁❂❃❄★☆＊', '&#9835;', 'U&#830;', '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', 'D&#866;', '16RaZQUW', 'm&#838;', 'A&#846;', '.result-s21', 'n&#826;', '&#41991;', 'P&#828;', '<br>\x0a', '&#1359;', 'l&#846;', '12qLvcHR', 'append', '&#41204;', 'b&#838;', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20[[text]]\x20°º¤ø,¸¸,ø¤º°`°º¤ø,¸', '&#608;', 'f&#826;', 'window', 'C&#838;', '&#120435;&#823;', 'B&#828;', 'Z&#838;', 'M&#846;', '.crazyWithFlourishOrSymbols', 'd&#826;', '(¯`·.¸¸.·´¯`·.¸¸.->\x20[[text]]\x20<-.¸¸.·´¯`·.¸¸.·´¯)', 'S&#826;', '(\x20ﾟ∀ﾟ)ﾉ【[[text]]】', 'c&#829;&#851;', 'A&#828;', 'z&#830;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20[[text]]\x20█\x20▇\x20▆\x20▅\x20▄\x20▂\x20▁', '&#268;', '3&#846;', '&#9442;', '0&#830;', '2&#828;', '&#5597;', 'K&#799;', '&#4336;', '(y)', '&#120450;&#823;', 'F&#857;', 'r&#866;', ',-*\x27^\x27~*-.,_,.-*~\x20', '&#20057;', 'm&#826;', 'function', '&#1358;', '.asianStyle2CharMap', 'o&#828;', '&#5616;', '.strikeThrough', '&#41804;', 'currencyCharMapFun', '•´¯`•»\x20', '&#120470;&#823;', '8&#828;', 'c&#846;', 'text', 'K&#828;', '◔◡◔', '🖫︎', 'f&#846;', '7&#799;', '&#41976;', 'n&#830;', '&#654;', '&#940;', '&#42150;', '&#374;', 'squiggle6CharMapFun', '&#1044;', '#y2k-font', '¸,ø¤º°`°º¤ø,¸\x20', 'exports', '&#295;', 'diametricAngleFrame', '🕭︎', 'k&#846;', '&eta;', 'fixedtop', 'M&#866;', '5&#826;', '&#120465;&#823;', '.flourish4', '&#1085;', 'amd', '&#41575;', '&#5262;', '&#392;', 'wideTextCharMapFun', 'G&#828;', '8&#846;', 'X&#846;', 'k&#830;', '&#5167;', 'g&#830;', 'bubbles', 'I&#829;&#851;', 'P&#830;', 'x&#857;', 'p&#828;', 's&#866;', '💣︎', '.italicCharMap', '.result-s14', 'A&#838;', '&phi;', 'C&#866;', 'v&#799;', 'n&#829;&#851;', 'j&#846;', '&#65420;', '.flourish5', 'S&#846;', 'e&#799;', '.thickBlockFramed', '8&#799;', '&#41081;', '&#41922;', '&#9791;', 'V&#866;', '&#400;', 'M&#829;&#851;', 'o&#830;', '&#120478;&#823;', '0&#828;', '🕮︎', 'b&#866;', 'O&#826;', 'I&#799;', 'x&#799;', 'D&#846;', 'D&#857;', 'roundsquares', '∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ\x20[[text]]\x20ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙', 'R&#846;', '|!¤*\x27~``~\x27*¤!|\x20[[text]]\x20|!¤*\x27~``~\x27*¤!|', 'H&#866;', 'o&#826;', 'S&#857;', 'map', '</p></div>', '&#407;', 'Y&#838;', 's14', 'a&#799;', '&#41392;', '&#1202;', '&#40983;', '&#2414;', '.result-s15', 'c&#830;', 'I&#826;', 'x&#826;', 'j&#857;', '•?((¯°·._.•\x20[[text]]\x20•._.·°¯))؟•', '&#607;', '-漫~*\x27¨¯¨\x27*·舞~\x20[[text]]\x20~舞*\x27¨¯¨\x27*·~漫-', '&#4357;', '&#1347;', 'replace', '-·=»‡«=·-\x20[[text]]\x20-·=»‡«=·-', 'monospaceCharMapFun', '&#625;', 'init', '¸„.-•~¹°”ˆ˜¨\x20', '(•◡•)', '&#651;', '&#41005;', 'R&#799;', '&#1060;', 'u&#846;', '.clear', '&#120829;&#823;', '.result-s19', 'wavyJoiner', 'u&#857;', 's&#826;', '🕐︎', 'floor', 'z&#826;', '&#1062;', 'M&#857;', 'Q&#846;', 'x&#829;&#851;', '#scroll', '&#10125;', 'medievalCharMapFun', 'split', '&#120471;&#823;', '4&#857;', 'e&#846;', '&#358;', '🖃︎', 'randomization', '.doubleUnderline', 'v&#828;', '&#42015;', 'dottyJoiner', 'diacriticsBottom', 'greekCharMapFun', '&#41427;', '&#1344;', '(¯`·.¸¸.·´¯`·.¸¸.->\x20', '106924KFqAje', 'Y&#830;', '&#41660;', 'w&#838;', 'd&#857;', '🗏︎', '&#596;', 'H&#826;', 's22', '&#41807;', 's&#838;', '&#10123;', '&#1046;', '.scriptify', 'squiggle2CharMapFun', 'max', '🕔︎', '&#41555;', '&#120474;&#823;', '369712TEtVEP', '&#41426;', '.flourish3', '&#41045;', 'f&#857;', 'I&#838;', '★彡\x20[[text]]\x20彡★', '◦•●◉✿\x20[[text]]\x20✿◉●•◦', '\x20\x20🎀\x20\x20', '&#120466;&#823;', 't&#830;', '3&#830;', 'l&#866;', 'Z&#799;', '.flourish1', 'q&#830;', '&Lambda;', '&#4335;', '&#272;', '&#308;', 'A&#826;', '1&#857;', 'P&#829;&#851;', '&#120444;&#823;', '●‿●', 'L&#829;&#851;', '&#4331;', '3&#866;', '&#41532;', 'V&#828;', '¤\x20(¯´☆✭.¸_)¤\x20[[text]]\x20¤(_¸.✭☆´¯)\x20¤', '&#423;', 'O&#866;', '.wingdings', '&#2790;', '.leftsection', '&#549;', 'kirbyHug', 'A&#866;', 'y&#830;', 'diacriticsTop', '.slashThrough', '<div\x20class=\x22stylename\x22><span>Recently\x20Used</span><p\x20onclick=\x22copyit(this)\x22\x20data-clipboard-target=\x22.', 'a&#866;', '&#41295;', 'Q&#830;', 'd&#846;', 'i&#828;', 'a&#857;', '&#313;', 'F&#866;', 't&#829;&#851;', '&#3057;', 'match', '🕓︎', 'H&#799;', '&#9796;', '&omega;', '&#10003;', 'M&#828;', '&#1179;', 'y2kcredit', '&#382;', '&#1072;', 'V&#830;', '&#5610;', '&#40996;', 'f&#830;', 'i&#799;', '5&#828;', '🕖︎', 'n&#846;', 'N&#846;', 'U&#866;', '.vaporwaveText', 'F&#826;', '&#615;', '&#5511;', '4&#799;', '#mobile-fly-menu', '&alpha;', '4&#829;&#851;', 'N&#828;', 'H&#830;', 'X&#838;', '.cuteText', 'setSelectionRange', 'hide', '&#4327;', 'I&#828;', '15355UbZHQH', '&#120824;&#823;', '3&#826;', '&#41157;', 'getHTML', '9&#866;', 'R&#838;', '2&#838;', 'q&#799;', 'E&#838;', '`•.¸¸.•´´¯`••._.•\x20', '♪ღ♪*•.¸¸.•*¨¨*•.♪\x20[[text]]\x20♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪', '7&#830;', 'remove', 'X&#857;', 'https://cursivefonts.pro/', 'Y&#857;', '&#1337;', '30kpevRx', '&#1131;', 'arrowBelow', 'random', '꧁༒☬\x20[[text]]\x20☬༒꧂', '.stylenamerecentlist\x20.stylename', '┗(^o^\x20)┓三\x20[[text]]\x20三\x20┗(^o^\x20)┓', '&#9773;', 'D&#830;', '&#41751;', '&#4306;', 'execCommand', '&#638;', 'w&#866;', 'find', '😐︎', 'top', 'scrollTop', 'K&#830;', 'l&#829;&#851;', '0&#799;', '👍︎', '.result-s6', '.stylenamerecentlist', 'moveToElementText', 'd&#799;', '&szlig;', '7&#866;', '◥꧁ད\x20ॐ卐[[text]]\x20卐ॐ\x20ཌ꧂◤', 'r&#799;', '&#41016;', 'S&#829;&#851;', '&#5397;', '&#340;', '1&#846;', '&#1075;', '.heartsBetween', 'l&#826;', '🌘‿🌘', '(¯´•._.•\x20[[text]]\x20•._.•´¯)', '&#2670;', '&#8023;', 'B&#846;', '9&#828;', 'getSelection', '&#429;', '&#41079;', '&#41708;', 'ღƪ(ˆ◡ˆ)ʃ♡\x20[[text]]\x20♡ƪ(ˆ◡ˆ)ʃ♪', 'J&#828;', 'x&#830;', 'subscriptCharMapFun', '&#428;', 'Y&#799;', '#loader', '.squiggleCharMap', '&#1095;', '8&#866;', '9&#830;', 's30', '&#5196;', '&scaron;', 'F&#828;', '&#42131;', 's16', '&#420;', 'readOnly', '&#1185;', '📪︎', '.result-s10', '&#1141;', 'html,\x20body', '&otilde;', 'q&#826;', 'ᵔ⌣ᵔ', '&forall;', 'y&#826;', 'q&#857;', '3&#857;', '.underline', '&#413;', 's10', 'B&#838;', '&#639;', '(✿╹◡╹)', '▌│█║▌║▌║\x20', '&#1348;', '&#41007;', '&#1330;', '°°°·.°·..·°¯°·._.·\x20', '&#355;', '¸¸♬·¯·♩¸¸♪·¯·♫¸¸\x20[[text]]\x20¸¸♫·¯·♪¸¸♩·¯·♬¸¸', '&#327;', 'A&#857;', 'O&#829;&#851;', '🕑︎', '&#12425;', 'v&#826;', 'n&#838;', '(¯`*•.¸,¤°´✿.｡.:*\x20[[text]]\x20*.:｡.✿`°¤,¸.•*´¯)', '6&#838;', 'e&#838;', '&#9450;', 's&#846;', '&#120446;&#823;', '╚»★«╝\x20[[text]]\x20╚»★«╝', 'strikeThrough', '&ugrave;', 'V&#799;', 'F&#846;', '&#4317;', 'T&#830;', '&#41126;', 'T&#799;', 'tools', 'p&#829;&#851;', '❀◕‿◕❀', '.result-s26', '.result-s2', '&#642;', '&#1356;', 'B&#829;&#851;', 'trim', 'G&#866;', '&#120453;&#823;', 'contentEditable', 'z&#866;', 'addRange', '🕯︎', '&#10081;', '&#592;', 'B&#826;', '.lunitoolsmirrorencode', 'R&#828;', '&#9730;', '.flourish6', 'u&#838;', 'N&#799;', 'G&#829;&#851;', '&#7828;', 'innerHTML', '👌︎', 'c&#828;', '&#1065;', '📫︎', 'w&#826;', 'pop', 'copy', '95gxvFgw', '&#477;', '.result-s9', '&#618;', '&#12552;', 'Z&#826;', '&#5500;', 'V&#826;', '↫↫↫↫↫\x20[[text]]\x20↬↬↬↬↬', 's19', '2&#866;', 'h&#857;', '&#1351;', '&#8355;', '1&#829;&#851;', '8&#829;&#851;', 'E&#829;&#851;', 'r&#846;', '&#120467;&#823;', '&#545;', 'B&#866;', '.doubleStruckCharMap', '&#5620;', 'a&#838;', 'E&#828;', '&#10130;', 'push', 'I&#866;', '&#8134;', '&#2749;', '&#9790;', '⚔️\x20[[text]]\x20⚔️', '&#41346;', '✿.｡.:*\x20☆:**:.\x20[[text]]\x20.:**:.☆*.:｡.✿', '&#614;', 'hasOwnProperty', '1&#838;', '&#1178;', 'squiggle4CharMapFun', 'G&#830;', '.monospaceCharMap', '&#10124;', 'i&#866;', '🗐︎', 'vaporwaveText', 'nodeName', '&#1078;', '&upsilon;', '&#645;', '&part;', 'Z&#866;', '&#998;', 'a&#828;', '&#41766;', 'L&#846;', 'w&#857;', 'undefined', 'C&#826;', '.symbolsCharMap', 'Y&#828;', 'Y&#866;', '&#5229;', 'Y&#829;&#851;', 'charCodeAt', '🕈︎', '୧(•̀ᗝ•́)૭\x20[[text]]\x20୧(⇀‸↼‶)૭', '&#1138;', 'ᵔᴥᵔ', '&#1105;', '&#296;', 'リサフランク現代のコンピュ竹内\x20まりや若者が履く流行のスニーカー真夜中のドアホットドッグマスターストライカーソニーブギ新しい日の誕生ライフ\x20-\x20ヒスイ蒸気波\x20無線゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゙゚゛゜ゝゞゟ亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育壱逸茨芋引印因咽姻員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科', '🕚︎', '9&#838;', 'K&#866;', '&#435;', '&#669;', '&#41042;', '&#5609;', 'm&#866;', '&#41508;', 'w&#828;', '$2$1', 'n&#857;', 'G&#826;', 'h&#828;', 'Q&#826;', '&#394;', ']|I{•------»\x20', '&#1052;', '&#120479;&#823;', '&#346;', 'squiggle5CharMapFun', '.greekCharMap', 'K&#846;', 'h&#826;', 'doubleStruckCharMapFun', '&#447;', '.futureAlienCharMap', 'underline', '╰☆☆\x20[[text]]\x20☆☆╮', '&#7990;', '•._.••´¯``•.¸¸.•`\x20', '&#1084;', '.y2k-font', 's27', 'T&#826;', 'px}\x20</style>', '&micro;', 'asianStyle2CharMapFun', 'u&#799;', '&#120434;&#823;', 'Copy', 'Z&#846;', 'f&#829;&#851;', '&#42014;', 's13', '&#653;', '5&#838;', '&#10129;', '<%=\x20version\x20%>', 'createRange', '&#646;', 'K&#838;', '9&#799;', 'J&#866;', '&#403;', '.result-s18', 'r&#826;', 'W&#828;', 's12', '2&#846;', '&#5290;', '&#5845;', '.lunisquares', 'H&#846;', 'fadeOut', '.squiggle5CharMap', '&#576;', 'v&#857;', '&#336;', 's20', '&epsilon;', 'F&#799;', 'href', 'X&#866;', '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', 'V&#838;', '&#120822;&#823;', '&#120439;&#823;', 'W&#846;', '&#4329;', 'T&#838;', 'g&#828;', '×º°”˜`”°º×\x20[[text]]\x20×º°”˜`”°º×', 'middle', '&#120482;&#823;', '&#120468;&#823;', '&#4310;', '˜”*°•.˜”*°•\x20', '&#5198;', '📂︎', '&#2799;', '🖮︎', 'n&#866;', '••¤(`×', 'asianStyleCharMapFun', '(ɔ◔‿◔)ɔ', 'k&#866;', '(¯´•._.•\x20', 'k&#826;', 'E&#826;', 'expires', 'diacriticsMiddle', 'G&#846;', '.littleSparkles', '••.•´¯`•.••\x20[[text]]\x20••.•´¯`•.••', 'e&#857;', 'q&#838;', '&#41141;', 'X&#826;', '.bentTextCharMap', '&#341;', '&beta;', 'P&#799;', 'k&#799;', '🕆︎', 'selecopyit', 'q&#828;', '&#2792;', '&#4308;', 'oldEnglishCharMapFun', '&thorn;', '&fnof;', '&#41556;', '8&#838;', '2&#829;&#851;', '&#4325;', 'O&#838;', '692384pxmJyk', '★·.·´¯`·.·★\x20', '&#4315;', 'T&#846;', '&#422;', 'O&#857;', '&#10128;', '&#1352;', 'j&#828;', 'e&#866;', 'doubleUnderline', 'P&#838;', '&#989;', 'ıllıllı\x20[[text]]\x20ıllıllı', '&#120455;&#823;', 's26', 'removeAllRanges', 's21', '&#1397;', 'v&#830;', '&#381;', 'L&#826;', 'e&#830;', '•?((¯°·._.•\x20', '.tildeStrikeThrough', 'mapInverse', '&#41029;', '&#120483;&#823;', 'd&#866;', 'X&#799;', '&#41949;', '.stylenamelist', '1&#828;', 'ıllıllı\x20', 'test', '🕕︎', '(ㅅꈍ﹃ꈍ)*\x20[[text]]\x20*(ꈍ﹃ꈍㅅ)♡', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20', '&#438;', 'futureAlienCharMapFun', '&#1360;', 's25', '.•°¤*(¯`★´¯)*¤°\x20', '&#286;', '•]••´º´•»\x20[[text]]\x20«•´º´••[•', '&#2797;', '&#41074;', '0&#857;', '📭︎', '`•.¸¸.•´´¯`••._.•\x20[[text]]\x20•._.••`¯´´•.¸¸.•`', '7&#828;'];
    _0x4799 = function() {
        return _0x4fd0dd;
    };
    return _0x4799();
}

function applyCharMap(_0x54f80e, _0x4bb960) {
    var _0x319811 = _0x46b0bf;
    let _0x35e2c9 = '';
    for (let _0x1267fc of _0x4bb960[_0x319811(0x24d)]('')) {
        if (_0x54f80e[_0x1267fc] !== undefined) _0x35e2c9 += _0x54f80e[_0x1267fc];
        else {
            if (_0x54f80e[_0x1267fc['toLowerCase']()] !== undefined) _0x35e2c9 += _0x54f80e[_0x1267fc[_0x319811(0x4d0)]()];
            else _0x35e2c9 += _0x1267fc;
        }
    }
    return _0x35e2c9;
}

function invertedSquaresCharMapFun(_0x44fe5d) {
    return applyCharMap(invertedSquaresCharMap, _0x44fe5d);
}

function wideTextCharMapFun(_0x5c23f4) {
    return applyCharMap(wideTextCharMap, _0x5c23f4);
}

function squaresCharMapFun(_0x2c560e) {
    return applyCharMap(squaresCharMap, _0x2c560e);
}

function subscriptCharMapFun(_0x940edb) {
    return applyCharMap(subscriptCharMap, _0x940edb);
}

function bentTextCharMapFun(_0x34b301) {
    return applyCharMap(bentTextCharMap, _0x34b301);
}

function neonCharMapFun(_0x304157) {
    return applyCharMap(neonCharMap, _0x304157);
}

function futureAlienCharMapFun(_0x479057) {
    return applyCharMap(futureAlienCharMap, _0x479057);
}

function squiggleCharMapFun(_0xeff663) {
    return applyCharMap(squiggleCharMap, _0xeff663);
}

function squiggle2CharMapFun(_0x512b95) {
    return applyCharMap(squiggle2CharMap, _0x512b95);
}

function squiggle3CharMapFun(_0x5cd591) {
    return applyCharMap(squiggle3CharMap, _0x5cd591);
}

function squiggle4CharMapFun(_0x1d473b) {
    return applyCharMap(squiggle4CharMap, _0x1d473b);
}

function squiggle5CharMapFun(_0x5cb890) {
    return applyCharMap(squiggle5CharMap, _0x5cb890);
}

function squiggle6CharMapFun(_0x215e86) {
    return applyCharMap(squiggle6CharMap, _0x215e86);
}

function boldCharMapFun(_0x2bf085) {
    return applyCharMap(boldCharMap, _0x2bf085);
}

function oldEnglishCharMapFun(_0x49db70) {
    return applyCharMap(oldEnglishCharMap, _0x49db70);
}

function medievalCharMapFun(_0x1ff22d) {
    return applyCharMap(medievalCharMap, _0x1ff22d);
}

function cursiveCharMapFun(_0x1b58de) {
    return applyCharMap(cursiveCharMap, _0x1b58de);
}

function doubleStruckCharMapFun(_0x26db11) {
    return applyCharMap(doubleStruckCharMap, _0x26db11);
}

function italicCharMapFun(_0x34ad45) {
    return applyCharMap(italicCharMap, _0x34ad45);
}

function boldItalicCharMapFun(_0x1609af) {
    return applyCharMap(boldItalicCharMap, _0x1609af);
}

function monospaceCharMapFun(_0x1ade09) {
    return applyCharMap(monospaceCharMap, _0x1ade09);
}

function upperAnglesCharMapFun(_0x3774fb) {
    return applyCharMap(upperAnglesCharMap, _0x3774fb);
}

function greekCharMapFun(_0x2e6de6) {
    return applyCharMap(greekCharMap, _0x2e6de6);
}

function symbolsCharMapFun(_0x142213) {
    return applyCharMap(symbolsCharMap, _0x142213);
}

function currencyCharMapFun(_0x2fa52c) {
    return applyCharMap(currencyCharMap, _0x2fa52c);
}

function asianStyleCharMapFun(_0x30289f) {
    return applyCharMap(asianStyleCharMap, _0x30289f);
}

function asianStyle2CharMapFun(_0x1f319c) {
    return applyCharMap(asianStyle2CharMap, _0x1f319c);
}
var luni = new Lunicode();
luni[_0x46b0bf(0x34e)][_0x46b0bf(0x607)][_0x46b0bf(0x5a7)][_0x46b0bf(0x602)] = 0xa;

function crazyWithFlourishOrSymbols(_0x48d721) {
    var _0x2c30b4 = _0x46b0bf;
    if (Math[_0x2c30b4(0x2df)]() < 0.7) return wrapInSymbols(crazifyText(_0x48d721), 0x2);
    else return wrapInFlourish(crazifyText(_0x48d721), 0x2);
}

function strikeThrough(_0x165247) {
    var _0xfa1158 = _0x46b0bf;
    return _0x165247[_0xfa1158(0x24d)]('')['join']('̶') + '̶';
}

function tildeStrikeThrough(_0x379bc4) {
    var _0x50570e = _0x46b0bf;
    return _0x379bc4[_0x50570e(0x24d)]('')[_0x50570e(0x59d)]('̴') + '̴';
}

function underline(_0x158158) {
    var _0x1cc093 = _0x46b0bf;
    return _0x158158[_0x1cc093(0x24d)]('')[_0x1cc093(0x59d)]('̲') + '̲';
}

function doubleUnderline(_0x43f2a3) {
    var _0x3af2dd = _0x46b0bf;
    return _0x43f2a3['split']('')[_0x3af2dd(0x59d)]('̳') + '̳';
}

function slashThrough(_0x230bc2) {
    var _0x45f347 = _0x46b0bf;
    return _0x230bc2[_0x45f347(0x24d)]('')[_0x45f347(0x59d)]('̷') + '̷';
}

function stinky(_0x54fb5b) {
    var _0x2ae33e = _0x46b0bf;
    return _0x54fb5b[_0x2ae33e(0x24d)]('')[_0x2ae33e(0x59d)]('̾') + '̾';
}

function heartsBetween(_0x1be1be) {
    var _0xfed685 = _0x46b0bf;
    return _0x1be1be[_0xfed685(0x24d)]('')[_0xfed685(0x59d)]('♥');
}

function arrowBelow(_0x4db12f) {
    var _0x59021e = _0x46b0bf;
    return _0x4db12f[_0x59021e(0x24d)]('')['join']('͎') + '͎';
}

function crossAboveBelow(_0x4700bc) {
    var _0x41c702 = _0x46b0bf;
    return _0x4700bc[_0x41c702(0x24d)]('')['join']('͓̽') + '͓̽';
}
var f = {};
f['0'] = _0x46b0bf(0x506), f['1'] = _0x46b0bf(0x410), f['2'] = _0x46b0bf(0x47f), f['3'] = _0x46b0bf(0x262), f['4'] = _0x46b0bf(0x39b), f['5'] = '🗄︎', f['6'] = '⌛︎', f['7'] = _0x46b0bf(0x412), f['8'] = _0x46b0bf(0x4f2), f['9'] = '🖲︎', f['!'] = '✏︎', f['\x22'] = '✂︎', f['#'] = '✁︎', f['$'] = _0x46b0bf(0x48d), f['%'] = _0x46b0bf(0x1dd), f['&'] = _0x46b0bf(0x20f), f['\x27'] = _0x46b0bf(0x35c), f['('] = '🕿︎', f[')'] = '✆︎', f['*'] = _0x46b0bf(0x527), f['+'] = _0x46b0bf(0x252), f[','] = _0x46b0bf(0x320), f['-'] = _0x46b0bf(0x36c), f['.'] = '📬︎', f['/'] = _0x46b0bf(0x466), f[':'] = _0x46b0bf(0x546), f[';'] = _0x46b0bf(0x177), f['<'] = _0x46b0bf(0x1cd), f['='] = _0x46b0bf(0x4f3), f['>'] = '✇︎', f['?'] = '✍︎', f['A'] = '✌︎', f['B'] = _0x46b0bf(0x369), f['C'] = _0x46b0bf(0x2f1), f['D'] = _0x46b0bf(0x5c7), f['E'] = '☜︎', f['F'] = '☞︎', f['G'] = '☝︎', f['H'] = '☟︎', f['I'] = '✋︎', f['J'] = '☺︎', f['K'] = _0x46b0bf(0x2eb), f['L'] = '☹︎', f['M'] = _0x46b0bf(0x1f7), f['N'] = '☠︎', f['O'] = '⚐︎', f['P'] = '🏱︎', f['Q'] = '✈︎', f['R'] = '☼︎', f['S'] = '💧︎', f['T'] = '❄︎', f['U'] = _0x46b0bf(0x429), f['V'] = '✞︎', f['W'] = _0x46b0bf(0x3b0), f['X'] = '✠︎', f['Y'] = '✡︎', f['Z'] = '☪︎', f['['] = '☯︎', f['\x5c'] = 'ॐ︎', f[']'] = '☸︎', f['^'] = '♈︎', f['_'] = '♉︎', f['`'] = '♊︎', f['a'] = '♋︎', f['b'] = '♌︎', f['c'] = '♍︎', f['d'] = '♎︎', f['e'] = '♏︎', f['f'] = '♐︎', f['g'] = '♑︎', f['h'] = '♒︎', f['i'] = '♓︎', f['j'] = '🙰', f['k'] = '🙵', f['l'] = '●︎', f['m'] = '❍︎', f['n'] = '■︎', f['o'] = '□︎', f['p'] = '◻︎', f['q'] = '❑︎', f['r'] = '❒︎', f['s'] = '⬧︎', f['t'] = '⧫︎', f['u'] = '◆︎', f['v'] = '❖︎', f['w'] = '⬥︎', f['x'] = '⌧︎', f['y'] = '⍓︎', f['z'] = '⌘︎', f['{'] = '❀︎', f['|'] = '✿︎', f['}'] = '❝︎', f['~'] = '❞︎', f['\x20'] = '▯︎', f['€'] = '⓪︎', f['\x20'] = '①︎', f['‚'] = '②︎', f['ƒ'] = '③︎', f['„'] = '④︎', f['…'] = '⑤︎', f['†'] = '⑥︎', f['‡'] = '⑦︎', f['ˆ'] = '⑧︎', f['‰'] = '⑨︎', f['Š'] = '⑩︎', f['‹'] = '⓿︎', f['Œ'] = '❶︎', f['\x20'] = '❷︎', f['Ž'] = '❸︎', f['\x20'] = '❹︎', f['\x20'] = '❺︎', f['‘'] = '❻︎', f['’'] = '❼︎', f['“'] = '❽︎', f['”'] = '❾︎', f['•'] = '❿︎', f['–'] = '◻︎', f['—'] = '◻︎', f['˜'] = '◻︎', f['™'] = '◻︎', f['š'] = '◻︎', f['›'] = '◻︎', f['œ'] = '◻︎', f['\x20'] = '◻︎', f['ž'] = '·︎', f['Ÿ'] = '•︎', f['¡'] = '○︎', f['¢'] = '⭕︎', f['£'] = '◻︎', f['¤'] = '◉︎', f['¥'] = '◎︎', f['¦'] = '◻︎', f['§'] = '▪︎', f['¨'] = '◻︎', f['©'] = '◻︎', f['ª'] = '✦︎', f['«'] = '★︎', f['¬'] = '✶︎', f['®'] = '✹︎', f['¯'] = '✵︎', f['°'] = '◻︎', f['±'] = '⌖︎', f['²'] = '⟡︎', f['³'] = '⌑︎', f['´'] = '◻︎', f['µ'] = '✪︎', f['¶'] = '✰︎', f['·'] = _0x46b0bf(0x243), f['¸'] = _0x46b0bf(0x33b), f['¹'] = '🕒︎', f['º'] = _0x46b0bf(0x2a6), f['»'] = _0x46b0bf(0x26d), f['¼'] = _0x46b0bf(0x459), f['½'] = _0x46b0bf(0x2b6), f['¾'] = '🕗︎', f['¿'] = _0x46b0bf(0x5f5), f['À'] = '🕙︎', f['Á'] = _0x46b0bf(0x3b7), f['Â'] = '🕛︎', f['Ã'] = '◻︎', f['Ä'] = '◻︎', f['Å'] = '◻︎', f['Æ'] = '◻︎', f['Ç'] = '◻︎', f['È'] = '◻︎', f['É'] = '◻︎', f['Ê'] = '◻︎', f['Ë'] = '◻︎', f['Ì'] = '◻︎', f['Í'] = '◻︎', f['Î'] = '◻︎', f['Ï'] = '◻︎', f['Ð'] = '◻︎', f['Ñ'] = '◻︎', f['Ò'] = '◻︎', f['Ó'] = '◻︎', f['Ô'] = '◻︎', f['Õ'] = '⌫︎', f['Ö'] = '⌦︎', f['×'] = '◻︎', f['Ø'] = '➢︎', f['Ù'] = '◻︎', f['Ú'] = '◻︎', f['Û'] = '◻︎', f['Ü'] = '➲︎', f['Ý'] = '◻︎', f['Þ'] = '◻︎', f['ß'] = '◻︎', f['à'] = '◻︎', f['á'] = '◻︎', f['â'] = '◻︎', f['ã'] = '◻︎', f['ä'] = '◻︎', f['å'] = '◻︎', f['æ'] = '◻︎', f['ç'] = '◻︎', f['è'] = '➔︎', f['é'] = '◻︎', f['ê'] = '◻︎', f['ë'] = '◻︎', f['ì'] = '◻︎', f['í'] = '◻︎', f['î'] = '◻︎', f['ï'] = '⇦︎', f['ð'] = '⇨︎', f['ñ'] = '⇧︎', f['ò'] = '⇩︎', f['ó'] = '⬄︎', f['ô'] = '⇳︎', f['õ'] = '⬀︎', f['ö'] = '⬁︎', f['÷'] = '⬃︎', f['ø'] = '⬂︎', f['ù'] = '▭︎', f['ú'] = '▫︎', f['û'] = '✗︎', f['ü'] = '✓︎', f['ý'] = '☒︎', f['þ'] = '☑︎', f['ÿ'] = '◻︎';
const wingdingsCharMap = f;

function wingdings(_0x5103c6) {
    var _0x560cdf = _0x46b0bf;
    return _0x5103c6[_0x560cdf(0x24d)]('')[_0x560cdf(0x21d)](function(_0x264b3d) {
        return wingdingsCharMap[_0x264b3d] ? wingdingsCharMap[_0x264b3d] : _0x264b3d;
    })[_0x560cdf(0x59d)]('');
}
var g = {};
g['\x20'] = '\u3000', g['`'] = '`', g['1'] = '１', g['2'] = '２', g['3'] = '３', g['4'] = '４', g['5'] = '５', g['6'] = '６', g['7'] = '７', g['8'] = '８', g['9'] = '９', g['0'] = '０', g['-'] = '－', g['='] = '＝', g['~'] = '~', g['!'] = '！', g['@'] = '＠', g['#'] = '＃', g['$'] = '＄', g['%'] = '％', g['^'] = '^', g['&'] = '＆', g['*'] = '＊', g['('] = '（', g[')'] = '）', g['_'] = '_', g['+'] = '＋', g['q'] = 'ｑ', g['w'] = 'ｗ', g['e'] = 'ｅ', g['r'] = 'ｒ', g['t'] = 'ｔ', g['y'] = 'ｙ', g['u'] = 'ｕ', g['i'] = 'ｉ', g['o'] = 'ｏ', g['p'] = 'ｐ', g['['] = '[', g[']'] = ']', g['\x5c'] = '\x5c', g['Q'] = 'Ｑ', g['W'] = 'Ｗ', g['E'] = 'Ｅ', g['R'] = 'Ｒ', g['T'] = 'Ｔ', g['Y'] = 'Ｙ', g['U'] = 'Ｕ', g['I'] = 'Ｉ', g['O'] = 'Ｏ', g['P'] = 'Ｐ', g['{'] = '{', g['}'] = '}', g['|'] = '|', g['a'] = 'ａ', g['s'] = 'ｓ', g['d'] = 'ｄ', g['f'] = 'ｆ', g['g'] = 'ｇ', g['h'] = 'ｈ', g['j'] = 'ｊ', g['k'] = 'ｋ', g['l'] = 'ｌ', g[';'] = '；', g['\x27'] = '＇', g['A'] = 'Ａ', g['S'] = 'Ｓ', g['D'] = 'Ｄ', g['F'] = 'Ｆ', g['G'] = 'Ｇ', g['H'] = 'Ｈ', g['J'] = 'Ｊ', g['K'] = 'Ｋ', g['L'] = 'Ｌ', g[':'] = '：', g['\x22'] = '\x22', g['z'] = 'ｚ', g['x'] = 'ｘ', g['c'] = 'ｃ', g['v'] = 'ｖ', g['b'] = 'ｂ', g['n'] = 'ｎ', g['m'] = 'ｍ', g[','] = '，', g['.'] = '．', g['/'] = '／', g['Z'] = 'Ｚ', g['X'] = 'Ｘ', g['C'] = 'Ｃ', g['V'] = 'Ｖ', g['B'] = 'Ｂ', g['N'] = 'Ｎ', g['M'] = 'Ｍ', g['<'] = '<', g['>'] = '>', g['?'] = '？';
const vaporwaveCharMap = g;

function vaporwaveText(_0x3c7201) {
    var _0x54a168 = _0x46b0bf,
        _0x5f4e28 = _0x3c7201[_0x54a168(0x24d)]('\x20')['length'];
    _0x3c7201 = applyCharMap(vaporwaveCharMap, _0x3c7201);
    var _0x15e72e = getAsianChars(Math[_0x54a168(0x26c)](0x3, _0x5f4e28));
    if (_0x5f4e28 > 0x6) _0x15e72e = _0x15e72e[_0x54a168(0x24d)]('')['map'](_0xf9382b => _0xf9382b + ['', ''][Math[_0x54a168(0x5b3)](Math[_0x54a168(0x2df)]() * 0.6)])[_0x54a168(0x59d)]('');
    var _0x580d67 = [];
    return _0x580d67['push'](_0x3c7201), _0x580d67[_0x54a168(0x59d)]();
}

function vaporwaveText1(_0x5b9093) {
    var _0x493ab6 = _0x46b0bf,
        _0x3c3859 = _0x5b9093[_0x493ab6(0x24d)]('\x20')[_0x493ab6(0x164)];
    _0x5b9093 = applyCharMap(vaporwaveCharMap, _0x5b9093);
    var _0x45b8dc = getAsianChars(Math['max'](0x3, _0x3c3859));
    if (_0x3c3859 > 0x6) _0x45b8dc = _0x45b8dc[_0x493ab6(0x24d)]('')['map'](_0x429815 => _0x429815 + ['', ''][Math[_0x493ab6(0x5b3)](Math[_0x493ab6(0x2df)]() * 0.6)])[_0x493ab6(0x59d)]('');
    var _0x4ae991 = [];
    return _0x4ae991[_0x493ab6(0x38a)](_0x5b9093[_0x493ab6(0x231)](/　/g, '░')['replace'](/ａｅ/, 'æ')[_0x493ab6(0x231)](/Ａ/g, 'Λ')['replace'](/Ｅ/g, function() {
        var _0xd2e1e5 = _0x493ab6;
        return Math[_0xd2e1e5(0x2df)]() > 0.5 ? 'Ξ' : 'Σ';
    })['replace'](/Ｏ/g, '♢')), _0x4ae991[_0x493ab6(0x59d)]();
}

function vaporwaveText2(_0x34b046) {
    var _0x5ba659 = _0x46b0bf,
        _0x47bf53 = _0x34b046[_0x5ba659(0x24d)]('\x20')[_0x5ba659(0x164)];
    _0x34b046 = applyCharMap(vaporwaveCharMap, _0x34b046);
    var _0x44e520 = getAsianChars(Math[_0x5ba659(0x26c)](0x3, _0x47bf53));
    if (_0x47bf53 > 0x6) _0x44e520 = _0x44e520[_0x5ba659(0x24d)]('')[_0x5ba659(0x21d)](_0x2eab53 => _0x2eab53 + ['', ''][Math[_0x5ba659(0x5b3)](Math[_0x5ba659(0x2df)]() * 0.6)])[_0x5ba659(0x59d)]('');
    var _0x2dc30e = [];
    return _0x2dc30e[_0x5ba659(0x38a)]('【\ufeff' + _0x34b046 + '】'), _0x2dc30e[_0x5ba659(0x59d)]();
}

function getAsianChars(_0x3c92c5) {
    var _0x3eea7d = _0x46b0bf;
    if (!_0x3c92c5) _0x3c92c5 = 0x1;
    var _0x12ab5a = _0x3eea7d(0x3b6),
        _0x4a3cd1 = '';
    for (var _0x509810 = 0x0; _0x509810 < _0x3c92c5; _0x509810++) {
        _0x4a3cd1 += _0x12ab5a[Math['floor'](Math[_0x3eea7d(0x2df)]() * _0x12ab5a[_0x3eea7d(0x164)])];
    }
    return _0x4a3cd1;
}
const flourishArray = [_0x46b0bf(0x2e0), '◥꧁ད\x20[[text]]\x20ཌ꧂◤', '★·.·´¯`·.·★\x20[[text]]\x20★·.·´¯`·.·★', _0x46b0bf(0x38f), '꧁༒༻☬ད\x20[[text]]\x20ཌ☬༺༒꧂', _0x46b0bf(0x2d5), _0x46b0bf(0x2f8), _0x46b0bf(0x1aa), _0x46b0bf(0x30c), '[[text]]\x20☜(`o´)', _0x46b0bf(0x4f4), '<:::::[]=¤\x20[[text]]\x20(▀̿̿Ĺ̯̿̿▀̿\x20̿)', '｡*ﾟ.*.｡(っ\x20ᐛ\x20)っ✂╰⋃╯\x20[[text]]', _0x46b0bf(0x2e2), _0x46b0bf(0x45a), _0x46b0bf(0x510), _0x46b0bf(0x3b1), _0x46b0bf(0x1ae), _0x46b0bf(0x5ff), _0x46b0bf(0x19d), _0x46b0bf(0x443), _0x46b0bf(0x22c), '▌│█║▌║▌║\x20[[text]]\x20║▌║▌║█│▌', _0x46b0bf(0x409), _0x46b0bf(0x462), _0x46b0bf(0x149), _0x46b0bf(0x3d3), _0x46b0bf(0x493), _0x46b0bf(0x303), _0x46b0bf(0x401), '░▒▓█\x20[[text]]\x20█▓▒░', '░▒▓█►─═\x20\x20[[text]]\x20═─◄█▓▒░', _0x46b0bf(0x276), '•´¯`•.\x20[[text]]\x20.•´¯`•', _0x46b0bf(0x482), _0x46b0bf(0x4f7), _0x46b0bf(0x33f), _0x46b0bf(0x219), _0x46b0bf(0x5aa), _0x46b0bf(0x401), _0x46b0bf(0x303), _0x46b0bf(0x4c6), _0x46b0bf(0x58c), _0x46b0bf(0x5cd), _0x46b0bf(0x18d), '—(••÷[\x20[[text]]\x20]÷••)—', _0x46b0bf(0x4fd), _0x46b0bf(0x467), ',-*\x27\x20^\x20\x27~*-.,_,.-*~\x20[[text]]\x20~*-.,_,.-*~\x27\x20^\x20\x27*-,', '`•.,¸¸,.•´¯\x20[[text]]\x20¯`•.,¸¸,.•´', _0x46b0bf(0x176), _0x46b0bf(0x488), _0x46b0bf(0x378), _0x46b0bf(0x4f9), '【｡_｡】\x20[[text]]\x20【｡_｡】', ']|I{•------»\x20[[text]]\x20«------•}I|[', _0x46b0bf(0x5d5), '(-_-)\x20[[text]]\x20(-_-)', _0x46b0bf(0x181), _0x46b0bf(0x22e), _0x46b0bf(0x151), _0x46b0bf(0x493), _0x46b0bf(0x41f), _0x46b0bf(0x18d), _0x46b0bf(0x277), _0x46b0bf(0x17d), _0x46b0bf(0x345), '⫷\x20[[text]]\x20⫸', _0x46b0bf(0x232), _0x46b0bf(0x217), _0x46b0bf(0x337), _0x46b0bf(0x58a), _0x46b0bf(0x28e), _0x46b0bf(0x1a8), _0x46b0bf(0x391), _0x46b0bf(0x577), 'ღ(¯`◕‿◕´¯)\x20♫\x20♪\x20♫\x20[[text]]\x20♫\x20♪\x20♫\x20(¯`◕‿◕´¯)ღ', '«-(¯`v´¯)-«\x20[[text]]\x20»-(¯`v´¯)-»'];

function wrapInFlourish(_0xe44d9d) {
    var _0x3aac4a = _0x46b0bf;
    return flourishArray[Math[_0x3aac4a(0x244)](Math[_0x3aac4a(0x2df)]() * flourishArray[_0x3aac4a(0x164)])][_0x3aac4a(0x231)](_0x3aac4a(0x4a8), _0xe44d9d);
}

function Flourishlist(_0x479e41, _0x29bb58) {
    var _0x5dff71 = _0x46b0bf;
    return flourishArray[_0x479e41][_0x5dff71(0x231)](_0x5dff71(0x4a8), _0x29bb58);
}

function wrapInSymbols(_0x11b893, _0x311dbf) {
    return randomSymbols(_0x311dbf) + '\x20\x20' + _0x11b893 + '\x20\x20' + randomSymbols(_0x311dbf);
}

function firework(_0x13cc49) {
    var _0x273418 = _0x46b0bf;
    return _0x13cc49['split']('')[_0x273418(0x59d)]('҉') + '҉';
}

function weirdBox(_0x47aa2b) {
    var _0x2f67d6 = _0x46b0bf;
    return _0x47aa2b['replace'](/([^\s])/g, _0x2f67d6(0x4c5));
}

function littleSparkles(_0x491e22) {
    var _0x48278f = _0x46b0bf;
    return _0x48278f(0x40e) + _0x491e22 + _0x48278f(0x53d);
}

function kirbyHug(_0x512309) {
    var _0x53e060 = _0x46b0bf;
    return _0x53e060(0x4f0) + _0x512309 + '\x20♥';
}

function dottyJoiner(_0x76331) {
    var _0x42c544 = _0x46b0bf;
    return '░' + _0x76331[_0x42c544(0x24d)]('')[_0x42c544(0x59d)]('░') + '░';
}

function wavyJoiner(_0x2f7060) {
    var _0x3dd732 = _0x46b0bf;
    return '≋' + _0x2f7060[_0x3dd732(0x24d)]('')[_0x3dd732(0x59d)]('≋') + '≋';
}

function diametricAngleFrame(_0x11ccc0) {
    var _0x342b23 = _0x46b0bf;
    return _0x11ccc0[_0x342b23(0x231)](/([^\s])/g, _0x342b23(0x49b));
}

function thickBlockFramed(_0x158faf) {
    var _0x7a46e0 = _0x46b0bf;
    return _0x158faf['replace'](/([^\s])/g, _0x7a46e0(0x153));
}
var h = {};
h['1'] = _0x46b0bf(0x2c0), h['2'] = _0x46b0bf(0x40d), h['3'] = _0x46b0bf(0x1e9), h['4'] = _0x46b0bf(0x569), h['5'] = _0x46b0bf(0x586), h['6'] = _0x46b0bf(0x442), h['7'] = _0x46b0bf(0x19e), h['8'] = '&#1291;', h['9'] = _0x46b0bf(0x570), h['10'] = _0x46b0bf(0x3bb), h['11'] = _0x46b0bf(0x48b), h['12'] = _0x46b0bf(0x3a0), h['13'] = _0x46b0bf(0x234), h['14'] = _0x46b0bf(0x623), h['15'] = _0x46b0bf(0x50b), h['16'] = '&rho;', h['17'] = '&#985;', h['18'] = _0x46b0bf(0x2e8), h['19'] = _0x46b0bf(0x353), h['20'] = '&#410;', h['21'] = '&upsilon;', h['22'] = _0x46b0bf(0x238), h['23'] = '&#623;', h['24'] = 'x', h['25'] = '&#4327;', h['26'] = _0x46b0bf(0x294), h['27'] = 'A', h['28'] = 'B', h['29'] = 'C', h['30'] = 'D', h['31'] = 'E', h['32'] = 'F', h['33'] = 'G', h['34'] = 'H', h['35'] = 'I', h['36'] = 'J', h['37'] = 'K', h['38'] = 'L', h['39'] = 'M', h['40'] = 'N', h['41'] = 'O', h['42'] = 'P', h['43'] = 'Q', h['44'] = 'R', h['45'] = 'S', h['46'] = 'T', h['47'] = 'U', h['48'] = 'V', h['49'] = 'W', h['50'] = 'X', h['51'] = 'Y', h['52'] = 'Z', h['53'] = '1', h['54'] = '2', h['55'] = '3', h['56'] = '4', h['57'] = '5', h['58'] = '6', h['59'] = '7', h['60'] = '8', h['61'] = '9', h['62'] = '0';
var i = {};
i['1'] = _0x46b0bf(0x266), i['2'] = _0x46b0bf(0x560), i['3'] = _0x46b0bf(0x38e), i['4'] = _0x46b0bf(0x5d7), i['5'] = _0x46b0bf(0x52f), i['6'] = _0x46b0bf(0x481), i['7'] = _0x46b0bf(0x35d), i['8'] = _0x46b0bf(0x2a8), i['9'] = _0x46b0bf(0x5a1), i['10'] = _0x46b0bf(0x54d), i['11'] = _0x46b0bf(0x4fc), i['12'] = _0x46b0bf(0x172), i['13'] = _0x46b0bf(0x622), i['14'] = _0x46b0bf(0x18b), i['15'] = _0x46b0bf(0x4c9), i['16'] = _0x46b0bf(0x4d6), i['17'] = _0x46b0bf(0x2e3), i['18'] = _0x46b0bf(0x533), i['19'] = '&#9442;', i['20'] = '&#9730;', i['21'] = '&#9739;', i['22'] = _0x46b0bf(0x2aa), i['23'] = _0x46b0bf(0x2a9), i['24'] = _0x46b0bf(0x580), i['25'] = _0x46b0bf(0x208), i['26'] = _0x46b0bf(0x46a), i['27'] = '&#41807;', i['28'] = _0x46b0bf(0x560), i['29'] = _0x46b0bf(0x38e), i['30'] = _0x46b0bf(0x5d7), i['31'] = '&euro;', i['32'] = _0x46b0bf(0x481), i['33'] = '&#10081;', i['34'] = _0x46b0bf(0x2a8), i['35'] = _0x46b0bf(0x5a1), i['36'] = '&#9834;', i['37'] = '&#1008;', i['38'] = _0x46b0bf(0x172), i['39'] = _0x46b0bf(0x622), i['40'] = _0x46b0bf(0x18b), i['41'] = '&#8857;', i['42'] = _0x46b0bf(0x4d6), i['43'] = _0x46b0bf(0x2e3), i['44'] = _0x46b0bf(0x533), i['45'] = _0x46b0bf(0x1b1), i['46'] = _0x46b0bf(0x362), i['47'] = '&#9739;', i['48'] = '&#10003;', i['49'] = _0x46b0bf(0x2a9), i['50'] = _0x46b0bf(0x580), i['51'] = _0x46b0bf(0x208), i['52'] = _0x46b0bf(0x46a), i['53'] = '&#10122;', i['54'] = _0x46b0bf(0x268), i['55'] = _0x46b0bf(0x399), i['56'] = _0x46b0bf(0x24b), i['57'] = '&#10126;', i['58'] = _0x46b0bf(0x56e), i['59'] = _0x46b0bf(0x43c), i['60'] = _0x46b0bf(0x3e6), i['61'] = _0x46b0bf(0x389), i['62'] = _0x46b0bf(0x342);
var j = {};
j['1'] = _0x46b0bf(0x4dd), j['2'] = _0x46b0bf(0x426), j['3'] = _0x46b0bf(0x1af), j['4'] = '&#270;', j['5'] = _0x46b0bf(0x5ce), j['6'] = _0x46b0bf(0x251), j['7'] = _0x46b0bf(0x461), j['8'] = _0x46b0bf(0x567), j['9'] = _0x46b0bf(0x3b5), j['10'] = _0x46b0bf(0x283), j['11'] = '&#310;', j['12'] = '&#313;', j['13'] = _0x46b0bf(0x3c8), j['14'] = _0x46b0bf(0x14a), j['15'] = _0x46b0bf(0x3fb), j['16'] = '&#1056;', j['17'] = 'Q', j['18'] = _0x46b0bf(0x2fd), j['19'] = _0x46b0bf(0x3ca), j['20'] = _0x46b0bf(0x4ca), j['21'] = '&Uacute;', j['22'] = 'V', j['23'] = _0x46b0bf(0x47d), j['24'] = '&#1046;', j['25'] = _0x46b0bf(0x1d5), j['26'] = _0x46b0bf(0x56d), j['27'] = _0x46b0bf(0x4dd), j['28'] = '&beta;', j['29'] = _0x46b0bf(0x1af), j['30'] = _0x46b0bf(0x5bf), j['31'] = _0x46b0bf(0x5ce), j['32'] = _0x46b0bf(0x251), j['33'] = _0x46b0bf(0x461), j['34'] = _0x46b0bf(0x567), j['35'] = _0x46b0bf(0x3b5), j['36'] = '&#308;', j['37'] = '&#310;', j['38'] = _0x46b0bf(0x2a1), j['39'] = _0x46b0bf(0x3c8), j['40'] = '&#323;', j['41'] = _0x46b0bf(0x3fb), j['42'] = _0x46b0bf(0x17b), j['43'] = 'Q', j['44'] = _0x46b0bf(0x2fd), j['45'] = _0x46b0bf(0x3ca), j['46'] = _0x46b0bf(0x4ca), j['47'] = '&Uacute;', j['48'] = 'V', j['49'] = _0x46b0bf(0x47d), j['50'] = '&#1046;', j['51'] = _0x46b0bf(0x1d5), j['52'] = '&#377;', j['53'] = '1', j['54'] = '2', j['55'] = '3', j['56'] = '4', j['57'] = '5', j['58'] = '6', j['59'] = '7', j['60'] = '8', j['61'] = '9', j['62'] = '0';
var k = {};
k['1'] = _0x46b0bf(0x35e), k['2'] = 'q', k['3'] = '&#596;', k['4'] = 'p', k['5'] = _0x46b0bf(0x371), k['6'] = '&#607;', k['7'] = _0x46b0bf(0x606), k['8'] = _0x46b0bf(0x4b1), k['9'] = _0x46b0bf(0x538), k['10'] = _0x46b0bf(0x2e8), k['11'] = '&#670;', k['12'] = 'l', k['13'] = '&#623;', k['14'] = 'u', k['15'] = 'o', k['16'] = 'd', k['17'] = 'b', k['18'] = '&#633;', k['19'] = 's', k['20'] = '&#647;', k['21'] = 'n', k['22'] = '&#652;', k['23'] = '&#653;', k['24'] = 'x', k['25'] = _0x46b0bf(0x1d2), k['26'] = 'z', k['27'] = _0x46b0bf(0x35e), k['28'] = 'q', k['29'] = _0x46b0bf(0x263), k['30'] = 'p', k['31'] = '&#477;', k['32'] = _0x46b0bf(0x22d), k['33'] = _0x46b0bf(0x606), k['34'] = _0x46b0bf(0x4b1), k['35'] = _0x46b0bf(0x538), k['36'] = _0x46b0bf(0x2e8), k['37'] = _0x46b0bf(0x5c1), k['38'] = 'l', k['39'] = _0x46b0bf(0x603), k['40'] = 'u', k['41'] = 'o', k['42'] = 'd', k['43'] = 'b', k['44'] = _0x46b0bf(0x59c), k['45'] = 's', k['46'] = _0x46b0bf(0x486), k['47'] = 'n', k['48'] = '&#652;', k['49'] = _0x46b0bf(0x3e4), k['50'] = 'x', k['51'] = _0x46b0bf(0x1d2), k['52'] = 'z', k['53'] = _0x46b0bf(0x5b9), k['54'] = _0x46b0bf(0x22f), k['55'] = _0x46b0bf(0x20a), k['56'] = '&#12579;', k['57'] = _0x46b0bf(0x474), k['58'] = '9', k['59'] = '&#12581;', k['60'] = '8', k['61'] = '6', k['62'] = '0';
var l = {};
l['1'] = _0x46b0bf(0x518), l['2'] = '&beta;', l['3'] = _0x46b0bf(0x5c4), l['4'] = '&#272;', l['5'] = _0x46b0bf(0x52f), l['6'] = _0x46b0bf(0x37d), l['7'] = _0x46b0bf(0x4ba), l['8'] = _0x46b0bf(0x553), l['9'] = _0x46b0bf(0x21f), l['10'] = _0x46b0bf(0x283), l['11'] = _0x46b0bf(0x4a4), l['12'] = _0x46b0bf(0x55f), l['13'] = '&Mu;', l['14'] = _0x46b0bf(0x338), l['15'] = _0x46b0bf(0x4d8), l['16'] = _0x46b0bf(0x31d), l['17'] = _0x46b0bf(0x470), l['18'] = _0x46b0bf(0x548), l['19'] = _0x46b0bf(0x5eb), l['20'] = _0x46b0bf(0x251), l['21'] = '&#7918;', l['22'] = 'V', l['23'] = '&#372;', l['24'] = _0x46b0bf(0x269), l['25'] = _0x46b0bf(0x4c4), l['26'] = '&#381;', l['27'] = _0x46b0bf(0x518), l['28'] = _0x46b0bf(0x426), l['29'] = _0x46b0bf(0x5c4), l['30'] = _0x46b0bf(0x282), l['31'] = _0x46b0bf(0x52f), l['32'] = '&#8355;', l['33'] = _0x46b0bf(0x4ba), l['34'] = _0x46b0bf(0x553), l['35'] = _0x46b0bf(0x21f), l['36'] = _0x46b0bf(0x283), l['37'] = _0x46b0bf(0x4a4), l['38'] = _0x46b0bf(0x55f), l['39'] = '&Mu;', l['40'] = _0x46b0bf(0x338), l['41'] = _0x46b0bf(0x4d8), l['42'] = _0x46b0bf(0x31d), l['43'] = '&Omega;', l['44'] = _0x46b0bf(0x548), l['45'] = _0x46b0bf(0x5eb), l['46'] = _0x46b0bf(0x251), l['47'] = _0x46b0bf(0x166), l['48'] = 'V', l['49'] = _0x46b0bf(0x47d), l['50'] = _0x46b0bf(0x269), l['51'] = _0x46b0bf(0x4c4), l['52'] = _0x46b0bf(0x44a), l['53'] = '1', l['54'] = '2', l['55'] = '3', l['56'] = '4', l['57'] = '5', l['58'] = '6', l['59'] = '7', l['60'] = '8', l['61'] = '9', l['62'] = '0';
var m = {};
m['1'] = _0x46b0bf(0x2c0), m['2'] = '&#595;', m['3'] = _0x46b0bf(0x613), m['4'] = _0x46b0bf(0x3a1), m['5'] = _0x46b0bf(0x3fd), m['6'] = _0x46b0bf(0x430), m['7'] = '&#608;', m['8'] = _0x46b0bf(0x392), m['9'] = '&#3648;', m['10'] = _0x46b0bf(0x3bb), m['11'] = _0x46b0bf(0x31f), m['12'] = _0x46b0bf(0x5e3), m['13'] = _0x46b0bf(0x234), m['14'] = _0x46b0bf(0x623), m['15'] = _0x46b0bf(0x50b), m['16'] = _0x46b0bf(0x4d6), m['17'] = _0x46b0bf(0x1fb), m['18'] = _0x46b0bf(0x42c), m['19'] = _0x46b0bf(0x54a), m['20'] = _0x46b0bf(0x309), m['21'] = _0x46b0bf(0x3db), m['22'] = _0x46b0bf(0x322), m['23'] = _0x46b0bf(0x2a9), m['24'] = '&#1488;', m['25'] = _0x46b0bf(0x2c8), m['26'] = '&#438;', m['27'] = _0x46b0bf(0x2c0), m['28'] = _0x46b0bf(0x484), m['29'] = '&#2798;', m['30'] = _0x46b0bf(0x3a1), m['31'] = _0x46b0bf(0x3fd), m['32'] = _0x46b0bf(0x430), m['33'] = '&#608;', m['34'] = _0x46b0bf(0x392), m['35'] = '&#3648;', m['36'] = '&#669;', m['37'] = '&#1185;', m['38'] = '&#8467;', m['39'] = _0x46b0bf(0x234), m['40'] = '&#627;', m['41'] = '&sigma;', m['42'] = _0x46b0bf(0x4d6), m['43'] = '&phi;', m['44'] = '&#2792;', m['45'] = _0x46b0bf(0x54a), m['46'] = _0x46b0bf(0x309), m['47'] = '&micro;', m['48'] = _0x46b0bf(0x322), m['49'] = _0x46b0bf(0x2a9), m['50'] = '&#1488;', m['51'] = '&#4327;', m['52'] = _0x46b0bf(0x45c), m['53'] = '1', m['54'] = '2', m['55'] = '3', m['56'] = '4', m['57'] = '5', m['58'] = '6', m['59'] = '7', m['60'] = '8', m['61'] = '9', m['62'] = '0';
var n = {};
n['1'] = _0x46b0bf(0x3bd), n['2'] = _0x46b0bf(0x575), n['3'] = _0x46b0bf(0x5fa), n['4'] = _0x46b0bf(0x2b1), n['5'] = '&#5620;', n['6'] = _0x46b0bf(0x5dd), n['7'] = _0x46b0bf(0x4ba), n['8'] = _0x46b0bf(0x376), n['9'] = _0x46b0bf(0x51d), n['10'] = '&#5262;', n['11'] = _0x46b0bf(0x3f4), n['12'] = _0x46b0bf(0x3f3), n['13'] = _0x46b0bf(0x1c2), n['14'] = _0x46b0bf(0x40f), n['15'] = _0x46b0bf(0x1b4), n['16'] = _0x46b0bf(0x3ad), n['17'] = '&#586;', n['18'] = '&#5511;', n['19'] = _0x46b0bf(0x2fc), n['20'] = '&#19973;', n['21'] = '&#5196;', n['22'] = _0x46b0bf(0x1ef), n['23'] = _0x46b0bf(0x16a), n['24'] = _0x46b0bf(0x596), n['25'] = _0x46b0bf(0x3ba), n['26'] = _0x46b0bf(0x1bc), n['27'] = _0x46b0bf(0x3bd), n['28'] = _0x46b0bf(0x575), n['29'] = _0x46b0bf(0x5fa), n['30'] = _0x46b0bf(0x2b1), n['31'] = _0x46b0bf(0x386), n['32'] = _0x46b0bf(0x5dd), n['33'] = _0x46b0bf(0x4ba), n['34'] = _0x46b0bf(0x376), n['35'] = _0x46b0bf(0x51d), n['36'] = _0x46b0bf(0x1e8), n['37'] = _0x46b0bf(0x3f4), n['38'] = _0x46b0bf(0x3f3), n['39'] = _0x46b0bf(0x1c2), n['40'] = _0x46b0bf(0x40f), n['41'] = _0x46b0bf(0x1b4), n['42'] = _0x46b0bf(0x3ad), n['43'] = _0x46b0bf(0x4bb), n['44'] = _0x46b0bf(0x2bd), n['45'] = _0x46b0bf(0x2fc), n['46'] = _0x46b0bf(0x500), n['47'] = _0x46b0bf(0x318), n['48'] = _0x46b0bf(0x1ef), n['49'] = _0x46b0bf(0x16a), n['50'] = _0x46b0bf(0x596), n['51'] = _0x46b0bf(0x3ba), n['52'] = _0x46b0bf(0x1bc), n['53'] = '1', n['54'] = '2', n['55'] = '3', n['56'] = '4', n['57'] = '5', n['58'] = '6', n['59'] = '7', n['60'] = '8', n['61'] = '9', n['62'] = '0';
var o = {};
o['1'] = _0x46b0bf(0x438), o['2'] = '&#4329;', o['3'] = '&#4308;', o['4'] = _0x46b0bf(0x28a), o['5'] = _0x46b0bf(0x5e4), o['6'] = 'f', o['7'] = _0x46b0bf(0x5d0), o['8'] = 'h', o['9'] = _0x46b0bf(0x3d4), o['10'] = '&#4325;', o['11'] = _0x46b0bf(0x60d), o['12'] = 'l', o['13'] = _0x46b0bf(0x34a), o['14'] = '&#8134;', o['15'] = _0x46b0bf(0x324), o['16'] = _0x46b0bf(0x4d6), o['17'] = '&#4306;', o['18'] = _0x46b0bf(0x4a9), o['19'] = _0x46b0bf(0x1b6), o['20'] = _0x46b0bf(0x5fe), o['21'] = _0x46b0bf(0x39f), o['22'] = _0x46b0bf(0x305), o['23'] = 'w', o['24'] = _0x46b0bf(0x281), o['25'] = _0x46b0bf(0x2c8), o['26'] = _0x46b0bf(0x3f9), o['27'] = '&#4315;', o['28'] = _0x46b0bf(0x406), o['29'] = _0x46b0bf(0x42d), o['30'] = _0x46b0bf(0x28a), o['31'] = _0x46b0bf(0x5e4), o['32'] = 'f', o['33'] = '&#4330;', o['34'] = 'h', o['35'] = _0x46b0bf(0x3d4), o['36'] = _0x46b0bf(0x434), o['37'] = _0x46b0bf(0x60d), o['38'] = 'l', o['39'] = '&#4317;', o['40'] = _0x46b0bf(0x38c), o['41'] = _0x46b0bf(0x324), o['42'] = '&rho;', o['43'] = _0x46b0bf(0x2e6), o['44'] = _0x46b0bf(0x4a9), o['45'] = _0x46b0bf(0x1b6), o['46'] = _0x46b0bf(0x5fe), o['47'] = _0x46b0bf(0x39f), o['48'] = '&#8023;', o['49'] = 'w', o['50'] = _0x46b0bf(0x281), o['51'] = _0x46b0bf(0x2c8), o['52'] = _0x46b0bf(0x3f9), o['53'] = '1', o['54'] = '2', o['55'] = '3', o['56'] = '4', o['57'] = '5', o['58'] = '6', o['59'] = '7', o['60'] = '8', o['61'] = '9', o['62'] = '0';
var p = {};
p['1'] = _0x46b0bf(0x1d3), p['2'] = _0x46b0bf(0x48e), p['3'] = _0x46b0bf(0x54b), p['4'] = '&#545;', p['5'] = _0x46b0bf(0x589), p['6'] = '&#1171;', p['7'] = _0x46b0bf(0x4a7), p['8'] = _0x46b0bf(0x1db), p['9'] = _0x46b0bf(0x50e), p['10'] = '&#1112;', p['11'] = _0x46b0bf(0x15f), p['12'] = _0x46b0bf(0x573), p['13'] = '&#1084;', p['14'] = '&#942;', p['15'] = _0x46b0bf(0x526), p['16'] = _0x46b0bf(0x4d6), p['17'] = 'q', p['18'] = _0x46b0bf(0x425), p['19'] = _0x46b0bf(0x4c3), p['20'] = _0x46b0bf(0x336), p['21'] = _0x46b0bf(0x347), p['22'] = _0x46b0bf(0x51a), p['23'] = '&#974;', p['24'] = 'x', p['25'] = _0x46b0bf(0x314), p['26'] = _0x46b0bf(0x2ae), p['27'] = '&#940;', p['28'] = _0x46b0bf(0x48e), p['29'] = _0x46b0bf(0x54b), p['30'] = _0x46b0bf(0x383), p['31'] = '&#941;', p['32'] = '&#1171;', p['33'] = _0x46b0bf(0x4a7), p['34'] = _0x46b0bf(0x1db), p['35'] = '&#943;', p['36'] = '&#1112;', p['37'] = _0x46b0bf(0x15f), p['38'] = _0x46b0bf(0x573), p['39'] = _0x46b0bf(0x3d6), p['40'] = _0x46b0bf(0x574), p['41'] = _0x46b0bf(0x526), p['42'] = '&rho;', p['43'] = 'q', p['44'] = _0x46b0bf(0x425), p['45'] = _0x46b0bf(0x4c3), p['46'] = _0x46b0bf(0x336), p['47'] = '&ugrave;', p['48'] = _0x46b0bf(0x51a), p['49'] = '&#974;', p['50'] = 'x', p['51'] = _0x46b0bf(0x314), p['52'] = _0x46b0bf(0x2ae), p['53'] = '1', p['54'] = '2', p['55'] = '3', p['56'] = '4', p['57'] = '5', p['58'] = '6', p['59'] = '7', p['60'] = '8', p['61'] = '9', p['62'] = '0';
var q = {};
q['1'] = _0x46b0bf(0x478), q['2'] = '&#41155;', q['3'] = '&#41976;', q['4'] = _0x46b0bf(0x273), q['5'] = _0x46b0bf(0x55e), q['6'] = _0x46b0bf(0x46b), q['7'] = '&#41037;', q['8'] = _0x46b0bf(0x61c), q['9'] = _0x46b0bf(0x4c8), q['10'] = '&#41005;', q['11'] = _0x46b0bf(0x225), q['12'] = '&#42130;', q['13'] = '&#41042;', q['14'] = _0x46b0bf(0x206), q['15'] = '&#41346;', q['16'] = _0x46b0bf(0x561), q['17'] = _0x46b0bf(0x530), q['18'] = _0x46b0bf(0x31b), q['19'] = _0x46b0bf(0x540), q['20'] = _0x46b0bf(0x5fd), q['21'] = _0x46b0bf(0x194), q['22'] = _0x46b0bf(0x454), q['23'] = _0x46b0bf(0x160), q['24'] = _0x46b0bf(0x25a), q['25'] = _0x46b0bf(0x256), q['26'] = _0x46b0bf(0x4af), q['27'] = '&#41707;', q['28'] = _0x46b0bf(0x532), q['29'] = _0x46b0bf(0x1d0), q['30'] = _0x46b0bf(0x273), q['31'] = '&#41823;', q['32'] = _0x46b0bf(0x46b), q['33'] = '&#41037;', q['34'] = _0x46b0bf(0x61c), q['35'] = _0x46b0bf(0x4c8), q['36'] = '&#41005;', q['37'] = _0x46b0bf(0x225), q['38'] = _0x46b0bf(0x5a0), q['39'] = _0x46b0bf(0x3bc), q['40'] = _0x46b0bf(0x206), q['41'] = _0x46b0bf(0x390), q['42'] = _0x46b0bf(0x561), q['43'] = _0x46b0bf(0x530), q['44'] = _0x46b0bf(0x31b), q['45'] = _0x46b0bf(0x540), q['46'] = _0x46b0bf(0x5fd), q['47'] = _0x46b0bf(0x194), q['48'] = _0x46b0bf(0x454), q['49'] = '&#41296;', q['50'] = '&#41427;', q['51'] = '&#42015;', q['52'] = _0x46b0bf(0x4af), q['53'] = '1', q['54'] = '2', q['55'] = '3', q['56'] = '4', q['57'] = '5', q['58'] = '6', q['59'] = '7', q['60'] = '8', q['61'] = '9', q['62'] = '0';
var r = {};
r['1'] = _0x46b0bf(0x1d7), r['2'] = '&#1041;', r['3'] = 'C', r['4'] = 'D', r['5'] = _0x46b0bf(0x178), r['6'] = 'F', r['7'] = 'G', r['8'] = 'H', r['9'] = 'I', r['10'] = 'J', r['11'] = _0x46b0bf(0x4a4), r['12'] = 'L', r['13'] = 'M', r['14'] = '&#1048;', r['15'] = '&#1060;', r['16'] = 'P', r['17'] = _0x46b0bf(0x4d2), r['18'] = '&#1071;', r['19'] = 'S', r['20'] = _0x46b0bf(0x4a9), r['21'] = _0x46b0bf(0x246), r['22'] = 'V', r['23'] = _0x46b0bf(0x36b), r['24'] = _0x46b0bf(0x269), r['25'] = '&#1059;', r['26'] = 'Z', r['27'] = _0x46b0bf(0x1d7), r['28'] = _0x46b0bf(0x15a), r['29'] = 'C', r['30'] = 'D', r['31'] = '&Xi;', r['32'] = 'F', r['33'] = 'G', r['34'] = 'H', r['35'] = 'I', r['36'] = 'J', r['37'] = _0x46b0bf(0x4a4), r['38'] = 'L', r['39'] = 'M', r['40'] = _0x46b0bf(0x5bc), r['41'] = _0x46b0bf(0x23b), r['42'] = 'P', r['43'] = _0x46b0bf(0x4d2), r['44'] = _0x46b0bf(0x5b5), r['45'] = 'S', r['46'] = _0x46b0bf(0x4a9), r['47'] = _0x46b0bf(0x246), r['48'] = 'V', r['49'] = '&#1065;', r['50'] = _0x46b0bf(0x269), r['51'] = _0x46b0bf(0x4e8), r['52'] = 'Z', r['53'] = '1', r['54'] = '2', r['55'] = '3', r['56'] = '4', r['57'] = '5', r['58'] = '6', r['59'] = '7', r['60'] = '8', r['61'] = '9', r['62'] = '0';
var s = {};
s['1'] = '&#41807;', s['2'] = _0x46b0bf(0x608), s['3'] = _0x46b0bf(0x26e), s['4'] = _0x46b0bf(0x2fa), s['5'] = _0x46b0bf(0x55e), s['6'] = '&#41863;', s['7'] = '&#41029;', s['8'] = _0x46b0bf(0x2cd), s['9'] = _0x46b0bf(0x2b2), s['10'] = _0x46b0bf(0x239), s['11'] = _0x46b0bf(0x496), s['12'] = _0x46b0bf(0x5a0), s['13'] = '&#41141;', s['14'] = _0x46b0bf(0x3bf), s['15'] = _0x46b0bf(0x34c), s['16'] = _0x46b0bf(0x561), s['17'] = _0x46b0bf(0x223), s['18'] = '&#41706;', s['19'] = _0x46b0bf(0x2e5), s['20'] = _0x46b0bf(0x5cc), s['21'] = _0x46b0bf(0x523), s['22'] = '&#41204;', s['23'] = '&#41295;', s['24'] = '&#41660;', s['25'] = _0x46b0bf(0x17c), s['26'] = _0x46b0bf(0x4af), s['27'] = _0x46b0bf(0x266), s['28'] = '&#41731;', s['29'] = _0x46b0bf(0x26e), s['30'] = _0x46b0bf(0x2fa), s['31'] = _0x46b0bf(0x55e), s['32'] = '&#41863;', s['33'] = _0x46b0bf(0x450), s['34'] = _0x46b0bf(0x2cd), s['35'] = _0x46b0bf(0x2b2), s['36'] = _0x46b0bf(0x239), s['37'] = '&#40984;', s['38'] = '&#42130;', s['39'] = _0x46b0bf(0x422), s['40'] = _0x46b0bf(0x3bf), s['41'] = _0x46b0bf(0x34c), s['42'] = _0x46b0bf(0x561), s['43'] = _0x46b0bf(0x223), s['44'] = '&#41706;', s['45'] = _0x46b0bf(0x2e5), s['46'] = _0x46b0bf(0x5cc), s['47'] = _0x46b0bf(0x523), s['48'] = _0x46b0bf(0x19b), s['49'] = _0x46b0bf(0x29c), s['50'] = _0x46b0bf(0x25f), s['51'] = _0x46b0bf(0x17c), s['52'] = _0x46b0bf(0x4af), s['53'] = '1', s['54'] = '2', s['55'] = '3', s['56'] = '4', s['57'] = '5', s['58'] = '6', s['59'] = '7', s['60'] = '8', s['61'] = '9', s['62'] = '0';
var t = {};
t['1'] = _0x46b0bf(0x30b), t['2'] = _0x46b0bf(0x49a), t['3'] = _0x46b0bf(0x431), t['4'] = '&#42159;', t['5'] = _0x46b0bf(0x207), t['6'] = '&#41648;', t['7'] = _0x46b0bf(0x1c4), t['8'] = _0x46b0bf(0x60c), t['9'] = '&#42128;', t['10'] = _0x46b0bf(0x475), t['11'] = _0x46b0bf(0x496), t['12'] = '&#42130;', t['13'] = _0x46b0bf(0x422), t['14'] = '&#41674;', t['15'] = _0x46b0bf(0x168), t['16'] = _0x46b0bf(0x561), t['17'] = _0x46b0bf(0x223), t['18'] = '&#41706;', t['19'] = _0x46b0bf(0x494), t['20'] = _0x46b0bf(0x5cc), t['21'] = _0x46b0bf(0x163), t['22'] = _0x46b0bf(0x1d4), t['23'] = _0x46b0bf(0x160), t['24'] = '&#41575;', t['25'] = _0x46b0bf(0x3a5), t['26'] = _0x46b0bf(0x4af), t['27'] = '&#41708;', t['28'] = _0x46b0bf(0x49a), t['29'] = _0x46b0bf(0x431), t['30'] = '&#42159;', t['31'] = '&#41922;', t['32'] = _0x46b0bf(0x4ed), t['33'] = _0x46b0bf(0x1c4), t['34'] = '&#41053;', t['35'] = '&#42128;', t['36'] = _0x46b0bf(0x475), t['37'] = _0x46b0bf(0x496), t['38'] = _0x46b0bf(0x5a0), t['39'] = _0x46b0bf(0x422), t['40'] = _0x46b0bf(0x60e), t['41'] = _0x46b0bf(0x168), t['42'] = '&#41571;', t['43'] = _0x46b0bf(0x223), t['44'] = '&#41706;', t['45'] = _0x46b0bf(0x494), t['46'] = _0x46b0bf(0x5cc), t['47'] = _0x46b0bf(0x163), t['48'] = _0x46b0bf(0x1d4), t['49'] = '&#41296;', t['50'] = _0x46b0bf(0x1e7), t['51'] = _0x46b0bf(0x3a5), t['52'] = '&#41076;', t['53'] = '1', t['54'] = '2', t['55'] = '3', t['56'] = '4', t['57'] = '5', t['58'] = '6', t['59'] = '7', t['60'] = '8', t['61'] = '9', t['62'] = '0';
var u = {};
u['1'] = _0x46b0bf(0x280), u['2'] = _0x46b0bf(0x3a3), u['3'] = _0x46b0bf(0x374), u['4'] = '&ETH;', u['5'] = _0x46b0bf(0x20a), u['6'] = 'F', u['7'] = _0x46b0bf(0x3ed), u['8'] = _0x46b0bf(0x1e5), u['9'] = _0x46b0bf(0x373), u['10'] = _0x46b0bf(0x200), u['11'] = _0x46b0bf(0x395), u['12'] = '&#321;', u['13'] = '&#3057;', u['14'] = _0x46b0bf(0x524), u['15'] = _0x46b0bf(0x4d8), u['16'] = _0x46b0bf(0x42f), u['17'] = '&#1192;', u['18'] = _0x46b0bf(0x4c2), u['19'] = _0x46b0bf(0x33c), u['20'] = _0x46b0bf(0x4ca), u['21'] = '&#1062;', u['22'] = _0x46b0bf(0x16b), u['23'] = _0x46b0bf(0x536), u['24'] = '&chi;', u['25'] = '&#996;', u['26'] = _0x46b0bf(0x367), u['27'] = _0x46b0bf(0x280), u['28'] = _0x46b0bf(0x3a3), u['29'] = _0x46b0bf(0x374), u['30'] = '&ETH;', u['31'] = _0x46b0bf(0x20a), u['32'] = 'F', u['33'] = _0x46b0bf(0x3ed), u['34'] = _0x46b0bf(0x1e5), u['35'] = _0x46b0bf(0x373), u['36'] = '&#65420;', u['37'] = _0x46b0bf(0x395), u['38'] = _0x46b0bf(0x55f), u['39'] = _0x46b0bf(0x2a4), u['40'] = _0x46b0bf(0x524), u['41'] = _0x46b0bf(0x4d8), u['42'] = _0x46b0bf(0x42f), u['43'] = _0x46b0bf(0x5f7), u['44'] = '&#23610;', u['45'] = _0x46b0bf(0x33c), u['46'] = _0x46b0bf(0x4ca), u['47'] = _0x46b0bf(0x246), u['48'] = _0x46b0bf(0x16b), u['49'] = '&#412;', u['50'] = _0x46b0bf(0x499), u['51'] = '&#996;', u['52'] = '&#7828;', u['53'] = '1', u['54'] = '2', u['55'] = '3', u['56'] = '4', u['57'] = '5', u['58'] = '6', u['59'] = '7', u['60'] = '8', u['61'] = '9', u['62'] = '0';
var v = {};
v['1'] = '&#411;', v['2'] = '&#385;', v['3'] = _0x46b0bf(0x5da), v['4'] = _0x46b0bf(0x3c6), v['5'] = _0x46b0bf(0x5b6), v['6'] = _0x46b0bf(0x14e), v['7'] = _0x46b0bf(0x3ed), v['8'] = '&#1223;', v['9'] = _0x46b0bf(0x5b9), v['10'] = _0x46b0bf(0x3e9), v['11'] = '&#408;', v['12'] = _0x46b0bf(0x588), v['13'] = 'M', v['14'] = '&#413;', v['15'] = _0x46b0bf(0x156), v['16'] = _0x46b0bf(0x31d), v['17'] = _0x46b0bf(0x51f), v['18'] = _0x46b0bf(0x43a), v['19'] = '&#423;', v['20'] = '&#428;', v['21'] = '&#434;', v['22'] = _0x46b0bf(0x16b), v['23'] = _0x46b0bf(0x536), v['24'] = _0x46b0bf(0x224), v['25'] = _0x46b0bf(0x3ba), v['26'] = _0x46b0bf(0x185), v['27'] = _0x46b0bf(0x5c9), v['28'] = '&#385;', v['29'] = '&#391;', v['30'] = '&#394;', v['31'] = _0x46b0bf(0x5b6), v['32'] = _0x46b0bf(0x14e), v['33'] = _0x46b0bf(0x3ed), v['34'] = '&#1223;', v['35'] = _0x46b0bf(0x5b9), v['36'] = _0x46b0bf(0x3e9), v['37'] = _0x46b0bf(0x5f8), v['38'] = _0x46b0bf(0x588), v['39'] = 'M', v['40'] = _0x46b0bf(0x32c), v['41'] = _0x46b0bf(0x156), v['42'] = _0x46b0bf(0x31d), v['43'] = _0x46b0bf(0x51f), v['44'] = _0x46b0bf(0x43a), v['45'] = _0x46b0bf(0x28f), v['46'] = _0x46b0bf(0x310), v['47'] = '&#434;', v['48'] = _0x46b0bf(0x16b), v['49'] = '&#412;', v['50'] = _0x46b0bf(0x224), v['51'] = '&#435;', v['52'] = _0x46b0bf(0x185), v['53'] = '1', v['54'] = '2', v['55'] = '3', v['56'] = '4', v['57'] = '5', v['58'] = '6', v['59'] = '7', v['60'] = '8', v['61'] = '9', v['62'] = '0';
var w = {};
w['1'] = _0x46b0bf(0x464), w['2'] = _0x46b0bf(0x4ae), w['3'] = _0x46b0bf(0x333), w['4'] = _0x46b0bf(0x541), w['5'] = _0x46b0bf(0x28c), w['6'] = '&#41246;', w['7'] = '&#41029;', w['8'] = _0x46b0bf(0x4ac), w['9'] = _0x46b0bf(0x4c8), w['10'] = '&#42171;', w['11'] = _0x46b0bf(0x225), w['12'] = '&#42130;', w['13'] = _0x46b0bf(0x422), w['14'] = '&#41674;', w['15'] = '&#41126;', w['16'] = _0x46b0bf(0x561), w['17'] = _0x46b0bf(0x30a), w['18'] = _0x46b0bf(0x5b7), w['19'] = _0x46b0bf(0x540), w['20'] = _0x46b0bf(0x5f9), w['21'] = '&#41991;', w['22'] = _0x46b0bf(0x491), w['23'] = _0x46b0bf(0x29c), w['24'] = _0x46b0bf(0x271), w['25'] = _0x46b0bf(0x3e2), w['26'] = '&#41076;', w['27'] = _0x46b0bf(0x464), w['28'] = _0x46b0bf(0x4ae), w['29'] = _0x46b0bf(0x333), w['30'] = _0x46b0bf(0x541), w['31'] = '&#41532;', w['32'] = '&#41246;', w['33'] = _0x46b0bf(0x450), w['34'] = _0x46b0bf(0x4ac), w['35'] = _0x46b0bf(0x4c8), w['36'] = _0x46b0bf(0x475), w['37'] = '&#40983;', w['38'] = _0x46b0bf(0x5a0), w['39'] = _0x46b0bf(0x422), w['40'] = '&#41674;', w['41'] = _0x46b0bf(0x34c), w['42'] = _0x46b0bf(0x561), w['43'] = '&#41079;', w['44'] = '&#41733;', w['45'] = _0x46b0bf(0x540), w['46'] = _0x46b0bf(0x5f9), w['47'] = '&#41991;', w['48'] = _0x46b0bf(0x491), w['49'] = _0x46b0bf(0x29c), w['50'] = _0x46b0bf(0x271), w['51'] = _0x46b0bf(0x3e2), w['52'] = _0x46b0bf(0x4af), w['53'] = '1', w['54'] = '2', w['55'] = '3', w['56'] = '4', w['57'] = '5', w['58'] = '6', w['59'] = '7', w['60'] = '8', w['61'] = '9', w['62'] = '0';
var x = {};
x['1'] = _0x46b0bf(0x2db), x['2'] = _0x46b0bf(0x512), x['3'] = _0x46b0bf(0x37c), x['4'] = _0x46b0bf(0x4b2), x['5'] = _0x46b0bf(0x55c), x['6'] = _0x46b0bf(0x334), x['7'] = '&#1331;', x['8'] = _0x46b0bf(0x2bc), x['9'] = _0x46b0bf(0x32f), x['10'] = _0x46b0bf(0x3bb), x['11'] = '&#409;', x['12'] = _0x46b0bf(0x3a0), x['13'] = '&#653;', x['14'] = _0x46b0bf(0x354), x['15'] = _0x46b0bf(0x56b), x['16'] = '&rho;', x['17'] = _0x46b0bf(0x1fb), x['18'] = _0x46b0bf(0x45e), x['19'] = _0x46b0bf(0x197), x['20'] = _0x46b0bf(0x581), x['21'] = _0x46b0bf(0x332), x['22'] = _0x46b0bf(0x579), x['23'] = '&#1377;', x['24'] = _0x46b0bf(0x230), x['25'] = _0x46b0bf(0x1bf), x['26'] = _0x46b0bf(0x25b), x['27'] = _0x46b0bf(0x2db), x['28'] = _0x46b0bf(0x512), x['29'] = _0x46b0bf(0x37c), x['30'] = '&#1338;', x['31'] = _0x46b0bf(0x55c), x['32'] = _0x46b0bf(0x334), x['33'] = _0x46b0bf(0x5d4), x['34'] = '&#615;', x['35'] = _0x46b0bf(0x32f), x['36'] = '&#669;', x['37'] = _0x46b0bf(0x48b), x['38'] = _0x46b0bf(0x3a0), x['39'] = '&#653;', x['40'] = '&#1356;', x['41'] = _0x46b0bf(0x56b), x['42'] = _0x46b0bf(0x4d6), x['43'] = _0x46b0bf(0x1fb), x['44'] = _0x46b0bf(0x45e), x['45'] = _0x46b0bf(0x197), x['46'] = _0x46b0bf(0x581), x['47'] = _0x46b0bf(0x332), x['48'] = '&#1506;', x['49'] = _0x46b0bf(0x4c7), x['50'] = _0x46b0bf(0x230), x['51'] = _0x46b0bf(0x1bf), x['52'] = _0x46b0bf(0x25b), x['53'] = '1', x['54'] = '2', x['55'] = '3', x['56'] = '4', x['57'] = '5', x['58'] = '6', x['59'] = '7', x['60'] = '8', x['61'] = '9', x['62'] = '0';
var y = {};
y['1'] = _0x46b0bf(0x2c0), y['2'] = _0x46b0bf(0x2f6), y['3'] = _0x46b0bf(0x54b), y['4'] = 'd', y['5'] = _0x46b0bf(0x3fd), y['6'] = _0x46b0bf(0x430), y['7'] = 'g', y['8'] = 'h', y['9'] = '&iuml;', y['10'] = '&#1397;', y['11'] = '&kappa;', y['12'] = _0x46b0bf(0x534), y['13'] = 'm', y['14'] = _0x46b0bf(0x1df), y['15'] = '&oplus;', y['16'] = 'p', y['17'] = _0x46b0bf(0x470), y['18'] = 'r', y['19'] = _0x46b0bf(0x319), y['20'] = '&dagger;', y['21'] = 'u', y['22'] = _0x46b0bf(0x327), y['23'] = _0x46b0bf(0x2a9), y['24'] = 'x', y['25'] = _0x46b0bf(0x46f), y['26'] = 'z', y['27'] = '&alpha;', y['28'] = '&szlig;', y['29'] = '&sigmaf;', y['30'] = 'd', y['31'] = _0x46b0bf(0x3fd), y['32'] = _0x46b0bf(0x430), y['33'] = 'g', y['34'] = 'h', y['35'] = '&iuml;', y['36'] = _0x46b0bf(0x448), y['37'] = _0x46b0bf(0x60d), y['38'] = _0x46b0bf(0x534), y['39'] = 'm', y['40'] = '&eta;', y['41'] = _0x46b0bf(0x189), y['42'] = 'p', y['43'] = '&Omega;', y['44'] = 'r', y['45'] = _0x46b0bf(0x319), y['46'] = _0x46b0bf(0x472), y['47'] = 'u', y['48'] = '&forall;', y['49'] = _0x46b0bf(0x2a9), y['50'] = 'x', y['51'] = _0x46b0bf(0x46f), y['52'] = 'z', y['53'] = '1', y['54'] = '2', y['55'] = '3', y['56'] = '4', y['57'] = '5', y['58'] = '6', y['59'] = '7', y['60'] = '8', y['61'] = '9', y['62'] = '0';
var z = {};
z['1'] = _0x46b0bf(0x5c6), z['2'] = _0x46b0bf(0x5d0), z['3'] = _0x46b0bf(0x226), z['4'] = _0x46b0bf(0x28a), z['5'] = '&#2799;', z['6'] = '&#1330;', z['7'] = '&#2797;', z['8'] = _0x46b0bf(0x566), z['9'] = '&#639;', z['10'] = _0x46b0bf(0x3e9), z['11'] = _0x46b0bf(0x2ac), z['12'] = '&#1350;', z['13'] = '&#625;', z['14'] = '&#1352;', z['15'] = '&#2790;', z['16'] = _0x46b0bf(0x3d0), z['17'] = '&#1193;', z['18'] = _0x46b0bf(0x45e), z['19'] = _0x46b0bf(0x54b), z['20'] = _0x46b0bf(0x304), z['21'] = '&upsilon;', z['22'] = '&#3182;', z['23'] = '&omega;', z['24'] = _0x46b0bf(0x4df), z['25'] = _0x46b0bf(0x579), z['26'] = '&#2749;', z['27'] = _0x46b0bf(0x5c6), z['28'] = _0x46b0bf(0x5d0), z['29'] = _0x46b0bf(0x226), z['30'] = _0x46b0bf(0x28a), z['31'] = _0x46b0bf(0x411), z['32'] = _0x46b0bf(0x334), z['33'] = _0x46b0bf(0x463), z['34'] = _0x46b0bf(0x566), z['35'] = _0x46b0bf(0x32f), z['36'] = _0x46b0bf(0x3e9), z['37'] = _0x46b0bf(0x2ac), z['38'] = _0x46b0bf(0x5f3), z['39'] = _0x46b0bf(0x234), z['40'] = _0x46b0bf(0x43d), z['41'] = _0x46b0bf(0x292), z['42'] = _0x46b0bf(0x3d0), z['43'] = '&#1193;', z['44'] = _0x46b0bf(0x45e), z['45'] = '&sigmaf;', z['46'] = _0x46b0bf(0x304), z['47'] = _0x46b0bf(0x39f), z['48'] = _0x46b0bf(0x46d), z['49'] = _0x46b0bf(0x2a9), z['50'] = _0x46b0bf(0x4df), z['51'] = '&#1506;', z['52'] = _0x46b0bf(0x38d), z['53'] = '1', z['54'] = '2', z['55'] = '3', z['56'] = '4', z['57'] = '5', z['58'] = '6', z['59'] = '7', z['60'] = '8', z['61'] = '9', z['62'] = '0';
var A = {};
A['1'] = _0x46b0bf(0x2af), A['2'] = '&#1073;', A['3'] = 'c', A['4'] = _0x46b0bf(0x597), A['5'] = _0x46b0bf(0x3b4), A['6'] = 'f', A['7'] = 'g', A['8'] = _0x46b0bf(0x1e5), A['9'] = _0x46b0bf(0x5ae), A['10'] = 'j', A['11'] = '&#1082;', A['12'] = _0x46b0bf(0x2ff), A['13'] = _0x46b0bf(0x2dd), A['14'] = _0x46b0bf(0x509), A['15'] = _0x46b0bf(0x179), A['16'] = 'p', A['17'] = _0x46b0bf(0x605), A['18'] = _0x46b0bf(0x568), A['19'] = '$', A['20'] = '&#1090;', A['21'] = _0x46b0bf(0x584), A['22'] = _0x46b0bf(0x322), A['23'] = '&#1097;', A['24'] = _0x46b0bf(0x39e), A['25'] = _0x46b0bf(0x314), A['26'] = _0x46b0bf(0x47b), A['27'] = _0x46b0bf(0x182), A['28'] = _0x46b0bf(0x15a), A['29'] = 'C', A['30'] = _0x46b0bf(0x1d7), A['31'] = _0x46b0bf(0x5b6), A['32'] = 'F', A['33'] = 'G', A['34'] = 'H', A['35'] = '&#1031;', A['36'] = 'J', A['37'] = '&#1050;', A['38'] = '&#1043;', A['39'] = _0x46b0bf(0x578), A['40'] = _0x46b0bf(0x4e6), A['41'] = _0x46b0bf(0x3b2), A['42'] = 'P', A['43'] = '&#1060;', A['44'] = _0x46b0bf(0x5b5), A['45'] = '$', A['46'] = 'T', A['47'] = _0x46b0bf(0x246), A['48'] = '&#1140;', A['49'] = _0x46b0bf(0x50a), A['50'] = _0x46b0bf(0x269), A['51'] = '&#1063;', A['52'] = '&#1047;', A['53'] = '1', A['54'] = '2', A['55'] = '3', A['56'] = '4', A['57'] = '5', A['58'] = '6', A['59'] = '7', A['60'] = '8', A['61'] = '9', A['62'] = '0';
var B = {};
B['1'] = _0x46b0bf(0x609), B['2'] = 'b&#830;', B['3'] = _0x46b0bf(0x228), B['4'] = _0x46b0bf(0x52d), B['5'] = _0x46b0bf(0x44c), B['6'] = _0x46b0bf(0x2b3), B['7'] = _0x46b0bf(0x1f0), B['8'] = 'h&#830;', B['9'] = 'i&#830;', B['10'] = _0x46b0bf(0x5ea), B['11'] = _0x46b0bf(0x1ee), B['12'] = _0x46b0bf(0x4da), B['13'] = _0x46b0bf(0x52c), B['14'] = _0x46b0bf(0x1d1), B['15'] = _0x46b0bf(0x20c), B['16'] = _0x46b0bf(0x563), B['17'] = _0x46b0bf(0x27f), B['18'] = _0x46b0bf(0x4a2), B['19'] = 's&#830;', B['20'] = _0x46b0bf(0x27a), B['21'] = 'u&#830;', B['22'] = _0x46b0bf(0x449), B['23'] = 'w&#830;', B['24'] = _0x46b0bf(0x30e), B['25'] = _0x46b0bf(0x297), B['26'] = _0x46b0bf(0x1ad), B['27'] = 'A&#830;', B['28'] = _0x46b0bf(0x4e1), B['29'] = 'C&#830;', B['30'] = _0x46b0bf(0x2e4), B['31'] = 'E&#830;', B['32'] = _0x46b0bf(0x57c), B['33'] = _0x46b0bf(0x397), B['34'] = _0x46b0bf(0x2c3), B['35'] = 'I&#830;', B['36'] = _0x46b0bf(0x148), B['37'] = _0x46b0bf(0x2ee), B['38'] = _0x46b0bf(0x5e9), B['39'] = _0x46b0bf(0x59e), B['40'] = _0x46b0bf(0x14b), B['41'] = _0x46b0bf(0x5a2), B['42'] = _0x46b0bf(0x1f3), B['43'] = _0x46b0bf(0x29d), B['44'] = 'R&#830;', B['45'] = 'S&#830;', B['46'] = _0x46b0bf(0x34b), B['47'] = _0x46b0bf(0x18c), B['48'] = _0x46b0bf(0x2b0), B['49'] = _0x46b0bf(0x549), B['50'] = 'X&#830;', B['51'] = _0x46b0bf(0x25e), B['52'] = 'Z&#830;', B['53'] = _0x46b0bf(0x15e), B['54'] = '2&#830;', B['55'] = _0x46b0bf(0x27b), B['56'] = _0x46b0bf(0x5c2), B['57'] = '5&#830;', B['58'] = '6&#830;', B['59'] = _0x46b0bf(0x2d6), B['60'] = _0x46b0bf(0x521), B['61'] = _0x46b0bf(0x316), B['62'] = _0x46b0bf(0x1b2);
var C = {};
C['1'] = _0x46b0bf(0x387), C['2'] = _0x46b0bf(0x19c), C['3'] = _0x46b0bf(0x5ab), C['4'] = 'd&#838;', C['5'] = _0x46b0bf(0x341), C['6'] = 'f&#838;', C['7'] = _0x46b0bf(0x565), C['8'] = 'h&#838;', C['9'] = 'i&#838;', C['10'] = _0x46b0bf(0x4eb), C['11'] = _0x46b0bf(0x61a), C['12'] = 'l&#838;', C['13'] = _0x46b0bf(0x190), C['14'] = _0x46b0bf(0x33e), C['15'] = _0x46b0bf(0x593), C['16'] = 'p&#838;', C['17'] = _0x46b0bf(0x421), C['18'] = 'r&#838;', C['19'] = _0x46b0bf(0x267), C['20'] = _0x46b0bf(0x47e), C['21'] = _0x46b0bf(0x364), C['22'] = 'v&#838;', C['23'] = _0x46b0bf(0x260), C['24'] = 'x&#838;', C['25'] = 'y&#838;', C['26'] = _0x46b0bf(0x60a), C['27'] = _0x46b0bf(0x1fa), C['28'] = _0x46b0bf(0x32e), C['29'] = _0x46b0bf(0x1a1), C['30'] = _0x46b0bf(0x4ea), C['31'] = _0x46b0bf(0x2d3), C['32'] = _0x46b0bf(0x4db), C['33'] = _0x46b0bf(0x4e0), C['34'] = _0x46b0bf(0x611), C['35'] = _0x46b0bf(0x275), C['36'] = _0x46b0bf(0x52e), C['37'] = _0x46b0bf(0x3ea), C['38'] = _0x46b0bf(0x158), C['39'] = _0x46b0bf(0x14c), C['40'] = 'N&#838;', C['41'] = _0x46b0bf(0x435), C['42'] = _0x46b0bf(0x441), C['43'] = 'Q&#838;', C['44'] = _0x46b0bf(0x2d0), C['45'] = 'S&#838;', C['46'] = _0x46b0bf(0x407), C['47'] = _0x46b0bf(0x54f), C['48'] = _0x46b0bf(0x402), C['49'] = _0x46b0bf(0x187), C['50'] = _0x46b0bf(0x2c4), C['51'] = _0x46b0bf(0x220), C['52'] = _0x46b0bf(0x1a4), C['53'] = _0x46b0bf(0x394), C['54'] = _0x46b0bf(0x2d1), C['55'] = '3&#838;', C['56'] = _0x46b0bf(0x4e9), C['57'] = _0x46b0bf(0x3e5), C['58'] = _0x46b0bf(0x340), C['59'] = _0x46b0bf(0x598), C['60'] = _0x46b0bf(0x432), C['61'] = _0x46b0bf(0x3b8), C['62'] = '0&#838;';
var D = {};
D['1'] = 'a&#826;', D['2'] = 'b&#826;', D['3'] = 'c&#826;', D['4'] = _0x46b0bf(0x1a7), D['5'] = _0x46b0bf(0x542), D['6'] = _0x46b0bf(0x19f), D['7'] = _0x46b0bf(0x175), D['8'] = _0x46b0bf(0x3ce), D['9'] = 'i&#826;', D['10'] = _0x46b0bf(0x53e), D['11'] = _0x46b0bf(0x419), D['12'] = _0x46b0bf(0x301), D['13'] = _0x46b0bf(0x1bd), D['14'] = _0x46b0bf(0x193), D['15'] = _0x46b0bf(0x21b), D['16'] = _0x46b0bf(0x5e1), D['17'] = _0x46b0bf(0x325), D['18'] = _0x46b0bf(0x3ef), D['19'] = _0x46b0bf(0x242), D['20'] = 't&#826;', D['21'] = _0x46b0bf(0x515), D['22'] = _0x46b0bf(0x33d), D['23'] = _0x46b0bf(0x36d), D['24'] = _0x46b0bf(0x22a), D['25'] = _0x46b0bf(0x328), D['26'] = _0x46b0bf(0x245), D['27'] = _0x46b0bf(0x284), D['28'] = _0x46b0bf(0x35f), D['29'] = _0x46b0bf(0x3a9), D['30'] = _0x46b0bf(0x4d1), D['31'] = _0x46b0bf(0x41a), D['32'] = _0x46b0bf(0x2bb), D['33'] = _0x46b0bf(0x3c3), D['34'] = _0x46b0bf(0x264), D['35'] = _0x46b0bf(0x229), D['36'] = _0x46b0bf(0x4bf), D['37'] = 'K&#826;', D['38'] = _0x46b0bf(0x44b), D['39'] = _0x46b0bf(0x5e7), D['40'] = 'N&#826;', D['41'] = _0x46b0bf(0x211), D['42'] = _0x46b0bf(0x4f1), D['43'] = _0x46b0bf(0x3c5), D['44'] = _0x46b0bf(0x4b7), D['45'] = _0x46b0bf(0x1a9), D['46'] = _0x46b0bf(0x3d9), D['47'] = _0x46b0bf(0x513), D['48'] = _0x46b0bf(0x377), D['49'] = _0x46b0bf(0x4c0), D['50'] = _0x46b0bf(0x423), D['51'] = _0x46b0bf(0x4b0), D['52'] = _0x46b0bf(0x375), D['53'] = '1&#826;', D['54'] = '2&#826;', D['55'] = _0x46b0bf(0x2cc), D['56'] = _0x46b0bf(0x4be), D['57'] = _0x46b0bf(0x1e2), D['58'] = '6&#826;', D['59'] = _0x46b0bf(0x487), D['60'] = '8&#826;', D['61'] = _0x46b0bf(0x4ee), D['62'] = _0x46b0bf(0x562);
var E = {};
E['1'] = _0x46b0bf(0x2a0), E['2'] = _0x46b0bf(0x543), E['3'] = _0x46b0bf(0x5a6), E['4'] = _0x46b0bf(0x261), E['5'] = _0x46b0bf(0x420), E['6'] = _0x46b0bf(0x274), E['7'] = 'g&#857;', E['8'] = _0x46b0bf(0x37b), E['9'] = _0x46b0bf(0x4fb), E['10'] = _0x46b0bf(0x22b), E['11'] = 'k&#857;', E['12'] = _0x46b0bf(0x4a6), E['13'] = _0x46b0bf(0x4ef), E['14'] = _0x46b0bf(0x3c2), E['15'] = 'o&#857;', E['16'] = 'p&#857;', E['17'] = _0x46b0bf(0x329), E['18'] = 'r&#857;', E['19'] = 's&#857;', E['20'] = _0x46b0bf(0x501), E['21'] = _0x46b0bf(0x241), E['22'] = _0x46b0bf(0x3fa), E['23'] = _0x46b0bf(0x3a7), E['24'] = _0x46b0bf(0x1f4), E['25'] = 'y&#857;', E['26'] = _0x46b0bf(0x4de), E['27'] = _0x46b0bf(0x339), E['28'] = 'B&#857;', E['29'] = 'C&#857;', E['30'] = _0x46b0bf(0x215), E['31'] = _0x46b0bf(0x620), E['32'] = _0x46b0bf(0x1b9), E['33'] = 'G&#857;', E['34'] = 'H&#857;', E['35'] = _0x46b0bf(0x544), E['36'] = _0x46b0bf(0x5ac), E['37'] = _0x46b0bf(0x48f), E['38'] = _0x46b0bf(0x576), E['39'] = _0x46b0bf(0x247), E['40'] = _0x46b0bf(0x5a8), E['41'] = _0x46b0bf(0x43b), E['42'] = _0x46b0bf(0x4d3), E['43'] = _0x46b0bf(0x5c3), E['44'] = 'R&#857;', E['45'] = _0x46b0bf(0x21c), E['46'] = _0x46b0bf(0x594), E['47'] = _0x46b0bf(0x520), E['48'] = 'V&#857;', E['49'] = _0x46b0bf(0x4ff), E['50'] = _0x46b0bf(0x2d8), E['51'] = _0x46b0bf(0x2da), E['52'] = _0x46b0bf(0x59b), E['53'] = _0x46b0bf(0x285), E['54'] = '2&#857;', E['55'] = _0x46b0bf(0x32a), E['56'] = _0x46b0bf(0x24f), E['57'] = _0x46b0bf(0x55d), E['58'] = _0x46b0bf(0x4c1), E['59'] = _0x46b0bf(0x171), E['60'] = '8&#857;', E['61'] = '9&#857;', E['62'] = _0x46b0bf(0x465);
var F = {};
F['1'] = _0x46b0bf(0x222), F['2'] = _0x46b0bf(0x552), F['3'] = 'c&#799;', F['4'] = _0x46b0bf(0x2f5), F['5'] = _0x46b0bf(0x203), F['6'] = _0x46b0bf(0x621), F['7'] = 'g&#799;', F['8'] = 'h&#799;', F['9'] = _0x46b0bf(0x2b4), F['10'] = 'j&#799;', F['11'] = _0x46b0bf(0x428), F['12'] = _0x46b0bf(0x473), F['13'] = 'm&#799;', F['14'] = 'n&#799;', F['15'] = 'o&#799;', F['16'] = 'p&#799;', F['17'] = _0x46b0bf(0x2d2), F['18'] = _0x46b0bf(0x2f9), F['19'] = _0x46b0bf(0x155), F['20'] = _0x46b0bf(0x5ed), F['21'] = _0x46b0bf(0x3dd), F['22'] = _0x46b0bf(0x1fd), F['23'] = _0x46b0bf(0x53b), F['24'] = _0x46b0bf(0x213), F['25'] = 'y&#799;', F['26'] = _0x46b0bf(0x5b1), F['27'] = _0x46b0bf(0x4b4), F['28'] = _0x46b0bf(0x4d5), F['29'] = _0x46b0bf(0x582), F['30'] = 'D&#799;', F['31'] = _0x46b0bf(0x14d), F['32'] = _0x46b0bf(0x3fe), F['33'] = _0x46b0bf(0x5ec), F['34'] = _0x46b0bf(0x2a7), F['35'] = _0x46b0bf(0x212), F['36'] = _0x46b0bf(0x16e), F['37'] = _0x46b0bf(0x1b5), F['38'] = _0x46b0bf(0x5ca), F['39'] = 'M&#799;', F['40'] = _0x46b0bf(0x365), F['41'] = _0x46b0bf(0x59f), F['42'] = _0x46b0bf(0x427), F['43'] = 'Q&#799;', F['44'] = _0x46b0bf(0x23a), F['45'] = _0x46b0bf(0x545), F['46'] = _0x46b0bf(0x34d), F['47'] = _0x46b0bf(0x60f), F['48'] = _0x46b0bf(0x348), F['49'] = 'W&#799;', F['50'] = _0x46b0bf(0x453), F['51'] = _0x46b0bf(0x311), F['52'] = _0x46b0bf(0x27d), F['53'] = _0x46b0bf(0x564), F['54'] = _0x46b0bf(0x59a), F['55'] = '3&#799;', F['56'] = _0x46b0bf(0x2be), F['57'] = _0x46b0bf(0x537), F['58'] = _0x46b0bf(0x583), F['59'] = _0x46b0bf(0x1cf), F['60'] = _0x46b0bf(0x205), F['61'] = _0x46b0bf(0x3eb), F['62'] = _0x46b0bf(0x2f0);
var G = {};
G['1'] = 'a&#846;', G['2'] = _0x46b0bf(0x4a0), G['3'] = _0x46b0bf(0x1c9), G['4'] = _0x46b0bf(0x29e), G['5'] = _0x46b0bf(0x250), G['6'] = _0x46b0bf(0x1ce), G['7'] = _0x46b0bf(0x17e), G['8'] = 'h&#846;', G['9'] = _0x46b0bf(0x554), G['10'] = _0x46b0bf(0x1ff), G['11'] = _0x46b0bf(0x1de), G['12'] = _0x46b0bf(0x198), G['13'] = _0x46b0bf(0x5ee), G['14'] = _0x46b0bf(0x2b7), G['15'] = _0x46b0bf(0x48a), G['16'] = 'p&#846;', G['17'] = 'q&#846;', G['18'] = _0x46b0bf(0x381), G['19'] = _0x46b0bf(0x343), G['20'] = _0x46b0bf(0x180), G['21'] = _0x46b0bf(0x23c), G['22'] = _0x46b0bf(0x60b), G['23'] = 'w&#846;', G['24'] = 'x&#846;', G['25'] = _0x46b0bf(0x5a3), G['26'] = _0x46b0bf(0x5cb), G['27'] = _0x46b0bf(0x191), G['28'] = _0x46b0bf(0x306), G['29'] = _0x46b0bf(0x52a), G['30'] = _0x46b0bf(0x214), G['31'] = _0x46b0bf(0x5f2), G['32'] = _0x46b0bf(0x349), G['33'] = _0x46b0bf(0x41d), G['34'] = _0x46b0bf(0x3f6), G['35'] = _0x46b0bf(0x5d9), G['36'] = _0x46b0bf(0x15d), G['37'] = _0x46b0bf(0x3cd), G['38'] = _0x46b0bf(0x3a6), G['39'] = _0x46b0bf(0x1a5), G['40'] = _0x46b0bf(0x2b8), G['41'] = _0x46b0bf(0x5de), G['42'] = 'P&#846;', G['43'] = _0x46b0bf(0x248), G['44'] = _0x46b0bf(0x218), G['45'] = _0x46b0bf(0x202), G['46'] = _0x46b0bf(0x439), G['47'] = 'U&#846;', G['48'] = _0x46b0bf(0x46c), G['49'] = _0x46b0bf(0x405), G['50'] = _0x46b0bf(0x1ed), G['51'] = _0x46b0bf(0x49e), G['52'] = _0x46b0bf(0x3e0), G['53'] = _0x46b0bf(0x2fe), G['54'] = _0x46b0bf(0x3f2), G['55'] = _0x46b0bf(0x1b0), G['56'] = '4&#846;', G['57'] = '5&#846;', G['58'] = '6&#846;', G['59'] = _0x46b0bf(0x50f), G['60'] = _0x46b0bf(0x1ec), G['61'] = _0x46b0bf(0x161), G['62'] = '0&#846;';
var H = {};
H['1'] = 'a&#829;&#851;', H['2'] = 'b&#829;&#851;', H['3'] = _0x46b0bf(0x1ab), H['4'] = 'd&#829;&#851;', H['5'] = _0x46b0bf(0x57b), H['6'] = _0x46b0bf(0x3e1), H['7'] = _0x46b0bf(0x480), H['8'] = 'h&#829;&#851;', H['9'] = 'i&#829;&#851;', H['10'] = _0x46b0bf(0x57d), H['11'] = _0x46b0bf(0x167), H['12'] = _0x46b0bf(0x2ef), H['13'] = _0x46b0bf(0x4f8), H['14'] = _0x46b0bf(0x1fe), H['15'] = 'o&#829;&#851;', H['16'] = _0x46b0bf(0x34f), H['17'] = 'q&#829;&#851;', H['18'] = 'r&#829;&#851;', H['19'] = _0x46b0bf(0x5d2), H['20'] = _0x46b0bf(0x2a3), H['21'] = 'u&#829;&#851;', H['22'] = _0x46b0bf(0x572), H['23'] = _0x46b0bf(0x159), H['24'] = _0x46b0bf(0x249), H['25'] = 'y&#829;&#851;', H['26'] = _0x46b0bf(0x5ef), H['27'] = 'A&#829;&#851;', H['28'] = _0x46b0bf(0x355), H['29'] = 'C&#829;&#851;', H['30'] = 'D&#829;&#851;', H['31'] = _0x46b0bf(0x380), H['32'] = _0x46b0bf(0x55b), H['33'] = _0x46b0bf(0x366), H['34'] = 'H&#829;&#851;', H['35'] = _0x46b0bf(0x1f2), H['36'] = _0x46b0bf(0x61d), H['37'] = _0x46b0bf(0x539), H['38'] = _0x46b0bf(0x289), H['39'] = _0x46b0bf(0x20b), H['40'] = 'N&#829;&#851;', H['41'] = _0x46b0bf(0x33a), H['42'] = _0x46b0bf(0x286), H['43'] = 'Q&#829;&#851;', H['44'] = 'R&#829;&#851;', H['45'] = _0x46b0bf(0x2fb), H['46'] = _0x46b0bf(0x503), H['47'] = 'U&#829;&#851;', H['48'] = _0x46b0bf(0x495), H['49'] = 'W&#829;&#851;', H['50'] = 'X&#829;&#851;', H['51'] = _0x46b0bf(0x3ae), H['52'] = 'Z&#829;&#851;', H['53'] = _0x46b0bf(0x37e), H['54'] = _0x46b0bf(0x433), H['55'] = _0x46b0bf(0x519), H['56'] = _0x46b0bf(0x2c1), H['57'] = '5&#829;&#851;', H['58'] = _0x46b0bf(0x4cc), H['59'] = _0x46b0bf(0x517), H['60'] = _0x46b0bf(0x37f), H['61'] = '9&#829;&#851;', H['62'] = '0&#829;&#851;';
var I = {};
I['1'] = '&#120458;&#823;', I['2'] = '&#120459;&#823;', I['3'] = '&#120460;&#823;', I['4'] = _0x46b0bf(0x599), I['5'] = _0x46b0bf(0x5b0), I['6'] = '&#120463;&#823;', I['7'] = '&#120464;&#823;', I['8'] = _0x46b0bf(0x1e3), I['9'] = _0x46b0bf(0x279), I['10'] = _0x46b0bf(0x382), I['11'] = _0x46b0bf(0x40c), I['12'] = '&#120469;&#823;', I['13'] = _0x46b0bf(0x1c7), I['14'] = _0x46b0bf(0x24e), I['15'] = '&#120472;&#823;', I['16'] = '&#120473;&#823;', I['17'] = _0x46b0bf(0x26f), I['18'] = _0x46b0bf(0x54c), I['19'] = _0x46b0bf(0x4ce), I['20'] = '&#120477;&#823;', I['21'] = _0x46b0bf(0x20d), I['22'] = _0x46b0bf(0x3c9), I['23'] = _0x46b0bf(0x4ad), I['24'] = '&#120481;&#823;', I['25'] = _0x46b0bf(0x40b), I['26'] = _0x46b0bf(0x451), I['27'] = _0x46b0bf(0x5e0), I['28'] = _0x46b0bf(0x56a), I['29'] = _0x46b0bf(0x3de), I['30'] = _0x46b0bf(0x1a2), I['31'] = _0x46b0bf(0x507), I['32'] = '&#120437;&#823;', I['33'] = '&#120438;&#823;', I['34'] = _0x46b0bf(0x404), I['35'] = _0x46b0bf(0x173), I['36'] = _0x46b0bf(0x186), I['37'] = '&#120442;&#823;', I['38'] = '&#120443;&#823;', I['39'] = _0x46b0bf(0x287), I['40'] = '&#120445;&#823;', I['41'] = _0x46b0bf(0x344), I['42'] = _0x46b0bf(0x5e6), I['43'] = '&#120448;&#823;', I['44'] = '&#120449;&#823;', I['45'] = _0x46b0bf(0x1b8), I['46'] = '&#120451;&#823;', I['47'] = '&#120452;&#823;', I['48'] = _0x46b0bf(0x358), I['49'] = _0x46b0bf(0x483), I['50'] = _0x46b0bf(0x444), I['51'] = _0x46b0bf(0x14f), I['52'] = _0x46b0bf(0x4a3), I['53'] = '&#120823;&#823;', I['54'] = _0x46b0bf(0x2cb), I['55'] = _0x46b0bf(0x4b9), I['56'] = _0x46b0bf(0x16d), I['57'] = _0x46b0bf(0x479), I['58'] = _0x46b0bf(0x162), I['59'] = _0x46b0bf(0x23e), I['60'] = _0x46b0bf(0x5cf), I['61'] = _0x46b0bf(0x5c8), I['62'] = _0x46b0bf(0x403);
var J = {};
J['1'] = _0x46b0bf(0x29b), J['2'] = _0x46b0bf(0x210), J['3'] = 'c&#866;', J['4'] = _0x46b0bf(0x452), J['5'] = _0x46b0bf(0x43f), J['6'] = _0x46b0bf(0x154), J['7'] = _0x46b0bf(0x4e2), J['8'] = _0x46b0bf(0x184), J['9'] = _0x46b0bf(0x39a), J['10'] = 'j&#866;', J['11'] = _0x46b0bf(0x417), J['12'] = _0x46b0bf(0x27c), J['13'] = _0x46b0bf(0x3be), J['14'] = _0x46b0bf(0x413), J['15'] = _0x46b0bf(0x5b4), J['16'] = 'p&#866;', J['17'] = 'q&#866;', J['18'] = _0x46b0bf(0x1ba), J['19'] = _0x46b0bf(0x1f6), J['20'] = _0x46b0bf(0x5d3), J['21'] = 'u&#866;', J['22'] = _0x46b0bf(0x5fb), J['23'] = _0x46b0bf(0x2e9), J['24'] = 'x&#866;', J['25'] = 'y&#866;', J['26'] = _0x46b0bf(0x35a), J['27'] = _0x46b0bf(0x296), J['28'] = _0x46b0bf(0x384), J['29'] = _0x46b0bf(0x1fc), J['30'] = _0x46b0bf(0x18e), J['31'] = 'E&#866;', J['32'] = _0x46b0bf(0x2a2), J['33'] = _0x46b0bf(0x357), J['34'] = _0x46b0bf(0x21a), J['35'] = _0x46b0bf(0x38b), J['36'] = _0x46b0bf(0x3ec), J['37'] = _0x46b0bf(0x3b9), J['38'] = _0x46b0bf(0x4b8), J['39'] = _0x46b0bf(0x1e1), J['40'] = 'N&#866;', J['41'] = _0x46b0bf(0x290), J['42'] = 'P&#866;', J['43'] = _0x46b0bf(0x157), J['44'] = _0x46b0bf(0x49d), J['45'] = _0x46b0bf(0x4cd), J['46'] = _0x46b0bf(0x61e), J['47'] = _0x46b0bf(0x2b9), J['48'] = _0x46b0bf(0x209), J['49'] = 'W&#866;', J['50'] = _0x46b0bf(0x400), J['51'] = _0x46b0bf(0x3ac), J['52'] = _0x46b0bf(0x3a2), J['53'] = _0x46b0bf(0x58f), J['54'] = _0x46b0bf(0x37a), J['55'] = _0x46b0bf(0x28b), J['56'] = '4&#866;', J['57'] = '5&#866;', J['58'] = '6&#866;', J['59'] = _0x46b0bf(0x2f7), J['60'] = _0x46b0bf(0x315), J['61'] = _0x46b0bf(0x2cf), J['62'] = '0&#866;';
var K = {};
K['1'] = _0x46b0bf(0x3a4), K['2'] = _0x46b0bf(0x600), K['3'] = _0x46b0bf(0x36a), K['4'] = _0x46b0bf(0x558), K['5'] = 'e&#828;', K['6'] = _0x46b0bf(0x592), K['7'] = _0x46b0bf(0x408), K['8'] = _0x46b0bf(0x3c4), K['9'] = _0x46b0bf(0x29f), K['10'] = _0x46b0bf(0x43e), K['11'] = 'k&#828;', K['12'] = _0x46b0bf(0x590), K['13'] = _0x46b0bf(0x489), K['14'] = 'n&#828;', K['15'] = _0x46b0bf(0x1c1), K['16'] = _0x46b0bf(0x1f5), K['17'] = _0x46b0bf(0x42b), K['18'] = _0x46b0bf(0x50d), K['19'] = _0x46b0bf(0x5b2), K['20'] = _0x46b0bf(0x4a1), K['21'] = 'u&#828;', K['22'] = _0x46b0bf(0x255), K['23'] = _0x46b0bf(0x3c0), K['24'] = _0x46b0bf(0x516), K['25'] = 'y&#828;', K['26'] = _0x46b0bf(0x61b), K['27'] = _0x46b0bf(0x1ac), K['28'] = _0x46b0bf(0x1a3), K['29'] = _0x46b0bf(0x5bd), K['30'] = 'D&#828;', K['31'] = _0x46b0bf(0x388), K['32'] = _0x46b0bf(0x31a), K['33'] = _0x46b0bf(0x1eb), K['34'] = _0x46b0bf(0x5d6), K['35'] = _0x46b0bf(0x2c9), K['36'] = _0x46b0bf(0x30d), K['37'] = _0x46b0bf(0x1cb), K['38'] = _0x46b0bf(0x5f0), K['39'] = _0x46b0bf(0x2ab), K['40'] = _0x46b0bf(0x2c2), K['41'] = 'O&#828;', K['42'] = _0x46b0bf(0x195), K['43'] = 'Q&#828;', K['44'] = _0x46b0bf(0x361), K['45'] = _0x46b0bf(0x47c), K['46'] = 'T&#828;', K['47'] = _0x46b0bf(0x471), K['48'] = _0x46b0bf(0x28d), K['49'] = _0x46b0bf(0x3f0), K['50'] = _0x46b0bf(0x616), K['51'] = _0x46b0bf(0x3ab), K['52'] = 'Z&#828;', K['53'] = _0x46b0bf(0x456), K['54'] = _0x46b0bf(0x1b3), K['55'] = _0x46b0bf(0x57f), K['56'] = '4&#828;', K['57'] = _0x46b0bf(0x2b5), K['58'] = _0x46b0bf(0x4d4), K['59'] = _0x46b0bf(0x468), K['60'] = _0x46b0bf(0x1c8), K['61'] = _0x46b0bf(0x307), K['62'] = _0x46b0bf(0x20e);
var L = {};
L['s1'] = h, L['s2'] = i, L['s3'] = j, L['s4'] = k, L['s5'] = l, L['s6'] = m, L['s7'] = n, L['s8'] = o, L['s9'] = p, L[_0x46b0bf(0x32d)] = q, L[_0x46b0bf(0x477)] = r, L[_0x46b0bf(0x3f1)] = s, L[_0x46b0bf(0x3e3)] = t, L[_0x46b0bf(0x221)] = u, L['s15'] = v, L[_0x46b0bf(0x31c)] = w, L['s17'] = x, L[_0x46b0bf(0x5d1)] = y, L[_0x46b0bf(0x379)] = z, L[_0x46b0bf(0x3fc)] = A, L[_0x46b0bf(0x447)] = B, L[_0x46b0bf(0x265)] = C, L[_0x46b0bf(0x502)] = D, L['s24'] = E, L[_0x46b0bf(0x45f)] = F, L[_0x46b0bf(0x445)] = G, L[_0x46b0bf(0x3d8)] = H, L['s29'] = I, L[_0x46b0bf(0x317)] = J, L[_0x46b0bf(0x47a)] = K;
var newtext = L;

function Change(_0x53e70e, _0x2a8e0d) {
    var _0x5750ec = _0x46b0bf,
        _0x28a4a2 = '',
        _0x53e70e = _0x53e70e;
    if (_0x53e70e[_0x5750ec(0x164)] == 0x0) return;
    for (i = 0x0; i < _0x53e70e[_0x5750ec(0x164)]; i++) {
        var _0x308f7c = _0x53e70e['charAt'](i),
            _0x2871dc = normal['indexOf'](_0x308f7c) + 0x1;
        if (_0x308f7c == '\x20') _0x28a4a2 += '\x20';
        else !_0x2871dc ? _0x28a4a2 += _0x308f7c : _0x28a4a2 += newtext[_0x2a8e0d][_0x2871dc];
    }
    return _0x28a4a2;
}
var M = {};
M['0'] = '0', M['1'] = '1', M['2'] = '2', M['3'] = '3', M['4'] = '4', M['5'] = '5', M['6'] = '6', M['7'] = '7', M['8'] = '8', M['9'] = '9', M['a'] = 'ᗩ', M['b'] = 'ᗷ', M['c'] = 'ᑢ', M['d'] = 'ᕲ', M['e'] = 'ᘿ', M['f'] = 'ᖴ', M['g'] = 'ᘜ', M['h'] = 'ᕼ', M['i'] = 'ᓰ', M['j'] = 'ᒚ', M['k'] = 'ᖽᐸ', M['l'] = 'ᒪ', M['m'] = 'ᘻ', M['n'] = 'ᘉ', M['o'] = 'ᓍ', M['p'] = 'ᕵ', M['q'] = 'ᕴ', M['r'] = 'ᖇ', M['s'] = 'S', M['t'] = 'ᖶ', M['u'] = 'ᑘ', M['v'] = 'ᐺ', M['w'] = 'ᘺ', M['x'] = '᙭', M['y'] = 'ᖻ', M['z'] = 'ᗱ', M['A'] = 'ᗩ', M['B'] = 'ᗷ', M['C'] = 'ᑢ', M['D'] = 'ᕲ', M['E'] = 'ᘿ', M['F'] = 'ᖴ', M['G'] = 'ᘜ', M['H'] = 'ᕼ', M['I'] = 'ᓰ', M['J'] = 'ᒚ', M['K'] = 'ᖽᐸ', M['L'] = 'ᒪ', M['M'] = 'ᘻ', M['N'] = 'ᘉ', M['O'] = 'ᓍ', M['P'] = 'ᕵ', M['Q'] = 'ᕴ', M['R'] = 'ᖇ', M['S'] = 'S', M['T'] = 'ᖶ', M['U'] = 'ᑘ', M['V'] = 'ᐺ', M['W'] = 'ᘺ', M['X'] = '᙭', M['Y'] = 'ᖻ', M['Z'] = 'ᗱ';
const futureAlienCharMap = M;
var N = {};
N['0'] = '0', N['1'] = '1', N['2'] = '2', N['3'] = '3', N['4'] = '4', N['5'] = '5', N['6'] = '6', N['7'] = '7', N['8'] = '8', N['9'] = '9', N['a'] = 'ค', N['b'] = '๖', N['c'] = '¢', N['d'] = '໓', N['e'] = 'ē', N['f'] = 'f', N['g'] = 'ງ', N['h'] = 'h', N['i'] = 'i', N['j'] = 'ว', N['k'] = 'k', N['l'] = 'l', N['m'] = '๓', N['n'] = 'ຖ', N['o'] = '໐', N['p'] = 'p', N['q'] = '๑', N['r'] = 'r', N['s'] = 'Ş', N['t'] = 't', N['u'] = 'น', N['v'] = 'ง', N['w'] = 'ຟ', N['x'] = 'x', N['y'] = 'ฯ', N['z'] = 'ຊ', N['A'] = 'ค', N['B'] = '๖', N['C'] = '¢', N['D'] = '໓', N['E'] = 'ē', N['F'] = 'f', N['G'] = 'ງ', N['H'] = 'h', N['I'] = 'i', N['J'] = 'ว', N['K'] = 'k', N['L'] = 'l', N['M'] = '๓', N['N'] = 'ຖ', N['O'] = '໐', N['P'] = 'p', N['Q'] = '๑', N['R'] = 'r', N['S'] = 'Ş', N['T'] = 't', N['U'] = 'น', N['V'] = 'ง', N['W'] = 'ຟ', N['X'] = 'x', N['Y'] = 'ฯ', N['Z'] = 'ຊ';
const squiggle6CharMap = N;
var O = {};
O['0'] = '0', O['1'] = '1', O['2'] = '2', O['3'] = '3', O['4'] = '4', O['5'] = '5', O['6'] = '6', O['7'] = '7', O['8'] = '8', O['9'] = '9', O['a'] = 'ą', O['b'] = 'ც', O['c'] = 'ƈ', O['d'] = 'ɖ', O['e'] = 'ɛ', O['f'] = 'ʄ', O['g'] = 'ɠ', O['h'] = 'ɧ', O['i'] = 'ı', O['j'] = 'ʝ', O['k'] = 'ƙ', O['l'] = 'Ɩ', O['m'] = 'ɱ', O['n'] = 'ŋ', O['o'] = 'ơ', O['p'] = '℘', O['q'] = 'զ', O['r'] = 'ཞ', O['s'] = 'ʂ', O['t'] = 'ɬ', O['u'] = 'ų', O['v'] = '۷', O['w'] = 'ῳ', O['x'] = 'ҳ', O['y'] = 'ყ', O['z'] = 'ʑ', O['A'] = 'ą', O['B'] = 'ც', O['C'] = 'ƈ', O['D'] = 'ɖ', O['E'] = 'ɛ', O['F'] = 'ʄ', O['G'] = 'ɠ', O['H'] = 'ɧ', O['I'] = 'ı', O['J'] = 'ʝ', O['K'] = 'ƙ', O['L'] = 'Ɩ', O['M'] = 'ɱ', O['N'] = 'ŋ', O['O'] = 'ơ', O['P'] = '℘', O['Q'] = 'զ', O['R'] = 'ཞ', O['S'] = 'ʂ', O['T'] = 'ɬ', O['U'] = 'ų', O['V'] = '۷', O['W'] = 'ῳ', O['X'] = 'ҳ', O['Y'] = 'ყ', O['Z'] = 'ʑ';
const squiggle5CharMap = O;
var P = {};
P['0'] = '0', P['1'] = '1', P['2'] = '2', P['3'] = '3', P['4'] = '4', P['5'] = '5', P['6'] = '6', P['7'] = '7', P['8'] = '8', P['9'] = '9', P['a'] = 'ﾑ', P['b'] = '乃', P['c'] = 'ᄃ', P['d'] = 'り', P['e'] = '乇', P['f'] = 'ｷ', P['g'] = 'ム', P['h'] = 'ん', P['i'] = 'ﾉ', P['j'] = 'ﾌ', P['k'] = 'ズ', P['l'] = 'ﾚ', P['m'] = 'ﾶ', P['n'] = '刀', P['o'] = 'の', P['p'] = 'ｱ', P['q'] = 'ゐ', P['r'] = '尺', P['s'] = '丂', P['t'] = 'ｲ', P['u'] = 'ひ', P['v'] = '√', P['w'] = 'W', P['x'] = 'ﾒ', P['y'] = 'ﾘ', P['z'] = '乙', P['A'] = 'ﾑ', P['B'] = '乃', P['C'] = 'ᄃ', P['D'] = 'り', P['E'] = '乇', P['F'] = 'ｷ', P['G'] = 'ム', P['H'] = 'ん', P['I'] = 'ﾉ', P['J'] = 'ﾌ', P['K'] = 'ズ', P['L'] = 'ﾚ', P['M'] = 'ﾶ', P['N'] = '刀', P['O'] = 'の', P['P'] = 'ｱ', P['Q'] = 'ゐ', P['R'] = '尺', P['S'] = '丂', P['T'] = 'ｲ', P['U'] = 'ひ', P['V'] = '√', P['W'] = 'W', P['X'] = 'ﾒ', P['Y'] = 'ﾘ', P['Z'] = '乙';
const asianStyle2CharMap = P;
var Q = {};
Q['0'] = '0', Q['1'] = '1', Q['2'] = '2', Q['3'] = '3', Q['4'] = '4', Q['5'] = '5', Q['6'] = '6', Q['7'] = '7', Q['8'] = '8', Q['9'] = '9', Q['a'] = '卂', Q['b'] = '乃', Q['c'] = '匚', Q['d'] = 'ᗪ', Q['e'] = '乇', Q['f'] = '千', Q['g'] = 'Ꮆ', Q['h'] = '卄', Q['i'] = '丨', Q['j'] = 'ﾌ', Q['k'] = 'Ҝ', Q['l'] = 'ㄥ', Q['m'] = '爪', Q['n'] = '几', Q['o'] = 'ㄖ', Q['p'] = '卩', Q['q'] = 'Ɋ', Q['r'] = '尺', Q['s'] = '丂', Q['t'] = 'ㄒ', Q['u'] = 'ㄩ', Q['v'] = 'ᐯ', Q['w'] = '山', Q['x'] = '乂', Q['y'] = 'ㄚ', Q['z'] = '乙', Q['A'] = '卂', Q['B'] = '乃', Q['C'] = '匚', Q['D'] = 'ᗪ', Q['E'] = '乇', Q['F'] = '千', Q['G'] = 'Ꮆ', Q['H'] = '卄', Q['I'] = '丨', Q['J'] = 'ﾌ', Q['K'] = 'Ҝ', Q['L'] = 'ㄥ', Q['M'] = '爪', Q['N'] = '几', Q['O'] = 'ㄖ', Q['P'] = '卩', Q['Q'] = 'Ɋ', Q['R'] = '尺', Q['S'] = '丂', Q['T'] = 'ㄒ', Q['U'] = 'ㄩ', Q['V'] = 'ᐯ', Q['W'] = '山', Q['X'] = '乂', Q['Y'] = 'ㄚ', Q['Z'] = '乙';
const asianStyleCharMap = Q;
var R = {};
R['0'] = '0', R['1'] = '1', R['2'] = '2', R['3'] = '3', R['4'] = '4', R['5'] = '5', R['6'] = '6', R['7'] = '7', R['8'] = '8', R['9'] = '9', R['a'] = '🄰', R['b'] = '🄱', R['c'] = '🄲', R['d'] = '🄳', R['e'] = '🄴', R['f'] = '🄵', R['g'] = '🄶', R['h'] = '🄷', R['i'] = '🄸', R['j'] = '🄹', R['k'] = '🄺', R['l'] = '🄻', R['m'] = '🄼', R['n'] = '🄽', R['o'] = '🄾', R['p'] = '🄿', R['q'] = '🅀', R['r'] = '🅁', R['s'] = '🅂', R['t'] = '🅃', R['u'] = '🅄', R['v'] = '🅅', R['w'] = '🅆', R['x'] = '🅇', R['y'] = '🅈', R['z'] = '🅉', R['A'] = '🄰', R['B'] = '🄱', R['C'] = '🄲', R['D'] = '🄳', R['E'] = '🄴', R['F'] = '🄵', R['G'] = '🄶', R['H'] = '🄷', R['I'] = '🄸', R['J'] = '🄹', R['K'] = '🄺', R['L'] = '🄻', R['M'] = '🄼', R['N'] = '🄽', R['O'] = '🄾', R['P'] = '🄿', R['Q'] = '🅀', R['R'] = '🅁', R['S'] = '🅂', R['T'] = '🅃', R['U'] = '🅄', R['V'] = '🅅', R['W'] = '🅆', R['X'] = '🅇', R['Y'] = '🅈', R['Z'] = '🅉';
const squaresCharMap = R;
var S = {};
S['0'] = '0', S['1'] = '1', S['2'] = '2', S['3'] = '3', S['4'] = '4', S['5'] = '5', S['6'] = '6', S['7'] = '7', S['8'] = '8', S['9'] = '9', S['a'] = 'Ꮧ', S['b'] = 'Ᏸ', S['c'] = 'ፈ', S['d'] = 'Ꮄ', S['e'] = 'Ꮛ', S['f'] = 'Ꭶ', S['g'] = 'Ꮆ', S['h'] = 'Ꮒ', S['i'] = 'Ꭵ', S['j'] = 'Ꮰ', S['k'] = 'Ꮶ', S['l'] = 'Ꮭ', S['m'] = 'Ꮇ', S['n'] = 'Ꮑ', S['o'] = 'Ꭷ', S['p'] = 'Ꭾ', S['q'] = 'Ꭴ', S['r'] = 'Ꮢ', S['s'] = 'Ꮥ', S['t'] = 'Ꮦ', S['u'] = 'Ꮼ', S['v'] = 'Ꮙ', S['w'] = 'Ꮗ', S['x'] = 'ጀ', S['y'] = 'Ꭹ', S['z'] = 'ፚ', S['A'] = 'Ꮧ', S['B'] = 'Ᏸ', S['C'] = 'ፈ', S['D'] = 'Ꮄ', S['E'] = 'Ꮛ', S['F'] = 'Ꭶ', S['G'] = 'Ꮆ', S['H'] = 'Ꮒ', S['I'] = 'Ꭵ', S['J'] = 'Ꮰ', S['K'] = 'Ꮶ', S['L'] = 'Ꮭ', S['M'] = 'Ꮇ', S['N'] = 'Ꮑ', S['O'] = 'Ꭷ', S['P'] = 'Ꭾ', S['Q'] = 'Ꭴ', S['R'] = 'Ꮢ', S['S'] = 'Ꮥ', S['T'] = 'Ꮦ', S['U'] = 'Ꮼ', S['V'] = 'Ꮙ', S['W'] = 'Ꮗ', S['X'] = 'ጀ', S['Y'] = 'Ꭹ', S['Z'] = 'ፚ';
const squiggle4CharMap = S;
var T = {};
T['0'] = '0', T['1'] = '1', T['2'] = '2', T['3'] = '3', T['4'] = '4', T['5'] = '5', T['6'] = '6', T['7'] = '7', T['8'] = '8', T['9'] = '9', T['a'] = 'ᗩ', T['b'] = 'ᗷ', T['c'] = 'ᑕ', T['d'] = 'ᗪ', T['e'] = 'E', T['f'] = 'ᖴ', T['g'] = 'G', T['h'] = 'ᕼ', T['i'] = 'I', T['j'] = 'ᒍ', T['k'] = 'K', T['l'] = 'ᒪ', T['m'] = 'ᗰ', T['n'] = 'ᑎ', T['o'] = 'O', T['p'] = 'ᑭ', T['q'] = 'ᑫ', T['r'] = 'ᖇ', T['s'] = 'ᔕ', T['t'] = 'T', T['u'] = 'ᑌ', T['v'] = 'ᐯ', T['w'] = 'ᗯ', T['x'] = '᙭', T['y'] = 'Y', T['z'] = 'ᘔ', T['A'] = 'ᗩ', T['B'] = 'ᗷ', T['C'] = 'ᑕ', T['D'] = 'ᗪ', T['E'] = 'E', T['F'] = 'ᖴ', T['G'] = 'G', T['H'] = 'ᕼ', T['I'] = 'I', T['J'] = 'ᒍ', T['K'] = 'K', T['L'] = 'ᒪ', T['M'] = 'ᗰ', T['N'] = 'ᑎ', T['O'] = 'O', T['P'] = 'ᑭ', T['Q'] = 'ᑫ', T['R'] = 'ᖇ', T['S'] = 'ᔕ', T['T'] = 'T', T['U'] = 'ᑌ', T['V'] = 'ᐯ', T['W'] = 'ᗯ', T['X'] = '᙭', T['Y'] = 'Y', T['Z'] = 'ᘔ';
const neonCharMap = T;
var U = {};
U['0'] = '0', U['1'] = '1', U['2'] = '2', U['3'] = '3', U['4'] = '4', U['5'] = '5', U['6'] = '6', U['7'] = '7', U['8'] = '8', U['9'] = '9', U['a'] = 'ǟ', U['b'] = 'ɮ', U['c'] = 'ƈ', U['d'] = 'ɖ', U['e'] = 'ɛ', U['f'] = 'ʄ', U['g'] = 'ɢ', U['h'] = 'ɦ', U['i'] = 'ɨ', U['j'] = 'ʝ', U['k'] = 'ӄ', U['l'] = 'ʟ', U['m'] = 'ʍ', U['n'] = 'ռ', U['o'] = 'օ', U['p'] = 'ք', U['q'] = 'զ', U['r'] = 'ʀ', U['s'] = 'ֆ', U['t'] = 'ȶ', U['u'] = 'ʊ', U['v'] = 'ʋ', U['w'] = 'ա', U['x'] = 'Ӽ', U['y'] = 'ʏ', U['z'] = 'ʐ', U['A'] = 'ǟ', U['B'] = 'ɮ', U['C'] = 'ƈ', U['D'] = 'ɖ', U['E'] = 'ɛ', U['F'] = 'ʄ', U['G'] = 'ɢ', U['H'] = 'ɦ', U['I'] = 'ɨ', U['J'] = 'ʝ', U['K'] = 'ӄ', U['L'] = 'ʟ', U['M'] = 'ʍ', U['N'] = 'ռ', U['O'] = 'օ', U['P'] = 'ք', U['Q'] = 'զ', U['R'] = 'ʀ', U['S'] = 'ֆ', U['T'] = 'ȶ', U['U'] = 'ʊ', U['V'] = 'ʋ', U['W'] = 'ա', U['X'] = 'Ӽ', U['Y'] = 'ʏ', U['Z'] = 'ʐ';
const squiggle3CharMap = U;
var V = {};
V['0'] = '𝟶', V['1'] = '𝟷', V['2'] = '𝟸', V['3'] = '𝟹', V['4'] = '𝟺', V['5'] = '𝟻', V['6'] = '𝟼', V['7'] = '𝟽', V['8'] = '𝟾', V['9'] = '𝟿', V['a'] = '𝚊', V['b'] = '𝚋', V['c'] = '𝚌', V['d'] = '𝚍', V['e'] = '𝚎', V['f'] = '𝚏', V['g'] = '𝚐', V['h'] = '𝚑', V['i'] = '𝚒', V['j'] = '𝚓', V['k'] = '𝚔', V['l'] = '𝚕', V['m'] = '𝚖', V['n'] = '𝚗', V['o'] = '𝚘', V['p'] = '𝚙', V['q'] = '𝚚', V['r'] = '𝚛', V['s'] = '𝚜', V['t'] = '𝚝', V['u'] = '𝚞', V['v'] = '𝚟', V['w'] = '𝚠', V['x'] = '𝚡', V['y'] = '𝚢', V['z'] = '𝚣', V['A'] = '𝙰', V['B'] = '𝙱', V['C'] = '𝙲', V['D'] = '𝙳', V['E'] = '𝙴', V['F'] = '𝙵', V['G'] = '𝙶', V['H'] = '𝙷', V['I'] = '𝙸', V['J'] = '𝙹', V['K'] = '𝙺', V['L'] = '𝙻', V['M'] = '𝙼', V['N'] = '𝙽', V['O'] = '𝙾', V['P'] = '𝙿', V['Q'] = '𝚀', V['R'] = '𝚁', V['S'] = '𝚂', V['T'] = '𝚃', V['U'] = '𝚄', V['V'] = '𝚅', V['W'] = '𝚆', V['X'] = '𝚇', V['Y'] = '𝚈', V['Z'] = '𝚉';
const monospaceCharMap = V;
var W = {};
W['0'] = '0', W['1'] = '1', W['2'] = '2', W['3'] = '3', W['4'] = '4', W['5'] = '5', W['6'] = '6', W['7'] = '7', W['8'] = '8', W['9'] = '9', W['a'] = '𝙖', W['b'] = '𝙗', W['c'] = '𝙘', W['d'] = '𝙙', W['e'] = '𝙚', W['f'] = '𝙛', W['g'] = '𝙜', W['h'] = '𝙝', W['i'] = '𝙞', W['j'] = '𝙟', W['k'] = '𝙠', W['l'] = '𝙡', W['m'] = '𝙢', W['n'] = '𝙣', W['o'] = '𝙤', W['p'] = '𝙥', W['q'] = '𝙦', W['r'] = '𝙧', W['s'] = '𝙨', W['t'] = '𝙩', W['u'] = '𝙪', W['v'] = '𝙫', W['w'] = '𝙬', W['x'] = '𝙭', W['y'] = '𝙮', W['z'] = '𝙯', W['A'] = '𝘼', W['B'] = '𝘽', W['C'] = '𝘾', W['D'] = '𝘿', W['E'] = '𝙀', W['F'] = '𝙁', W['G'] = '𝙂', W['H'] = '𝙃', W['I'] = '𝙄', W['J'] = '𝙅', W['K'] = '𝙆', W['L'] = '𝙇', W['M'] = '𝙈', W['N'] = '𝙉', W['O'] = '𝙊', W['P'] = '𝙋', W['Q'] = '𝙌', W['R'] = '𝙍', W['S'] = '𝙎', W['T'] = '𝙏', W['U'] = '𝙐', W['V'] = '𝙑', W['W'] = '𝙒', W['X'] = '𝙓', W['Y'] = '𝙔', W['Z'] = '𝙕';
const boldItalicCharMap = W;
var X = {};
X['0'] = '𝟎', X['1'] = '𝟏', X['2'] = '𝟐', X['3'] = '𝟑', X['4'] = '𝟒', X['5'] = '𝟓', X['6'] = '𝟔', X['7'] = '𝟕', X['8'] = '𝟖', X['9'] = '𝟗', X['a'] = '𝐚', X['b'] = '𝐛', X['c'] = '𝐜', X['d'] = '𝐝', X['e'] = '𝐞', X['f'] = '𝐟', X['g'] = '𝐠', X['h'] = '𝐡', X['i'] = '𝐢', X['j'] = '𝐣', X['k'] = '𝐤', X['l'] = '𝐥', X['m'] = '𝐦', X['n'] = '𝐧', X['o'] = '𝐨', X['p'] = '𝐩', X['q'] = '𝐪', X['r'] = '𝐫', X['s'] = '𝐬', X['t'] = '𝐭', X['u'] = '𝐮', X['v'] = '𝐯', X['w'] = '𝐰', X['x'] = '𝐱', X['y'] = '𝐲', X['z'] = '𝐳', X['A'] = '𝐀', X['B'] = '𝐁', X['C'] = '𝐂', X['D'] = '𝐃', X['E'] = '𝐄', X['F'] = '𝐅', X['G'] = '𝐆', X['H'] = '𝐇', X['I'] = '𝐈', X['J'] = '𝐉', X['K'] = '𝐊', X['L'] = '𝐋', X['M'] = '𝐌', X['N'] = '𝐍', X['O'] = '𝐎', X['P'] = '𝐏', X['Q'] = '𝐐', X['R'] = '𝐑', X['S'] = '𝐒', X['T'] = '𝐓', X['U'] = '𝐔', X['V'] = '𝐕', X['W'] = '𝐖', X['X'] = '𝐗', X['Y'] = '𝐘', X['Z'] = '𝐙';
const boldCharMap = X;
var Y = {};
Y['0'] = '0', Y['1'] = '1', Y['2'] = '2', Y['3'] = '3', Y['4'] = '4', Y['5'] = '5', Y['6'] = '6', Y['7'] = '7', Y['8'] = '8', Y['9'] = '9', Y['a'] = '𝘢', Y['b'] = '𝘣', Y['c'] = '𝘤', Y['d'] = '𝘥', Y['e'] = '𝘦', Y['f'] = '𝘧', Y['g'] = '𝘨', Y['h'] = '𝘩', Y['i'] = '𝘪', Y['j'] = '𝘫', Y['k'] = '𝘬', Y['l'] = '𝘭', Y['m'] = '𝘮', Y['n'] = '𝘯', Y['o'] = '𝘰', Y['p'] = '𝘱', Y['q'] = '𝘲', Y['r'] = '𝘳', Y['s'] = '𝘴', Y['t'] = '𝘵', Y['u'] = '𝘶', Y['v'] = '𝘷', Y['w'] = '𝘸', Y['x'] = '𝘹', Y['y'] = '𝘺', Y['z'] = '𝘻', Y['A'] = '𝘈', Y['B'] = '𝘉', Y['C'] = '𝘊', Y['D'] = '𝘋', Y['E'] = '𝘌', Y['F'] = '𝘍', Y['G'] = '𝘎', Y['H'] = '𝘏', Y['I'] = '𝘐', Y['J'] = '𝘑', Y['K'] = '𝘒', Y['L'] = '𝘓', Y['M'] = '𝘔', Y['N'] = '𝘕', Y['O'] = '𝘖', Y['P'] = '𝘗', Y['Q'] = '𝘘', Y['R'] = '𝘙', Y['S'] = '𝘚', Y['T'] = '𝘛', Y['U'] = '𝘜', Y['V'] = '𝘝', Y['W'] = '𝘞', Y['X'] = '𝘟', Y['Y'] = '𝘠', Y['Z'] = '𝘡';
const italicCharMap = Y;
var Z = {};
Z['0'] = '0', Z['1'] = '1', Z['2'] = '2', Z['3'] = '3', Z['4'] = '4', Z['5'] = '5', Z['6'] = '6', Z['7'] = '7', Z['8'] = '8', Z['9'] = '9', Z['a'] = 'α', Z['b'] = 'Ⴆ', Z['c'] = 'ƈ', Z['d'] = 'ԃ', Z['e'] = 'ҽ', Z['f'] = 'ϝ', Z['g'] = 'ɠ', Z['h'] = 'ԋ', Z['i'] = 'ι', Z['j'] = 'ʝ', Z['k'] = 'ƙ', Z['l'] = 'ʅ', Z['m'] = 'ɱ', Z['n'] = 'ɳ', Z['o'] = 'σ', Z['p'] = 'ρ', Z['q'] = 'ϙ', Z['r'] = 'ɾ', Z['s'] = 'ʂ', Z['t'] = 'ƚ', Z['u'] = 'υ', Z['v'] = 'ʋ', Z['w'] = 'ɯ', Z['x'] = 'x', Z['y'] = 'ყ', Z['z'] = 'ȥ', Z['A'] = 'A', Z['B'] = 'B', Z['C'] = 'C', Z['D'] = 'D', Z['E'] = 'E', Z['F'] = 'F', Z['G'] = 'G', Z['H'] = 'H', Z['I'] = 'I', Z['J'] = 'J', Z['K'] = 'K', Z['L'] = 'L', Z['M'] = 'M', Z['N'] = 'N', Z['O'] = 'O', Z['P'] = 'P', Z['Q'] = 'Q', Z['R'] = 'R', Z['S'] = 'S', Z['T'] = 'T', Z['U'] = 'U', Z['V'] = 'V', Z['W'] = 'W', Z['X'] = 'X', Z['Y'] = 'Y', Z['Z'] = 'Z';
const squiggle2CharMap = Z;
var a0 = {};
a0['0'] = '0', a0['1'] = '1', a0['2'] = '2', a0['3'] = '3', a0['4'] = '4', a0['5'] = '5', a0['6'] = '6', a0['7'] = '7', a0['8'] = '8', a0['9'] = '9', a0['a'] = '₳', a0['b'] = '฿', a0['c'] = '₵', a0['d'] = 'Đ', a0['e'] = 'Ɇ', a0['f'] = '₣', a0['g'] = '₲', a0['h'] = 'Ⱨ', a0['i'] = 'ł', a0['j'] = 'J', a0['k'] = '₭', a0['l'] = 'Ⱡ', a0['m'] = '₥', a0['n'] = '₦', a0['o'] = 'Ø', a0['p'] = '₱', a0['q'] = 'Q', a0['r'] = 'Ɽ', a0['s'] = '₴', a0['t'] = '₮', a0['u'] = 'Ʉ', a0['v'] = 'V', a0['w'] = '₩', a0['x'] = 'Ӿ', a0['y'] = 'Ɏ', a0['z'] = 'Ⱬ', a0['A'] = '₳', a0['B'] = '฿', a0['C'] = '₵', a0['D'] = 'Đ', a0['E'] = 'Ɇ', a0['F'] = '₣', a0['G'] = '₲', a0['H'] = 'Ⱨ', a0['I'] = 'ł', a0['J'] = 'J', a0['K'] = '₭', a0['L'] = 'Ⱡ', a0['M'] = '₥', a0['N'] = '₦', a0['O'] = 'Ø', a0['P'] = '₱', a0['Q'] = 'Q', a0['R'] = 'Ɽ', a0['S'] = '₴', a0['T'] = '₮', a0['U'] = 'Ʉ', a0['V'] = 'V', a0['W'] = '₩', a0['X'] = 'Ӿ', a0['Y'] = 'Ɏ', a0['Z'] = 'Ⱬ';

function _0x40a5(_0x193679, _0x5d3cd0) {
    var _0x4799d9 = _0x4799();
    return _0x40a5 = function(_0x40a593, _0x523076) {
        _0x40a593 = _0x40a593 - 0x148;
        var _0x998271 = _0x4799d9[_0x40a593];
        return _0x998271;
    }, _0x40a5(_0x193679, _0x5d3cd0);
}
const currencyCharMap = a0;
var a1 = {};
a1['0'] = '0', a1['1'] = '1', a1['2'] = '2', a1['3'] = '3', a1['4'] = '4', a1['5'] = '5', a1['6'] = '6', a1['7'] = '7', a1['8'] = '8', a1['9'] = '9', a1['a'] = 'å', a1['b'] = 'ß', a1['c'] = '¢', a1['d'] = 'Ð', a1['e'] = 'ê', a1['f'] = '£', a1['g'] = 'g', a1['h'] = 'h', a1['i'] = 'ï', a1['j'] = 'j', a1['k'] = 'k', a1['l'] = 'l', a1['m'] = 'm', a1['n'] = 'ñ', a1['o'] = 'ð', a1['p'] = 'þ', a1['q'] = 'q', a1['r'] = 'r', a1['s'] = '§', a1['t'] = '†', a1['u'] = 'µ', a1['v'] = 'v', a1['w'] = 'w', a1['x'] = 'x', a1['y'] = '¥', a1['z'] = 'z', a1['A'] = 'Ä', a1['B'] = 'ß', a1['C'] = 'Ç', a1['D'] = 'Ð', a1['E'] = 'È', a1['F'] = '£', a1['G'] = 'G', a1['H'] = 'H', a1['I'] = 'Ì', a1['J'] = 'J', a1['K'] = 'K', a1['L'] = 'L', a1['M'] = 'M', a1['N'] = 'ñ', a1['O'] = 'Ö', a1['P'] = 'þ', a1['Q'] = 'Q', a1['R'] = 'R', a1['S'] = '§', a1['T'] = '†', a1['U'] = 'Ú', a1['V'] = 'V', a1['W'] = 'W', a1['X'] = '×', a1['Y'] = '¥', a1['Z'] = 'Z';
const symbolsCharMap = a1;
var a2 = {};
a2['0'] = '0', a2['1'] = '1', a2['2'] = '2', a2['3'] = '3', a2['4'] = '4', a2['5'] = '5', a2['6'] = '6', a2['7'] = '7', a2['8'] = '8', a2['9'] = '9', a2['a'] = 'α', a2['b'] = 'в', a2['c'] = '¢', a2['d'] = '∂', a2['e'] = 'є', a2['f'] = 'ƒ', a2['g'] = 'g', a2['h'] = 'н', a2['i'] = 'ι', a2['j'] = 'נ', a2['k'] = 'к', a2['l'] = 'ℓ', a2['m'] = 'м', a2['n'] = 'η', a2['o'] = 'σ', a2['p'] = 'ρ', a2['q'] = 'q', a2['r'] = 'я', a2['s'] = 'ѕ', a2['t'] = 'т', a2['u'] = 'υ', a2['v'] = 'ν', a2['w'] = 'ω', a2['x'] = 'χ', a2['y'] = 'у', a2['z'] = 'z', a2['A'] = 'α', a2['B'] = 'в', a2['C'] = '¢', a2['D'] = '∂', a2['E'] = 'є', a2['F'] = 'ƒ', a2['G'] = 'g', a2['H'] = 'н', a2['I'] = 'ι', a2['J'] = 'נ', a2['K'] = 'к', a2['L'] = 'ℓ', a2['M'] = 'м', a2['N'] = 'η', a2['O'] = 'σ', a2['P'] = 'ρ', a2['Q'] = 'q', a2['R'] = 'я', a2['S'] = 'ѕ', a2['T'] = 'т', a2['U'] = 'υ', a2['V'] = 'ν', a2['W'] = 'ω', a2['X'] = 'χ', a2['Y'] = 'у', a2['Z'] = 'z';
const greekCharMap = a2;
var a3 = {};
a3['0'] = '⊘', a3['1'] = '𝟙', a3['2'] = 'ϩ', a3['3'] = 'Ӡ', a3['4'] = '५', a3['5'] = 'Ƽ', a3['6'] = 'Ϭ', a3['7'] = '7', a3['8'] = '𝟠', a3['9'] = '९', a3['a'] = 'ą', a3['b'] = 'ҍ', a3['c'] = 'ç', a3['d'] = 'ժ', a3['e'] = 'ҽ', a3['f'] = 'ƒ', a3['g'] = 'ց', a3['h'] = 'հ', a3['i'] = 'ì', a3['j'] = 'ʝ', a3['k'] = 'ҟ', a3['l'] = 'Ӏ', a3['m'] = 'ʍ', a3['n'] = 'ղ', a3['o'] = 'օ', a3['p'] = 'ք', a3['q'] = 'զ', a3['r'] = 'ɾ', a3['s'] = 'ʂ', a3['t'] = 'է', a3['u'] = 'մ', a3['v'] = 'ѵ', a3['w'] = 'ա', a3['x'] = '×', a3['y'] = 'վ', a3['z'] = 'Հ', a3['A'] = 'Ⱥ', a3['B'] = 'β', a3['C'] = '↻', a3['D'] = 'Ꭰ', a3['E'] = 'Ɛ', a3['F'] = 'Ƒ', a3['G'] = 'Ɠ', a3['H'] = 'Ƕ', a3['I'] = 'į', a3['J'] = 'ل', a3['K'] = 'Ҡ', a3['L'] = 'Ꝉ', a3['M'] = 'Ɱ', a3['N'] = 'ហ', a3['O'] = 'ට', a3['P'] = 'φ', a3['Q'] = 'Ҩ', a3['R'] = 'འ', a3['S'] = 'Ϛ', a3['T'] = 'Ͳ', a3['U'] = 'Ա', a3['V'] = 'Ỽ', a3['W'] = 'చ', a3['X'] = 'ჯ', a3['Y'] = 'Ӌ', a3['Z'] = 'ɀ';
const bentTextCharMap = a3;
var a4 = {};
a4['0'] = '0', a4['1'] = '1', a4['2'] = '2', a4['3'] = '3', a4['4'] = '4', a4['5'] = '5', a4['6'] = '6', a4['7'] = '7', a4['8'] = '8', a4['9'] = '9', a4['a'] = 'Λ', a4['b'] = 'B', a4['c'] = 'ᄃ', a4['d'] = 'D', a4['e'] = 'Σ', a4['f'] = 'F', a4['g'] = 'G', a4['h'] = 'Ή', a4['i'] = 'I', a4['j'] = 'J', a4['k'] = 'K', a4['l'] = 'ᄂ', a4['m'] = 'M', a4['n'] = 'П', a4['o'] = 'Ө', a4['p'] = 'P', a4['q'] = 'Q', a4['r'] = 'Я', a4['s'] = 'Ƨ', a4['t'] = 'Ƭ', a4['u'] = 'Ц', a4['v'] = 'V', a4['w'] = 'Щ', a4['x'] = 'X', a4['y'] = 'Y', a4['z'] = 'Z', a4['A'] = 'Λ', a4['B'] = 'B', a4['C'] = 'ᄃ', a4['D'] = 'D', a4['E'] = 'Σ', a4['F'] = 'F', a4['G'] = 'G', a4['H'] = 'Ή', a4['I'] = 'I', a4['J'] = 'J', a4['K'] = 'K', a4['L'] = 'ᄂ', a4['M'] = 'M', a4['N'] = 'П', a4['O'] = 'Ө', a4['P'] = 'P', a4['Q'] = 'Q', a4['R'] = 'Я', a4['S'] = 'Ƨ', a4['T'] = 'Ƭ', a4['U'] = 'Ц', a4['V'] = 'V', a4['W'] = 'Щ', a4['X'] = 'X', a4['Y'] = 'Y', a4['Z'] = 'Z';
const upperAnglesCharMap = a4;
var a5 = {};
a5['0'] = '₀', a5['1'] = '₁', a5['2'] = '₂', a5['3'] = '₃', a5['4'] = '₄', a5['5'] = '₅', a5['6'] = '₆', a5['7'] = '₇', a5['8'] = '₈', a5['9'] = '₉', a5['a'] = 'ₐ', a5['b'] = 'b', a5['c'] = 'c', a5['d'] = 'd', a5['e'] = 'ₑ', a5['f'] = 'f', a5['g'] = 'g', a5['h'] = 'ₕ', a5['i'] = 'ᵢ', a5['j'] = 'ⱼ', a5['k'] = 'ₖ', a5['l'] = 'ₗ', a5['m'] = 'ₘ', a5['n'] = 'ₙ', a5['o'] = 'ₒ', a5['p'] = 'ₚ', a5['q'] = 'q', a5['r'] = 'ᵣ', a5['s'] = 'ₛ', a5['t'] = 'ₜ', a5['u'] = 'ᵤ', a5['v'] = 'ᵥ', a5['w'] = 'w', a5['x'] = 'ₓ', a5['y'] = 'y', a5['z'] = 'z', a5['A'] = 'ₐ', a5['B'] = 'B', a5['C'] = 'C', a5['D'] = 'D', a5['E'] = 'ₑ', a5['F'] = 'F', a5['G'] = 'G', a5['H'] = 'ₕ', a5['I'] = 'ᵢ', a5['J'] = 'ⱼ', a5['K'] = 'ₖ', a5['L'] = 'ₗ', a5['M'] = 'ₘ', a5['N'] = 'ₙ', a5['O'] = 'ₒ', a5['P'] = 'ₚ', a5['Q'] = 'Q', a5['R'] = 'ᵣ', a5['S'] = 'ₛ', a5['T'] = 'ₜ', a5['U'] = 'ᵤ', a5['V'] = 'ᵥ', a5['W'] = 'W', a5['X'] = 'ₓ', a5['Y'] = 'Y', a5['Z'] = 'Z', a5['+'] = '₊', a5['-'] = '₋', a5['='] = '₌', a5['('] = '₍', a5[')'] = '₎';
const subscriptCharMap = a5;
var a6 = {};
a6['0'] = '⁰', a6['1'] = '¹', a6['2'] = '²', a6['3'] = '³', a6['4'] = '⁴', a6['5'] = '⁵', a6['6'] = '⁶', a6['7'] = '⁷', a6['8'] = '⁸', a6['9'] = '⁹', a6['a'] = 'ᵃ', a6['b'] = 'ᵇ', a6['c'] = 'ᶜ', a6['d'] = 'ᵈ', a6['e'] = 'ᵉ', a6['f'] = 'ᶠ', a6['g'] = 'ᵍ', a6['h'] = 'ʰ', a6['i'] = 'ⁱ', a6['j'] = 'ʲ', a6['k'] = 'ᵏ', a6['l'] = 'ˡ', a6['m'] = 'ᵐ', a6['n'] = 'ⁿ', a6['o'] = 'ᵒ', a6['p'] = 'ᵖ', a6['q'] = 'q', a6['r'] = 'ʳ', a6['s'] = 'ˢ', a6['t'] = 'ᵗ', a6['u'] = 'ᵘ', a6['v'] = 'ᵛ', a6['w'] = 'ʷ', a6['x'] = 'ˣ', a6['y'] = 'ʸ', a6['z'] = 'ᶻ', a6['A'] = 'ᴬ', a6['B'] = 'ᴮ', a6['C'] = 'ᶜ', a6['D'] = 'ᴰ', a6['E'] = 'ᴱ', a6['F'] = 'ᶠ', a6['G'] = 'ᴳ', a6['H'] = 'ᴴ', a6['I'] = 'ᴵ', a6['J'] = 'ᴶ', a6['K'] = 'ᴷ', a6['L'] = 'ᴸ', a6['M'] = 'ᴹ', a6['N'] = 'ᴺ', a6['O'] = 'ᴼ', a6['P'] = 'ᴾ', a6['Q'] = 'Q', a6['R'] = 'ᴿ', a6['S'] = 'ˢ', a6['T'] = 'ᵀ', a6['U'] = 'ᵁ', a6['V'] = 'ⱽ', a6['W'] = 'ᵂ', a6['X'] = 'ˣ', a6['Y'] = 'ʸ', a6['Z'] = 'ᶻ', a6['+'] = '⁺', a6['-'] = '⁻', a6['='] = '⁼', a6['('] = '⁽', a6[')'] = '⁾';
const superscriptCharMap = a6;
var a7 = {};
a7['0'] = '0', a7['1'] = '1', a7['2'] = '2', a7['3'] = '3', a7['4'] = '4', a7['5'] = '5', a7['6'] = '6', a7['7'] = '7', a7['8'] = '8', a7['9'] = '9', a7['a'] = 'ค', a7['b'] = '๒', a7['c'] = 'ς', a7['d'] = '๔', a7['e'] = 'є', a7['f'] = 'Ŧ', a7['g'] = 'ﻮ', a7['h'] = 'ђ', a7['i'] = 'เ', a7['j'] = 'ן', a7['k'] = 'к', a7['l'] = 'ɭ', a7['m'] = '๓', a7['n'] = 'ภ', a7['o'] = '๏', a7['p'] = 'ק', a7['q'] = 'ợ', a7['r'] = 'г', a7['s'] = 'ร', a7['t'] = 'Շ', a7['u'] = 'ย', a7['v'] = 'ש', a7['w'] = 'ฬ', a7['x'] = 'א', a7['y'] = 'ץ', a7['z'] = 'չ', a7['A'] = 'ค', a7['B'] = '๒', a7['C'] = 'ς', a7['D'] = '๔', a7['E'] = 'є', a7['F'] = 'Ŧ', a7['G'] = 'ﻮ', a7['H'] = 'ђ', a7['I'] = 'เ', a7['J'] = 'ן', a7['K'] = 'к', a7['L'] = 'ɭ', a7['M'] = '๓', a7['N'] = 'ภ', a7['O'] = '๏', a7['P'] = 'ק', a7['Q'] = 'ợ', a7['R'] = 'г', a7['S'] = 'ร', a7['T'] = 'Շ', a7['U'] = 'ย', a7['V'] = 'ש', a7['W'] = 'ฬ', a7['X'] = 'א', a7['Y'] = 'ץ', a7['Z'] = 'չ';
const squiggleCharMap = a7;
var a8 = {};
a8['0'] = '𝟘', a8['1'] = '𝟙', a8['2'] = '𝟚', a8['3'] = '𝟛', a8['4'] = '𝟜', a8['5'] = '𝟝', a8['6'] = '𝟞', a8['7'] = '𝟟', a8['8'] = '𝟠', a8['9'] = '𝟡', a8['a'] = '𝕒', a8['b'] = '𝕓', a8['c'] = '𝕔', a8['d'] = '𝕕', a8['e'] = '𝕖', a8['f'] = '𝕗', a8['g'] = '𝕘', a8['h'] = '𝕙', a8['i'] = '𝕚', a8['j'] = '𝕛', a8['k'] = '𝕜', a8['l'] = '𝕝', a8['m'] = '𝕞', a8['n'] = '𝕟', a8['o'] = '𝕠', a8['p'] = '𝕡', a8['q'] = '𝕢', a8['r'] = '𝕣', a8['s'] = '𝕤', a8['t'] = '𝕥', a8['u'] = '𝕦', a8['v'] = '𝕧', a8['w'] = '𝕨', a8['x'] = '𝕩', a8['y'] = '𝕪', a8['z'] = '𝕫', a8['A'] = '𝔸', a8['B'] = '𝔹', a8['C'] = 'ℂ', a8['D'] = '𝔻', a8['E'] = '𝔼', a8['F'] = '𝔽', a8['G'] = '𝔾', a8['H'] = 'ℍ', a8['I'] = '𝕀', a8['J'] = '𝕁', a8['K'] = '𝕂', a8['L'] = '𝕃', a8['M'] = '𝕄', a8['N'] = 'ℕ', a8['O'] = '𝕆', a8['P'] = 'ℙ', a8['Q'] = 'ℚ', a8['R'] = 'ℝ', a8['S'] = '𝕊', a8['T'] = '𝕋', a8['U'] = '𝕌', a8['V'] = '𝕍', a8['W'] = '𝕎', a8['X'] = '𝕏', a8['Y'] = '𝕐', a8['Z'] = 'ℤ';
const doubleStruckCharMap = a8;
var a9 = {};
a9['0'] = '0', a9['1'] = '1', a9['2'] = '2', a9['3'] = '3', a9['4'] = '4', a9['5'] = '5', a9['6'] = '6', a9['7'] = '7', a9['8'] = '8', a9['9'] = '9', a9['a'] = '𝖆', a9['b'] = '𝖇', a9['c'] = '𝖈', a9['d'] = '𝖉', a9['e'] = '𝖊', a9['f'] = '𝖋', a9['g'] = '𝖌', a9['h'] = '𝖍', a9['i'] = '𝖎', a9['j'] = '𝖏', a9['k'] = '𝖐', a9['l'] = '𝖑', a9['m'] = '𝖒', a9['n'] = '𝖓', a9['o'] = '𝖔', a9['p'] = '𝖕', a9['q'] = '𝖖', a9['r'] = '𝖗', a9['s'] = '𝖘', a9['t'] = '𝖙', a9['u'] = '𝖚', a9['v'] = '𝖛', a9['w'] = '𝖜', a9['x'] = '𝖝', a9['y'] = '𝖞', a9['z'] = '𝖟', a9['A'] = '𝕬', a9['B'] = '𝕭', a9['C'] = '𝕮', a9['D'] = '𝕯', a9['E'] = '𝕰', a9['F'] = '𝕱', a9['G'] = '𝕲', a9['H'] = '𝕳', a9['I'] = '𝕴', a9['J'] = '𝕵', a9['K'] = '𝕶', a9['L'] = '𝕷', a9['M'] = '𝕸', a9['N'] = '𝕹', a9['O'] = '𝕺', a9['P'] = '𝕻', a9['Q'] = '𝕼', a9['R'] = '𝕽', a9['S'] = '𝕾', a9['T'] = '𝕿', a9['U'] = '𝖀', a9['V'] = '𝖁', a9['W'] = '𝖂', a9['X'] = '𝖃', a9['Y'] = '𝖄', a9['Z'] = '𝖅';
const medievalCharMap = a9;
var aa = {};
aa['q'] = '🆀', aa['w'] = '🆆', aa['e'] = '🅴', aa['r'] = '🆁', aa['t'] = '🆃', aa['y'] = '🆈', aa['u'] = '🆄', aa['i'] = '🅸', aa['o'] = '🅾', aa['p'] = '🅿', aa['a'] = '🅰', aa['s'] = '🆂', aa['d'] = '🅳', aa['f'] = '🅵', aa['g'] = '🅶', aa['h'] = '🅷', aa['j'] = '🅹', aa['k'] = '🅺', aa['l'] = '🅻', aa['z'] = '🆉', aa['x'] = '🆇', aa['c'] = '🅲', aa['v'] = '🆅', aa['b'] = '🅱', aa['n'] = '🅽', aa['m'] = '🅼';
const invertedSquaresCharMap = aa;
var ab = {};
ab['0'] = '0', ab['1'] = '1', ab['2'] = '2', ab['3'] = '3', ab['4'] = '4', ab['5'] = '5', ab['6'] = '6', ab['7'] = '7', ab['8'] = '8', ab['9'] = '9', ab['a'] = '𝓪', ab['b'] = '𝓫', ab['c'] = '𝓬', ab['d'] = '𝓭', ab['e'] = '𝓮', ab['f'] = '𝓯', ab['g'] = '𝓰', ab['h'] = '𝓱', ab['i'] = '𝓲', ab['j'] = '𝓳', ab['k'] = '𝓴', ab['l'] = '𝓵', ab['m'] = '𝓶', ab['n'] = '𝓷', ab['o'] = '𝓸', ab['p'] = '𝓹', ab['q'] = '𝓺', ab['r'] = '𝓻', ab['s'] = '𝓼', ab['t'] = '𝓽', ab['u'] = '𝓾', ab['v'] = '𝓿', ab['w'] = '𝔀', ab['x'] = '𝔁', ab['y'] = '𝔂', ab['z'] = '𝔃', ab['A'] = '𝓐', ab['B'] = '𝓑', ab['C'] = '𝓒', ab['D'] = '𝓓', ab['E'] = '𝓔', ab['F'] = '𝓕', ab['G'] = '𝓖', ab['H'] = '𝓗', ab['I'] = '𝓘', ab['J'] = '𝓙', ab['K'] = '𝓚', ab['L'] = '𝓛', ab['M'] = '𝓜', ab['N'] = '𝓝', ab['O'] = '𝓞', ab['P'] = '𝓟', ab['Q'] = '𝓠', ab['R'] = '𝓡', ab['S'] = '𝓢', ab['T'] = '𝓣', ab['U'] = '𝓤', ab['V'] = '𝓥', ab['W'] = '𝓦', ab['X'] = '𝓧', ab['Y'] = '𝓨', ab['Z'] = '𝓩';
const cursiveCharMap = ab;
var ac = {};
ac['a'] = '𝔞', ac['b'] = '𝔟', ac['c'] = '𝔠', ac['d'] = '𝔡', ac['e'] = '𝔢', ac['f'] = '𝔣', ac['g'] = '𝔤', ac['h'] = '𝔥', ac['i'] = '𝔦', ac['j'] = '𝔧', ac['k'] = '𝔨', ac['l'] = '𝔩', ac['m'] = '𝔪', ac['n'] = '𝔫', ac['o'] = '𝔬', ac['p'] = '𝔭', ac['q'] = '𝔮', ac['r'] = '𝔯', ac['s'] = '𝔰', ac['t'] = '𝔱', ac['u'] = '𝔲', ac['v'] = '𝔳', ac['w'] = '𝔴', ac['x'] = '𝔵', ac['y'] = '𝔶', ac['z'] = '𝔷', ac['A'] = '𝔄', ac['B'] = '𝔅', ac['C'] = 'ℭ', ac['D'] = '𝔇', ac['E'] = '𝔈', ac['F'] = '𝔉', ac['G'] = '𝔊', ac['H'] = 'ℌ', ac['I'] = 'ℑ', ac['J'] = '𝔍', ac['K'] = '𝔎', ac['L'] = '𝔏', ac['M'] = '𝔐', ac['N'] = '𝔑', ac['O'] = '𝔒', ac['P'] = '𝔓', ac['Q'] = '𝔔', ac['R'] = 'ℜ', ac['S'] = '𝔖', ac['T'] = '𝔗', ac['U'] = '𝔘', ac['V'] = '𝔙', ac['W'] = '𝔚', ac['X'] = '𝔛', ac['Y'] = '𝔜', ac['Z'] = 'ℨ';
const oldEnglishCharMap = ac;
var ad = {};
ad['`'] = '`', ad['1'] = '１', ad['2'] = '２', ad['3'] = '３', ad['4'] = '４', ad['5'] = '５', ad['6'] = '６', ad['7'] = '７', ad['8'] = '８', ad['9'] = '９', ad['0'] = '０', ad['-'] = '－', ad['='] = '＝', ad['~'] = '~', ad['!'] = '！', ad['@'] = '＠', ad['#'] = '＃', ad['$'] = '＄', ad['%'] = '％', ad['^'] = '^', ad['&'] = '＆', ad['*'] = '＊', ad['('] = '（', ad[')'] = '）', ad['_'] = '_', ad['+'] = '＋', ad['q'] = 'ｑ', ad['w'] = 'ｗ', ad['e'] = 'ｅ', ad['r'] = 'ｒ', ad['t'] = 'ｔ', ad['y'] = 'ｙ', ad['u'] = 'ｕ', ad['i'] = 'ｉ', ad['o'] = 'ｏ', ad['p'] = 'ｐ', ad['['] = '[', ad[']'] = ']', ad['\x5c'] = '\x5c', ad['Q'] = 'Ｑ', ad['W'] = 'Ｗ', ad['E'] = 'Ｅ', ad['R'] = 'Ｒ', ad['T'] = 'Ｔ', ad['Y'] = 'Ｙ', ad['U'] = 'Ｕ', ad['I'] = 'Ｉ', ad['O'] = 'Ｏ', ad['P'] = 'Ｐ', ad['{'] = '{', ad['}'] = '}', ad['|'] = '|', ad['a'] = 'ａ', ad['s'] = 'ｓ', ad['d'] = 'ｄ', ad['f'] = 'ｆ', ad['g'] = 'ｇ', ad['h'] = 'ｈ', ad['j'] = 'ｊ', ad['k'] = 'ｋ', ad['l'] = 'ｌ', ad[';'] = '；', ad['\x27'] = '＇', ad['A'] = 'Ａ', ad['S'] = 'Ｓ', ad['D'] = 'Ｄ', ad['F'] = 'Ｆ', ad['G'] = 'Ｇ', ad['H'] = 'Ｈ', ad['J'] = 'Ｊ', ad['K'] = 'Ｋ', ad['L'] = 'Ｌ', ad[':'] = '：', ad['\x22'] = '\x22', ad['z'] = 'ｚ', ad['x'] = 'ｘ', ad['c'] = 'ｃ', ad['v'] = 'ｖ', ad['b'] = 'ｂ', ad['n'] = 'ｎ', ad['m'] = 'ｍ', ad[','] = '，', ad['.'] = '．', ad['/'] = '／', ad['Z'] = 'Ｚ', ad['X'] = 'Ｘ', ad['C'] = 'Ｃ', ad['V'] = 'Ｖ', ad['B'] = 'Ｂ', ad['N'] = 'Ｎ', ad['M'] = 'Ｍ', ad['<'] = '<', ad['>'] = '>', ad['?'] = '？';
const wideTextCharMap = ad;

function Lunicode() {
    var _0x5b0fae = _0x46b0bf,
        _0x2dc319 = {};
    _0x2dc319['a'] = 'ɐ', _0x2dc319['b'] = 'q', _0x2dc319['c'] = 'ɔ', _0x2dc319['d'] = 'p', _0x2dc319['e'] = 'ǝ', _0x2dc319['f'] = 'ɟ', _0x2dc319['g'] = 'ɓ', _0x2dc319['h'] = 'ɥ', _0x2dc319['i'] = 'ı', _0x2dc319['j'] = 'ɾ', _0x2dc319['k'] = 'ʞ', _0x2dc319['l'] = 'l', _0x2dc319['m'] = 'ɯ', _0x2dc319['n'] = 'u', _0x2dc319['r'] = 'ɹ', _0x2dc319['t'] = 'ʇ', _0x2dc319['v'] = 'ʌ', _0x2dc319['w'] = 'ʍ', _0x2dc319['y'] = 'ʎ', _0x2dc319['A'] = '∀', _0x2dc319['B'] = 'ᙠ', _0x2dc319['C'] = 'Ɔ', _0x2dc319['D'] = 'ᗡ', _0x2dc319['E'] = 'Ǝ', _0x2dc319['F'] = 'Ⅎ', _0x2dc319['G'] = '⅁', _0x2dc319['J'] = 'ſ', _0x2dc319['K'] = '⋊', _0x2dc319['L'] = '˥', _0x2dc319['M'] = 'W', _0x2dc319['P'] = 'Ԁ', _0x2dc319['Q'] = 'Ό', _0x2dc319['R'] = 'ᴚ', _0x2dc319['T'] = '⊥', _0x2dc319['U'] = '∩', _0x2dc319['V'] = 'Λ', _0x2dc319['Y'] = '⅄', _0x2dc319['1'] = '⇂', _0x2dc319['2'] = 'ᄅ', _0x2dc319['3'] = 'Ɛ', _0x2dc319['4'] = 'ㄣ', _0x2dc319['5'] = 'ގ', _0x2dc319['6'] = '9', _0x2dc319['7'] = 'ㄥ', _0x2dc319['&'] = '⅋', _0x2dc319['.'] = '˙', _0x2dc319['\x22'] = '„', _0x2dc319[';'] = '؛', _0x2dc319['['] = ']', _0x2dc319['('] = ')', _0x2dc319['{'] = '}', _0x2dc319['?'] = '¿', _0x2dc319['!'] = '¡', _0x2dc319['\x27'] = ',', _0x2dc319['<'] = '>', _0x2dc319['‾'] = '_', _0x2dc319['¯'] = '_', _0x2dc319['‿'] = '⁀', _0x2dc319['⁅'] = '⁆', _0x2dc319['∴'] = '∵', _0x2dc319['\x0d'] = '\x0a', _0x2dc319['ß'] = 'ᙠ', _0x2dc319['̈'] = '̤', _0x2dc319['ä'] = 'ɐ̤', _0x2dc319['ö'] = 'o̤', _0x2dc319['ü'] = 'n̤', _0x2dc319['Ä'] = '∀̤', _0x2dc319['Ö'] = 'O̤', _0x2dc319['Ü'] = '∩̤', _0x2dc319['´'] = '\x20̗', _0x2dc319['é'] = 'ǝ̗', _0x2dc319['á'] = 'ɐ̗', _0x2dc319['ó'] = 'o̗', _0x2dc319['ú'] = 'n̗', _0x2dc319['É'] = 'Ǝ̗', _0x2dc319['Á'] = '∀̗', _0x2dc319['Ó'] = 'O̗', _0x2dc319['Ú'] = '∩̗', _0x2dc319['`'] = '\x20̖', _0x2dc319['è'] = 'ǝ̖', _0x2dc319['à'] = 'ɐ̖', _0x2dc319['ò'] = 'o̖', _0x2dc319['ù'] = 'n̖', _0x2dc319['È'] = 'Ǝ̖', _0x2dc319['À'] = '∀̖', _0x2dc319['Ò'] = 'O̖', _0x2dc319['Ù'] = '∩̖', _0x2dc319['^'] = '\x20̮', _0x2dc319['ê'] = 'ǝ̮', _0x2dc319['â'] = 'ɐ̮', _0x2dc319['ô'] = 'o̮', _0x2dc319['û'] = 'n̮', _0x2dc319['Ê'] = 'Ǝ̮', _0x2dc319['Â'] = '∀̮', _0x2dc319['Ô'] = 'O̮', _0x2dc319['Û'] = '∩̮';
    var _0x2dc112 = {};
    _0x2dc112[_0x5b0fae(0x235)] = function() {
        var _0x2dd80c = _0x5b0fae;
        for (i in this[_0x2dd80c(0x21d)]) this[_0x2dd80c(0x21d)][this[_0x2dd80c(0x21d)][i]] = i;
    }, _0x2dc112['encode'] = function(_0x313696) {
        var _0x3e988b = _0x5b0fae;
        for (var _0x453b8d, _0x23563f = [], _0x5b2211 = 0x0, _0x332a29 = _0x313696['length']; _0x332a29 > _0x5b2211; _0x5b2211++) _0x453b8d = _0x313696[_0x3e988b(0x5af)](_0x5b2211), _0x5b2211 > 0x0 && ('̤' == _0x453b8d || '̗' == _0x453b8d || '̖' == _0x453b8d || '̮' == _0x453b8d) ? (_0x453b8d = this[_0x3e988b(0x21d)][_0x313696['charAt'](_0x5b2211 - 0x1) + _0x453b8d], _0x23563f[_0x3e988b(0x36e)]()) : (_0x453b8d = this[_0x3e988b(0x21d)][_0x453b8d], _0x3e988b(0x3a8) == typeof _0x453b8d && (_0x453b8d = _0x313696['charAt'](_0x5b2211))), _0x23563f['push'](_0x453b8d);
        return _0x23563f['reverse']()['join']('');
    }, _0x2dc112['decode'] = function(_0x5111bb) {
        var _0x2bac28 = _0x5b0fae;
        for (var _0x1eddaa, _0x4af120 = [], _0x9da8c4 = 0x0, _0x4cc009 = _0x5111bb['length']; _0x4cc009 > _0x9da8c4; _0x9da8c4++) _0x1eddaa = _0x5111bb['charAt'](_0x9da8c4), _0x9da8c4 > 0x0 && ('̤' == _0x1eddaa || '̗' == _0x1eddaa || '̖' == _0x1eddaa || '̮' == _0x1eddaa) ? (_0x1eddaa = this[_0x2bac28(0x21d)][_0x5111bb[_0x2bac28(0x5af)](_0x9da8c4 - 0x1) + _0x1eddaa], _0x4af120[_0x2bac28(0x36e)]()) : (_0x1eddaa = this[_0x2bac28(0x21d)][_0x1eddaa], _0x2bac28(0x3a8) == typeof _0x1eddaa && (_0x1eddaa = _0x5111bb['charAt'](_0x9da8c4))), _0x4af120['push'](_0x1eddaa);
        return _0x4af120[_0x2bac28(0x53a)]()[_0x2bac28(0x59d)]('');
    }, _0x2dc112['map'] = _0x2dc319;
    var _0x5d0bc3 = {};
    _0x5d0bc3['a'] = 'ɒ', _0x5d0bc3['b'] = 'd', _0x5d0bc3['c'] = 'ɔ', _0x5d0bc3['e'] = 'ɘ', _0x5d0bc3['f'] = 'Ꮈ', _0x5d0bc3['g'] = 'ǫ', _0x5d0bc3['h'] = 'ʜ', _0x5d0bc3['j'] = 'ꞁ', _0x5d0bc3['k'] = 'ʞ', _0x5d0bc3['l'] = '|', _0x5d0bc3['n'] = 'ᴎ', _0x5d0bc3['p'] = 'q', _0x5d0bc3['r'] = 'ɿ', _0x5d0bc3['s'] = 'ꙅ', _0x5d0bc3['t'] = 'ƚ', _0x5d0bc3['y'] = 'ʏ', _0x5d0bc3['z'] = 'ƹ', _0x5d0bc3['B'] = 'ᙠ', _0x5d0bc3['C'] = 'Ɔ', _0x5d0bc3['D'] = 'ᗡ', _0x5d0bc3['E'] = 'Ǝ', _0x5d0bc3['F'] = 'ꟻ', _0x5d0bc3['G'] = 'Ꭾ', _0x5d0bc3['J'] = 'Ⴑ', _0x5d0bc3['K'] = '⋊', _0x5d0bc3['L'] = '⅃', _0x5d0bc3['N'] = 'Ͷ', _0x5d0bc3['P'] = 'ꟼ', _0x5d0bc3['Q'] = 'Ọ', _0x5d0bc3['R'] = 'Я', _0x5d0bc3['S'] = 'Ꙅ', _0x5d0bc3['Z'] = 'Ƹ', _0x5d0bc3['1'] = '', _0x5d0bc3['2'] = '', _0x5d0bc3['3'] = '', _0x5d0bc3['4'] = '', _0x5d0bc3['5'] = '', _0x5d0bc3['6'] = '', _0x5d0bc3['7'] = '', _0x5d0bc3['&'] = '', _0x5d0bc3[';'] = '', _0x5d0bc3['['] = ']', _0x5d0bc3['('] = ')', _0x5d0bc3['{'] = '}', _0x5d0bc3['?'] = '⸮', _0x5d0bc3['<'] = '>', _0x5d0bc3['ä'] = 'ɒ̈', _0x5d0bc3['ß'] = 'ᙠ', _0x5d0bc3['´'] = '`', _0x5d0bc3['é'] = 'ɘ̀', _0x5d0bc3['á'] = 'ɒ̀', _0x5d0bc3['ó'] = 'ò', _0x5d0bc3['ú'] = 'ù', _0x5d0bc3['É'] = 'Ǝ̀', _0x5d0bc3['Á'] = 'À', _0x5d0bc3['Ó'] = 'Ò', _0x5d0bc3['Ú'] = 'Ù', _0x5d0bc3['`'] = '´', _0x5d0bc3['è'] = 'ɘ́', _0x5d0bc3['à'] = 'ɒ́', _0x5d0bc3['È'] = 'Ǝ́', _0x5d0bc3['ê'] = 'ɘ̂', _0x5d0bc3['â'] = 'ɒ̂', _0x5d0bc3['Ê'] = 'Ǝ̂', _0x5d0bc3['Ø'] = 'ᴓ', _0x5d0bc3['ø'] = 'ᴓ';
    var _0x7dfe86 = {};
    _0x7dfe86['init'] = function() {
        var _0x237f15 = _0x5b0fae;
        for (i in this[_0x237f15(0x21d)]) this['map'][this[_0x237f15(0x21d)][i]] = i;
    }, _0x7dfe86[_0x5b0fae(0x469)] = function(_0x4d2f3a) {
        var _0x258dcf = _0x5b0fae;
        for (var _0x4e7328, _0x70bfd8 = [], _0x512055 = [], _0x4a22b6 = 0x0, _0x38f0ef = _0x4d2f3a[_0x258dcf(0x164)]; _0x38f0ef > _0x4a22b6; _0x4a22b6++) _0x4e7328 = _0x4d2f3a[_0x258dcf(0x5af)](_0x4a22b6), _0x4a22b6 > 0x0 && ('̈' == _0x4e7328 || '̀' == _0x4e7328 || '́' == _0x4e7328 || '̂' == _0x4e7328) ? (_0x4e7328 = this[_0x258dcf(0x21d)][_0x4d2f3a[_0x258dcf(0x5af)](_0x4a22b6 - 0x1) + _0x4e7328], _0x70bfd8[_0x258dcf(0x36e)]()) : (_0x4e7328 = this[_0x258dcf(0x21d)][_0x4e7328], _0x258dcf(0x3a8) == typeof _0x4e7328 && (_0x4e7328 = _0x4d2f3a[_0x258dcf(0x5af)](_0x4a22b6))), '\x0a' == _0x4e7328 ? (_0x512055[_0x258dcf(0x38a)](_0x70bfd8[_0x258dcf(0x53a)]()[_0x258dcf(0x59d)]('')), _0x70bfd8 = []) : _0x70bfd8[_0x258dcf(0x38a)](_0x4e7328);
        return _0x512055['push'](_0x70bfd8[_0x258dcf(0x53a)]()[_0x258dcf(0x59d)]('')), _0x512055[_0x258dcf(0x59d)]('\x0a');
    }, _0x7dfe86[_0x5b0fae(0x5a9)] = function(_0x347398) {
        var _0x368203 = _0x5b0fae;
        for (var _0x48b031, _0x547165 = [], _0x464512 = [], _0xadd44f = 0x0, _0x2d8f36 = _0x347398[_0x368203(0x164)]; _0x2d8f36 > _0xadd44f; _0xadd44f++) _0x48b031 = _0x347398['charAt'](_0xadd44f), _0xadd44f > 0x0 && ('̈' == _0x48b031 || '̀' == _0x48b031 || '́' == _0x48b031 || '̂' == _0x48b031) ? (_0x48b031 = this['map'][_0x347398[_0x368203(0x5af)](_0xadd44f - 0x1) + _0x48b031], _0x547165['pop']()) : (_0x48b031 = this[_0x368203(0x21d)][_0x48b031], _0x368203(0x3a8) == typeof _0x48b031 && (_0x48b031 = _0x347398[_0x368203(0x5af)](_0xadd44f))), '\x0a' == _0x48b031 ? (_0x464512[_0x368203(0x38a)](_0x547165['reverse']()['join']('')), _0x547165 = []) : _0x547165[_0x368203(0x38a)](_0x48b031);
        return _0x464512[_0x368203(0x38a)](_0x547165[_0x368203(0x53a)]()[_0x368203(0x59d)]('')), _0x464512[_0x368203(0x59d)]('\x0a');
    }, _0x7dfe86['map'] = _0x5d0bc3;
    var _0x1b7a62 = {};
    _0x1b7a62[_0x5b0fae(0x2ec)] = !0x0, _0x1b7a62[_0x5b0fae(0x40a)] = !0x0, _0x1b7a62[_0x5b0fae(0x5a5)] = !0x0, _0x1b7a62[_0x5b0fae(0x602)] = 0xf, _0x1b7a62['randomization'] = 0x64;
    var _0x3edf2d = {};
    _0x3edf2d[_0x5b0fae(0x235)] = function() {
        var _0x2542c5 = _0x5b0fae;
        for (var _0x93d2b1 = 0x300; 0x315 >= _0x93d2b1; _0x93d2b1++) this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String['fromCharCode'](_0x93d2b1));
        for (var _0x93d2b1 = 0x316; 0x333 >= _0x93d2b1; _0x93d2b1++) 0x31a != _0x93d2b1 && 0x31b != _0x93d2b1 && this['diacriticsBottom'][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](_0x93d2b1));
        this[_0x2542c5(0x298)]['push'](String[_0x2542c5(0x15c)](0x31a)), this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x31b));
        for (var _0x93d2b1 = 0x334; 0x338 >= _0x93d2b1; _0x93d2b1++) this[_0x2542c5(0x41c)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](_0x93d2b1));
        for (var _0x93d2b1 = 0x339; 0x33c >= _0x93d2b1; _0x93d2b1++) this[_0x2542c5(0x258)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](_0x93d2b1));
        for (var _0x93d2b1 = 0x33d; 0x344 >= _0x93d2b1; _0x93d2b1++) this['diacriticsTop'][_0x2542c5(0x38a)](String['fromCharCode'](_0x93d2b1));
        this[_0x2542c5(0x298)]['push'](String['fromCharCode'](0x344)), this[_0x2542c5(0x258)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x345)), this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x346)), this[_0x2542c5(0x258)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x347)), this[_0x2542c5(0x258)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x348)), this[_0x2542c5(0x258)][_0x2542c5(0x38a)](String['fromCharCode'](0x349)), this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x34a)), this[_0x2542c5(0x298)]['push'](String[_0x2542c5(0x15c)](0x34b)), this['diacriticsTop'][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x34c)), this[_0x2542c5(0x258)]['push'](String[_0x2542c5(0x15c)](0x34d)), this[_0x2542c5(0x258)]['push'](String[_0x2542c5(0x15c)](0x34e)), this[_0x2542c5(0x298)]['push'](String[_0x2542c5(0x15c)](0x350)), this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x351)), this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String['fromCharCode'](0x352)), this[_0x2542c5(0x258)][_0x2542c5(0x38a)](String['fromCharCode'](0x353)), this[_0x2542c5(0x258)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x354)), this[_0x2542c5(0x258)][_0x2542c5(0x38a)](String['fromCharCode'](0x355)), this[_0x2542c5(0x258)]['push'](String[_0x2542c5(0x15c)](0x356)), this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String['fromCharCode'](0x357)), this['diacriticsTop'][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x358)), this[_0x2542c5(0x258)][_0x2542c5(0x38a)](String['fromCharCode'](0x359)), this[_0x2542c5(0x258)]['push'](String[_0x2542c5(0x15c)](0x35a)), this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String['fromCharCode'](0x35b)), this[_0x2542c5(0x258)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x35c)), this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String['fromCharCode'](0x35d)), this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x35d)), this[_0x2542c5(0x258)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x35f)), this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String[_0x2542c5(0x15c)](0x360)), this[_0x2542c5(0x298)][_0x2542c5(0x38a)](String['fromCharCode'](0x361));
    }, _0x3edf2d['encode'] = function(_0x28f682) {
        var _0x2a72a2 = _0x5b0fae,
            _0x3cbd17, _0x1e680e = '';
        for (i in _0x28f682) {
            if (_0x3cbd17 = _0x28f682[i], this[_0x2a72a2(0x5a7)][_0x2a72a2(0x40a)] && (_0x3cbd17 += this[_0x2a72a2(0x41c)][Math[_0x2a72a2(0x244)](Math[_0x2a72a2(0x2df)]() * this['diacriticsMiddle'][_0x2a72a2(0x164)])]), this['options']['top']) {
                for (var _0x37eef1 = this[_0x2a72a2(0x298)]['length'] - 0x1, _0x5d8a03 = 0x0, _0x4ac31b = this[_0x2a72a2(0x5a7)]['maxHeight'] - Math['random']() * (this['options'][_0x2a72a2(0x253)] / 0x64 * this[_0x2a72a2(0x5a7)][_0x2a72a2(0x602)]); _0x4ac31b > _0x5d8a03; _0x5d8a03++) _0x3cbd17 += this[_0x2a72a2(0x298)][Math[_0x2a72a2(0x244)](Math[_0x2a72a2(0x2df)]() * _0x37eef1)];
            }
            if (this[_0x2a72a2(0x5a7)][_0x2a72a2(0x5a5)]) {
                for (var _0x2bc143 = this[_0x2a72a2(0x258)][_0x2a72a2(0x164)] - 0x1, _0x5d8a03 = 0x0, _0x4ac31b = this[_0x2a72a2(0x5a7)]['maxHeight'] - Math[_0x2a72a2(0x2df)]() * (this[_0x2a72a2(0x5a7)][_0x2a72a2(0x253)] / 0x64 * this['options']['maxHeight']); _0x4ac31b > _0x5d8a03; _0x5d8a03++) _0x3cbd17 += this[_0x2a72a2(0x258)][Math[_0x2a72a2(0x244)](Math[_0x2a72a2(0x2df)]() * _0x2bc143)];
            }
            _0x1e680e += _0x3cbd17;
        }
        return _0x1e680e;
    }, _0x3edf2d[_0x5b0fae(0x5a9)] = function(_0x4c49b4) {
        var _0x447852 = _0x5b0fae,
            _0x1a8ac1, _0x2aff48 = '';
        for (i in _0x4c49b4) _0x1a8ac1 = _0x4c49b4[i][_0x447852(0x3af)](0x0), (0x300 > _0x1a8ac1 || _0x1a8ac1 > 0x361) && (_0x2aff48 += _0x4c49b4[i]);
        return _0x2aff48;
    }, _0x3edf2d[_0x5b0fae(0x298)] = [], _0x3edf2d[_0x5b0fae(0x41c)] = [], _0x3edf2d['diacriticsBottom'] = [], _0x3edf2d[_0x5b0fae(0x5a7)] = _0x1b7a62;
    var _0x5382ba = {};
    _0x5382ba[_0x5b0fae(0x235)] = function() {
        var _0x4e7a45 = _0x5b0fae;
        for (var _0x400d87 = 0x31; 0x39 >= _0x400d87; _0x400d87++) this[_0x4e7a45(0x21d)][String['fromCharCode'](_0x400d87)] = String[_0x4e7a45(0x15c)](_0x400d87 + 0x242f);
        this[_0x4e7a45(0x21d)][0x0] = '⓪';
        for (var _0x400d87 = 0x41; 0x5a >= _0x400d87; _0x400d87++) this[_0x4e7a45(0x21d)][String[_0x4e7a45(0x15c)](_0x400d87)] = String['fromCharCode'](_0x400d87 + 0x2475);
        for (var _0x400d87 = 0x61; 0x7a >= _0x400d87; _0x400d87++) this[_0x4e7a45(0x21d)][String[_0x4e7a45(0x15c)](_0x400d87)] = String['fromCharCode'](_0x400d87 + 0x246f);
        for (_0x400d87 in this[_0x4e7a45(0x21d)]) this[_0x4e7a45(0x44f)][this[_0x4e7a45(0x21d)][_0x400d87]] = _0x400d87;
    }, _0x5382ba[_0x5b0fae(0x469)] = function(_0x38cf00) {
        var _0x542d40 = _0x5b0fae,
            _0x280f70, _0x563f1e = '',
            _0x2c20a9 = !0x0;
        for (i in _0x38cf00) _0x280f70 = this[_0x542d40(0x21d)][_0x38cf00[i]], 'undefined' == typeof _0x280f70 && (_0x38cf00[i][_0x542d40(0x3af)](0x0) >= 0x21 ? (_0x280f70 = _0x38cf00[i] + String['fromCharCode'](0x20dd), _0x2c20a9 || (_0x280f70 = String[_0x542d40(0x15c)](0x202f) + String[_0x542d40(0x15c)](0xa0) + String[_0x542d40(0x15c)](0xa0) + String[_0x542d40(0x15c)](0x202f) + _0x280f70)) : _0x280f70 = _0x38cf00[i]), _0x563f1e += _0x280f70, _0x2c20a9 = '\x0a' == _0x280f70;
        return _0x563f1e;
    }, _0x5382ba[_0x5b0fae(0x5a9)] = function(_0x58233d) {
        var _0xdb8780 = _0x5b0fae,
            _0x4867c2, _0x1b4a16 = '',
            _0x3e4161 = '';
        for (i in _0x58233d) _0x4867c2 = this[_0xdb8780(0x44f)][_0x58233d[i]], _0x1b4a16 += _0xdb8780(0x3a8) == typeof _0x4867c2 ? _0x58233d[i] : _0x4867c2;
        for (i in _0x1b4a16) _0x4867c2 = _0x1b4a16[i]['charCodeAt'](0x0), 0xa0 != _0x4867c2 && 0x202f != _0x4867c2 && 0x20dd != _0x4867c2 && (_0x3e4161 += _0x1b4a16[i]);
        return _0x3e4161;
    }, _0x5382ba[_0x5b0fae(0x21d)] = {}, _0x5382ba['mapInverse'] = {};
    var _0x85b613 = {};
    _0x85b613[_0x5b0fae(0x235)] = function() {}, _0x85b613[_0x5b0fae(0x469)] = function(_0x59f359) {
        var _0x2d552a = _0x5b0fae,
            _0x277e69, _0x46375b = '',
            _0xd2eb16 = !0x0;
        for (i in _0x59f359) _0x59f359[i][_0x2d552a(0x3af)](0x0) >= 0x21 ? (_0x277e69 = _0x59f359[i] + String[_0x2d552a(0x15c)](0x20de), _0xd2eb16 || (_0x277e69 = String[_0x2d552a(0x15c)](0x202f) + String['fromCharCode'](0xa0) + String[_0x2d552a(0x15c)](0xa0) + String[_0x2d552a(0x15c)](0x202f) + _0x277e69)) : _0x277e69 = _0x59f359[i], _0x46375b += _0x277e69, _0xd2eb16 = '\x0a' == _0x277e69;
        return _0x46375b;
    }, _0x85b613[_0x5b0fae(0x5a9)] = function(_0x101c00) {
        var _0x4e8f17 = _0x5b0fae,
            _0x550eed, _0x5e65a7 = '';
        for (i in _0x101c00) _0x550eed = _0x101c00[i][_0x4e8f17(0x3af)](0x0), 0xa0 != _0x550eed && 0x202f != _0x550eed && 0x20de != _0x550eed && (_0x5e65a7 += _0x101c00[i]);
        return _0x5e65a7;
    };
    var _0x59e84b = {};
    _0x59e84b['init'] = function() {}, _0x59e84b[_0x5b0fae(0x469)] = function(_0x3cd372) {
        var _0x5e1fe5 = _0x5b0fae,
            _0x4be5a7, _0x5d08af = '',
            _0x2af67e = !0x0;
        for (i in _0x3cd372) _0x3cd372[i]['charCodeAt'](0x0) >= 0x21 ? (_0x4be5a7 = _0x3cd372[i] + String[_0x5e1fe5(0x15c)](0x20e3), _0x2af67e || (_0x4be5a7 = String[_0x5e1fe5(0x15c)](0xa0) + String[_0x5e1fe5(0x15c)](0xa0) + String[_0x5e1fe5(0x15c)](0xa0) + _0x4be5a7)) : _0x4be5a7 = _0x3cd372[i], _0x5d08af += _0x4be5a7, _0x2af67e = '\x0a' == _0x4be5a7;
        return _0x5d08af;
    }, _0x59e84b[_0x5b0fae(0x5a9)] = function(_0x2db532) {
        var _0x519fef = _0x5b0fae,
            _0x1f469c, _0x120fdd = '';
        for (i in _0x2db532) _0x1f469c = _0x2db532[i][_0x519fef(0x3af)](0x0), 0xa0 != _0x1f469c && 0x202f != _0x1f469c && 0x20e3 != _0x1f469c && (_0x120fdd += _0x2db532[i]);
        return _0x120fdd;
    };
    var _0x1c5483 = {};
    _0x1c5483['a'] = 'ą', _0x1c5483['b'] = 'ҍ', _0x1c5483['c'] = 'ç', _0x1c5483['d'] = 'ժ', _0x1c5483['e'] = 'ҽ', _0x1c5483['f'] = 'ƒ', _0x1c5483['g'] = 'ց', _0x1c5483['h'] = 'հ', _0x1c5483['i'] = 'ì', _0x1c5483['j'] = 'ʝ', _0x1c5483['k'] = 'ҟ', _0x1c5483['l'] = 'Ӏ', _0x1c5483['m'] = 'ʍ', _0x1c5483['n'] = 'ղ', _0x1c5483['o'] = 'օ', _0x1c5483['p'] = 'ք', _0x1c5483['q'] = 'զ', _0x1c5483['r'] = 'ɾ', _0x1c5483['s'] = 'ʂ', _0x1c5483['t'] = 'է', _0x1c5483['u'] = 'մ', _0x1c5483['v'] = 'ѵ', _0x1c5483['w'] = 'ա', _0x1c5483['x'] = '×', _0x1c5483['y'] = 'վ', _0x1c5483['z'] = 'Հ', _0x1c5483['A'] = 'Ⱥ', _0x1c5483['B'] = 'β', _0x1c5483['C'] = '↻', _0x1c5483['D'] = 'Ꭰ', _0x1c5483['E'] = 'Ɛ', _0x1c5483['F'] = 'Ƒ', _0x1c5483['G'] = 'Ɠ', _0x1c5483['H'] = 'Ƕ', _0x1c5483['I'] = 'į', _0x1c5483['J'] = 'ل', _0x1c5483['K'] = 'Ҡ', _0x1c5483['L'] = 'Ꝉ', _0x1c5483['M'] = 'Ɱ', _0x1c5483['N'] = 'ហ', _0x1c5483['O'] = 'ට', _0x1c5483['P'] = 'φ', _0x1c5483['Q'] = 'Ҩ', _0x1c5483['R'] = 'འ', _0x1c5483['S'] = 'Ϛ', _0x1c5483['T'] = 'Ͳ', _0x1c5483['U'] = 'Ա', _0x1c5483['V'] = 'Ỽ', _0x1c5483['W'] = 'చ', _0x1c5483['X'] = 'ჯ', _0x1c5483['Y'] = 'Ӌ', _0x1c5483['Z'] = 'ɀ', _0x1c5483['0'] = '⊘', _0x1c5483['1'] = _0x5b0fae(0x601), _0x1c5483['2'] = 'ϩ', _0x1c5483['3'] = 'Ӡ', _0x1c5483['4'] = '५', _0x1c5483['5'] = 'Ƽ', _0x1c5483['6'] = 'Ϭ', _0x1c5483['7'] = '7', _0x1c5483['8'] = _0x5b0fae(0x601), _0x1c5483['9'] = '९', _0x1c5483['&'] = '⅋', _0x1c5483['('] = '{', _0x1c5483[')'] = '}', _0x1c5483['{'] = '(', _0x1c5483['}'] = ')', _0x1c5483['ä'] = 'ą̈', _0x1c5483['ö'] = 'օ̈', _0x1c5483['ü'] = 'մ̈', _0x1c5483['Ä'] = 'Ⱥ̈', _0x1c5483['Ö'] = 'ට̈', _0x1c5483['Ü'] = 'Ա̈', _0x1c5483['é'] = 'ҽ́', _0x1c5483['á'] = 'ą́', _0x1c5483['ó'] = 'օ́', _0x1c5483['ú'] = 'մ́', _0x1c5483['É'] = 'Ɛ́', _0x1c5483['Á'] = 'Ⱥ́', _0x1c5483['Ó'] = 'ට́', _0x1c5483['Ú'] = 'Ա́', _0x1c5483['è'] = 'ҽ̀', _0x1c5483['à'] = 'ą̀', _0x1c5483['ò'] = 'օ̀', _0x1c5483['ù'] = 'մ̀', _0x1c5483['È'] = 'Ɛ̀', _0x1c5483['À'] = 'Ⱥ̀', _0x1c5483['Ò'] = 'ට̀', _0x1c5483['Ù'] = 'Ա̀', _0x1c5483['ê'] = 'ҽ̂', _0x1c5483['â'] = 'ą̂', _0x1c5483['ô'] = 'օ̂', _0x1c5483['û'] = 'մ̂', _0x1c5483['Ê'] = 'Ɛ̂', _0x1c5483['Â'] = 'Ⱥ̂', _0x1c5483['Ô'] = 'ට̂', _0x1c5483['Û'] = 'Ա̂';
    var _0xf11b49 = {};
    _0xf11b49[_0x5b0fae(0x235)] = function() {
        var _0x247716 = _0x5b0fae;
        for (i in this[_0x247716(0x21d)]) this['map'][this[_0x247716(0x21d)][i]] = i;
    }, _0xf11b49[_0x5b0fae(0x469)] = function(_0x25fab7) {
        var _0x378794 = _0x5b0fae;
        for (var _0x585992, _0x36db1e = '', _0x3c1f60 = 0x0, _0x36ce44 = _0x25fab7[_0x378794(0x164)]; _0x36ce44 > _0x3c1f60; _0x3c1f60++) _0x585992 = this['map'][_0x25fab7[_0x378794(0x5af)](_0x3c1f60)], _0x378794(0x3a8) == typeof _0x585992 && (_0x585992 = _0x25fab7[_0x378794(0x5af)](_0x3c1f60)), _0x36db1e += _0x585992;
        return _0x36db1e;
    }, _0xf11b49[_0x5b0fae(0x5a9)] = function(_0x4fb061) {
        var _0x5df446 = _0x5b0fae;
        for (var _0x4e1d6d, _0x34841d = '', _0x32af69 = 0x0, _0x12b065 = _0x4fb061['length']; _0x12b065 > _0x32af69; _0x32af69++) _0x4e1d6d = this[_0x5df446(0x21d)][_0x4fb061[_0x5df446(0x5af)](_0x32af69)], _0x5df446(0x3a8) == typeof _0x4e1d6d && (_0x4e1d6d = _0x4fb061[_0x5df446(0x5af)](_0x32af69)), _0x34841d += _0x4e1d6d;
        return _0x34841d;
    }, _0xf11b49[_0x5b0fae(0x21d)] = _0x1c5483;
    var _0x42e6b6 = {};
    _0x42e6b6['A'] = 'ᴀ', _0x42e6b6['B'] = 'ʙ', _0x42e6b6['C'] = 'ᴄ', _0x42e6b6['D'] = 'ᴅ', _0x42e6b6['E'] = 'ᴇ', _0x42e6b6['F'] = 'ꜰ', _0x42e6b6['G'] = 'ɢ', _0x42e6b6['H'] = 'ʜ', _0x42e6b6['I'] = 'ɪ', _0x42e6b6['J'] = 'ᴊ', _0x42e6b6['K'] = 'ᴋ', _0x42e6b6['L'] = 'ʟ', _0x42e6b6['M'] = 'ᴍ', _0x42e6b6['N'] = 'ɴ', _0x42e6b6['O'] = 'ᴏ', _0x42e6b6['P'] = 'ᴘ', _0x42e6b6['Q'] = 'Q', _0x42e6b6['R'] = 'ʀ', _0x42e6b6['S'] = 'ꜱ', _0x42e6b6['T'] = 'ᴛ', _0x42e6b6['U'] = 'ᴜ', _0x42e6b6['V'] = 'ᴠ', _0x42e6b6['W'] = 'ᴡ', _0x42e6b6['X'] = 'x', _0x42e6b6['Y'] = 'ʏ', _0x42e6b6['Z'] = 'ᴢ';
    var _0x30ea2b = {};
    _0x30ea2b[_0x5b0fae(0x235)] = function() {
        var _0xf8469b = _0x5b0fae;
        for (i in this['map']) this['map'][this[_0xf8469b(0x21d)][i]] = i;
    }, _0x30ea2b['encode'] = function(_0x500fa1) {
        var _0x413738 = _0x5b0fae,
            _0xf1bcb8, _0x3b7c4a = '';
        _0x500fa1 = _0x500fa1[_0x413738(0x4b3)]();
        for (var _0x585508 = 0x0, _0x280c0c = _0x500fa1[_0x413738(0x164)]; _0x280c0c > _0x585508; _0x585508++) _0xf1bcb8 = this[_0x413738(0x21d)][_0x500fa1[_0x413738(0x5af)](_0x585508)], _0x413738(0x3a8) == typeof _0xf1bcb8 && (_0xf1bcb8 = _0x500fa1[_0x413738(0x5af)](_0x585508)), _0x3b7c4a += _0xf1bcb8;
        return _0x3b7c4a;
    }, _0x30ea2b[_0x5b0fae(0x5a9)] = function(_0xb23af4) {
        var _0x56caba = _0x5b0fae;
        for (var _0x28507c, _0x4f50ef = '', _0x3f8967 = 0x0, _0x20648c = _0xb23af4[_0x56caba(0x164)]; _0x20648c > _0x3f8967; _0x3f8967++) _0x28507c = this[_0x56caba(0x21d)][_0xb23af4[_0x56caba(0x5af)](_0x3f8967)], _0x56caba(0x3a8) == typeof _0x28507c && (_0x28507c = _0xb23af4[_0x56caba(0x5af)](_0x3f8967)), _0x4f50ef += _0x28507c;
        return _0x4f50ef;
    }, _0x30ea2b[_0x5b0fae(0x21d)] = _0x42e6b6;
    var _0x2a9e86 = {};
    _0x2a9e86[_0x5b0fae(0x58e)] = _0x2dc112, _0x2a9e86[_0x5b0fae(0x555)] = _0x7dfe86, _0x2a9e86[_0x5b0fae(0x607)] = _0x3edf2d, _0x2a9e86[_0x5b0fae(0x1f1)] = _0x5382ba, _0x2a9e86['squares'] = _0x85b613, _0x2a9e86['roundsquares'] = _0x59e84b, _0x2a9e86['bent'] = _0xf11b49, _0x2a9e86[_0x5b0fae(0x51e)] = _0x30ea2b, this[_0x5b0fae(0x34e)] = _0x2a9e86;
    for (i in this[_0x5b0fae(0x34e)]) this[_0x5b0fae(0x34e)][i][_0x5b0fae(0x235)]();
    this[_0x5b0fae(0x2ce)] = function(_0x385975) {
        var _0x20ccca = _0x5b0fae;
        for (var _0x1987b2, _0x2043b4 = '', _0x449d8b = !0x0, _0x11b2bb = 0x0, _0x4b8e2e = 0x0, _0x231625 = 0x0, _0x26f32c = _0x385975[_0x20ccca(0x164)]; _0x26f32c > _0x231625; _0x231625++) _0x1987b2 = _0x385975['charCodeAt'](_0x231625), 0xa == _0x1987b2 || 0xd == _0x1987b2 ? (_0x2043b4 += _0x20ccca(0x196), _0x449d8b = !0x0) : 0x20 == _0x1987b2 ? _0x449d8b ? (_0x2043b4 += '\x20', _0x449d8b = !0x1) : (_0x2043b4 += '\x20', _0x449d8b = !0x0) : (_0x1987b2 >= 0xd800 && 0xdbff >= _0x1987b2 ? (_0x11b2bb = _0x1987b2, _0x4b8e2e = 0x0) : _0x11b2bb > 0x0 ? (_0x1987b2 >= 0xdc00 && 0xdfff >= _0x1987b2 && (_0x4b8e2e = 0x400 * (_0x11b2bb - 0xd800) + (_0x1987b2 - 0xdc00) + 0x10000), _0x11b2bb = 0x0) : _0x4b8e2e = _0x1987b2, 0x0 != _0x4b8e2e && (_0x2043b4 += '&#x' + _0x4b8e2e[_0x20ccca(0x5a4)](0x10) + ';', _0x449d8b = !0x0));
        return _0x2043b4;
    };
}

function cuteText(_0x3319bc) {
    var _0x2d246b = _0x46b0bf;
    if (_0x3319bc['trim']() === '') return '';
    qi = -0x1;
    var _0x4a45dd = boundingString(Math[_0x2d246b(0x244)](Math[_0x2d246b(0x2df)]() * 0x2) + 0x1);
    return _0x4a45dd + _0x2d246b(0x278) + _0x3319bc[_0x2d246b(0x24d)](/([!?.]+)/gi)[_0x2d246b(0x21d)](cuteSentence)[_0x2d246b(0x59d)]('') + _0x2d246b(0x278) + esrever['reverse'](_0x4a45dd);
}

function cuteSentence(_0x5ea9c6) {
    var _0x16f773 = _0x46b0bf;
    return _0x5ea9c6[_0x16f773(0x24d)](/([\s,]+)/gi)[_0x16f773(0x21d)](cuteWord)['join']('');
}

function cuteWord(_0x41eee5) {
    var _0xf2d16b = _0x46b0bf;
    if (_0x41eee5 === '' || /[[!?.\s,]+]/gi [_0xf2d16b(0x458)](_0x41eee5)) return _0x41eee5;
    return _0x41eee5 = roundReplace(_0x41eee5), _0x41eee5 = punctReplace(_0x41eee5), _0x41eee5 = emojiReplace(_0x41eee5), scriptify(_0x41eee5);
}
var qi = -0x1,
    qa = ['❝', '❞'];

function quotes() {
    qi++;
    if (qi === 0x2) qi = 0x0;
    return qa[qi];
}

function punctReplace(_0xc45c15) {
    var _0x58f1c5 = _0x46b0bf;
    return _0xc45c15['split']('')[_0x58f1c5(0x21d)](function(_0x55f6a5) {
        if (_0x55f6a5 === '!') return randomElement(['❣', '❢']);
        else {
            if (_0x55f6a5 === '?') return randomElement(['¿', '?']);
            else {
                if (_0x55f6a5 === '\x22') return quotes();
                else return _0x55f6a5;
            }
        }
    })[_0x58f1c5(0x59d)]('');
}

function emojiReplace(_0x2d9466) {
    var _0x32f2a4 = _0x46b0bf;
    return _0x2d9466[_0x32f2a4(0x231)](':)', randomElement(emoji[':)']))[_0x32f2a4(0x231)]('(:', randomElement(emoji[':)']))[_0x32f2a4(0x231)]('^^', randomElement(emoji['^^']))[_0x32f2a4(0x231)](':P', randomElement(emoji[':p']))[_0x32f2a4(0x231)](':p', randomElement(emoji[':p']))[_0x32f2a4(0x231)](':D', randomElement(emoji[':D']))['replace']('<3', randomElement(emoji['<3']))['replace']('(y)', randomElement(emoji[_0x32f2a4(0x1b7)]))['replace'](_0x32f2a4(0x587), randomElement(emoji['(y)']));
}

function roundReplace(_0x5e254a) {
    var _0x2dbe8e = _0x46b0bf;
    return _0x5e254a[_0x2dbe8e(0x24d)]('')[_0x2dbe8e(0x21d)](function(_0xe081ec) {
        var _0x1a2abc = _0x2dbe8e;
        return _0xe081ec[_0x1a2abc(0x4d0)]() === 'o' || _0xe081ec === '0' ? randomElement(round) : _0xe081ec;
    })[_0x2dbe8e(0x59d)]('');
}
var ar = {};
ar[':)'] = ['٩(˘◡˘)۶', _0x46b0bf(0x237), _0x46b0bf(0x416), _0x46b0bf(0x350), '(｡◕‿◕｡)', _0x46b0bf(0x288), _0x46b0bf(0x614), '😍', 'ツ', '(✿ヘᴥヘ)', _0x46b0bf(0x302), '(づ｡◕‿‿◕｡)づ', '(/◔◡◔)/', 's(^‿^)-b', _0x46b0bf(0x4b5), _0x46b0bf(0x330), _0x46b0bf(0x1cc)], ar['^^'] = [_0x46b0bf(0x170), _0x46b0bf(0x4aa), _0x46b0bf(0x326), _0x46b0bf(0x3b3), _0x46b0bf(0x476), _0x46b0bf(0x4f6), '^ㅂ^', '(⌒‿⌒)', '◠◡◠', _0x46b0bf(0x5e8), ''], ar[':p'] = [':Þ', ''], ar[':D'] = [_0x46b0bf(0x619), _0x46b0bf(0x604), 'ᕕ(ᐛ)ᕗ'], ar['<3'] = ['♡', '❤', '♥', '❥', '💘', '💙', '💗', '💖', '💕', '💓', '💞', '💝', '💟'], ar['(y)'] = ['👍', '👌'];
var emoji = ar,
    round = ['❁', '🌺', '❀', '💮', '🏵', '🌸', '☯', '😍', '♡', '🍩', '🍬', '💙', '🌞', '💍', '🍪', '❤', '💗', '🍑', '💞'],
    food = ['🍬', '🍭', '🍒', '🍎', '🍉', '🍇', '🍓', '🍌', '🍑', '🍰', '🎂', '🍩', '🍪', '🍧', '🍦', '🍫', '🍡'],
    flowers = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    twinkles = ['⚛', '🌌', '🌠', '*', ':', '｡', '･ﾟ', '✧', '✮', '★', '✩', '⋆', '.', '°', '`', '✴', '｡', '✴', '⋆', '✳', '✶', '✷', '❈'],
    animals = ['🐯', '🐎', '🐖', '🐷', '🐏', '🐑', '🐐', '🐫', '🐘', '🐭', '🐁', '🐀', '🐹', '🐰', '🐇', '🐿', '🐻', '🐨', '🐼', '🐾', '🐔', '🐓', '🐣', '🐤', '🐥', '🐦', '🐧', '🕊', '🐸', '🐢', '🐳', '🐋', '🐬', '🐟', '🐠', '🐡', '🐙', '🐚', '🐌', '🐞'],
    plants = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    misc = ['🌌', '🌠', '🎉', '🎊', '🎈', '💌', '🎎', '🎁', '🎀', '🕯', '🔮', '🛀', '🎖', '🏆', '🏅', '👑', '💍', '👶', '👼', '👸', '👯', '👒', '👻'],
    music = ['♫', '♬', '♪', '♩', '°', '｡', '✧', '🎻', '🎺', '🎸', '🎷', '📯'],
    flourish = [_0x46b0bf(0x44d), _0x46b0bf(0x457), _0x46b0bf(0x45b), _0x46b0bf(0x335), '•´¯`•.\x20', _0x46b0bf(0x557), _0x46b0bf(0x547), _0x46b0bf(0x3c7), _0x46b0bf(0x5dc), '•°¯`••\x20', _0x46b0bf(0x25c), _0x46b0bf(0x5bb), '(¯`·.¸¸.->\x20°º\x20', _0x46b0bf(0x57a), _0x46b0bf(0x3d5), _0x46b0bf(0x236), _0x46b0bf(0x418), _0x46b0bf(0x414), _0x46b0bf(0x1c6), _0x46b0bf(0x61f), _0x46b0bf(0x1d9), '.o0×X×0o.\x20', _0x46b0bf(0x1bb), _0x46b0bf(0x2d4), '—(••÷', '¤¸¸.•´¯`•¸¸.•..>>\x20', _0x46b0bf(0x550), _0x46b0bf(0x460), '๑۞๑,¸¸,ø¤º°`°๑۩\x20', '-漫~*\x27¨¯¨\x27*·舞~\x20', _0x46b0bf(0x437), _0x46b0bf(0x5d8), '▀▄▀▄▀▄\x20', _0x46b0bf(0x331)];

function boundingString(_0x3189d6) {
    return randomElement([foodString, twinkleString, animalString, flourishString])(_0x3189d6);
}

function foodString(_0x19bfed) {
    var _0x46574a = _0x46b0bf;
    return new Array(_0x19bfed + 0x1)[_0x46574a(0x59d)]('0')[_0x46574a(0x24d)]('')[_0x46574a(0x21d)](function(_0x56b7d6) {
        return randomElement(food);
    })[_0x46574a(0x59d)](_0x46574a(0x511));
}

function twinkleString(_0x2592c2) {
    var _0x42f7eb = _0x46b0bf;
    return new Array(_0x2592c2 + 0x1)[_0x42f7eb(0x59d)]('0')[_0x42f7eb(0x24d)]('')[_0x42f7eb(0x21d)](function() {
        return randomElement(twinkles);
    })[_0x42f7eb(0x59d)]('');
}

function animalString(_0x1e1f08) {
    var _0x1274e7 = _0x46b0bf;
    return new Array(_0x1e1f08 + 0x1)[_0x1274e7(0x59d)]('0')[_0x1274e7(0x24d)]('')[_0x1274e7(0x21d)](function(_0xa5e943) {
        return randomElement(animals);
    })[_0x1274e7(0x59d)]('\x20⋆\x20');
}

function flourishString(_0x11457c) {
    return randomElement(flourish);
}

function scriptify(_0x2de87d) {
    var _0x31b8c3 = _0x46b0bf,
        _0x39ca8a = {};
    _0x39ca8a['0'] = '𝟢', _0x39ca8a['1'] = '𝟣', _0x39ca8a['2'] = '𝟤', _0x39ca8a['3'] = '𝟥', _0x39ca8a['4'] = '𝟦', _0x39ca8a['5'] = '𝟧', _0x39ca8a['6'] = '𝟨', _0x39ca8a['7'] = '𝟩', _0x39ca8a['8'] = '𝟪', _0x39ca8a['9'] = '𝟫', _0x39ca8a['a'] = '𝒶', _0x39ca8a['b'] = '𝒷', _0x39ca8a['c'] = '𝒸', _0x39ca8a['d'] = '𝒹', _0x39ca8a['e'] = '𝑒', _0x39ca8a['f'] = '𝒻', _0x39ca8a['g'] = '𝑔', _0x39ca8a['h'] = '𝒽', _0x39ca8a['i'] = '𝒾', _0x39ca8a['j'] = '𝒿', _0x39ca8a['k'] = '𝓀', _0x39ca8a['l'] = '𝓁', _0x39ca8a['m'] = '𝓂', _0x39ca8a['n'] = '𝓃', _0x39ca8a['o'] = '𝑜', _0x39ca8a['p'] = '𝓅', _0x39ca8a['q'] = '𝓆', _0x39ca8a['r'] = '𝓇', _0x39ca8a['s'] = '𝓈', _0x39ca8a['t'] = '𝓉', _0x39ca8a['u'] = '𝓊', _0x39ca8a['v'] = '𝓋', _0x39ca8a['w'] = '𝓌', _0x39ca8a['x'] = '𝓍', _0x39ca8a['y'] = '𝓎', _0x39ca8a['z'] = '𝓏', _0x39ca8a['A'] = '𝒜', _0x39ca8a['B'] = '𝐵', _0x39ca8a['C'] = '𝒞', _0x39ca8a['D'] = '𝒟', _0x39ca8a['E'] = '𝐸', _0x39ca8a['F'] = '𝐹', _0x39ca8a['G'] = '𝒢', _0x39ca8a['H'] = '𝐻', _0x39ca8a['I'] = '𝐼', _0x39ca8a['J'] = '𝒥', _0x39ca8a['K'] = '𝒦', _0x39ca8a['L'] = '𝐿', _0x39ca8a['M'] = '𝑀', _0x39ca8a['N'] = '𝒩', _0x39ca8a['O'] = '𝒪', _0x39ca8a['P'] = '𝒫', _0x39ca8a['Q'] = '𝒬', _0x39ca8a['R'] = '𝑅', _0x39ca8a['S'] = '𝒮', _0x39ca8a['T'] = '𝒯', _0x39ca8a['U'] = '𝒰', _0x39ca8a['V'] = '𝒱', _0x39ca8a['W'] = '𝒲', _0x39ca8a['X'] = '𝒳', _0x39ca8a['Y'] = '𝒴', _0x39ca8a['Z'] = '𝒵';
    var _0x33d6d9 = _0x39ca8a,
        _0x201bb = _0x2de87d[_0x31b8c3(0x24d)]('');
    for (var _0x591d16 = 0x0; _0x591d16 < _0x201bb[_0x31b8c3(0x164)]; _0x591d16++) {
        _0x33d6d9[_0x201bb[_0x591d16][_0x31b8c3(0x4d0)]()] && (_0x201bb[_0x591d16] = _0x33d6d9[_0x201bb[_0x591d16]]);
    }
    return _0x2de87d = _0x201bb[_0x31b8c3(0x59d)](''), _0x2de87d;
}

function shuffleArray(_0x5118b8) {
    var _0x2e17c4 = _0x46b0bf,
        _0x570e64 = _0x5118b8['length'],
        _0x3c0b47, _0xeef015;
    while (0x0 !== _0x570e64) {
        _0xeef015 = Math[_0x2e17c4(0x244)](Math[_0x2e17c4(0x2df)]() * _0x570e64), _0x570e64 -= 0x1, _0x3c0b47 = _0x5118b8[_0x570e64], _0x5118b8[_0x570e64] = _0x5118b8[_0xeef015], _0x5118b8[_0xeef015] = _0x3c0b47;
    }
    return _0x5118b8;
}

function randomElement(_0x2d1b70) {
    var _0x57f98a = _0x46b0bf;
    return _0x2d1b70[Math[_0x57f98a(0x244)](Math[_0x57f98a(0x2df)]() * _0x2d1b70['length'])];
}! function(_0x108e0c) {
    var _0x1483c4 = _0x46b0bf,
        _0x2085df = _0x1483c4(0x49f) == typeof exports && exports,
        _0x16658f = _0x1483c4(0x49f) == typeof module && module && module[_0x1483c4(0x1da)] == _0x2085df && module,
        _0x1de18b = _0x1483c4(0x49f) == typeof global && global;
    (_0x1de18b['global'] === _0x1de18b || _0x1de18b[_0x1483c4(0x1a0)] === _0x1de18b) && (_0x108e0c = _0x1de18b);
    var _0x23e5dd = /(<%= allExceptCombiningMarks %>)(<%= combiningMarks %>+)/g,
        _0x213e6c = /([\uD800-\uDBFF])([\uDC00-\uDFFF])/g,
        _0x2657c9 = function(_0x58ba7c) {
            var _0x42845b = _0x1483c4;
            _0x58ba7c = _0x58ba7c[_0x42845b(0x231)](_0x23e5dd, function(_0x48142, _0x1f991a, _0x5ce3fd) {
                return _0x2657c9(_0x5ce3fd) + _0x1f991a;
            })['replace'](_0x213e6c, _0x42845b(0x3c1));
            for (var _0x573250 = '', _0x244aa1 = _0x58ba7c[_0x42845b(0x164)]; _0x244aa1--;) _0x573250 += _0x58ba7c[_0x42845b(0x5af)](_0x244aa1);
            return _0x573250;
        },
        _0x592db6 = {
            'version': _0x1483c4(0x3e7),
            'reverse': _0x2657c9
        };
    if (_0x1483c4(0x1be) == typeof define && 'object' == typeof define[_0x1483c4(0x1e6)] && define[_0x1483c4(0x1e6)]) define(function() {
        return _0x592db6;
    });
    else {
        if (_0x2085df && !_0x2085df['nodeType']) {
            if (_0x16658f) _0x16658f[_0x1483c4(0x1da)] = _0x592db6;
            else {
                for (var _0x32bf48 in _0x592db6) _0x592db6[_0x1483c4(0x393)](_0x32bf48) && (_0x2085df[_0x32bf48] = _0x592db6[_0x32bf48]);
            }
        } else _0x108e0c['esrever'] = _0x592db6;
    }
}(this);

function fullCrazy(_0x2ad324) {
    var _0xc4867b = _0x46b0bf;
    if (_0x2ad324[_0xc4867b(0x356)]() === '') return '';
    return randomSymbols(0x2) + '\x20\x20' + crazifyText(_0x2ad324) + '\x20\x20' + randomSymbols(0x2);
}

function crazifyText(_0x5b8e62) {
    var _0x154326 = _0x46b0bf;
    _0x5b8e62 = _0x5b8e62[_0x154326(0x24d)]('');
    for (var _0x1fcdae = 0x0; _0x1fcdae < _0x5b8e62['length']; _0x1fcdae++) {
        _0x5b8e62[_0x1fcdae] = crazifyCharacter(_0x5b8e62[_0x1fcdae]);
    }
    return _0x5b8e62[_0x154326(0x59d)]('');
}

function crazifyCharacter(_0x2474cb) {
    var _0x35db17 = _0x46b0bf;
    _0x2474cb = _0x2474cb['toLowerCase']();
    var _0x45cd90 = {};
    _0x45cd90['&'] = '⅋', _0x45cd90['%'] = ['⅍', '℀', '℁', '℆', '℅'], _0x45cd90['0'] = ['０', 'Ѳ', 'ʘ'], _0x45cd90['1'] = ['➀', '❶', '１'], _0x45cd90['2'] = ['２', '❷', '➁'], _0x45cd90['3'] = ['３', '❸', '➂'], _0x45cd90['4'] = ['４', '❹', '➃'], _0x45cd90['5'] = ['❺', '➄', '５'], _0x45cd90['6'] = ['６', '❻', '➅'], _0x45cd90['7'] = ['７', '❼', '➆'], _0x45cd90['8'] = ['８', '➇', '❽'], _0x45cd90['9'] = ['➈', '❾', '９'], _0x45cd90['<'] = ['≼', '≺', '≪', '☾', '≾', '⋜', '⋞', '⋐', '⊂', '⊏', '⊑', '《', '＜', '❮', '❰', '⫷'], _0x45cd90['>'] = '☽≫≻≽≿⋝⋟⋑⊃⊐⊒⫸》＞❯❱', _0x45cd90['['] = '【〖〘〚［', _0x45cd90[']'] = '】〗〙〛］', _0x45cd90['*'] = _0x35db17(0x18a), _0x45cd90['a'] = ['Ⓐ', 'ⓐ', 'α', 'Ａ', 'ａ', 'ᗩ', '卂', 'Δ', 'ค', 'α', 'ά', 'Ã', '𝔞', '𝓪', '𝒶', '𝓐', '𝐀', '𝐚', '𝔸', '𝕒', 'ᵃ'], _0x45cd90['b'] = ['Ⓑ', 'ⓑ', 'в', 'Ｂ', '乃', 'ｂ', 'ᗷ', 'β', '๒', 'в', 'в', 'β', '𝔟', '𝓫', '𝒷', '𝓑', '𝐁', '𝐛', '𝔹', '𝕓', 'ᵇ'], _0x45cd90['c'] = ['Ⓒ', 'ⓒ', '匚', '¢', 'Ｃ', 'ｃ', 'ᑕ', 'Ć', 'ς', 'c', 'ς', 'Č', '℃', '𝔠', '𝓬', '𝒸', '𝓒', '𝐂', '𝐜', 'ℂ', '𝕔', 'ᶜ'], _0x45cd90['d'] = ['Ⓓ', 'ⓓ', '∂', 'Ｄ', 'ｄ', 'ᗪ', 'Đ', '๔', '∂', 'đ', 'Ď', '𝔡', '𝓭', '𝒹', '𝓓', '𝐃', 'ᗪ', '𝐝', '𝔻', '𝕕', 'ᵈ'], _0x45cd90['e'] = ['Ⓔ', '乇', 'ⓔ', 'є', 'Ｅ', 'ｅ', 'ᗴ', '€', 'є', 'ε', 'έ', 'Ẹ', '𝔢', '𝒆', '𝑒', '𝓔', '𝐄', '𝐞', '𝔼', '𝕖', 'ᵉ'], _0x45cd90['f'] = ['Ⓕ', 'ⓕ', 'ƒ', 'Ｆ', 'ｆ', '千', 'ᖴ', 'ℱ', 'Ŧ', 'ғ', 'ғ', 'Ƒ', '𝔣', '𝒇', '𝒻', '𝓕', '𝐅', '𝐟', '𝔽', '𝕗', 'ᶠ'], _0x45cd90['g'] = ['Ⓖ', 'ⓖ', 'ق', 'g', 'Ｇ', 'ｇ', 'Ǥ', 'Ꮆ', 'ﻮ', 'g', 'ģ', 'Ğ', '𝔤', '𝓰', '𝑔', '𝓖', '𝐆', '𝐠', '𝔾', '𝕘', 'ᵍ', 'Ꮆ'], _0x45cd90['h'] = ['Ⓗ', '卄', 'ⓗ', 'н', 'Ｈ', 'ｈ', 'ᕼ', 'Ħ', 'ђ', 'н', 'ħ', 'Ĥ', '𝔥', '𝓱', '𝒽', '𝓗', '𝐇', '𝐡', 'ℍ', '𝕙', 'ʰ'], _0x45cd90['i'] = ['Ⓘ', 'ⓘ', 'ι', 'Ｉ', 'ｉ', 'Ꭵ', '丨', 'Ɨ', 'เ', 'ι', 'ί', 'Į', '𝔦', '𝓲', '𝒾', '𝓘', '𝐈', '𝐢', '𝕀', '𝕚', 'ᶤ'], _0x45cd90['j'] = ['Ⓙ', 'ⓙ', 'נ', 'Ｊ', 'ڶ', 'ｊ', 'ᒎ', 'Ĵ', 'ן', 'נ', 'ј', 'Ĵ', '𝔧', '𝓳', '𝒿', '𝓙', '𝐉', '𝐣', '𝕁', '𝕛', 'ʲ'], _0x45cd90['k'] = ['Ⓚ', 'ⓚ', 'к', 'Ｋ', 'ｋ', 'ᛕ', 'Ҝ', 'к', 'к', 'ķ', 'Ќ', '𝔨', '𝓴', '𝓀', '𝓚', '𝐊', '𝐤', '𝕂', '𝕜', 'ᵏ', 'Ҝ'], _0x45cd90['l'] = ['Ⓛ', 'ⓛ', 'ℓ', 'ㄥ', 'Ｌ', 'ｌ', 'ᒪ', 'Ł', 'l', 'ℓ', 'Ļ', 'Ĺ', '𝔩', '𝓵', '𝓁', '𝓛', '𝐋', '𝐥', '𝕃', '𝕝', 'ˡ'], _0x45cd90['m'] = ['Ⓜ', 'ⓜ', 'м', 'Ｍ', 'ｍ', 'ᗰ', 'Μ', '๓', 'м', 'м', 'ϻ', '𝔪', '𝓶', '𝓂', '𝓜', '𝐌', '𝐦', '𝕄', '𝕞', 'ᵐ', '爪'], _0x45cd90['n'] = ['Ⓝ', '几', 'ⓝ', 'η', 'Ｎ', 'ｎ', 'ᑎ', 'Ň', 'ภ', 'η', 'ή', 'Ň', '𝔫', '𝓷', '𝓃', '𝓝', '𝐍', '𝐧', 'ℕ', '𝕟', 'ᶰ'], _0x45cd90['o'] = ['Ⓞ', 'ㄖ', 'ⓞ', 'σ', 'Ｏ', 'ｏ', 'ᗝ', 'Ø', '๏', 'σ', 'ό', 'Ỗ', '𝔬', '𝓸', '𝑜', '𝓞', '𝐎', '𝐨', '𝕆', '𝕠', 'ᵒ'], _0x45cd90['p'] = ['Ⓟ', 'ⓟ', 'ρ', 'Ｐ', 'ｐ', '卩', 'ᑭ', 'Ƥ', 'ק', 'ρ', 'ρ', 'Ƥ', '𝔭', '𝓹', '𝓅', '𝓟', '𝐏', '𝐩', 'ℙ', '𝕡', 'ᵖ'], _0x45cd90['q'] = ['Ⓠ', 'ⓠ', 'q', 'Ｑ', 'ｑ', 'Ɋ', 'Ω', 'ợ', 'q', 'q', 'Ǫ', '𝔮', '𝓺', '𝓆', '𝓠', '𝐐', '𝐪', 'ℚ', '𝕢', 'ᵠ'], _0x45cd90['r'] = ['Ⓡ', 'ⓡ', 'я', '尺', 'Ｒ', 'ｒ', 'ᖇ', 'Ř', 'г', 'я', 'ŕ', 'Ř', '𝔯', '𝓻', '𝓇', '𝓡', '𝐑', '𝐫', 'ℝ', '𝕣', 'ʳ'], _0x45cd90['s'] = ['Ⓢ', 'ⓢ', 'ѕ', 'Ｓ', '丂', 'ｓ', 'ᔕ', 'Ş', 'ร', 's', 'ş', 'Ŝ', '𝔰', '𝓼', '𝓈', '𝓢', '𝐒', '𝐬', '𝕊', '𝕤', 'ˢ'], _0x45cd90['t'] = ['Ⓣ', 'ⓣ', 'т', 'Ｔ', 'ｔ', '丅', 'Ŧ', 't', 'т', 'ţ', 'Ť', '𝔱', '𝓽', '𝓉', '𝓣', '𝐓', '𝐭', '𝕋', '𝕥', 'ᵗ'], _0x45cd90['u'] = ['Ⓤ', 'ⓤ', 'υ', 'Ｕ', 'ｕ', 'ᑌ', 'Ữ', 'ย', 'υ', 'ù', 'Ǘ', '𝔲', '𝓾', '𝓊', '𝓤', '𝐔', '𝐮', '𝕌', '𝕦', 'ᵘ'], _0x45cd90['v'] = ['Ⓥ', 'ⓥ', 'ν', 'Ｖ', 'ｖ', 'ᐯ', 'V', 'ש', 'v', 'ν', 'Ѷ', '𝔳', '𝓿', '𝓋', '𝓥', '𝐕', '𝐯', '𝕍', '𝕧', 'ᵛ'], _0x45cd90['w'] = ['Ⓦ', 'ⓦ', 'ω', 'Ｗ', 'ｗ', 'ᗯ', 'Ŵ', 'ฬ', 'ω', 'ώ', 'Ŵ', '𝔴', '𝔀', '𝓌', '𝓦', '𝐖', '𝐰', '𝕎', '𝕨', 'ʷ', '山'], _0x45cd90['x'] = ['Ⓧ', 'ⓧ', 'χ', 'Ｘ', '乂', 'ｘ', '᙭', 'Ж', 'א', 'x', 'x', 'Ж', '𝔵', '𝔁', '𝓍', '𝓧', '𝐗', '𝐱', '𝕏', '𝕩', 'ˣ'], _0x45cd90['y'] = ['Ⓨ', 'ㄚ', 'ⓨ', 'у', 'Ｙ', 'ｙ', 'Ƴ', '¥', 'ץ', 'ү', 'ч', 'Ў', '𝔶', '𝔂', '𝓎', '𝓨', '𝐘', '𝐲', '𝕐', '𝕪', 'ʸ'], _0x45cd90['z'] = ['Ⓩ', 'ⓩ', 'z', '乙', 'Ｚ', 'ｚ', 'Ƶ', 'Ž', 'z', 'z', 'ž', 'Ż', '𝔷', '𝔃', '𝓏', '𝓩', '𝐙', '𝐳', 'ℤ', '𝕫', 'ᶻ'];
    var _0x29cd62 = _0x45cd90;
    return _0x29cd62[_0x2474cb] ? randomElement(_0x29cd62[_0x2474cb]) : _0x2474cb;
}

function randomElement(_0x236b50) {
    var _0x566ce4 = _0x46b0bf;
    return _0x236b50[Math[_0x566ce4(0x244)](Math['random']() * _0x236b50['length'])];
}

function randomSymbols(_0x59c278) {
    var _0x3ed4ad = _0x46b0bf,
        _0x3cb90c = ['🐙', '🐉', '🐊', '🐒', '🐝', '🐜', '🐚', '🐲', '🐳', '🐸', '👑', '👹', '👺', '👤', '💲', '💣', '💙', '💚', '💛', '💜', '💝', '💗', '💘', '💞', '💔', '💥', '🐯', '🐼', '🐻', '🐺', '👌', '🐍', '🐧', '🐟', '🐠', '🐨', '🎯', '🏆', '🎁', '🎀', '🎉', '🎈', '🍮', '🍭', '🍬', '🍫', '🍪', '🍧', '🌷', '🍓', '😺', '😾', '✎', '😎', '😝', '😂', '😈', '😡', '😲', '😳', '🍔', '🍟', '🍩', '🎃', '🎄', '🎅', '🐣', '🐤', '👍', '👊', '👻', '👽', '👮', '💎', '💋', '👣', '💀', '💢', '🔥', '♔', '♕', '♖', '♗', '♘', '♙', '♚', '♛', '♜', '♝', '♞', '♟', '♠', '♡', '♢', '♣', '♤', '♥', '♦', '♧', '♨', '♩', '♪', '♬', '★', '☆', '☺', '☹', '☯', '☮', '☢', '☠', '☟', '☞', '☝', '☜', '✌', '✋', '✊', '⛵', 'ൠ', '✌', 'ඏ'],
        _0x3d2c6a = [];
    for (var _0x27362a = 0x0; _0x27362a < _0x59c278; _0x27362a++) _0x3d2c6a['push'](randomElement(_0x3cb90c));
    return _0x3d2c6a[_0x3ed4ad(0x59d)]('');
}

function randInt(_0x49371f, _0x580341) {
    var _0x3f66d7 = _0x46b0bf;
    return _0x49371f + Math['floor'](Math[_0x3f66d7(0x2df)]() * (_0x580341 - _0x49371f + 0x1));
}
$(document)[_0x46b0bf(0x5f4)](function() {
    var _0x9e9214 = _0x46b0bf;
    $(_0x9e9214(0x312))[_0x9e9214(0x2c7)](), $(window)[_0x9e9214(0x4d7)](function() {
        var _0xece8ae = _0x9e9214;
        $(this)[_0xece8ae(0x2ed)]() > 0x64 ? $('#scroll')['fadeIn']() : $(_0xece8ae(0x24a))[_0xece8ae(0x3f7)]();
    }), $(_0x9e9214(0x24a))[_0x9e9214(0x51b)](function() {
        var _0x1ffc50 = _0x9e9214,
            _0x1a3de2 = {};
        return _0x1a3de2[_0x1ffc50(0x2ed)] = 0x0, $(_0x1ffc50(0x323))['animate'](_0x1a3de2, 0x258), ![];
    });
}), $(document)['ready'](function() {
    var _0x4b0ffb = _0x46b0bf;
    $('#textSize')['on']('input\x20change', function() {
        var _0x5beb38 = _0x40a5;
        $(_0x5beb38(0x535) + $(this)[_0x5beb38(0x49c)]() + _0x5beb38(0x3da))[_0x5beb38(0x595)](_0x5beb38(0x5ad));
        var _0x6ff2eb = {};
        _0x6ff2eb[_0x5beb38(0x41b)] = 0x16d, $[_0x5beb38(0x52b)](_0x5beb38(0x5e5), $(this)[_0x5beb38(0x49c)](), _0x6ff2eb);
    });
    $[_0x4b0ffb(0x52b)]('recentlist') && $(_0x4b0ffb(0x2f3))[_0x4b0ffb(0x504)]($[_0x4b0ffb(0x52b)](_0x4b0ffb(0x4e7)));
    $(_0x4b0ffb(0x3d7))['on']('input', function(_0x526891) {
        var _0x505f99 = _0x4b0ffb,
            _0x4c5a36 = $(_0x505f99(0x1d8))['val']();
        _0x118b2f(_0x4c5a36);
        var _0x6498c2 = {};
        _0x6498c2[_0x505f99(0x41b)] = 0x16d, $[_0x505f99(0x52b)]('recenttext', _0x4c5a36, _0x6498c2), $(_0x505f99(0x5db))['html'](siteurl + encodeURIComponent(_0x4c5a36));
    });
    var _0x1f1623 = window['location'][_0x4b0ffb(0x3ff)],
        _0x240464 = _0x1f1623[_0x4b0ffb(0x24d)]('?=');
    urltext = _0x240464[0x1];
    if (urltext) {
        urltext = decodeURIComponent(urltext), $('#y2k-font')[_0x4b0ffb(0x49c)](urltext), _0x118b2f(urltext);
        var _0x570c77 = {};
        _0x570c77[_0x4b0ffb(0x41b)] = 0x16d, $[_0x4b0ffb(0x52b)](_0x4b0ffb(0x152), urltext, _0x570c77), $(_0x4b0ffb(0x5db))[_0x4b0ffb(0x504)](siteurl + encodeURIComponent(urltext));
    }
    $(document)['on'](_0x4b0ffb(0x51b), _0x4b0ffb(0x5fc), function() {
        var _0x7d68ea = _0x4b0ffb;
        $(_0x7d68ea(0x2f3))[_0x7d68ea(0x505)](_0x7d68ea(0x29a) + $(this)[_0x7d68ea(0x2ea)]('p')[_0x7d68ea(0x531)](_0x7d68ea(0x4fe)) + '\x22\x20class=\x22' + $(this)[_0x7d68ea(0x2ea)]('p')['attr'](_0x7d68ea(0x4fe)) + '\x22>' + $(this)[_0x7d68ea(0x2ea)]('p')[_0x7d68ea(0x1ca)]() + _0x7d68ea(0x21e));
        $(_0x7d68ea(0x2e1))[_0x7d68ea(0x164)] > 0x3 && $(_0x7d68ea(0x2e1))['last']()['remove']();
        var _0x83a2be = {};
        _0x83a2be['expires'] = 0x16d, $['cookie']('recentlist', $(_0x7d68ea(0x2f3))['html'](), _0x83a2be);
    });

    function _0x4dce3c() {
        var _0x2649e7 = _0x4b0ffb,
            _0x4ea13f = $(_0x2649e7(0x1d8))[_0x2649e7(0x49c)]();
        $(_0x2649e7(0x27e))[_0x2649e7(0x504)](wrapInFlourish(_0x419087(_0x4ea13f))), $(_0x2649e7(0x4dc))[_0x2649e7(0x504)](wrapInFlourish(_0x419087(_0x4ea13f))), $(_0x2649e7(0x272))[_0x2649e7(0x504)](wrapInFlourish(_0x419087(_0x4ea13f))), $(_0x2649e7(0x1e4))['html'](wrapInFlourish(_0x419087(_0x4ea13f))), $(_0x2649e7(0x201))[_0x2649e7(0x504)](wrapInFlourish(_0x419087(_0x4ea13f))), $(_0x2649e7(0x363))['html'](wrapInFlourish(_0x419087(_0x4ea13f))), $(_0x2649e7(0x46e))[_0x2649e7(0x504)](wrapInFlourish(_0x419087(_0x4ea13f))), $('.flourish8')[_0x2649e7(0x504)](wrapInFlourish(_0x419087(_0x4ea13f))), $(_0x2649e7(0x4fa))[_0x2649e7(0x504)](wrapInFlourish(_0x419087(_0x4ea13f)));
    }

    function _0x118b2f(_0x5a5517) {
        var _0x199ad7 = _0x4b0ffb;
        _0x5a5517 = _0x5a5517[_0x199ad7(0x356)](), $('.result-s1')[_0x199ad7(0x504)](Change(_0x5a5517, 's1')), $(_0x199ad7(0x352))[_0x199ad7(0x504)](Change(_0x5a5517, 's2')), $(_0x199ad7(0x528))[_0x199ad7(0x504)](Change(_0x5a5517, 's3')), $(_0x199ad7(0x53c))[_0x199ad7(0x504)](Change(_0x5a5517, 's4')), $(_0x199ad7(0x48c))[_0x199ad7(0x504)](Change(_0x5a5517, 's5')), $(_0x199ad7(0x2f2))[_0x199ad7(0x504)](Change(_0x5a5517, 's6')), $(_0x199ad7(0x188))[_0x199ad7(0x504)](Change(_0x5a5517, 's7')), $(_0x199ad7(0x5c0))[_0x199ad7(0x504)](Change(_0x5a5517, 's8')), $(_0x199ad7(0x372))[_0x199ad7(0x504)](Change(_0x5a5517, 's9')), $(_0x199ad7(0x321))[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x32d))), $('.result-s11')['html'](Change(_0x5a5517, _0x199ad7(0x477))), $(_0x199ad7(0x16c))[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x3f1))), $('.result-s13')['html'](Change(_0x5a5517, _0x199ad7(0x3e3))), $(_0x199ad7(0x1f9))[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x221))), $(_0x199ad7(0x227))[_0x199ad7(0x504)](Change(_0x5a5517, 's15')), $('.result-s16')[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x31c))), $('.result-s17')[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x17a))), $(_0x199ad7(0x3ee))['html'](Change(_0x5a5517, 's18')), $(_0x199ad7(0x23f))[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x379))), $('.result-s20')[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x3fc))), $(_0x199ad7(0x192))[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x447))), $('.result-s22')[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x265))), $(_0x199ad7(0x4cb))[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x502))), $('.result-s24')[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x612))), $(_0x199ad7(0x183))[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x45f))), $(_0x199ad7(0x351))[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x445))), $('.result-s27')['html'](Change(_0x5a5517, _0x199ad7(0x3d8))), $('.result-s29')[_0x199ad7(0x504)](Change(_0x5a5517, 's29')), $(_0x199ad7(0x485))[_0x199ad7(0x504)](Change(_0x5a5517, 's30')), $(_0x199ad7(0x4e5))[_0x199ad7(0x504)](Change(_0x5a5517, _0x199ad7(0x47a))), $(_0x199ad7(0x4cf))[_0x199ad7(0x504)](luni[_0x199ad7(0x34e)]['bubbles'][_0x199ad7(0x469)](_0x5a5517)), $(_0x199ad7(0x4b6))[_0x199ad7(0x504)](applyCharMap(invertedSquaresCharMap, _0x5a5517)), $('.wideTextCharMap')[_0x199ad7(0x504)](applyCharMap(wideTextCharMap, _0x5a5517)), $(_0x199ad7(0x4e4))[_0x199ad7(0x504)](luni['tools'][_0x199ad7(0x51e)][_0x199ad7(0x469)](_0x5a5517)), $('.lunitoolsflipencode')[_0x199ad7(0x504)](luni[_0x199ad7(0x34e)][_0x199ad7(0x58e)]['encode'](_0x5a5517)), $('.squaresCharMap')[_0x199ad7(0x504)](applyCharMap(squaresCharMap, _0x5a5517)), $(_0x199ad7(0x360))[_0x199ad7(0x504)](luni['tools'][_0x199ad7(0x555)][_0x199ad7(0x469)](_0x5a5517)), $(_0x199ad7(0x57e))[_0x199ad7(0x504)](applyCharMap(subscriptCharMap, _0x5a5517)), $('.superscriptCharMap')[_0x199ad7(0x504)](applyCharMap(superscriptCharMap, _0x5a5517)), $(_0x199ad7(0x424))['html'](applyCharMap(bentTextCharMap, _0x5a5517)), $('.neonCharMap')[_0x199ad7(0x504)](applyCharMap(neonCharMap, _0x5a5517)), $(_0x199ad7(0x3d1))['html'](applyCharMap(futureAlienCharMap, _0x5a5517)), $(_0x199ad7(0x1c3))[_0x199ad7(0x504)](strikeThrough(_0x5a5517)), $(_0x199ad7(0x44e))['html'](tildeStrikeThrough(_0x5a5517)), $(_0x199ad7(0x299))[_0x199ad7(0x504)](slashThrough(_0x5a5517)), $(_0x199ad7(0x32b))['html'](underline(_0x5a5517)), $(_0x199ad7(0x254))[_0x199ad7(0x504)](doubleUnderline(_0x5a5517)), $(_0x199ad7(0x508))[_0x199ad7(0x504)](luni[_0x199ad7(0x34e)][_0x199ad7(0x607)][_0x199ad7(0x469)](_0x5a5517)), $(_0x199ad7(0x313))[_0x199ad7(0x504)](applyCharMap(squiggleCharMap, _0x5a5517)), $('.squiggle2CharMap')[_0x199ad7(0x504)](applyCharMap(squiggle2CharMap, _0x5a5517)), $('.squiggle3CharMap')[_0x199ad7(0x504)](applyCharMap(squiggle3CharMap, _0x5a5517)), $(_0x199ad7(0x522))[_0x199ad7(0x504)](applyCharMap(squiggle4CharMap, _0x5a5517)), $(_0x199ad7(0x3f8))[_0x199ad7(0x504)](applyCharMap(squiggle5CharMap, _0x5a5517)), $(_0x199ad7(0x5b8))['html'](applyCharMap(squiggle6CharMap, _0x5a5517)), $(_0x199ad7(0x514))[_0x199ad7(0x504)](applyCharMap(boldCharMap, _0x5a5517)), $(_0x199ad7(0x4f5))['html'](luni[_0x199ad7(0x34e)][_0x199ad7(0x216)]['encode'](_0x5a5517)), $(_0x199ad7(0x3f5))['html'](luni[_0x199ad7(0x34e)][_0x199ad7(0x492)]['encode'](_0x5a5517)), $(_0x199ad7(0x498))[_0x199ad7(0x504)](applyCharMap(oldEnglishCharMap, _0x5a5517)), $('.medievalCharMap')['html'](applyCharMap(medievalCharMap, _0x5a5517)), $('.cursiveCharMap')[_0x199ad7(0x504)](applyCharMap(cursiveCharMap, _0x5a5517)), $(_0x199ad7(0x26a))[_0x199ad7(0x504)](scriptify(_0x5a5517)), $(_0x199ad7(0x385))[_0x199ad7(0x504)](applyCharMap(doubleStruckCharMap, _0x5a5517)), $(_0x199ad7(0x1f8))[_0x199ad7(0x504)](applyCharMap(italicCharMap, _0x5a5517)), $('.boldItalicCharMap')[_0x199ad7(0x504)](applyCharMap(boldItalicCharMap, _0x5a5517)), $(_0x199ad7(0x398))[_0x199ad7(0x504)](applyCharMap(monospaceCharMap, _0x5a5517)), $('.upperAnglesCharMap')[_0x199ad7(0x504)](applyCharMap(upperAnglesCharMap, _0x5a5517)), $(_0x199ad7(0x3cc))[_0x199ad7(0x504)](applyCharMap(greekCharMap, _0x5a5517)), $(_0x199ad7(0x3aa))['html'](applyCharMap(symbolsCharMap, _0x5a5517)), $('.currencyCharMap')[_0x199ad7(0x504)](applyCharMap(currencyCharMap, _0x5a5517)), $('.asianStyleCharMap')[_0x199ad7(0x504)](applyCharMap(asianStyleCharMap, _0x5a5517)), $(_0x199ad7(0x1c0))[_0x199ad7(0x504)](applyCharMap(asianStyle2CharMap, _0x5a5517)), $(_0x199ad7(0x204))[_0x199ad7(0x504)](thickBlockFramed(_0x5a5517)), $(_0x199ad7(0x4e3))[_0x199ad7(0x504)](diametricAngleFrame(_0x5a5517)), $('.wavyJoiner')[_0x199ad7(0x504)](wavyJoiner(_0x5a5517)), $(_0x199ad7(0x4ab))['html'](dottyJoiner(_0x5a5517)), $('.kirbyHug')[_0x199ad7(0x504)](kirbyHug(_0x5a5517)), $(_0x199ad7(0x2ba))[_0x199ad7(0x504)](vaporwaveText(_0x5a5517)), $('.vaporwaveText1')['html'](vaporwaveText1(_0x5a5517)), $(_0x199ad7(0x497))[_0x199ad7(0x504)](vaporwaveText2(_0x5a5517)), $(_0x199ad7(0x41e))['html'](littleSparkles(_0x5a5517)), $(_0x199ad7(0x529))[_0x199ad7(0x504)](weirdBox(_0x5a5517)), $(_0x199ad7(0x169))['html'](firework(_0x5a5517)), $('.stinky')['html'](stinky(_0x5a5517)), $(_0x199ad7(0x300))['html'](heartsBetween(_0x5a5517)), $(_0x199ad7(0x5df))['html'](arrowBelow(_0x5a5517)), $(_0x199ad7(0x4ec))[_0x199ad7(0x504)](crossAboveBelow(_0x5a5517)), $(_0x199ad7(0x291))[_0x199ad7(0x504)](wingdings(_0x5a5517)), $('.fullCrazy')[_0x199ad7(0x504)](fullCrazy(_0x5a5517)), $(_0x199ad7(0x1a6))[_0x199ad7(0x504)](crazyWithFlourishOrSymbols(_0x5a5517)), $(_0x199ad7(0x2c5))[_0x199ad7(0x504)](cuteText(_0x5a5517)), _0x4dce3c(), $('.rand')[_0x199ad7(0x2d7)]();
    };
    $(_0x4b0ffb(0x551))[_0x4b0ffb(0x51b)](function() {
        var _0x5e69f2 = _0x4b0ffb;
        $(_0x5e69f2(0x312))[_0x5e69f2(0x5be)](), _0x4dce3c(), $(_0x5e69f2(0x312))[_0x5e69f2(0x3f7)]();
    });

    function _0x5b9269() {
        var _0x2bdcf2 = _0x4b0ffb;
        return fontgenArray[Math[_0x2bdcf2(0x244)](Math[_0x2bdcf2(0x2df)]() * fontgenArray[_0x2bdcf2(0x164)])];
    }

    function _0x152887(_0x3fe4a0) {
        var _0x3f69b7 = _0x5b9269();
        return eval(_0x3f69b7 + '(\x22' + _0x3fe4a0 + '\x22)');
    }

    function _0x4a1e5e() {
        var _0x53efd6 = _0x4b0ffb;
        return fontgenArrayMap[Math[_0x53efd6(0x244)](Math['random']() * fontgenArrayMap[_0x53efd6(0x164)])];
    }

    function _0x419087(_0x174721) {
        var _0x43d32b = _0x4b0ffb,
            _0x2aa77e = _0x4a1e5e();
        return _0x174721 = _0x174721[_0x43d32b(0x356)](), eval(_0x2aa77e + '(\x22' + _0x174721 + '\x22)');
    }
    $('#load-more')['click'](function() {
        var _0x81cb21 = _0x4b0ffb;
        $(_0x81cb21(0x312))[_0x81cb21(0x5be)]();
        var _0x5aa79c = $('#y2k-font')[_0x81cb21(0x49c)]();
        $(_0x81cb21(0x455))[_0x81cb21(0x19a)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + fullCrazy(_0x5aa79c) + _0x81cb21(0x21e)), $(_0x81cb21(0x455))[_0x81cb21(0x19a)](_0x81cb21(0x15b) + crazyWithFlourishOrSymbols(_0x5aa79c) + _0x81cb21(0x21e)), $(_0x81cb21(0x455))['append'](_0x81cb21(0x15b) + wrapInFlourish(_0x152887(_0x5aa79c)) + _0x81cb21(0x21e)), $(_0x81cb21(0x455))[_0x81cb21(0x19a)](_0x81cb21(0x15b) + cuteText(_0x5aa79c) + _0x81cb21(0x21e)), $(_0x81cb21(0x455))[_0x81cb21(0x19a)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x152887(_0x5aa79c)) + '</p></div>'), $(_0x81cb21(0x455))[_0x81cb21(0x19a)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x152887(_0x5aa79c)) + _0x81cb21(0x21e)), $(_0x81cb21(0x455))[_0x81cb21(0x19a)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x419087(_0x5aa79c)) + _0x81cb21(0x21e)), $(_0x81cb21(0x455))[_0x81cb21(0x19a)](_0x81cb21(0x15b) + wrapInFlourish(_0x419087(_0x5aa79c)) + _0x81cb21(0x21e)), $(_0x81cb21(0x455))['append']('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x419087(_0x5aa79c)) + _0x81cb21(0x21e)), $('#loader')[_0x81cb21(0x3f7)]();
    }), $[_0x4b0ffb(0x52b)](_0x4b0ffb(0x5e5)) && ($(_0x4b0ffb(0x535) + $[_0x4b0ffb(0x52b)](_0x4b0ffb(0x5e5)) + _0x4b0ffb(0x3da))[_0x4b0ffb(0x595)]('body'), $('#textSize')[_0x4b0ffb(0x49c)]($[_0x4b0ffb(0x52b)](_0x4b0ffb(0x5e5)))), $(_0x4b0ffb(0x23d))['click'](function() {
        var _0x1c3f8c = _0x4b0ffb;
        $(_0x1c3f8c(0x1d8))['val']('');
        var _0x49ea84 = {};
        _0x49ea84['expires'] = 0x16d, $[_0x1c3f8c(0x52b)](_0x1c3f8c(0x152), '', _0x49ea84);
    });
}), $(document)[_0x46b0bf(0x5f4)](function() {
    setInterval(function() {
        var _0x136b94 = _0x40a5;
        !$(_0x136b94(0x610))[_0x136b94(0x164)] && (window[_0x136b94(0x571)][_0x136b94(0x3ff)] = _0x136b94(0x2d9));
    }, 0x186a0);
}), window[_0x46b0bf(0x556)] = function() {
    var _0x3583e3 = _0x46b0bf,
        _0x3a9e9e = document[_0x3583e3(0x617)](_0x3583e3(0x2ad));
    _0x3a9e9e[_0x3583e3(0x150)]('href', _0x3583e3(0x2d9)), _0x3a9e9e['setAttribute']('rel', 'noopener'), _0x3a9e9e[_0x3583e3(0x150)](_0x3583e3(0x55a), _0x3583e3(0x174)), _0x3a9e9e[_0x3583e3(0x150)](_0x3583e3(0x4bc), _0x3583e3(0x490)), _0x3a9e9e[_0x3583e3(0x150)]('style', 'display:\x20inline-block!important;\x20font-size:\x20inherit!important;\x20color:\x20#0088ff!important;\x20visibility:\x20visible!important;z-index:99!important;\x20opacity:\x201!important;'), _0x3a9e9e[_0x3583e3(0x368)] = _0x3583e3(0x490);
};

function copyit(_0x41f91c) {
    var _0x41d75e = _0x46b0bf;
    if (document[_0x41d75e(0x5ad)][_0x41d75e(0x559)]) {
        var _0xe403de = document[_0x41d75e(0x5ad)]['createTextRange']();
        _0xe403de[_0x41d75e(0x2f4)](_0x41f91c), _0xe403de[_0x41d75e(0x42a)](), _0xe403de['execCommand'](_0x41d75e(0x3df));
    } else {
        if (window[_0x41d75e(0x308)] && document[_0x41d75e(0x3e8)]) {
            var _0x335a8c = _0x41f91c[_0x41d75e(0x359)],
                _0x633c62 = _0x41f91c[_0x41d75e(0x31e)];
            _0x41f91c['contentEditable'] = !![], _0x41f91c[_0x41d75e(0x31e)] = !![];
            var _0x215b3f = document[_0x41d75e(0x3e8)]();
            _0x215b3f[_0x41d75e(0x5c5)](_0x41f91c);
            var _0x133734 = window['getSelection']();
            _0x133734[_0x41d75e(0x446)](), _0x133734[_0x41d75e(0x35b)](_0x215b3f);
            if (_0x41f91c[_0x41d75e(0x39d)] == 'TEXTAREA' || _0x41f91c['nodeName'] == 'INPUT') _0x41f91c[_0x41d75e(0x42a)]();
            if (_0x41f91c[_0x41d75e(0x2c6)]) _0x41f91c[_0x41d75e(0x2c6)](0x0, 0xf423f);
            _0x41f91c[_0x41d75e(0x359)] = _0x335a8c, _0x41f91c[_0x41d75e(0x31e)] = _0x633c62;
            if (document[_0x41d75e(0x585)]('copy')) {
                var _0x52b204 = document[_0x41d75e(0x2e7)](_0x41d75e(0x36f));
                if (_0x52b204) $('body')[_0x41d75e(0x19a)](_0x41d75e(0x50c) + $(_0x41f91c)[_0x41d75e(0x1ca)]() + '\x22\x20/><span\x20class=\x22copybtn\x22>✔\x20Copied\x20!</span></p>'), setTimeout(function() {
                    var _0x32ec6c = _0x41d75e;
                    $('.copied')[_0x32ec6c(0x2d7)]();
                }, 0x3e8);
                else $(_0x41d75e(0x5ad))[_0x41d75e(0x19a)](_0x41d75e(0x525)), setTimeout(function() {
                    var _0x47318f = _0x41d75e;
                    $(_0x47318f(0x58b))[_0x47318f(0x2d7)]();
                }, 0x3e8);
            } else {
                if (!navigator[_0x41d75e(0x54e)][_0x41d75e(0x2a5)](/ipad|ipod|iphone|android|silk/i)) $('body')[_0x41d75e(0x19a)]('<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22Press\x20CTRL+C\x20to\x20copy\x22\x20/></p>'), setTimeout(function() {
                    var _0x5d4d59 = _0x41d75e;
                    $('.copied')[_0x5d4d59(0x2d7)]();
                }, 0x3e8);
            }
        }
    }
}
$(window)['width']() > 0x3c0 && $(window)[_0x46b0bf(0x4d7)](function() {
    var _0x5afb72 = _0x46b0bf,
        _0x51412a = $(window)[_0x5afb72(0x2ed)]();
    _0x51412a >= 0x64 ? $(_0x5afb72(0x3d7))[_0x5afb72(0x4bd)](_0x5afb72(0x1e0)) : $(_0x5afb72(0x3d7))['removeClass']('fixedtop');
});
$(_0x46b0bf(0x2bf))[_0x46b0bf(0x51b)](function() {
    var _0x393b6b = _0x46b0bf;
    $(_0x393b6b(0x293))['show'](0x64);
}), $(_0x46b0bf(0x5e2))[_0x46b0bf(0x51b)](function() {
    var _0x415b83 = _0x46b0bf;
    $(_0x415b83(0x293))[_0x415b83(0x2c7)](0x64);
});
