var _0x30d44f = _0x19a6;
(function(_0x1f9181, _0x2237f2) {
    var _0x160f04 = _0x19a6,
        _0x357036 = _0x1f9181();
    while (!![]) {
        try {
            var _0x35c63 = -parseInt(_0x160f04(0x50b)) / 0x1 + parseInt(_0x160f04(0x488)) / 0x2 + parseInt(_0x160f04(0x5ee)) / 0x3 * (-parseInt(_0x160f04(0x216)) / 0x4) + -parseInt(_0x160f04(0x2d6)) / 0x5 + parseInt(_0x160f04(0x210)) / 0x6 * (-parseInt(_0x160f04(0x484)) / 0x7) + parseInt(_0x160f04(0x1a5)) / 0x8 * (-parseInt(_0x160f04(0x234)) / 0x9) + parseInt(_0x160f04(0x2ec)) / 0xa;
            if (_0x35c63 === _0x2237f2) break;
            else _0x357036['push'](_0x357036['shift']());
        } catch (_0x3fcc84) {
            _0x357036['push'](_0x357036['shift']());
        }
    }
}(_0x5239, 0x7b520));
var normal = 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890';
const fontgenArray = [_0x30d44f(0x5d8), _0x30d44f(0x269), _0x30d44f(0x1d9), 'diametricAngleFrame', 'heartsBetween', 'fullCrazy', _0x30d44f(0x197), _0x30d44f(0x245), _0x30d44f(0x54f), _0x30d44f(0x141), _0x30d44f(0x4dd), _0x30d44f(0x29d), 'strikeThrough', _0x30d44f(0x2c6), 'underline', 'doubleUnderline', _0x30d44f(0x328), _0x30d44f(0x181)],
    fontgenArrayMap = ['invertedSquaresCharMapFun', _0x30d44f(0x3ac), _0x30d44f(0x35d), _0x30d44f(0x45d), 'bentTextCharMapFun', _0x30d44f(0x1f2), _0x30d44f(0x19b), _0x30d44f(0x486), _0x30d44f(0x3a4), _0x30d44f(0x5f8), _0x30d44f(0x1fc), 'squiggle5CharMapFun', _0x30d44f(0x169), _0x30d44f(0x568), _0x30d44f(0x1b0), _0x30d44f(0x51d), 'cursiveCharMapFun', _0x30d44f(0x4a3), _0x30d44f(0x34e), _0x30d44f(0x481), _0x30d44f(0x34d), _0x30d44f(0x123), 'greekCharMapFun', _0x30d44f(0x139), _0x30d44f(0x256), _0x30d44f(0x11b), 'asianStyle2CharMapFun'];

function applyCharMap(_0x207ab0, _0x1f154e) {
    var _0x194d16 = _0x30d44f;
    let _0x2449ed = '';
    for (let _0x44864b of _0x1f154e[_0x194d16(0x1f1)]('')) {
        if (_0x207ab0[_0x44864b] !== undefined) _0x2449ed += _0x207ab0[_0x44864b];
        else {
            if (_0x207ab0[_0x44864b[_0x194d16(0x573)]()] !== undefined) _0x2449ed += _0x207ab0[_0x44864b[_0x194d16(0x573)]()];
            else _0x2449ed += _0x44864b;
        }
    }
    return _0x2449ed;
}

function invertedSquaresCharMapFun(_0x1b75ef) {
    return applyCharMap(invertedSquaresCharMap, _0x1b75ef);
}

function wideTextCharMapFun(_0x65f399) {
    return applyCharMap(wideTextCharMap, _0x65f399);
}

function squaresCharMapFun(_0x1d2fdd) {
    return applyCharMap(squaresCharMap, _0x1d2fdd);
}

function subscriptCharMapFun(_0x5628c6) {
    return applyCharMap(subscriptCharMap, _0x5628c6);
}

function bentTextCharMapFun(_0x3f0e72) {
    return applyCharMap(bentTextCharMap, _0x3f0e72);
}

function neonCharMapFun(_0x4ef699) {
    return applyCharMap(neonCharMap, _0x4ef699);
}

function futureAlienCharMapFun(_0x3eccd6) {
    return applyCharMap(futureAlienCharMap, _0x3eccd6);
}

function squiggleCharMapFun(_0xf4ed51) {
    return applyCharMap(squiggleCharMap, _0xf4ed51);
}

function squiggle2CharMapFun(_0x3bf23d) {
    return applyCharMap(squiggle2CharMap, _0x3bf23d);
}

function squiggle3CharMapFun(_0x5b0d48) {
    return applyCharMap(squiggle3CharMap, _0x5b0d48);
}

function squiggle4CharMapFun(_0x5301e1) {
    return applyCharMap(squiggle4CharMap, _0x5301e1);
}

function squiggle5CharMapFun(_0x1e800a) {
    return applyCharMap(squiggle5CharMap, _0x1e800a);
}

function squiggle6CharMapFun(_0x505f64) {
    return applyCharMap(squiggle6CharMap, _0x505f64);
}

function boldCharMapFun(_0x260468) {
    return applyCharMap(boldCharMap, _0x260468);
}

function oldEnglishCharMapFun(_0x155bb2) {
    return applyCharMap(oldEnglishCharMap, _0x155bb2);
}

function medievalCharMapFun(_0x5a2183) {
    return applyCharMap(medievalCharMap, _0x5a2183);
}

function cursiveCharMapFun(_0x4f0f71) {
    return applyCharMap(cursiveCharMap, _0x4f0f71);
}

function doubleStruckCharMapFun(_0x2d01f9) {
    return applyCharMap(doubleStruckCharMap, _0x2d01f9);
}

function _0x19a6(_0x54403f, _0x5accba) {
    var _0x52393b = _0x5239();
    return _0x19a6 = function(_0x19a620, _0x395b64) {
        _0x19a620 = _0x19a620 - 0x109;
        var _0x2a9fa7 = _0x52393b[_0x19a620];
        return _0x2a9fa7;
    }, _0x19a6(_0x54403f, _0x5accba);
}

function italicCharMapFun(_0x39312e) {
    return applyCharMap(italicCharMap, _0x39312e);
}

function boldItalicCharMapFun(_0xe5cc64) {
    return applyCharMap(boldItalicCharMap, _0xe5cc64);
}

function monospaceCharMapFun(_0x149d80) {
    return applyCharMap(monospaceCharMap, _0x149d80);
}

function upperAnglesCharMapFun(_0x2ce88f) {
    return applyCharMap(upperAnglesCharMap, _0x2ce88f);
}

function greekCharMapFun(_0x340f18) {
    return applyCharMap(greekCharMap, _0x340f18);
}

function symbolsCharMapFun(_0x45f751) {
    return applyCharMap(symbolsCharMap, _0x45f751);
}

function currencyCharMapFun(_0x183350) {
    return applyCharMap(currencyCharMap, _0x183350);
}

function asianStyleCharMapFun(_0x47387a) {
    return applyCharMap(asianStyleCharMap, _0x47387a);
}

function asianStyle2CharMapFun(_0x1e2af3) {
    return applyCharMap(asianStyle2CharMap, _0x1e2af3);
}
var luni = new Lunicode();
luni['tools'][_0x30d44f(0x5e5)][_0x30d44f(0x130)][_0x30d44f(0x58d)] = 0xa;

function crazyWithFlourishOrSymbols(_0x2b510a) {
    var _0x2101a0 = _0x30d44f;
    if (Math[_0x2101a0(0x3a5)]() < 0.7) return wrapInSymbols(crazifyText(_0x2b510a), 0x2);
    else return wrapInFlourish(crazifyText(_0x2b510a), 0x2);
}

function strikeThrough(_0x88cb32) {
    var _0x22cd5e = _0x30d44f;
    return _0x88cb32['split']('')[_0x22cd5e(0x38e)]('̶') + '̶';
}

function tildeStrikeThrough(_0x388f95) {
    var _0x2b6234 = _0x30d44f;
    return _0x388f95[_0x2b6234(0x1f1)]('')[_0x2b6234(0x38e)]('̴') + '̴';
}

function underline(_0x5362bf) {
    var _0x1b577b = _0x30d44f;
    return _0x5362bf[_0x1b577b(0x1f1)]('')[_0x1b577b(0x38e)]('̲') + '̲';
}

function doubleUnderline(_0x3ff779) {
    return _0x3ff779['split']('')['join']('̳') + '̳';
}

function slashThrough(_0x3fd8f3) {
    var _0x1ec912 = _0x30d44f;
    return _0x3fd8f3[_0x1ec912(0x1f1)]('')[_0x1ec912(0x38e)]('̷') + '̷';
}

function stinky(_0x9e3ea2) {
    var _0x4d22b7 = _0x30d44f;
    return _0x9e3ea2[_0x4d22b7(0x1f1)]('')[_0x4d22b7(0x38e)]('̾') + '̾';
}

function heartsBetween(_0x467beb) {
    var _0x3c529d = _0x30d44f;
    return _0x467beb[_0x3c529d(0x1f1)]('')[_0x3c529d(0x38e)]('♥');
}

function arrowBelow(_0x43de27) {
    var _0x276da5 = _0x30d44f;
    return _0x43de27[_0x276da5(0x1f1)]('')[_0x276da5(0x38e)]('͎') + '͎';
}

function crossAboveBelow(_0x1f8e29) {
    var _0x473b84 = _0x30d44f;
    return _0x1f8e29[_0x473b84(0x1f1)]('')[_0x473b84(0x38e)]('͓̽') + '͓̽';
}
var f = {};
f['0'] = _0x30d44f(0x48a), f['1'] = '📂︎', f['2'] = _0x30d44f(0x2a0), f['3'] = '🗏︎', f['4'] = _0x30d44f(0x331), f['5'] = _0x30d44f(0x4a0), f['6'] = '⌛︎', f['7'] = _0x30d44f(0x5c5), f['8'] = _0x30d44f(0x14e), f['9'] = _0x30d44f(0x2fc), f['!'] = '✏︎', f['\x22'] = '✂︎', f['#'] = '✁︎', f['$'] = _0x30d44f(0x48b), f['%'] = _0x30d44f(0x366), f['&'] = _0x30d44f(0x349), f['\x27'] = '🕯︎', f['('] = '🕿︎', f[')'] = '✆︎', f['*'] = _0x30d44f(0x564), f['+'] = _0x30d44f(0x39d), f[','] = _0x30d44f(0x2ba), f['-'] = '📫︎', f['.'] = _0x30d44f(0x15e), f['/'] = '📭︎', f[':'] = _0x30d44f(0x19c), f[';'] = '🖴︎', f['<'] = _0x30d44f(0x110), f['='] = '🖬︎', f['>'] = '✇︎', f['?'] = '✍︎', f['A'] = '✌︎', f['B'] = _0x30d44f(0x25c), f['C'] = '👍︎', f['D'] = _0x30d44f(0x4c0), f['E'] = '☜︎', f['F'] = '☞︎', f['G'] = '☝︎', f['H'] = '☟︎', f['I'] = '✋︎', f['J'] = '☺︎', f['K'] = _0x30d44f(0x276), f['L'] = '☹︎', f['M'] = _0x30d44f(0x448), f['N'] = '☠︎', f['O'] = '⚐︎', f['P'] = '🏱︎', f['Q'] = '✈︎', f['R'] = '☼︎', f['S'] = _0x30d44f(0x5a0), f['T'] = '❄︎', f['U'] = '🕆︎', f['V'] = '✞︎', f['W'] = _0x30d44f(0x327), f['X'] = '✠︎', f['Y'] = '✡︎', f['Z'] = '☪︎', f['['] = '☯︎', f['\x5c'] = 'ॐ︎', f[']'] = '☸︎', f['^'] = '♈︎', f['_'] = '♉︎', f['`'] = '♊︎', f['a'] = '♋︎', f['b'] = '♌︎', f['c'] = '♍︎', f['d'] = '♎︎', f['e'] = '♏︎', f['f'] = '♐︎', f['g'] = '♑︎', f['h'] = '♒︎', f['i'] = '♓︎', f['j'] = '🙰', f['k'] = '🙵', f['l'] = '●︎', f['m'] = '❍︎', f['n'] = '■︎', f['o'] = '□︎', f['p'] = '◻︎', f['q'] = '❑︎', f['r'] = '❒︎', f['s'] = '⬧︎', f['t'] = '⧫︎', f['u'] = '◆︎', f['v'] = '❖︎', f['w'] = '⬥︎', f['x'] = '⌧︎', f['y'] = '⍓︎', f['z'] = '⌘︎', f['{'] = '❀︎', f['|'] = '✿︎', f['}'] = '❝︎', f['~'] = '❞︎', f['\x20'] = '▯︎', f['€'] = '⓪︎', f['\x20'] = '①︎', f['‚'] = '②︎', f['ƒ'] = '③︎', f['„'] = '④︎', f['…'] = '⑤︎', f['†'] = '⑥︎', f['‡'] = '⑦︎', f['ˆ'] = '⑧︎', f['‰'] = '⑨︎', f['Š'] = '⑩︎', f['‹'] = '⓿︎', f['Œ'] = '❶︎', f['\x20'] = '❷︎', f['Ž'] = '❸︎', f['\x20'] = '❹︎', f['\x20'] = '❺︎', f['‘'] = '❻︎', f['’'] = '❼︎', f['“'] = '❽︎', f['”'] = '❾︎', f['•'] = '❿︎', f['–'] = '◻︎', f['—'] = '◻︎', f['˜'] = '◻︎', f['™'] = '◻︎', f['š'] = '◻︎', f['›'] = '◻︎', f['œ'] = '◻︎', f['\x20'] = '◻︎', f['ž'] = '·︎', f['Ÿ'] = '•︎', f['¡'] = '○︎', f['¢'] = '⭕︎', f['£'] = '◻︎', f['¤'] = '◉︎', f['¥'] = '◎︎', f['¦'] = '◻︎', f['§'] = '▪︎', f['¨'] = '◻︎', f['©'] = '◻︎', f['ª'] = '✦︎', f['«'] = '★︎', f['¬'] = '✶︎', f['®'] = '✹︎', f['¯'] = '✵︎', f['°'] = '◻︎', f['±'] = '⌖︎', f['²'] = '⟡︎', f['³'] = '⌑︎', f['´'] = '◻︎', f['µ'] = '✪︎', f['¶'] = '✰︎', f['·'] = _0x30d44f(0x26d), f['¸'] = _0x30d44f(0x441), f['¹'] = _0x30d44f(0x4b0), f['º'] = _0x30d44f(0x39c), f['»'] = '🕔︎', f['¼'] = _0x30d44f(0x2c3), f['½'] = _0x30d44f(0x36c), f['¾'] = _0x30d44f(0x187), f['¿'] = '🕘︎', f['À'] = _0x30d44f(0x547), f['Á'] = _0x30d44f(0x5b2), f['Â'] = _0x30d44f(0x2f9), f['Ã'] = '◻︎', f['Ä'] = '◻︎', f['Å'] = '◻︎', f['Æ'] = '◻︎', f['Ç'] = '◻︎', f['È'] = '◻︎', f['É'] = '◻︎', f['Ê'] = '◻︎', f['Ë'] = '◻︎', f['Ì'] = '◻︎', f['Í'] = '◻︎', f['Î'] = '◻︎', f['Ï'] = '◻︎', f['Ð'] = '◻︎', f['Ñ'] = '◻︎', f['Ò'] = '◻︎', f['Ó'] = '◻︎', f['Ô'] = '◻︎', f['Õ'] = '⌫︎', f['Ö'] = '⌦︎', f['×'] = '◻︎', f['Ø'] = '➢︎', f['Ù'] = '◻︎', f['Ú'] = '◻︎', f['Û'] = '◻︎', f['Ü'] = '➲︎', f['Ý'] = '◻︎', f['Þ'] = '◻︎', f['ß'] = '◻︎', f['à'] = '◻︎', f['á'] = '◻︎', f['â'] = '◻︎', f['ã'] = '◻︎', f['ä'] = '◻︎', f['å'] = '◻︎', f['æ'] = '◻︎', f['ç'] = '◻︎', f['è'] = '➔︎', f['é'] = '◻︎', f['ê'] = '◻︎', f['ë'] = '◻︎', f['ì'] = '◻︎', f['í'] = '◻︎', f['î'] = '◻︎', f['ï'] = '⇦︎', f['ð'] = '⇨︎', f['ñ'] = '⇧︎', f['ò'] = '⇩︎', f['ó'] = '⬄︎', f['ô'] = '⇳︎', f['õ'] = '⬀︎', f['ö'] = '⬁︎', f['÷'] = '⬃︎', f['ø'] = '⬂︎', f['ù'] = '▭︎', f['ú'] = '▫︎', f['û'] = '✗︎', f['ü'] = '✓︎', f['ý'] = '☒︎', f['þ'] = '☑︎', f['ÿ'] = '◻︎';
const wingdingsCharMap = f;

function wingdings(_0x1ec2c1) {
    var _0x356b94 = _0x30d44f;
    return _0x1ec2c1[_0x356b94(0x1f1)]('')[_0x356b94(0x1ce)](function(_0x166a0c) {
        return wingdingsCharMap[_0x166a0c] ? wingdingsCharMap[_0x166a0c] : _0x166a0c;
    })[_0x356b94(0x38e)]('');
}
var g = {};
g['\x20'] = '\u3000', g['`'] = '`', g['1'] = '１', g['2'] = '２', g['3'] = '３', g['4'] = '４', g['5'] = '５', g['6'] = '６', g['7'] = '７', g['8'] = '８', g['9'] = '９', g['0'] = '０', g['-'] = '－', g['='] = '＝', g['~'] = '~', g['!'] = '！', g['@'] = '＠', g['#'] = '＃', g['$'] = '＄', g['%'] = '％', g['^'] = '^', g['&'] = '＆', g['*'] = '＊', g['('] = '（', g[')'] = '）', g['_'] = '_', g['+'] = '＋', g['q'] = 'ｑ', g['w'] = 'ｗ', g['e'] = 'ｅ', g['r'] = 'ｒ', g['t'] = 'ｔ', g['y'] = 'ｙ', g['u'] = 'ｕ', g['i'] = 'ｉ', g['o'] = 'ｏ', g['p'] = 'ｐ', g['['] = '[', g[']'] = ']', g['\x5c'] = '\x5c', g['Q'] = 'Ｑ', g['W'] = 'Ｗ', g['E'] = 'Ｅ', g['R'] = 'Ｒ', g['T'] = 'Ｔ', g['Y'] = 'Ｙ', g['U'] = 'Ｕ', g['I'] = 'Ｉ', g['O'] = 'Ｏ', g['P'] = 'Ｐ', g['{'] = '{', g['}'] = '}', g['|'] = '|', g['a'] = 'ａ', g['s'] = 'ｓ', g['d'] = 'ｄ', g['f'] = 'ｆ', g['g'] = 'ｇ', g['h'] = 'ｈ', g['j'] = 'ｊ', g['k'] = 'ｋ', g['l'] = 'ｌ', g[';'] = '；', g['\x27'] = '＇', g['A'] = 'Ａ', g['S'] = 'Ｓ', g['D'] = 'Ｄ', g['F'] = 'Ｆ', g['G'] = 'Ｇ', g['H'] = 'Ｈ', g['J'] = 'Ｊ', g['K'] = 'Ｋ', g['L'] = 'Ｌ', g[':'] = '：', g['\x22'] = '\x22', g['z'] = 'ｚ', g['x'] = 'ｘ', g['c'] = 'ｃ', g['v'] = 'ｖ', g['b'] = 'ｂ', g['n'] = 'ｎ', g['m'] = 'ｍ', g[','] = '，', g['.'] = '．', g['/'] = '／', g['Z'] = 'Ｚ', g['X'] = 'Ｘ', g['C'] = 'Ｃ', g['V'] = 'Ｖ', g['B'] = 'Ｂ', g['N'] = 'Ｎ', g['M'] = 'Ｍ', g['<'] = '<', g['>'] = '>', g['?'] = '？';
const vaporwaveCharMap = g;

function vaporwaveText(_0x13bbd7) {
    var _0x1bcca9 = _0x30d44f,
        _0x2a1abe = _0x13bbd7[_0x1bcca9(0x1f1)]('\x20')[_0x1bcca9(0x52a)];
    _0x13bbd7 = applyCharMap(vaporwaveCharMap, _0x13bbd7);
    var _0x4a28f9 = getAsianChars(Math[_0x1bcca9(0x176)](0x3, _0x2a1abe));
    if (_0x2a1abe > 0x6) _0x4a28f9 = _0x4a28f9[_0x1bcca9(0x1f1)]('')[_0x1bcca9(0x1ce)](_0x3444dc => _0x3444dc + ['', ''][Math['round'](Math[_0x1bcca9(0x3a5)]() * 0.6)])[_0x1bcca9(0x38e)]('');
    var _0x202518 = [];
    return _0x202518[_0x1bcca9(0x507)](_0x13bbd7), _0x202518[_0x1bcca9(0x38e)]();
}

function vaporwaveText1(_0x5dfa5d) {
    var _0x2d44eb = _0x30d44f,
        _0x57e92d = _0x5dfa5d[_0x2d44eb(0x1f1)]('\x20')['length'];
    _0x5dfa5d = applyCharMap(vaporwaveCharMap, _0x5dfa5d);
    var _0x3f1f58 = getAsianChars(Math[_0x2d44eb(0x176)](0x3, _0x57e92d));
    if (_0x57e92d > 0x6) _0x3f1f58 = _0x3f1f58[_0x2d44eb(0x1f1)]('')[_0x2d44eb(0x1ce)](_0x35ca15 => _0x35ca15 + ['', ''][Math[_0x2d44eb(0x2e8)](Math[_0x2d44eb(0x3a5)]() * 0.6)])[_0x2d44eb(0x38e)]('');
    var _0x3b2e44 = [];
    return _0x3b2e44[_0x2d44eb(0x507)](_0x5dfa5d[_0x2d44eb(0x325)](/　/g, '░')[_0x2d44eb(0x325)](/ａｅ/, 'æ')[_0x2d44eb(0x325)](/Ａ/g, 'Λ')['replace'](/Ｅ/g, function() {
        var _0x3a3a2b = _0x2d44eb;
        return Math[_0x3a3a2b(0x3a5)]() > 0.5 ? 'Ξ' : 'Σ';
    })[_0x2d44eb(0x325)](/Ｏ/g, '♢')), _0x3b2e44[_0x2d44eb(0x38e)]();
}

function vaporwaveText2(_0x54b4da) {
    var _0xfc808a = _0x30d44f,
        _0x2cbad9 = _0x54b4da[_0xfc808a(0x1f1)]('\x20')[_0xfc808a(0x52a)];
    _0x54b4da = applyCharMap(vaporwaveCharMap, _0x54b4da);
    var _0x20fd69 = getAsianChars(Math['max'](0x3, _0x2cbad9));
    if (_0x2cbad9 > 0x6) _0x20fd69 = _0x20fd69[_0xfc808a(0x1f1)]('')[_0xfc808a(0x1ce)](_0xbdd913 => _0xbdd913 + ['', ''][Math[_0xfc808a(0x2e8)](Math[_0xfc808a(0x3a5)]() * 0.6)])[_0xfc808a(0x38e)]('');
    var _0x4c5fab = [];
    return _0x4c5fab[_0xfc808a(0x507)]('【\ufeff' + _0x54b4da + '】'), _0x4c5fab[_0xfc808a(0x38e)]();
}

function getAsianChars(_0x36190c) {
    var _0x10a2bc = _0x30d44f;
    if (!_0x36190c) _0x36190c = 0x1;
    var _0x1bc8df = 'リサフランク現代のコンピュ竹内\x20まりや若者が履く流行のスニーカー真夜中のドアホットドッグマスターストライカーソニーブギ新しい日の誕生ライフ\x20-\x20ヒスイ蒸気波\x20無線゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゙゚゛゜ゝゞゟ亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育壱逸茨芋引印因咽姻員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科',
        _0x3664cc = '';
    for (var _0x9521f9 = 0x0; _0x9521f9 < _0x36190c; _0x9521f9++) {
        _0x3664cc += _0x1bc8df[Math[_0x10a2bc(0x21a)](Math[_0x10a2bc(0x3a5)]() * _0x1bc8df[_0x10a2bc(0x52a)])];
    }
    return _0x3664cc;
}
const flourishArray = [_0x30d44f(0x406), _0x30d44f(0x4c4), _0x30d44f(0x221), _0x30d44f(0x375), _0x30d44f(0x404), _0x30d44f(0x2eb), _0x30d44f(0x13c), _0x30d44f(0x595), _0x30d44f(0x30b), '[[text]]\x20☜(`o´)', '⎝⎝✧GͥOͣDͫ✧⎠⎠\x20[[text]]\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', _0x30d44f(0x27b), _0x30d44f(0x16b), '┗(^o^\x20)┓三\x20[[text]]\x20三\x20┗(^o^\x20)┓', _0x30d44f(0x53e), _0x30d44f(0x4fa), _0x30d44f(0x5cf), _0x30d44f(0x2b0), _0x30d44f(0x55a), '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20[[text]]\x20°º¤ø,¸¸,ø¤º°`°º¤ø,¸', 'ıllıllı\x20[[text]]\x20ıllıllı', _0x30d44f(0x235), _0x30d44f(0x11f), _0x30d44f(0x321), _0x30d44f(0x359), '*•.¸♡\x20[[text]]\x20♡¸.•*', '╰☆☆\x20[[text]]\x20☆☆╮', _0x30d44f(0x3a3), _0x30d44f(0x50e), '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', _0x30d44f(0x2e1), _0x30d44f(0x209), _0x30d44f(0x2e0), '•´¯`•.\x20[[text]]\x20.•´¯`•', '§.•´¨\x27°÷•..×\x20[[text]]\x20×,.•´¨\x27°÷•..§', _0x30d44f(0x54e), _0x30d44f(0x412), _0x30d44f(0x30a), _0x30d44f(0x439), _0x30d44f(0x17d), _0x30d44f(0x50e), _0x30d44f(0x3ad), '•´¯`•»\x20[[text]]\x20«•´¯`•', '\x20.o0×X×0o.\x20[[text]]\x20.o0×X×0o.', _0x30d44f(0x13b), _0x30d44f(0x501), '¸,ø¤º°`°º¤ø,¸\x20[[text]]\x20¸,ø¤º°`°º¤ø,¸', _0x30d44f(0x4b5), _0x30d44f(0x1b1), _0x30d44f(0x3fc), _0x30d44f(0x2ca), _0x30d44f(0x51a), _0x30d44f(0x33f), _0x30d44f(0x4a6), _0x30d44f(0x1cd), _0x30d44f(0x203), _0x30d44f(0x299), _0x30d44f(0x294), _0x30d44f(0x20f), _0x30d44f(0x1f8), '๑۞๑,¸¸,ø¤º°`°๑۩\x20[[text]]\x20๑۩\x20,¸¸,ø¤º°`°๑۞๑', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', _0x30d44f(0x13a), _0x30d44f(0x13b), _0x30d44f(0x598), _0x30d44f(0x54b), '╚»★«╝\x20[[text]]\x20╚»★«╝', _0x30d44f(0x3e2), _0x30d44f(0x563), _0x30d44f(0x5f0), _0x30d44f(0x129), _0x30d44f(0x1ee), _0x30d44f(0x19f), _0x30d44f(0x4ad), _0x30d44f(0x48d), _0x30d44f(0x2bc), _0x30d44f(0x281), _0x30d44f(0x471)];

function wrapInFlourish(_0x2df73a) {
    var _0x43be67 = _0x30d44f;
    return flourishArray[Math['floor'](Math[_0x43be67(0x3a5)]() * flourishArray[_0x43be67(0x52a)])]['replace'](_0x43be67(0x56e), _0x2df73a);
}

function Flourishlist(_0x4a4ccf, _0x511a84) {
    var _0x51e15c = _0x30d44f;
    return flourishArray[_0x4a4ccf]['replace'](_0x51e15c(0x56e), _0x511a84);
}

function wrapInSymbols(_0x1ebc35, _0x592017) {
    return randomSymbols(_0x592017) + '\x20\x20' + _0x1ebc35 + '\x20\x20' + randomSymbols(_0x592017);
}

function firework(_0x5eb557) {
    var _0x53c494 = _0x30d44f;
    return _0x5eb557[_0x53c494(0x1f1)]('')[_0x53c494(0x38e)]('҉') + '҉';
}

function weirdBox(_0x5819d0) {
    var _0x1fb6c5 = _0x30d44f;
    return _0x5819d0['replace'](/([^\s])/g, _0x1fb6c5(0x311));
}

function littleSparkles(_0x2cf22a) {
    var _0x5bd8b3 = _0x30d44f;
    return _0x5bd8b3(0x1b7) + _0x2cf22a + '\x20•°*”˜.•°*”˜';
}

function kirbyHug(_0x35ce9d) {
    var _0x448847 = _0x30d44f;
    return _0x448847(0x199) + _0x35ce9d + '\x20♥';
}

function dottyJoiner(_0x2acc55) {
    var _0x58662f = _0x30d44f;
    return '░' + _0x2acc55[_0x58662f(0x1f1)]('')[_0x58662f(0x38e)]('░') + '░';
}

function wavyJoiner(_0x58a244) {
    var _0x3acce6 = _0x30d44f;
    return '≋' + _0x58a244[_0x3acce6(0x1f1)]('')[_0x3acce6(0x38e)]('≋') + '≋';
}

function diametricAngleFrame(_0xa21097) {
    var _0x179d7e = _0x30d44f;
    return _0xa21097[_0x179d7e(0x325)](/([^\s])/g, _0x179d7e(0x3d8));
}

function thickBlockFramed(_0x1cebbc) {
    var _0x4bdacc = _0x30d44f;
    return _0x1cebbc['replace'](/([^\s])/g, _0x4bdacc(0x59e));
}
var h = {};
h['1'] = '&alpha;', h['2'] = _0x30d44f(0x4b3), h['3'] = _0x30d44f(0x3fe), h['4'] = _0x30d44f(0x1d2), h['5'] = _0x30d44f(0x49d), h['6'] = _0x30d44f(0x376), h['7'] = '&#608;', h['8'] = _0x30d44f(0x270), h['9'] = '&iota;', h['10'] = _0x30d44f(0x2f4), h['11'] = _0x30d44f(0x3eb), h['12'] = _0x30d44f(0x492), h['13'] = '&#625;', h['14'] = '&#627;', h['15'] = _0x30d44f(0x405), h['16'] = _0x30d44f(0x33e), h['17'] = _0x30d44f(0x496), h['18'] = _0x30d44f(0x1cf), h['19'] = _0x30d44f(0x402), h['20'] = '&#410;', h['21'] = _0x30d44f(0x4e3), h['22'] = _0x30d44f(0x4b7), h['23'] = _0x30d44f(0x21d), h['24'] = 'x', h['25'] = _0x30d44f(0x334), h['26'] = '&#549;', h['27'] = 'A', h['28'] = 'B', h['29'] = 'C', h['30'] = 'D', h['31'] = 'E', h['32'] = 'F', h['33'] = 'G', h['34'] = 'H', h['35'] = 'I', h['36'] = 'J', h['37'] = 'K', h['38'] = 'L', h['39'] = 'M', h['40'] = 'N', h['41'] = 'O', h['42'] = 'P', h['43'] = 'Q', h['44'] = 'R', h['45'] = 'S', h['46'] = 'T', h['47'] = 'U', h['48'] = 'V', h['49'] = 'W', h['50'] = 'X', h['51'] = 'Y', h['52'] = 'Z', h['53'] = '1', h['54'] = '2', h['55'] = '3', h['56'] = '4', h['57'] = '5', h['58'] = '6', h['59'] = '7', h['60'] = '8', h['61'] = '9', h['62'] = '0';
var i = {};
i['1'] = _0x30d44f(0x227), i['2'] = _0x30d44f(0x5af), i['3'] = _0x30d44f(0x43f), i['4'] = _0x30d44f(0x3b5), i['5'] = '&euro;', i['6'] = '&#988;', i['7'] = '&#10081;', i['8'] = '&#9796;', i['9'] = _0x30d44f(0x145), i['10'] = _0x30d44f(0x3b6), i['11'] = _0x30d44f(0x433), i['12'] = _0x30d44f(0x2a5), i['13'] = '&#9812;', i['14'] = _0x30d44f(0x539), i['15'] = '&#8857;', i['16'] = _0x30d44f(0x33e), i['17'] = _0x30d44f(0x529), i['18'] = _0x30d44f(0x4c9), i['19'] = _0x30d44f(0x251), i['20'] = '&#9730;', i['21'] = _0x30d44f(0x2b6), i['22'] = '&#10003;', i['23'] = _0x30d44f(0x1dc), i['24'] = _0x30d44f(0x338), i['25'] = _0x30d44f(0x1ae), i['26'] = _0x30d44f(0x482), i['27'] = '&#41807;', i['28'] = '&#9837;', i['29'] = _0x30d44f(0x43f), i['30'] = _0x30d44f(0x3b5), i['31'] = _0x30d44f(0x5c7), i['32'] = _0x30d44f(0x37e), i['33'] = _0x30d44f(0x12c), i['34'] = '&#9796;', i['35'] = _0x30d44f(0x145), i['36'] = _0x30d44f(0x3b6), i['37'] = _0x30d44f(0x433), i['38'] = _0x30d44f(0x2a5), i['39'] = '&#9812;', i['40'] = '&#9835;', i['41'] = '&#8857;', i['42'] = '&rho;', i['43'] = _0x30d44f(0x529), i['44'] = '&#9736;', i['45'] = _0x30d44f(0x251), i['46'] = '&#9730;', i['47'] = '&#9739;', i['48'] = _0x30d44f(0x1ff), i['49'] = _0x30d44f(0x1dc), i['50'] = _0x30d44f(0x338), i['51'] = '&#9791;', i['52'] = _0x30d44f(0x482), i['53'] = _0x30d44f(0x22f), i['54'] = '&#10123;', i['55'] = _0x30d44f(0x58e), i['56'] = _0x30d44f(0x558), i['57'] = '&#10126;', i['58'] = '&#10127;', i['59'] = _0x30d44f(0x5bf), i['60'] = _0x30d44f(0x4d3), i['61'] = _0x30d44f(0x5b1), i['62'] = '&#9450;';
var j = {};
j['1'] = _0x30d44f(0x16c), j['2'] = _0x30d44f(0x5a6), j['3'] = _0x30d44f(0x544), j['4'] = _0x30d44f(0x198), j['5'] = _0x30d44f(0x2c7), j['6'] = _0x30d44f(0x255), j['7'] = _0x30d44f(0x280), j['8'] = '&#292;', j['9'] = '&#296;', j['10'] = _0x30d44f(0x446), j['11'] = '&#310;', j['12'] = _0x30d44f(0x337), j['13'] = '&#1052;', j['14'] = _0x30d44f(0x17c), j['15'] = _0x30d44f(0x127), j['16'] = _0x30d44f(0x506), j['17'] = 'Q', j['18'] = _0x30d44f(0x2a4), j['19'] = _0x30d44f(0x36b), j['20'] = '&#356;', j['21'] = _0x30d44f(0x436), j['22'] = 'V', j['23'] = '&#372;', j['24'] = _0x30d44f(0x42c), j['25'] = _0x30d44f(0x521), j['26'] = _0x30d44f(0x4aa), j['27'] = _0x30d44f(0x16c), j['28'] = _0x30d44f(0x5a6), j['29'] = _0x30d44f(0x544), j['30'] = _0x30d44f(0x198), j['31'] = '&#276;', j['32'] = _0x30d44f(0x255), j['33'] = _0x30d44f(0x280), j['34'] = _0x30d44f(0x1f7), j['35'] = _0x30d44f(0x53b), j['36'] = _0x30d44f(0x446), j['37'] = '&#310;', j['38'] = _0x30d44f(0x337), j['39'] = _0x30d44f(0x23c), j['40'] = _0x30d44f(0x17c), j['41'] = '&#336;', j['42'] = '&#1056;', j['43'] = 'Q', j['44'] = _0x30d44f(0x2a4), j['45'] = _0x30d44f(0x36b), j['46'] = _0x30d44f(0x2df), j['47'] = _0x30d44f(0x436), j['48'] = 'V', j['49'] = _0x30d44f(0x27c), j['50'] = _0x30d44f(0x42c), j['51'] = _0x30d44f(0x521), j['52'] = _0x30d44f(0x4aa), j['53'] = '1', j['54'] = '2', j['55'] = '3', j['56'] = '4', j['57'] = '5', j['58'] = '6', j['59'] = '7', j['60'] = '8', j['61'] = '9', j['62'] = '0';
var k = {};
k['1'] = '&#592;', k['2'] = 'q', k['3'] = _0x30d44f(0x213), k['4'] = 'p', k['5'] = _0x30d44f(0x519), k['6'] = _0x30d44f(0x58c), k['7'] = '&#387;', k['8'] = _0x30d44f(0x414), k['9'] = '&#7433;', k['10'] = _0x30d44f(0x1cf), k['11'] = _0x30d44f(0x293), k['12'] = 'l', k['13'] = _0x30d44f(0x21d), k['14'] = 'u', k['15'] = 'o', k['16'] = 'd', k['17'] = 'b', k['18'] = _0x30d44f(0x3e9), k['19'] = 's', k['20'] = '&#647;', k['21'] = 'n', k['22'] = _0x30d44f(0x2d0), k['23'] = _0x30d44f(0x133), k['24'] = 'x', k['25'] = _0x30d44f(0x592), k['26'] = 'z', k['27'] = '&#592;', k['28'] = 'q', k['29'] = _0x30d44f(0x213), k['30'] = 'p', k['31'] = _0x30d44f(0x519), k['32'] = _0x30d44f(0x58c), k['33'] = _0x30d44f(0x140), k['34'] = '&#613;', k['35'] = _0x30d44f(0x1cc), k['36'] = _0x30d44f(0x1cf), k['37'] = '&#670;', k['38'] = 'l', k['39'] = _0x30d44f(0x21d), k['40'] = 'u', k['41'] = 'o', k['42'] = 'd', k['43'] = 'b', k['44'] = '&#633;', k['45'] = 's', k['46'] = _0x30d44f(0x54c), k['47'] = 'n', k['48'] = _0x30d44f(0x2d0), k['49'] = _0x30d44f(0x133), k['50'] = 'x', k['51'] = '&#654;', k['52'] = 'z', k['53'] = _0x30d44f(0x42d), k['54'] = _0x30d44f(0x475), k['55'] = _0x30d44f(0x20d), k['56'] = _0x30d44f(0x3a9), k['57'] = _0x30d44f(0x39f), k['58'] = '9', k['59'] = _0x30d44f(0x3b4), k['60'] = '8', k['61'] = '6', k['62'] = '0';
var l = {};
l['1'] = _0x30d44f(0x318), l['2'] = _0x30d44f(0x5a6), l['3'] = '&#262;', l['4'] = _0x30d44f(0x177), l['5'] = _0x30d44f(0x5c7), l['6'] = '&#8355;', l['7'] = _0x30d44f(0x5d3), l['8'] = _0x30d44f(0x450), l['9'] = '&#407;', l['10'] = '&#308;', l['11'] = _0x30d44f(0x2f3), l['12'] = _0x30d44f(0x4be), l['13'] = _0x30d44f(0x2e7), l['14'] = _0x30d44f(0x451), l['15'] = _0x30d44f(0x5e4), l['16'] = '&#420;', l['17'] = _0x30d44f(0x174), l['18'] = _0x30d44f(0x468), l['19'] = _0x30d44f(0x272), l['20'] = _0x30d44f(0x255), l['21'] = '&#7918;', l['22'] = 'V', l['23'] = _0x30d44f(0x27c), l['24'] = _0x30d44f(0x42c), l['25'] = _0x30d44f(0x528), l['26'] = _0x30d44f(0x1e1), l['27'] = _0x30d44f(0x318), l['28'] = _0x30d44f(0x5a6), l['29'] = _0x30d44f(0x4ce), l['30'] = _0x30d44f(0x177), l['31'] = _0x30d44f(0x5c7), l['32'] = '&#8355;', l['33'] = _0x30d44f(0x5d3), l['34'] = '&#294;', l['35'] = _0x30d44f(0x355), l['36'] = _0x30d44f(0x446), l['37'] = _0x30d44f(0x2f3), l['38'] = _0x30d44f(0x4be), l['39'] = _0x30d44f(0x2e7), l['40'] = _0x30d44f(0x451), l['41'] = '&Oslash;', l['42'] = '&#420;', l['43'] = _0x30d44f(0x174), l['44'] = '&#344;', l['45'] = _0x30d44f(0x272), l['46'] = _0x30d44f(0x255), l['47'] = _0x30d44f(0x316), l['48'] = 'V', l['49'] = '&#372;', l['50'] = _0x30d44f(0x42c), l['51'] = _0x30d44f(0x528), l['52'] = '&#381;', l['53'] = '1', l['54'] = '2', l['55'] = '3', l['56'] = '4', l['57'] = '5', l['58'] = '6', l['59'] = '7', l['60'] = '8', l['61'] = '9', l['62'] = '0';
var m = {};
m['1'] = _0x30d44f(0x1e7), m['2'] = '&#595;', m['3'] = _0x30d44f(0x290), m['4'] = '&part;', m['5'] = _0x30d44f(0x158), m['6'] = '&fnof;', m['7'] = '&#608;', m['8'] = _0x30d44f(0x43e), m['9'] = '&#3648;', m['10'] = _0x30d44f(0x2f4), m['11'] = _0x30d44f(0x41a), m['12'] = _0x30d44f(0x455), m['13'] = _0x30d44f(0x5a5), m['14'] = '&#627;', m['15'] = _0x30d44f(0x405), m['16'] = _0x30d44f(0x33e), m['17'] = _0x30d44f(0x230), m['18'] = _0x30d44f(0x59f), m['19'] = _0x30d44f(0x57d), m['20'] = _0x30d44f(0x52c), m['21'] = '&micro;', m['22'] = _0x30d44f(0x361), m['23'] = '&omega;', m['24'] = '&#1488;', m['25'] = '&#4327;', m['26'] = '&#438;', m['27'] = '&alpha;', m['28'] = _0x30d44f(0x2b8), m['29'] = _0x30d44f(0x290), m['30'] = '&part;', m['31'] = _0x30d44f(0x158), m['32'] = _0x30d44f(0x20e), m['33'] = '&#608;', m['34'] = '&#614;', m['35'] = _0x30d44f(0x44b), m['36'] = '&#669;', m['37'] = _0x30d44f(0x41a), m['38'] = _0x30d44f(0x455), m['39'] = _0x30d44f(0x5a5), m['40'] = _0x30d44f(0x1bc), m['41'] = _0x30d44f(0x405), m['42'] = '&rho;', m['43'] = '&phi;', m['44'] = _0x30d44f(0x59f), m['45'] = _0x30d44f(0x57d), m['46'] = _0x30d44f(0x52c), m['47'] = '&micro;', m['48'] = _0x30d44f(0x361), m['49'] = _0x30d44f(0x1dc), m['50'] = _0x30d44f(0x1b9), m['51'] = _0x30d44f(0x334), m['52'] = _0x30d44f(0x4d0), m['53'] = '1', m['54'] = '2', m['55'] = '3', m['56'] = '4', m['57'] = '5', m['58'] = '6', m['59'] = '7', m['60'] = '8', m['61'] = '9', m['62'] = '0';
var n = {};
n['1'] = '&#5609;', n['2'] = _0x30d44f(0x29f), n['3'] = _0x30d44f(0x114), n['4'] = _0x30d44f(0x467), n['5'] = '&#5620;', n['6'] = _0x30d44f(0x4a1), n['7'] = _0x30d44f(0x5d3), n['8'] = '&#5500;', n['9'] = _0x30d44f(0x229), n['10'] = _0x30d44f(0x15c), n['11'] = _0x30d44f(0x542), n['12'] = _0x30d44f(0x5e9), n['13'] = _0x30d44f(0x37b), n['14'] = _0x30d44f(0x335), n['15'] = _0x30d44f(0x3c9), n['16'] = _0x30d44f(0x1ab), n['17'] = _0x30d44f(0x188), n['18'] = _0x30d44f(0x431), n['19'] = '&#5397;', n['20'] = _0x30d44f(0x322), n['21'] = _0x30d44f(0x126), n['22'] = _0x30d44f(0x3d4), n['23'] = '&#5615;', n['24'] = _0x30d44f(0x5b0), n['25'] = _0x30d44f(0x292), n['26'] = _0x30d44f(0x4c2), n['27'] = _0x30d44f(0x4e0), n['28'] = _0x30d44f(0x29f), n['29'] = _0x30d44f(0x114), n['30'] = _0x30d44f(0x467), n['31'] = '&#5620;', n['32'] = '&#5556;', n['33'] = '&#484;', n['34'] = _0x30d44f(0x478), n['35'] = _0x30d44f(0x229), n['36'] = _0x30d44f(0x15c), n['37'] = '&#5845;', n['38'] = _0x30d44f(0x5e9), n['39'] = _0x30d44f(0x37b), n['40'] = _0x30d44f(0x335), n['41'] = _0x30d44f(0x3c9), n['42'] = '&#5229;', n['43'] = _0x30d44f(0x188), n['44'] = _0x30d44f(0x431), n['45'] = _0x30d44f(0x3c8), n['46'] = _0x30d44f(0x322), n['47'] = '&#5196;', n['48'] = _0x30d44f(0x3d4), n['49'] = _0x30d44f(0x354), n['50'] = '&#5741;', n['51'] = '&#435;', n['52'] = _0x30d44f(0x4c2), n['53'] = '1', n['54'] = '2', n['55'] = '3', n['56'] = '4', n['57'] = '5', n['58'] = '6', n['59'] = '7', n['60'] = '8', n['61'] = '9', n['62'] = '0';
var o = {};
o['1'] = _0x30d44f(0x27e), o['2'] = _0x30d44f(0x1ed), o['3'] = _0x30d44f(0x154), o['4'] = _0x30d44f(0x3ee), o['5'] = _0x30d44f(0x59d), o['6'] = 'f', o['7'] = _0x30d44f(0x4cb), o['8'] = 'h', o['9'] = _0x30d44f(0x1be), o['10'] = _0x30d44f(0x5ec), o['11'] = _0x30d44f(0x1de), o['12'] = 'l', o['13'] = _0x30d44f(0x247), o['14'] = _0x30d44f(0x1aa), o['15'] = _0x30d44f(0x44a), o['16'] = _0x30d44f(0x33e), o['17'] = '&#4306;', o['18'] = _0x30d44f(0x48f), o['19'] = _0x30d44f(0x358), o['20'] = _0x30d44f(0x4db), o['21'] = _0x30d44f(0x4e3), o['22'] = _0x30d44f(0x557), o['23'] = 'w', o['24'] = _0x30d44f(0x4f0), o['25'] = _0x30d44f(0x334), o['26'] = _0x30d44f(0x15f), o['27'] = _0x30d44f(0x27e), o['28'] = _0x30d44f(0x1ed), o['29'] = '&#4308;', o['30'] = _0x30d44f(0x3ee), o['31'] = _0x30d44f(0x59d), o['32'] = 'f', o['33'] = _0x30d44f(0x4cb), o['34'] = 'h', o['35'] = _0x30d44f(0x1be), o['36'] = '&#4325;', o['37'] = _0x30d44f(0x1de), o['38'] = 'l', o['39'] = _0x30d44f(0x247), o['40'] = _0x30d44f(0x1aa), o['41'] = _0x30d44f(0x44a), o['42'] = '&rho;', o['43'] = _0x30d44f(0x10b), o['44'] = _0x30d44f(0x48f), o['45'] = _0x30d44f(0x358), o['46'] = '&#3923;', o['47'] = _0x30d44f(0x4e3), o['48'] = _0x30d44f(0x557), o['49'] = 'w', o['50'] = _0x30d44f(0x4f0), o['51'] = _0x30d44f(0x334), o['52'] = _0x30d44f(0x15f), o['53'] = '1', o['54'] = '2', o['55'] = '3', o['56'] = '4', o['57'] = '5', o['58'] = '6', o['59'] = '7', o['60'] = '8', o['61'] = '9', o['62'] = '0';
var p = {};
p['1'] = _0x30d44f(0x202), p['2'] = '&#1074;', p['3'] = _0x30d44f(0x1ea), p['4'] = _0x30d44f(0x16f), p['5'] = _0x30d44f(0x340), p['6'] = _0x30d44f(0x3e4), p['7'] = _0x30d44f(0x5c1), p['8'] = _0x30d44f(0x35c), p['9'] = _0x30d44f(0x42e), p['10'] = '&#1112;', p['11'] = _0x30d44f(0x31d), p['12'] = _0x30d44f(0x27a), p['13'] = '&#1084;', p['14'] = _0x30d44f(0x2fe), p['15'] = _0x30d44f(0x3b9), p['16'] = _0x30d44f(0x33e), p['17'] = 'q', p['18'] = _0x30d44f(0x159), p['19'] = _0x30d44f(0x131), p['20'] = _0x30d44f(0x497), p['21'] = _0x30d44f(0x3e3), p['22'] = _0x30d44f(0x30d), p['23'] = _0x30d44f(0x265), p['24'] = 'x', p['25'] = _0x30d44f(0x410), p['26'] = _0x30d44f(0x4a2), p['27'] = _0x30d44f(0x202), p['28'] = _0x30d44f(0x1c7), p['29'] = _0x30d44f(0x1ea), p['30'] = _0x30d44f(0x16f), p['31'] = _0x30d44f(0x340), p['32'] = _0x30d44f(0x3e4), p['33'] = '&#291;', p['34'] = _0x30d44f(0x35c), p['35'] = _0x30d44f(0x42e), p['36'] = '&#1112;', p['37'] = _0x30d44f(0x31d), p['38'] = '&#315;', p['39'] = '&#1084;', p['40'] = _0x30d44f(0x2fe), p['41'] = '&#972;', p['42'] = _0x30d44f(0x33e), p['43'] = 'q', p['44'] = _0x30d44f(0x159), p['45'] = '&#351;', p['46'] = _0x30d44f(0x497), p['47'] = _0x30d44f(0x3e3), p['48'] = _0x30d44f(0x30d), p['49'] = _0x30d44f(0x265), p['50'] = 'x', p['51'] = _0x30d44f(0x410), p['52'] = _0x30d44f(0x4a2), p['53'] = '1', p['54'] = '2', p['55'] = '3', p['56'] = '4', p['57'] = '5', p['58'] = '6', p['59'] = '7', p['60'] = '8', p['61'] = '9', p['62'] = '0';
var q = {};
q['1'] = '&#41707;', q['2'] = _0x30d44f(0x466), q['3'] = '&#41976;', q['4'] = '&#41045;', q['5'] = _0x30d44f(0x5e3), q['6'] = _0x30d44f(0x18d), q['7'] = '&#41037;', q['8'] = _0x30d44f(0x4bf), q['9'] = _0x30d44f(0x231), q['10'] = '&#41005;', q['11'] = _0x30d44f(0x50f), q['12'] = _0x30d44f(0x1c6), q['13'] = _0x30d44f(0x25a), q['14'] = '&#41081;', q['15'] = _0x30d44f(0x4f3), q['16'] = _0x30d44f(0x476), q['17'] = _0x30d44f(0x31c), q['18'] = _0x30d44f(0x4a5), q['19'] = '&#41754;', q['20'] = _0x30d44f(0x208), q['21'] = _0x30d44f(0x2bd), q['22'] = '&#41949;', q['23'] = _0x30d44f(0x350), q['24'] = _0x30d44f(0x407), q['25'] = _0x30d44f(0x5f1), q['26'] = '&#41076;', q['27'] = '&#41707;', q['28'] = _0x30d44f(0x466), q['29'] = _0x30d44f(0x531), q['30'] = _0x30d44f(0x571), q['31'] = _0x30d44f(0x5e3), q['32'] = _0x30d44f(0x18d), q['33'] = _0x30d44f(0x590), q['34'] = _0x30d44f(0x4bf), q['35'] = _0x30d44f(0x231), q['36'] = _0x30d44f(0x14b), q['37'] = _0x30d44f(0x50f), q['38'] = _0x30d44f(0x1c6), q['39'] = '&#41042;', q['40'] = _0x30d44f(0x1c0), q['41'] = _0x30d44f(0x4f3), q['42'] = _0x30d44f(0x476), q['43'] = _0x30d44f(0x31c), q['44'] = _0x30d44f(0x4a5), q['45'] = '&#41754;', q['46'] = _0x30d44f(0x208), q['47'] = _0x30d44f(0x2bd), q['48'] = _0x30d44f(0x45f), q['49'] = _0x30d44f(0x350), q['50'] = '&#41427;', q['51'] = _0x30d44f(0x5f1), q['52'] = _0x30d44f(0x18f), q['53'] = '1', q['54'] = '2', q['55'] = '3', q['56'] = '4', q['57'] = '5', q['58'] = '6', q['59'] = '7', q['60'] = '8', q['61'] = '9', q['62'] = '0';
var r = {};
r['1'] = '&#1044;', r['2'] = '&#1041;', r['3'] = 'C', r['4'] = 'D', r['5'] = _0x30d44f(0x308), r['6'] = 'F', r['7'] = 'G', r['8'] = 'H', r['9'] = 'I', r['10'] = 'J', r['11'] = _0x30d44f(0x2f3), r['12'] = 'L', r['13'] = 'M', r['14'] = _0x30d44f(0x243), r['15'] = _0x30d44f(0x33c), r['16'] = 'P', r['17'] = '&#490;', r['18'] = _0x30d44f(0x185), r['19'] = 'S', r['20'] = _0x30d44f(0x48f), r['21'] = _0x30d44f(0x4b2), r['22'] = 'V', r['23'] = _0x30d44f(0x300), r['24'] = _0x30d44f(0x42c), r['25'] = _0x30d44f(0x434), r['26'] = 'Z', r['27'] = _0x30d44f(0x16a), r['28'] = _0x30d44f(0x3ed), r['29'] = 'C', r['30'] = 'D', r['31'] = _0x30d44f(0x308), r['32'] = 'F', r['33'] = 'G', r['34'] = 'H', r['35'] = 'I', r['36'] = 'J', r['37'] = _0x30d44f(0x2f3), r['38'] = 'L', r['39'] = 'M', r['40'] = _0x30d44f(0x243), r['41'] = _0x30d44f(0x33c), r['42'] = 'P', r['43'] = _0x30d44f(0x178), r['44'] = _0x30d44f(0x185), r['45'] = 'S', r['46'] = _0x30d44f(0x48f), r['47'] = _0x30d44f(0x4b2), r['48'] = 'V', r['49'] = '&#1065;', r['50'] = _0x30d44f(0x42c), r['51'] = '&#1059;', r['52'] = 'Z', r['53'] = '1', r['54'] = '2', r['55'] = '3', r['56'] = '4', r['57'] = '5', r['58'] = '6', r['59'] = '7', r['60'] = '8', r['61'] = '9', r['62'] = '0';
var s = {};
s['1'] = '&#41807;', s['2'] = _0x30d44f(0x220), s['3'] = _0x30d44f(0x3bd), s['4'] = '&#41016;', s['5'] = _0x30d44f(0x5e3), s['6'] = _0x30d44f(0x13f), s['7'] = _0x30d44f(0x509), s['8'] = '&#41157;', s['9'] = _0x30d44f(0x560), s['10'] = _0x30d44f(0x14b), s['11'] = _0x30d44f(0x559), s['12'] = _0x30d44f(0x1c6), s['13'] = _0x30d44f(0x2ce), s['14'] = _0x30d44f(0x5d4), s['15'] = _0x30d44f(0x1c2), s['16'] = _0x30d44f(0x476), s['17'] = _0x30d44f(0x50c), s['18'] = _0x30d44f(0x1a0), s['19'] = _0x30d44f(0x477), s['20'] = _0x30d44f(0x2ef), s['21'] = _0x30d44f(0x5f9), s['22'] = _0x30d44f(0x515), s['23'] = _0x30d44f(0x51c), s['24'] = _0x30d44f(0x200), s['25'] = _0x30d44f(0x493), s['26'] = '&#41076;', s['27'] = _0x30d44f(0x227), s['28'] = _0x30d44f(0x220), s['29'] = '&#41555;', s['30'] = '&#41016;', s['31'] = _0x30d44f(0x5e3), s['32'] = _0x30d44f(0x13f), s['33'] = _0x30d44f(0x509), s['34'] = _0x30d44f(0x1b3), s['35'] = _0x30d44f(0x560), s['36'] = _0x30d44f(0x14b), s['37'] = _0x30d44f(0x559), s['38'] = '&#42130;', s['39'] = _0x30d44f(0x2ce), s['40'] = _0x30d44f(0x5d4), s['41'] = _0x30d44f(0x1c2), s['42'] = _0x30d44f(0x476), s['43'] = _0x30d44f(0x50c), s['44'] = _0x30d44f(0x1a0), s['45'] = '&#41751;', s['46'] = '&#42180;', s['47'] = _0x30d44f(0x5f9), s['48'] = '&#41204;', s['49'] = _0x30d44f(0x51c), s['50'] = _0x30d44f(0x200), s['51'] = _0x30d44f(0x493), s['52'] = _0x30d44f(0x18f), s['53'] = '1', s['54'] = '2', s['55'] = '3', s['56'] = '4', s['57'] = '5', s['58'] = '6', s['59'] = '7', s['60'] = '8', s['61'] = '9', s['62'] = '0';
var t = {};
t['1'] = _0x30d44f(0x2f2), t['2'] = _0x30d44f(0x514), t['3'] = '&#41556;', t['4'] = '&#42159;', t['5'] = _0x30d44f(0x1fa), t['6'] = _0x30d44f(0x5c4), t['7'] = '&#41804;', t['8'] = _0x30d44f(0x12e), t['9'] = _0x30d44f(0x3ef), t['10'] = '&#42171;', t['11'] = _0x30d44f(0x559), t['12'] = '&#42130;', t['13'] = _0x30d44f(0x2ce), t['14'] = _0x30d44f(0x37f), t['15'] = _0x30d44f(0x3af), t['16'] = _0x30d44f(0x476), t['17'] = _0x30d44f(0x50c), t['18'] = _0x30d44f(0x1a0), t['19'] = '&#41433;', t['20'] = _0x30d44f(0x2ef), t['21'] = _0x30d44f(0x387), t['22'] = _0x30d44f(0x532), t['23'] = '&#41296;', t['24'] = _0x30d44f(0x45b), t['25'] = _0x30d44f(0x4c3), t['26'] = _0x30d44f(0x18f), t['27'] = _0x30d44f(0x2f2), t['28'] = _0x30d44f(0x514), t['29'] = _0x30d44f(0x5e1), t['30'] = '&#42159;', t['31'] = _0x30d44f(0x1fa), t['32'] = _0x30d44f(0x5c4), t['33'] = _0x30d44f(0x5e7), t['34'] = _0x30d44f(0x12e), t['35'] = _0x30d44f(0x3ef), t['36'] = '&#42171;', t['37'] = _0x30d44f(0x559), t['38'] = '&#42130;', t['39'] = _0x30d44f(0x2ce), t['40'] = _0x30d44f(0x37f), t['41'] = _0x30d44f(0x3af), t['42'] = _0x30d44f(0x476), t['43'] = _0x30d44f(0x50c), t['44'] = _0x30d44f(0x1a0), t['45'] = _0x30d44f(0x56c), t['46'] = _0x30d44f(0x2ef), t['47'] = '&#42148;', t['48'] = _0x30d44f(0x532), t['49'] = _0x30d44f(0x350), t['50'] = _0x30d44f(0x45b), t['51'] = _0x30d44f(0x4c3), t['52'] = _0x30d44f(0x18f), t['53'] = '1', t['54'] = '2', t['55'] = '3', t['56'] = '4', t['57'] = '5', t['58'] = '6', t['59'] = '7', t['60'] = '8', t['61'] = '9', t['62'] = '0';
var u = {};
u['1'] = _0x30d44f(0x1f0), u['2'] = _0x30d44f(0x460), u['3'] = _0x30d44f(0x4fd), u['4'] = _0x30d44f(0x4ec), u['5'] = _0x30d44f(0x20d), u['6'] = 'F', u['7'] = _0x30d44f(0x2be), u['8'] = _0x30d44f(0x15d), u['9'] = _0x30d44f(0x10e), u['10'] = _0x30d44f(0x527), u['11'] = _0x30d44f(0x388), u['12'] = _0x30d44f(0x4be), u['13'] = '&#3057;', u['14'] = '&#1051;', u['15'] = _0x30d44f(0x5e4), u['16'] = '&thorn;', u['17'] = _0x30d44f(0x49b), u['18'] = _0x30d44f(0x570), u['19'] = _0x30d44f(0x305), u['20'] = _0x30d44f(0x2df), u['21'] = _0x30d44f(0x4b2), u['22'] = '&#404;', u['23'] = _0x30d44f(0x536), u['24'] = _0x30d44f(0x429), u['25'] = _0x30d44f(0x3f8), u['26'] = _0x30d44f(0x10f), u['27'] = '&Lambda;', u['28'] = '&#998;', u['29'] = _0x30d44f(0x4fd), u['30'] = '&ETH;', u['31'] = '&#400;', u['32'] = 'F', u['33'] = _0x30d44f(0x2be), u['34'] = '&#1085;', u['35'] = _0x30d44f(0x10e), u['36'] = _0x30d44f(0x527), u['37'] = _0x30d44f(0x388), u['38'] = _0x30d44f(0x4be), u['39'] = _0x30d44f(0x1e6), u['40'] = _0x30d44f(0x379), u['41'] = _0x30d44f(0x5e4), u['42'] = _0x30d44f(0x118), u['43'] = _0x30d44f(0x49b), u['44'] = _0x30d44f(0x570), u['45'] = _0x30d44f(0x305), u['46'] = _0x30d44f(0x2df), u['47'] = _0x30d44f(0x4b2), u['48'] = '&#404;', u['49'] = _0x30d44f(0x536), u['50'] = _0x30d44f(0x429), u['51'] = _0x30d44f(0x3f8), u['52'] = _0x30d44f(0x10f), u['53'] = '1', u['54'] = '2', u['55'] = '3', u['56'] = '4', u['57'] = '5', u['58'] = '6', u['59'] = '7', u['60'] = '8', u['61'] = '9', u['62'] = '0';
var v = {};
v['1'] = _0x30d44f(0x117), v['2'] = '&#385;', v['3'] = _0x30d44f(0x5b8), v['4'] = _0x30d44f(0x2dc), v['5'] = _0x30d44f(0x1cb), v['6'] = _0x30d44f(0x435), v['7'] = '&#403;', v['8'] = _0x30d44f(0x409), v['9'] = _0x30d44f(0x42d), v['10'] = _0x30d44f(0x2ac), v['11'] = _0x30d44f(0x148), v['12'] = '&#1340;', v['13'] = 'M', v['14'] = _0x30d44f(0x285), v['15'] = '&#416;', v['16'] = _0x30d44f(0x3ff), v['17'] = _0x30d44f(0x2c4), v['18'] = _0x30d44f(0x1db), v['19'] = '&#423;', v['20'] = _0x30d44f(0x326), v['21'] = _0x30d44f(0x2d7), v['22'] = _0x30d44f(0x190), v['23'] = _0x30d44f(0x536), v['24'] = _0x30d44f(0x5ab), v['25'] = '&#435;', v['26'] = _0x30d44f(0x2de), v['27'] = '&#411;', v['28'] = _0x30d44f(0x302), v['29'] = _0x30d44f(0x5b8), v['30'] = _0x30d44f(0x2dc), v['31'] = _0x30d44f(0x1cb), v['32'] = _0x30d44f(0x435), v['33'] = _0x30d44f(0x2be), v['34'] = '&#1223;', v['35'] = _0x30d44f(0x42d), v['36'] = _0x30d44f(0x2ac), v['37'] = '&#408;', v['38'] = _0x30d44f(0x36d), v['39'] = 'M', v['40'] = '&#413;', v['41'] = _0x30d44f(0x21e), v['42'] = '&#420;', v['43'] = _0x30d44f(0x2c4), v['44'] = '&#422;', v['45'] = _0x30d44f(0x1b5), v['46'] = _0x30d44f(0x326), v['47'] = '&#434;', v['48'] = '&#404;', v['49'] = _0x30d44f(0x536), v['50'] = _0x30d44f(0x5ab), v['51'] = _0x30d44f(0x292), v['52'] = '&#548;', v['53'] = '1', v['54'] = '2', v['55'] = '3', v['56'] = '4', v['57'] = '5', v['58'] = '6', v['59'] = '7', v['60'] = '8', v['61'] = '9', v['62'] = '0';
var w = {};
w['1'] = _0x30d44f(0x5f7), w['2'] = '&#41712;', w['3'] = '&#41007;', w['4'] = _0x30d44f(0x112), w['5'] = '&#41532;', w['6'] = _0x30d44f(0x551), w['7'] = _0x30d44f(0x509), w['8'] = _0x30d44f(0x1b4), w['9'] = '&#41105;', w['10'] = '&#42171;', w['11'] = '&#40983;', w['12'] = '&#42130;', w['13'] = _0x30d44f(0x2ce), w['14'] = '&#41674;', w['15'] = '&#41126;', w['16'] = '&#41571;', w['17'] = _0x30d44f(0x222), w['18'] = _0x30d44f(0x553), w['19'] = '&#41754;', w['20'] = _0x30d44f(0x342), w['21'] = _0x30d44f(0x2bd), w['22'] = _0x30d44f(0x3f4), w['23'] = _0x30d44f(0x51c), w['24'] = _0x30d44f(0x1d4), w['25'] = _0x30d44f(0x5fc), w['26'] = _0x30d44f(0x18f), w['27'] = _0x30d44f(0x5f7), w['28'] = _0x30d44f(0x171), w['29'] = _0x30d44f(0x3bf), w['30'] = _0x30d44f(0x112), w['31'] = _0x30d44f(0x172), w['32'] = _0x30d44f(0x551), w['33'] = _0x30d44f(0x509), w['34'] = _0x30d44f(0x1b4), w['35'] = _0x30d44f(0x231), w['36'] = _0x30d44f(0x115), w['37'] = _0x30d44f(0x50f), w['38'] = '&#42130;', w['39'] = '&#41141;', w['40'] = _0x30d44f(0x37f), w['41'] = _0x30d44f(0x1c2), w['42'] = _0x30d44f(0x476), w['43'] = _0x30d44f(0x222), w['44'] = _0x30d44f(0x553), w['45'] = _0x30d44f(0x428), w['46'] = _0x30d44f(0x342), w['47'] = _0x30d44f(0x2bd), w['48'] = '&#41008;', w['49'] = _0x30d44f(0x51c), w['50'] = _0x30d44f(0x1d4), w['51'] = '&#42014;', w['52'] = '&#41076;', w['53'] = '1', w['54'] = '2', w['55'] = '3', w['56'] = '4', w['57'] = '5', w['58'] = '6', w['59'] = '7', w['60'] = '8', w['61'] = '9', w['62'] = '0';
var x = {};
x['1'] = _0x30d44f(0x312), x['2'] = _0x30d44f(0x296), x['3'] = '&#1351;', x['4'] = _0x30d44f(0x240), x['5'] = _0x30d44f(0x51b), x['6'] = _0x30d44f(0x498), x['7'] = _0x30d44f(0x422), x['8'] = '&#615;', x['9'] = _0x30d44f(0x12d), x['10'] = _0x30d44f(0x2f4), x['11'] = _0x30d44f(0x3eb), x['12'] = _0x30d44f(0x492), x['13'] = _0x30d44f(0x133), x['14'] = _0x30d44f(0x306), x['15'] = '&#1342;', x['16'] = _0x30d44f(0x33e), x['17'] = _0x30d44f(0x230), x['18'] = _0x30d44f(0x191), x['19'] = _0x30d44f(0x246), x['20'] = _0x30d44f(0x462), x['21'] = _0x30d44f(0x1fb), x['22'] = _0x30d44f(0x1c4), x['23'] = _0x30d44f(0x38d), x['24'] = _0x30d44f(0x2a1), x['25'] = '&#1358;', x['26'] = _0x30d44f(0x524), x['27'] = _0x30d44f(0x312), x['28'] = '&#1349;', x['29'] = _0x30d44f(0x420), x['30'] = _0x30d44f(0x240), x['31'] = _0x30d44f(0x51b), x['32'] = _0x30d44f(0x498), x['33'] = '&#1331;', x['34'] = '&#615;', x['35'] = '&#639;', x['36'] = '&#669;', x['37'] = _0x30d44f(0x3eb), x['38'] = _0x30d44f(0x492), x['39'] = _0x30d44f(0x133), x['40'] = _0x30d44f(0x306), x['41'] = '&#1342;', x['42'] = _0x30d44f(0x33e), x['43'] = '&phi;', x['44'] = _0x30d44f(0x191), x['45'] = _0x30d44f(0x246), x['46'] = _0x30d44f(0x462), x['47'] = _0x30d44f(0x1fb), x['48'] = '&#1506;', x['49'] = _0x30d44f(0x38d), x['50'] = '&#1347;', x['51'] = _0x30d44f(0x23f), x['52'] = '&#1344;', x['53'] = '1', x['54'] = '2', x['55'] = '3', x['56'] = '4', x['57'] = '5', x['58'] = '6', x['59'] = '7', x['60'] = '8', x['61'] = '9', x['62'] = '0';
var y = {};
y['1'] = _0x30d44f(0x1e7), y['2'] = _0x30d44f(0x583), y['3'] = _0x30d44f(0x1ea), y['4'] = 'd', y['5'] = _0x30d44f(0x158), y['6'] = _0x30d44f(0x20e), y['7'] = 'g', y['8'] = 'h', y['9'] = _0x30d44f(0x440), y['10'] = _0x30d44f(0x503), y['11'] = _0x30d44f(0x1de), y['12'] = _0x30d44f(0x4cc), y['13'] = 'm', y['14'] = '&eta;', y['15'] = _0x30d44f(0x5bd), y['16'] = 'p', y['17'] = _0x30d44f(0x174), y['18'] = 'r', y['19'] = '&scaron;', y['20'] = '&dagger;', y['21'] = 'u', y['22'] = _0x30d44f(0x5fb), y['23'] = '&omega;', y['24'] = 'x', y['25'] = _0x30d44f(0x371), y['26'] = 'z', y['27'] = _0x30d44f(0x1e7), y['28'] = '&szlig;', y['29'] = _0x30d44f(0x1ea), y['30'] = 'd', y['31'] = '&epsilon;', y['32'] = _0x30d44f(0x20e), y['33'] = 'g', y['34'] = 'h', y['35'] = '&iuml;', y['36'] = _0x30d44f(0x503), y['37'] = _0x30d44f(0x1de), y['38'] = _0x30d44f(0x4cc), y['39'] = 'm', y['40'] = _0x30d44f(0x57c), y['41'] = _0x30d44f(0x5bd), y['42'] = 'p', y['43'] = _0x30d44f(0x174), y['44'] = 'r', y['45'] = '&scaron;', y['46'] = _0x30d44f(0x4c7), y['47'] = 'u', y['48'] = _0x30d44f(0x5fb), y['49'] = _0x30d44f(0x1dc), y['50'] = 'x', y['51'] = _0x30d44f(0x371), y['52'] = 'z', y['53'] = '1', y['54'] = '2', y['55'] = '3', y['56'] = '4', y['57'] = '5', y['58'] = '6', y['59'] = '7', y['60'] = '8', y['61'] = '9', y['62'] = '0';
var z = {};
z['1'] = _0x30d44f(0x3b0), z['2'] = _0x30d44f(0x4cb), z['3'] = '&#2414;', z['4'] = _0x30d44f(0x3ee), z['5'] = _0x30d44f(0x522), z['6'] = _0x30d44f(0x498), z['7'] = '&#2797;', z['8'] = _0x30d44f(0x23b), z['9'] = _0x30d44f(0x12d), z['10'] = _0x30d44f(0x2ac), z['11'] = _0x30d44f(0x13e), z['12'] = '&#1350;', z['13'] = _0x30d44f(0x5a5), z['14'] = '&#1352;', z['15'] = _0x30d44f(0x51f), z['16'] = '&#447;', z['17'] = '&#1193;', z['18'] = _0x30d44f(0x191), z['19'] = _0x30d44f(0x1ea), z['20'] = _0x30d44f(0x2c9), z['21'] = '&upsilon;', z['22'] = _0x30d44f(0x4d4), z['23'] = _0x30d44f(0x1dc), z['24'] = _0x30d44f(0x34c), z['25'] = _0x30d44f(0x1c4), z['26'] = _0x30d44f(0x3dc), z['27'] = _0x30d44f(0x3b0), z['28'] = _0x30d44f(0x4cb), z['29'] = _0x30d44f(0x5e6), z['30'] = _0x30d44f(0x3ee), z['31'] = _0x30d44f(0x522), z['32'] = _0x30d44f(0x498), z['33'] = _0x30d44f(0x184), z['34'] = '&#1210;', z['35'] = _0x30d44f(0x12d), z['36'] = '&#646;', z['37'] = _0x30d44f(0x13e), z['38'] = '&#1350;', z['39'] = '&#625;', z['40'] = _0x30d44f(0x47e), z['41'] = '&#2790;', z['42'] = _0x30d44f(0x5cb), z['43'] = _0x30d44f(0x4ed), z['44'] = _0x30d44f(0x191), z['45'] = _0x30d44f(0x1ea), z['46'] = _0x30d44f(0x2c9), z['47'] = _0x30d44f(0x4e3), z['48'] = _0x30d44f(0x4d4), z['49'] = _0x30d44f(0x1dc), z['50'] = _0x30d44f(0x34c), z['51'] = '&#1506;', z['52'] = '&#2749;', z['53'] = '1', z['54'] = '2', z['55'] = '3', z['56'] = '4', z['57'] = '5', z['58'] = '6', z['59'] = '7', z['60'] = '8', z['61'] = '9', z['62'] = '0';
var A = {};
A['1'] = '&#1072;', A['2'] = _0x30d44f(0x2fa), A['3'] = 'c', A['4'] = _0x30d44f(0x1d6), A['5'] = _0x30d44f(0x364), A['6'] = 'f', A['7'] = 'g', A['8'] = _0x30d44f(0x15d), A['9'] = _0x30d44f(0x5eb), A['10'] = 'j', A['11'] = _0x30d44f(0x362), A['12'] = _0x30d44f(0x1a7), A['13'] = _0x30d44f(0x36a), A['14'] = '&#1087;', A['15'] = '&#1139;', A['16'] = 'p', A['17'] = _0x30d44f(0x14d), A['18'] = '&#1103;', A['19'] = '$', A['20'] = _0x30d44f(0x319), A['21'] = _0x30d44f(0x56b), A['22'] = _0x30d44f(0x361), A['23'] = _0x30d44f(0x415), A['24'] = '&#1078;', A['25'] = '&#1095;', A['26'] = _0x30d44f(0x122), A['27'] = _0x30d44f(0x55f), A['28'] = '&#1041;', A['29'] = 'C', A['30'] = '&#1044;', A['31'] = '&#1028;', A['32'] = 'F', A['33'] = 'G', A['34'] = 'H', A['35'] = '&#1031;', A['36'] = 'J', A['37'] = '&#1050;', A['38'] = '&#1043;', A['39'] = _0x30d44f(0x4f8), A['40'] = _0x30d44f(0x257), A['41'] = _0x30d44f(0x5da), A['42'] = 'P', A['43'] = _0x30d44f(0x33c), A['44'] = _0x30d44f(0x185), A['45'] = '$', A['46'] = 'T', A['47'] = _0x30d44f(0x4b2), A['48'] = _0x30d44f(0x20a), A['49'] = _0x30d44f(0x5a4), A['50'] = _0x30d44f(0x42c), A['51'] = _0x30d44f(0x1f3), A['52'] = '&#1047;', A['53'] = '1', A['54'] = '2', A['55'] = '3', A['56'] = '4', A['57'] = '5', A['58'] = '6', A['59'] = '7', A['60'] = '8', A['61'] = '9', A['62'] = '0';
var B = {};
B['1'] = _0x30d44f(0x4d2), B['2'] = 'b&#830;', B['3'] = 'c&#830;', B['4'] = _0x30d44f(0x196), B['5'] = _0x30d44f(0x390), B['6'] = _0x30d44f(0x2da), B['7'] = _0x30d44f(0x418), B['8'] = _0x30d44f(0x3c7), B['9'] = _0x30d44f(0x31a), B['10'] = _0x30d44f(0x548), B['11'] = _0x30d44f(0x3b7), B['12'] = _0x30d44f(0x121), B['13'] = _0x30d44f(0x241), B['14'] = 'n&#830;', B['15'] = _0x30d44f(0x160), B['16'] = _0x30d44f(0x535), B['17'] = _0x30d44f(0x2d5), B['18'] = _0x30d44f(0x400), B['19'] = 's&#830;', B['20'] = _0x30d44f(0x49c), B['21'] = _0x30d44f(0x194), B['22'] = _0x30d44f(0x175), B['23'] = _0x30d44f(0x5d9), B['24'] = _0x30d44f(0x20b), B['25'] = _0x30d44f(0x1f5), B['26'] = _0x30d44f(0x33b), B['27'] = _0x30d44f(0x40c), B['28'] = _0x30d44f(0x211), B['29'] = 'C&#830;', B['30'] = _0x30d44f(0x1d3), B['31'] = _0x30d44f(0x396), B['32'] = _0x30d44f(0x3e0), B['33'] = _0x30d44f(0x3fa), B['34'] = _0x30d44f(0x291), B['35'] = _0x30d44f(0x186), B['36'] = _0x30d44f(0x2aa), B['37'] = _0x30d44f(0x1f4), B['38'] = _0x30d44f(0x288), B['39'] = _0x30d44f(0x10c), B['40'] = _0x30d44f(0x167), B['41'] = 'O&#830;', B['42'] = _0x30d44f(0x21f), B['43'] = _0x30d44f(0x193), B['44'] = 'R&#830;', B['45'] = 'S&#830;', B['46'] = _0x30d44f(0x3f9), B['47'] = _0x30d44f(0x4eb), B['48'] = _0x30d44f(0x32b), B['49'] = _0x30d44f(0x192), B['50'] = _0x30d44f(0x57b), B['51'] = _0x30d44f(0x53c), B['52'] = _0x30d44f(0x2e2), B['53'] = _0x30d44f(0x4c1), B['54'] = _0x30d44f(0x2cd), B['55'] = _0x30d44f(0x3b3), B['56'] = _0x30d44f(0x329), B['57'] = _0x30d44f(0x5a2), B['58'] = _0x30d44f(0x399), B['59'] = '7&#830;', B['60'] = '8&#830;', B['61'] = _0x30d44f(0x40f), B['62'] = _0x30d44f(0x261);
var C = {};
C['1'] = 'a&#838;', C['2'] = _0x30d44f(0x3d5), C['3'] = 'c&#838;', C['4'] = _0x30d44f(0x3d9), C['5'] = _0x30d44f(0x41c), C['6'] = _0x30d44f(0x3d7), C['7'] = 'g&#838;', C['8'] = _0x30d44f(0x4de), C['9'] = 'i&#838;', C['10'] = _0x30d44f(0x368), C['11'] = _0x30d44f(0x2ea), C['12'] = 'l&#838;', C['13'] = 'm&#838;', C['14'] = _0x30d44f(0x543), C['15'] = 'o&#838;', C['16'] = _0x30d44f(0x157), C['17'] = 'q&#838;', C['18'] = _0x30d44f(0x59b), C['19'] = _0x30d44f(0x22c), C['20'] = 't&#838;', C['21'] = 'u&#838;', C['22'] = _0x30d44f(0x3f5), C['23'] = _0x30d44f(0x2a2), C['24'] = _0x30d44f(0x382), C['25'] = _0x30d44f(0x596), C['26'] = _0x30d44f(0x31f), C['27'] = 'A&#838;', C['28'] = _0x30d44f(0x3f6), C['29'] = _0x30d44f(0x550), C['30'] = 'D&#838;', C['31'] = _0x30d44f(0x449), C['32'] = _0x30d44f(0x3c4), C['33'] = 'G&#838;', C['34'] = _0x30d44f(0x29c), C['35'] = 'I&#838;', C['36'] = _0x30d44f(0x3a2), C['37'] = _0x30d44f(0x44c), C['38'] = _0x30d44f(0x4f4), C['39'] = _0x30d44f(0x5dc), C['40'] = _0x30d44f(0x2e4), C['41'] = _0x30d44f(0x1fe), C['42'] = 'P&#838;', C['43'] = 'Q&#838;', C['44'] = 'R&#838;', C['45'] = _0x30d44f(0x13d), C['46'] = 'T&#838;', C['47'] = _0x30d44f(0x510), C['48'] = _0x30d44f(0x530), C['49'] = _0x30d44f(0x4fc), C['50'] = 'X&#838;', C['51'] = 'Y&#838;', C['52'] = 'Z&#838;', C['53'] = '1&#838;', C['54'] = _0x30d44f(0x10a), C['55'] = _0x30d44f(0x273), C['56'] = _0x30d44f(0x487), C['57'] = _0x30d44f(0x383), C['58'] = _0x30d44f(0x425), C['59'] = _0x30d44f(0x40b), C['60'] = _0x30d44f(0x11e), C['61'] = _0x30d44f(0x332), C['62'] = _0x30d44f(0x38a);
var D = {};
D['1'] = _0x30d44f(0x380), D['2'] = _0x30d44f(0x26a), D['3'] = 'c&#826;', D['4'] = 'd&#826;', D['5'] = _0x30d44f(0x4f6), D['6'] = 'f&#826;', D['7'] = _0x30d44f(0x5b4), D['8'] = _0x30d44f(0x582), D['9'] = _0x30d44f(0x597), D['10'] = 'j&#826;', D['11'] = _0x30d44f(0x589), D['12'] = 'l&#826;', D['13'] = _0x30d44f(0x3dd), D['14'] = _0x30d44f(0x25e), D['15'] = _0x30d44f(0x426), D['16'] = _0x30d44f(0x586), D['17'] = _0x30d44f(0x283), D['18'] = _0x30d44f(0x21b), D['19'] = _0x30d44f(0x242), D['20'] = 't&#826;', D['21'] = _0x30d44f(0x271), D['22'] = _0x30d44f(0x2b1), D['23'] = _0x30d44f(0x5b3), D['24'] = 'x&#826;', D['25'] = _0x30d44f(0x1b8), D['26'] = _0x30d44f(0x500), D['27'] = 'A&#826;', D['28'] = _0x30d44f(0x268), D['29'] = 'C&#826;', D['30'] = _0x30d44f(0x576), D['31'] = _0x30d44f(0x1c1), D['32'] = _0x30d44f(0x5f4), D['33'] = 'G&#826;', D['34'] = 'H&#826;', D['35'] = _0x30d44f(0x2d2), D['36'] = _0x30d44f(0x144), D['37'] = _0x30d44f(0x1e3), D['38'] = _0x30d44f(0x339), D['39'] = _0x30d44f(0x289), D['40'] = 'N&#826;', D['41'] = _0x30d44f(0x4c5), D['42'] = _0x30d44f(0x513), D['43'] = _0x30d44f(0x324), D['44'] = _0x30d44f(0x233), D['45'] = _0x30d44f(0x577), D['46'] = _0x30d44f(0x3d6), D['47'] = _0x30d44f(0x3c5), D['48'] = _0x30d44f(0x40e), D['49'] = _0x30d44f(0x49e), D['50'] = 'X&#826;', D['51'] = _0x30d44f(0x533), D['52'] = _0x30d44f(0x30f), D['53'] = _0x30d44f(0x384), D['54'] = '2&#826;', D['55'] = '3&#826;', D['56'] = _0x30d44f(0x23a), D['57'] = '5&#826;', D['58'] = '6&#826;', D['59'] = _0x30d44f(0x2a6), D['60'] = _0x30d44f(0x3c2), D['61'] = _0x30d44f(0x26f), D['62'] = _0x30d44f(0x17f);
var E = {};
E['1'] = _0x30d44f(0x3de), E['2'] = _0x30d44f(0x57f), E['3'] = _0x30d44f(0x56f), E['4'] = 'd&#857;', E['5'] = _0x30d44f(0x512), E['6'] = 'f&#857;', E['7'] = 'g&#857;', E['8'] = _0x30d44f(0x1f6), E['9'] = _0x30d44f(0x1a2), E['10'] = _0x30d44f(0x34f), E['11'] = _0x30d44f(0x3d3), E['12'] = _0x30d44f(0x5fa), E['13'] = 'm&#857;', E['14'] = _0x30d44f(0x588), E['15'] = _0x30d44f(0x279), E['16'] = _0x30d44f(0x3e6), E['17'] = 'q&#857;', E['18'] = _0x30d44f(0x5d1), E['19'] = _0x30d44f(0x421), E['20'] = _0x30d44f(0x523), E['21'] = 'u&#857;', E['22'] = _0x30d44f(0x369), E['23'] = 'w&#857;', E['24'] = _0x30d44f(0x343), E['25'] = _0x30d44f(0x5a7), E['26'] = _0x30d44f(0x485), E['27'] = _0x30d44f(0x37a), E['28'] = _0x30d44f(0x2ee), E['29'] = _0x30d44f(0x4af), E['30'] = _0x30d44f(0x2a8), E['31'] = _0x30d44f(0x19e), E['32'] = 'F&#857;', E['33'] = _0x30d44f(0x22a), E['34'] = _0x30d44f(0x1df), E['35'] = 'I&#857;', E['36'] = _0x30d44f(0x44e), E['37'] = _0x30d44f(0x24b), E['38'] = _0x30d44f(0x149), E['39'] = _0x30d44f(0x236), E['40'] = _0x30d44f(0x52b), E['41'] = _0x30d44f(0x546), E['42'] = _0x30d44f(0x20c), E['43'] = _0x30d44f(0x2a3), E['44'] = _0x30d44f(0x463), E['45'] = _0x30d44f(0x155), E['46'] = 'T&#857;', E['47'] = _0x30d44f(0x3f2), E['48'] = _0x30d44f(0x508), E['49'] = _0x30d44f(0x2bb), E['50'] = _0x30d44f(0x3cb), E['51'] = _0x30d44f(0x3cf), E['52'] = 'Z&#857;', E['53'] = _0x30d44f(0x46c), E['54'] = _0x30d44f(0x2cf), E['55'] = '3&#857;', E['56'] = _0x30d44f(0x3bc), E['57'] = _0x30d44f(0x1c9), E['58'] = _0x30d44f(0x45e), E['59'] = _0x30d44f(0x195), E['60'] = _0x30d44f(0x579), E['61'] = '9&#857;', E['62'] = '0&#857;';
var F = {};
F['1'] = _0x30d44f(0x259), F['2'] = 'b&#799;', F['3'] = _0x30d44f(0x138), F['4'] = _0x30d44f(0x416), F['5'] = 'e&#799;', F['6'] = _0x30d44f(0x42b), F['7'] = _0x30d44f(0x594), F['8'] = 'h&#799;', F['9'] = _0x30d44f(0x389), F['10'] = _0x30d44f(0x578), F['11'] = _0x30d44f(0x28f), F['12'] = _0x30d44f(0x518), F['13'] = 'm&#799;', F['14'] = _0x30d44f(0x516), F['15'] = _0x30d44f(0x4c8), F['16'] = 'p&#799;', F['17'] = _0x30d44f(0x4f2), F['18'] = _0x30d44f(0x4ae), F['19'] = _0x30d44f(0x5c6), F['20'] = _0x30d44f(0x32c), F['21'] = _0x30d44f(0x424), F['22'] = _0x30d44f(0x580), F['23'] = _0x30d44f(0x1ac), F['24'] = _0x30d44f(0x2f1), F['25'] = _0x30d44f(0x4bc), F['26'] = _0x30d44f(0x23d), F['27'] = 'A&#799;', F['28'] = _0x30d44f(0x4f1), F['29'] = _0x30d44f(0x2e6), F['30'] = 'D&#799;', F['31'] = _0x30d44f(0x50a), F['32'] = _0x30d44f(0x3da), F['33'] = _0x30d44f(0x511), F['34'] = _0x30d44f(0x29b), F['35'] = 'I&#799;', F['36'] = _0x30d44f(0x5de), F['37'] = _0x30d44f(0x381), F['38'] = _0x30d44f(0x58b), F['39'] = _0x30d44f(0x2ed), F['40'] = 'N&#799;', F['41'] = _0x30d44f(0x5c9), F['42'] = _0x30d44f(0x1a9), F['43'] = _0x30d44f(0x4a7), F['44'] = 'R&#799;', F['45'] = _0x30d44f(0x575), F['46'] = _0x30d44f(0x1a3), F['47'] = _0x30d44f(0x5e8), F['48'] = _0x30d44f(0x4ea), F['49'] = _0x30d44f(0x17b), F['50'] = _0x30d44f(0x120), F['51'] = _0x30d44f(0x284), F['52'] = _0x30d44f(0x4e5), F['53'] = _0x30d44f(0x4da), F['54'] = _0x30d44f(0x2af), F['55'] = _0x30d44f(0x313), F['56'] = _0x30d44f(0x2e5), F['57'] = _0x30d44f(0x52e), F['58'] = _0x30d44f(0x323), F['59'] = '7&#799;', F['60'] = _0x30d44f(0x244), F['61'] = _0x30d44f(0x43b), F['62'] = _0x30d44f(0x156);
var G = {};
G['1'] = 'a&#846;', G['2'] = _0x30d44f(0x365), G['3'] = _0x30d44f(0x15b), G['4'] = _0x30d44f(0x3c3), G['5'] = _0x30d44f(0x287), G['6'] = _0x30d44f(0x303), G['7'] = _0x30d44f(0x2b9), G['8'] = _0x30d44f(0x336), G['9'] = _0x30d44f(0x457), G['10'] = _0x30d44f(0x4ff), G['11'] = 'k&#846;', G['12'] = _0x30d44f(0x3aa), G['13'] = _0x30d44f(0x16d), G['14'] = 'n&#846;', G['15'] = _0x30d44f(0x4b6), G['16'] = 'p&#846;', G['17'] = _0x30d44f(0x44d), G['18'] = _0x30d44f(0x4e6), G['19'] = 's&#846;', G['20'] = _0x30d44f(0x260), G['21'] = _0x30d44f(0x50d), G['22'] = _0x30d44f(0x10d), G['23'] = _0x30d44f(0x461), G['24'] = _0x30d44f(0x128), G['25'] = 'y&#846;', G['26'] = _0x30d44f(0x146), G['27'] = _0x30d44f(0x1b6), G['28'] = _0x30d44f(0x168), G['29'] = _0x30d44f(0x18e), G['30'] = _0x30d44f(0x26c), G['31'] = _0x30d44f(0x15a), G['32'] = _0x30d44f(0x56d), G['33'] = _0x30d44f(0x54a), G['34'] = _0x30d44f(0x5d7), G['35'] = _0x30d44f(0x34a), G['36'] = _0x30d44f(0x374), G['37'] = _0x30d44f(0x3f3), G['38'] = 'L&#846;', G['39'] = _0x30d44f(0x4e9), G['40'] = 'N&#846;', G['41'] = _0x30d44f(0x43a), G['42'] = _0x30d44f(0x587), G['43'] = _0x30d44f(0x315), G['44'] = 'R&#846;', G['45'] = _0x30d44f(0x562), G['46'] = _0x30d44f(0x136), G['47'] = _0x30d44f(0x458), G['48'] = _0x30d44f(0x4e7), G['49'] = _0x30d44f(0x249), G['50'] = _0x30d44f(0x278), G['51'] = _0x30d44f(0x4b1), G['52'] = 'Z&#846;', G['53'] = '1&#846;', G['54'] = '2&#846;', G['55'] = _0x30d44f(0x258), G['56'] = _0x30d44f(0x42a), G['57'] = _0x30d44f(0x1a8), G['58'] = '6&#846;', G['59'] = _0x30d44f(0x165), G['60'] = _0x30d44f(0x304), G['61'] = _0x30d44f(0x58a), G['62'] = _0x30d44f(0x1d0);
var H = {};
H['1'] = 'a&#829;&#851;', H['2'] = 'b&#829;&#851;', H['3'] = _0x30d44f(0x5ce), H['4'] = _0x30d44f(0x1af), H['5'] = _0x30d44f(0x4f5), H['6'] = _0x30d44f(0x5aa), H['7'] = _0x30d44f(0x3ba), H['8'] = _0x30d44f(0x479), H['9'] = _0x30d44f(0x3f1), H['10'] = 'j&#829;&#851;', H['11'] = 'k&#829;&#851;', H['12'] = _0x30d44f(0x504), H['13'] = 'm&#829;&#851;', H['14'] = 'n&#829;&#851;', H['15'] = _0x30d44f(0x1d7), H['16'] = _0x30d44f(0x142), H['17'] = 'q&#829;&#851;', H['18'] = 'r&#829;&#851;', H['19'] = _0x30d44f(0x565), H['20'] = _0x30d44f(0x48c), H['21'] = _0x30d44f(0x5cd), H['22'] = _0x30d44f(0x5f6), H['23'] = _0x30d44f(0x232), H['24'] = _0x30d44f(0x2db), H['25'] = _0x30d44f(0x49a), H['26'] = _0x30d44f(0x417), H['27'] = _0x30d44f(0x35e), H['28'] = _0x30d44f(0x454), H['29'] = _0x30d44f(0x2c5), H['30'] = _0x30d44f(0x4d1), H['31'] = 'E&#829;&#851;', H['32'] = _0x30d44f(0x35f), H['33'] = _0x30d44f(0x2c2), H['34'] = _0x30d44f(0x403), H['35'] = _0x30d44f(0x5bb), H['36'] = _0x30d44f(0x472), H['37'] = 'K&#829;&#851;', H['38'] = 'L&#829;&#851;', H['39'] = _0x30d44f(0x297), H['40'] = _0x30d44f(0x45c), H['41'] = _0x30d44f(0x3ae), H['42'] = _0x30d44f(0x505), H['43'] = _0x30d44f(0x5d5), H['44'] = 'R&#829;&#851;', H['45'] = _0x30d44f(0x347), H['46'] = _0x30d44f(0x37c), H['47'] = 'U&#829;&#851;', H['48'] = 'V&#829;&#851;', H['49'] = _0x30d44f(0x111), H['50'] = _0x30d44f(0x591), H['51'] = _0x30d44f(0x125), H['52'] = _0x30d44f(0x53a), H['53'] = _0x30d44f(0x398), H['54'] = _0x30d44f(0x352), H['55'] = _0x30d44f(0x1ad), H['56'] = _0x30d44f(0x393), H['57'] = _0x30d44f(0x438), H['58'] = _0x30d44f(0x4e4), H['59'] = _0x30d44f(0x33d), H['60'] = '8&#829;&#851;', H['61'] = _0x30d44f(0x599), H['62'] = _0x30d44f(0x5b7);
var I = {};
I['1'] = '&#120458;&#823;', I['2'] = _0x30d44f(0x41d), I['3'] = _0x30d44f(0x215), I['4'] = _0x30d44f(0x39e), I['5'] = _0x30d44f(0x43c), I['6'] = _0x30d44f(0x3e7), I['7'] = '&#120464;&#823;', I['8'] = _0x30d44f(0x401), I['9'] = _0x30d44f(0x1c5), I['10'] = _0x30d44f(0x46d), I['11'] = _0x30d44f(0x502), I['12'] = _0x30d44f(0x554), I['13'] = '&#120470;&#823;', I['14'] = _0x30d44f(0x2fb), I['15'] = _0x30d44f(0x4f9), I['16'] = '&#120473;&#823;', I['17'] = _0x30d44f(0x267), I['18'] = _0x30d44f(0x275), I['19'] = _0x30d44f(0x581), I['20'] = _0x30d44f(0x12f), I['21'] = _0x30d44f(0x1f9), I['22'] = _0x30d44f(0x5ef), I['23'] = _0x30d44f(0x44f), I['24'] = _0x30d44f(0x443), I['25'] = _0x30d44f(0x266), I['26'] = _0x30d44f(0x5ba), I['27'] = _0x30d44f(0x228), I['28'] = _0x30d44f(0x4dc), I['29'] = _0x30d44f(0x250), I['30'] = '&#120435;&#823;', I['31'] = _0x30d44f(0x22d), I['32'] = _0x30d44f(0x2f8), I['33'] = _0x30d44f(0x5a8), I['34'] = '&#120439;&#823;', I['35'] = _0x30d44f(0x18c), I['36'] = _0x30d44f(0x5d2), I['37'] = _0x30d44f(0x1e9), I['38'] = _0x30d44f(0x52f), I['39'] = _0x30d44f(0x253), I['40'] = _0x30d44f(0x264), I['41'] = _0x30d44f(0x25d), I['42'] = _0x30d44f(0x5ac), I['43'] = _0x30d44f(0x4cd), I['44'] = _0x30d44f(0x252), I['45'] = _0x30d44f(0x348), I['46'] = _0x30d44f(0x4bb), I['47'] = _0x30d44f(0x330), I['48'] = '&#120453;&#823;', I['49'] = '&#120454;&#823;', I['50'] = _0x30d44f(0x474), I['51'] = _0x30d44f(0x38b), I['52'] = '&#120457;&#823;', I['53'] = _0x30d44f(0x274), I['54'] = _0x30d44f(0x353), I['55'] = '&#120825;&#823;', I['56'] = _0x30d44f(0x5ea), I['57'] = _0x30d44f(0x3a1), I['58'] = _0x30d44f(0x55b), I['59'] = '&#120829;&#823;', I['60'] = _0x30d44f(0x4b9), I['61'] = _0x30d44f(0x56a), I['62'] = _0x30d44f(0x499);
var J = {};
J['1'] = _0x30d44f(0x1e2), J['2'] = _0x30d44f(0x37d), J['3'] = _0x30d44f(0x447), J['4'] = 'd&#866;', J['5'] = _0x30d44f(0x2cc), J['6'] = _0x30d44f(0x152), J['7'] = _0x30d44f(0x333), J['8'] = _0x30d44f(0x3fd), J['9'] = _0x30d44f(0x520), J['10'] = _0x30d44f(0x556), J['11'] = _0x30d44f(0x17e), J['12'] = _0x30d44f(0x295), J['13'] = 'm&#866;', J['14'] = 'n&#866;', J['15'] = _0x30d44f(0x205), J['16'] = 'p&#866;', J['17'] = _0x30d44f(0x2f7), J['18'] = _0x30d44f(0x344), J['19'] = 's&#866;', J['20'] = 't&#866;', J['21'] = _0x30d44f(0x5cc), J['22'] = _0x30d44f(0x147), J['23'] = _0x30d44f(0x153), J['24'] = 'x&#866;', J['25'] = _0x30d44f(0x4b8), J['26'] = _0x30d44f(0x3a6), J['27'] = _0x30d44f(0x2c0), J['28'] = _0x30d44f(0x4fb), J['29'] = 'C&#866;', J['30'] = _0x30d44f(0x1d8), J['31'] = _0x30d44f(0x217), J['32'] = _0x30d44f(0x55c), J['33'] = 'G&#866;', J['34'] = 'H&#866;', J['35'] = _0x30d44f(0x31b), J['36'] = _0x30d44f(0x2b7), J['37'] = _0x30d44f(0x525), J['38'] = _0x30d44f(0x453), J['39'] = _0x30d44f(0x2d9), J['40'] = _0x30d44f(0x3a8), J['41'] = _0x30d44f(0x206), J['42'] = 'P&#866;', J['43'] = 'Q&#866;', J['44'] = _0x30d44f(0x29e), J['45'] = _0x30d44f(0x307), J['46'] = _0x30d44f(0x490), J['47'] = _0x30d44f(0x189), J['48'] = 'V&#866;', J['49'] = 'W&#866;', J['50'] = 'X&#866;', J['51'] = _0x30d44f(0x43d), J['52'] = 'Z&#866;', J['53'] = '1&#866;', J['54'] = _0x30d44f(0x2b2), J['55'] = '3&#866;', J['56'] = _0x30d44f(0x469), J['57'] = _0x30d44f(0x5ad), J['58'] = _0x30d44f(0x12b), J['59'] = _0x30d44f(0x1a1), J['60'] = _0x30d44f(0x183), J['61'] = _0x30d44f(0x113), J['62'] = '0&#866;';
var K = {};
K['1'] = _0x30d44f(0x35b), K['2'] = _0x30d44f(0x14c), K['3'] = 'c&#828;', K['4'] = _0x30d44f(0x4c6), K['5'] = _0x30d44f(0x5c0), K['6'] = _0x30d44f(0x4b4), K['7'] = 'g&#828;', K['8'] = _0x30d44f(0x2ad), K['9'] = _0x30d44f(0x201), K['10'] = _0x30d44f(0x1e5), K['11'] = _0x30d44f(0x162), K['12'] = _0x30d44f(0x552), K['13'] = _0x30d44f(0x4ef), K['14'] = 'n&#828;', K['15'] = _0x30d44f(0x2ab), K['16'] = 'p&#828;', K['17'] = _0x30d44f(0x3ce), K['18'] = _0x30d44f(0x4a4), K['19'] = _0x30d44f(0x411), K['20'] = 't&#828;', K['21'] = _0x30d44f(0x2f5), K['22'] = _0x30d44f(0x517), K['23'] = 'w&#828;', K['24'] = _0x30d44f(0x464), K['25'] = 'y&#828;', K['26'] = _0x30d44f(0x254), K['27'] = _0x30d44f(0x49f), K['28'] = 'B&#828;', K['29'] = 'C&#828;', K['30'] = _0x30d44f(0x494), K['31'] = _0x30d44f(0x3c1), K['32'] = 'F&#828;', K['33'] = _0x30d44f(0x2f6), K['34'] = _0x30d44f(0x5f2), K['35'] = _0x30d44f(0x14f), K['36'] = 'J&#828;', K['37'] = 'K&#828;', K['38'] = _0x30d44f(0x1a6), K['39'] = _0x30d44f(0x4df), K['40'] = 'N&#828;', K['41'] = 'O&#828;', K['42'] = 'P&#828;', K['43'] = _0x30d44f(0x372), K['44'] = _0x30d44f(0x137), K['45'] = _0x30d44f(0x495), K['46'] = _0x30d44f(0x537), K['47'] = _0x30d44f(0x3e1), K['48'] = 'V&#828;', K['49'] = _0x30d44f(0x2e3), K['50'] = _0x30d44f(0x309), K['51'] = _0x30d44f(0x2b4), K['52'] = _0x30d44f(0x3a7), K['53'] = _0x30d44f(0x38c), K['54'] = _0x30d44f(0x1bd), K['55'] = '3&#828;', K['56'] = _0x30d44f(0x28c), K['57'] = '5&#828;', K['58'] = _0x30d44f(0x27d), K['59'] = _0x30d44f(0x5b9), K['60'] = _0x30d44f(0x47d), K['61'] = _0x30d44f(0x32d), K['62'] = _0x30d44f(0x4a9);
var L = {};
L['s1'] = h, L['s2'] = i, L['s3'] = j, L['s4'] = k, L['s5'] = l, L['s6'] = m, L['s7'] = n, L['s8'] = o, L['s9'] = p, L[_0x30d44f(0x134)] = q, L[_0x30d44f(0x47b)] = r, L[_0x30d44f(0x356)] = s, L[_0x30d44f(0x41b)] = t, L[_0x30d44f(0x4ac)] = u, L[_0x30d44f(0x5ae)] = v, L[_0x30d44f(0x1c8)] = w, L[_0x30d44f(0x480)] = x, L['s18'] = y, L[_0x30d44f(0x1eb)] = z, L[_0x30d44f(0x33a)] = A, L[_0x30d44f(0x25f)] = B, L[_0x30d44f(0x3d1)] = C, L[_0x30d44f(0x151)] = D, L[_0x30d44f(0x11c)] = E, L[_0x30d44f(0x166)] = F, L['s26'] = G, L[_0x30d44f(0x373)] = H, L[_0x30d44f(0x346)] = I, L[_0x30d44f(0x5b6)] = J, L[_0x30d44f(0x370)] = K;
var newtext = L;

function Change(_0x1b0d8e, _0x2ccfc1) {
    var _0x5651d2 = _0x30d44f,
        _0x3e242c = '',
        _0x1b0d8e = _0x1b0d8e;
    if (_0x1b0d8e[_0x5651d2(0x52a)] == 0x0) return;
    for (i = 0x0; i < _0x1b0d8e[_0x5651d2(0x52a)]; i++) {
        var _0x10efc2 = _0x1b0d8e[_0x5651d2(0x5df)](i),
            _0x332024 = normal[_0x5651d2(0x395)](_0x10efc2) + 0x1;
        if (_0x10efc2 == '\x20') _0x3e242c += '\x20';
        else !_0x332024 ? _0x3e242c += _0x10efc2 : _0x3e242c += newtext[_0x2ccfc1][_0x332024];
    }
    return _0x3e242c;
}
var M = {};
M['0'] = '0', M['1'] = '1', M['2'] = '2', M['3'] = '3', M['4'] = '4', M['5'] = '5', M['6'] = '6', M['7'] = '7', M['8'] = '8', M['9'] = '9', M['a'] = 'ᗩ', M['b'] = 'ᗷ', M['c'] = 'ᑢ', M['d'] = 'ᕲ', M['e'] = 'ᘿ', M['f'] = 'ᖴ', M['g'] = 'ᘜ', M['h'] = 'ᕼ', M['i'] = 'ᓰ', M['j'] = 'ᒚ', M['k'] = 'ᖽᐸ', M['l'] = 'ᒪ', M['m'] = 'ᘻ', M['n'] = 'ᘉ', M['o'] = 'ᓍ', M['p'] = 'ᕵ', M['q'] = 'ᕴ', M['r'] = 'ᖇ', M['s'] = 'S', M['t'] = 'ᖶ', M['u'] = 'ᑘ', M['v'] = 'ᐺ', M['w'] = 'ᘺ', M['x'] = '᙭', M['y'] = 'ᖻ', M['z'] = 'ᗱ', M['A'] = 'ᗩ', M['B'] = 'ᗷ', M['C'] = 'ᑢ', M['D'] = 'ᕲ', M['E'] = 'ᘿ', M['F'] = 'ᖴ', M['G'] = 'ᘜ', M['H'] = 'ᕼ', M['I'] = 'ᓰ', M['J'] = 'ᒚ', M['K'] = 'ᖽᐸ', M['L'] = 'ᒪ', M['M'] = 'ᘻ', M['N'] = 'ᘉ', M['O'] = 'ᓍ', M['P'] = 'ᕵ', M['Q'] = 'ᕴ', M['R'] = 'ᖇ', M['S'] = 'S', M['T'] = 'ᖶ', M['U'] = 'ᑘ', M['V'] = 'ᐺ', M['W'] = 'ᘺ', M['X'] = '᙭', M['Y'] = 'ᖻ', M['Z'] = 'ᗱ';
const futureAlienCharMap = M;
var N = {};
N['0'] = '0', N['1'] = '1', N['2'] = '2', N['3'] = '3', N['4'] = '4', N['5'] = '5', N['6'] = '6', N['7'] = '7', N['8'] = '8', N['9'] = '9', N['a'] = 'ค', N['b'] = '๖', N['c'] = '¢', N['d'] = '໓', N['e'] = 'ē', N['f'] = 'f', N['g'] = 'ງ', N['h'] = 'h', N['i'] = 'i', N['j'] = 'ว', N['k'] = 'k', N['l'] = 'l', N['m'] = '๓', N['n'] = 'ຖ', N['o'] = '໐', N['p'] = 'p', N['q'] = '๑', N['r'] = 'r', N['s'] = 'Ş', N['t'] = 't', N['u'] = 'น', N['v'] = 'ง', N['w'] = 'ຟ', N['x'] = 'x', N['y'] = 'ฯ', N['z'] = 'ຊ', N['A'] = 'ค', N['B'] = '๖', N['C'] = '¢', N['D'] = '໓', N['E'] = 'ē', N['F'] = 'f', N['G'] = 'ງ', N['H'] = 'h', N['I'] = 'i', N['J'] = 'ว', N['K'] = 'k', N['L'] = 'l', N['M'] = '๓', N['N'] = 'ຖ', N['O'] = '໐', N['P'] = 'p', N['Q'] = '๑', N['R'] = 'r', N['S'] = 'Ş', N['T'] = 't', N['U'] = 'น', N['V'] = 'ง', N['W'] = 'ຟ', N['X'] = 'x', N['Y'] = 'ฯ', N['Z'] = 'ຊ';
const squiggle6CharMap = N;
var O = {};
O['0'] = '0', O['1'] = '1', O['2'] = '2', O['3'] = '3', O['4'] = '4', O['5'] = '5', O['6'] = '6', O['7'] = '7', O['8'] = '8', O['9'] = '9', O['a'] = 'ą', O['b'] = 'ც', O['c'] = 'ƈ', O['d'] = 'ɖ', O['e'] = 'ɛ', O['f'] = 'ʄ', O['g'] = 'ɠ', O['h'] = 'ɧ', O['i'] = 'ı', O['j'] = 'ʝ', O['k'] = 'ƙ', O['l'] = 'Ɩ', O['m'] = 'ɱ', O['n'] = 'ŋ', O['o'] = 'ơ', O['p'] = '℘', O['q'] = 'զ', O['r'] = 'ཞ', O['s'] = 'ʂ', O['t'] = 'ɬ', O['u'] = 'ų', O['v'] = '۷', O['w'] = 'ῳ', O['x'] = 'ҳ', O['y'] = 'ყ', O['z'] = 'ʑ', O['A'] = 'ą', O['B'] = 'ც', O['C'] = 'ƈ', O['D'] = 'ɖ', O['E'] = 'ɛ', O['F'] = 'ʄ', O['G'] = 'ɠ', O['H'] = 'ɧ', O['I'] = 'ı', O['J'] = 'ʝ', O['K'] = 'ƙ', O['L'] = 'Ɩ', O['M'] = 'ɱ', O['N'] = 'ŋ', O['O'] = 'ơ', O['P'] = '℘', O['Q'] = 'զ', O['R'] = 'ཞ', O['S'] = 'ʂ', O['T'] = 'ɬ', O['U'] = 'ų', O['V'] = '۷', O['W'] = 'ῳ', O['X'] = 'ҳ', O['Y'] = 'ყ', O['Z'] = 'ʑ';
const squiggle5CharMap = O;
var P = {};
P['0'] = '0', P['1'] = '1', P['2'] = '2', P['3'] = '3', P['4'] = '4', P['5'] = '5', P['6'] = '6', P['7'] = '7', P['8'] = '8', P['9'] = '9', P['a'] = 'ﾑ', P['b'] = '乃', P['c'] = 'ᄃ', P['d'] = 'り', P['e'] = '乇', P['f'] = 'ｷ', P['g'] = 'ム', P['h'] = 'ん', P['i'] = 'ﾉ', P['j'] = 'ﾌ', P['k'] = 'ズ', P['l'] = 'ﾚ', P['m'] = 'ﾶ', P['n'] = '刀', P['o'] = 'の', P['p'] = 'ｱ', P['q'] = 'ゐ', P['r'] = '尺', P['s'] = '丂', P['t'] = 'ｲ', P['u'] = 'ひ', P['v'] = '√', P['w'] = 'W', P['x'] = 'ﾒ', P['y'] = 'ﾘ', P['z'] = '乙', P['A'] = 'ﾑ', P['B'] = '乃', P['C'] = 'ᄃ', P['D'] = 'り', P['E'] = '乇', P['F'] = 'ｷ', P['G'] = 'ム', P['H'] = 'ん', P['I'] = 'ﾉ', P['J'] = 'ﾌ', P['K'] = 'ズ', P['L'] = 'ﾚ', P['M'] = 'ﾶ', P['N'] = '刀', P['O'] = 'の', P['P'] = 'ｱ', P['Q'] = 'ゐ', P['R'] = '尺', P['S'] = '丂', P['T'] = 'ｲ', P['U'] = 'ひ', P['V'] = '√', P['W'] = 'W', P['X'] = 'ﾒ', P['Y'] = 'ﾘ', P['Z'] = '乙';
const asianStyle2CharMap = P;
var Q = {};
Q['0'] = '0', Q['1'] = '1', Q['2'] = '2', Q['3'] = '3', Q['4'] = '4', Q['5'] = '5', Q['6'] = '6', Q['7'] = '7', Q['8'] = '8', Q['9'] = '9', Q['a'] = '卂', Q['b'] = '乃', Q['c'] = '匚', Q['d'] = 'ᗪ', Q['e'] = '乇', Q['f'] = '千', Q['g'] = 'Ꮆ', Q['h'] = '卄', Q['i'] = '丨', Q['j'] = 'ﾌ', Q['k'] = 'Ҝ', Q['l'] = 'ㄥ', Q['m'] = '爪', Q['n'] = '几', Q['o'] = 'ㄖ', Q['p'] = '卩', Q['q'] = 'Ɋ', Q['r'] = '尺', Q['s'] = '丂', Q['t'] = 'ㄒ', Q['u'] = 'ㄩ', Q['v'] = 'ᐯ', Q['w'] = '山', Q['x'] = '乂', Q['y'] = 'ㄚ', Q['z'] = '乙', Q['A'] = '卂', Q['B'] = '乃', Q['C'] = '匚', Q['D'] = 'ᗪ', Q['E'] = '乇', Q['F'] = '千', Q['G'] = 'Ꮆ', Q['H'] = '卄', Q['I'] = '丨', Q['J'] = 'ﾌ', Q['K'] = 'Ҝ', Q['L'] = 'ㄥ', Q['M'] = '爪', Q['N'] = '几', Q['O'] = 'ㄖ', Q['P'] = '卩', Q['Q'] = 'Ɋ', Q['R'] = '尺', Q['S'] = '丂', Q['T'] = 'ㄒ', Q['U'] = 'ㄩ', Q['V'] = 'ᐯ', Q['W'] = '山', Q['X'] = '乂', Q['Y'] = 'ㄚ', Q['Z'] = '乙';
const asianStyleCharMap = Q;
var R = {};
R['0'] = '0', R['1'] = '1', R['2'] = '2', R['3'] = '3', R['4'] = '4', R['5'] = '5', R['6'] = '6', R['7'] = '7', R['8'] = '8', R['9'] = '9', R['a'] = '🄰', R['b'] = '🄱', R['c'] = '🄲', R['d'] = '🄳', R['e'] = '🄴', R['f'] = '🄵', R['g'] = '🄶', R['h'] = '🄷', R['i'] = '🄸', R['j'] = '🄹', R['k'] = '🄺', R['l'] = '🄻', R['m'] = '🄼', R['n'] = '🄽', R['o'] = '🄾', R['p'] = '🄿', R['q'] = '🅀', R['r'] = '🅁', R['s'] = '🅂', R['t'] = '🅃', R['u'] = '🅄', R['v'] = '🅅', R['w'] = '🅆', R['x'] = '🅇', R['y'] = '🅈', R['z'] = '🅉', R['A'] = '🄰', R['B'] = '🄱', R['C'] = '🄲', R['D'] = '🄳', R['E'] = '🄴', R['F'] = '🄵', R['G'] = '🄶', R['H'] = '🄷', R['I'] = '🄸', R['J'] = '🄹', R['K'] = '🄺', R['L'] = '🄻', R['M'] = '🄼', R['N'] = '🄽', R['O'] = '🄾', R['P'] = '🄿', R['Q'] = '🅀', R['R'] = '🅁', R['S'] = '🅂', R['T'] = '🅃', R['U'] = '🅄', R['V'] = '🅅', R['W'] = '🅆', R['X'] = '🅇', R['Y'] = '🅈', R['Z'] = '🅉';
const squaresCharMap = R;
var S = {};
S['0'] = '0', S['1'] = '1', S['2'] = '2', S['3'] = '3', S['4'] = '4', S['5'] = '5', S['6'] = '6', S['7'] = '7', S['8'] = '8', S['9'] = '9', S['a'] = 'Ꮧ', S['b'] = 'Ᏸ', S['c'] = 'ፈ', S['d'] = 'Ꮄ', S['e'] = 'Ꮛ', S['f'] = 'Ꭶ', S['g'] = 'Ꮆ', S['h'] = 'Ꮒ', S['i'] = 'Ꭵ', S['j'] = 'Ꮰ', S['k'] = 'Ꮶ', S['l'] = 'Ꮭ', S['m'] = 'Ꮇ', S['n'] = 'Ꮑ', S['o'] = 'Ꭷ', S['p'] = 'Ꭾ', S['q'] = 'Ꭴ', S['r'] = 'Ꮢ', S['s'] = 'Ꮥ', S['t'] = 'Ꮦ', S['u'] = 'Ꮼ', S['v'] = 'Ꮙ', S['w'] = 'Ꮗ', S['x'] = 'ጀ', S['y'] = 'Ꭹ', S['z'] = 'ፚ', S['A'] = 'Ꮧ', S['B'] = 'Ᏸ', S['C'] = 'ፈ', S['D'] = 'Ꮄ', S['E'] = 'Ꮛ', S['F'] = 'Ꭶ', S['G'] = 'Ꮆ', S['H'] = 'Ꮒ', S['I'] = 'Ꭵ', S['J'] = 'Ꮰ', S['K'] = 'Ꮶ', S['L'] = 'Ꮭ', S['M'] = 'Ꮇ', S['N'] = 'Ꮑ', S['O'] = 'Ꭷ', S['P'] = 'Ꭾ', S['Q'] = 'Ꭴ', S['R'] = 'Ꮢ', S['S'] = 'Ꮥ', S['T'] = 'Ꮦ', S['U'] = 'Ꮼ', S['V'] = 'Ꮙ', S['W'] = 'Ꮗ', S['X'] = 'ጀ', S['Y'] = 'Ꭹ', S['Z'] = 'ፚ';
const squiggle4CharMap = S;
var T = {};
T['0'] = '0', T['1'] = '1', T['2'] = '2', T['3'] = '3', T['4'] = '4', T['5'] = '5', T['6'] = '6', T['7'] = '7', T['8'] = '8', T['9'] = '9', T['a'] = 'ᗩ', T['b'] = 'ᗷ', T['c'] = 'ᑕ', T['d'] = 'ᗪ', T['e'] = 'E', T['f'] = 'ᖴ', T['g'] = 'G', T['h'] = 'ᕼ', T['i'] = 'I', T['j'] = 'ᒍ', T['k'] = 'K', T['l'] = 'ᒪ', T['m'] = 'ᗰ', T['n'] = 'ᑎ', T['o'] = 'O', T['p'] = 'ᑭ', T['q'] = 'ᑫ', T['r'] = 'ᖇ', T['s'] = 'ᔕ', T['t'] = 'T', T['u'] = 'ᑌ', T['v'] = 'ᐯ', T['w'] = 'ᗯ', T['x'] = '᙭', T['y'] = 'Y', T['z'] = 'ᘔ', T['A'] = 'ᗩ', T['B'] = 'ᗷ', T['C'] = 'ᑕ', T['D'] = 'ᗪ', T['E'] = 'E', T['F'] = 'ᖴ', T['G'] = 'G', T['H'] = 'ᕼ', T['I'] = 'I', T['J'] = 'ᒍ', T['K'] = 'K', T['L'] = 'ᒪ', T['M'] = 'ᗰ', T['N'] = 'ᑎ', T['O'] = 'O', T['P'] = 'ᑭ', T['Q'] = 'ᑫ', T['R'] = 'ᖇ', T['S'] = 'ᔕ', T['T'] = 'T', T['U'] = 'ᑌ', T['V'] = 'ᐯ', T['W'] = 'ᗯ', T['X'] = '᙭', T['Y'] = 'Y', T['Z'] = 'ᘔ';
const neonCharMap = T;
var U = {};
U['0'] = '0', U['1'] = '1', U['2'] = '2', U['3'] = '3', U['4'] = '4', U['5'] = '5', U['6'] = '6', U['7'] = '7', U['8'] = '8', U['9'] = '9', U['a'] = 'ǟ', U['b'] = 'ɮ', U['c'] = 'ƈ', U['d'] = 'ɖ', U['e'] = 'ɛ', U['f'] = 'ʄ', U['g'] = 'ɢ', U['h'] = 'ɦ', U['i'] = 'ɨ', U['j'] = 'ʝ', U['k'] = 'ӄ', U['l'] = 'ʟ', U['m'] = 'ʍ', U['n'] = 'ռ', U['o'] = 'օ', U['p'] = 'ք', U['q'] = 'զ', U['r'] = 'ʀ', U['s'] = 'ֆ', U['t'] = 'ȶ', U['u'] = 'ʊ', U['v'] = 'ʋ', U['w'] = 'ա', U['x'] = 'Ӽ', U['y'] = 'ʏ', U['z'] = 'ʐ', U['A'] = 'ǟ', U['B'] = 'ɮ', U['C'] = 'ƈ', U['D'] = 'ɖ', U['E'] = 'ɛ', U['F'] = 'ʄ', U['G'] = 'ɢ', U['H'] = 'ɦ', U['I'] = 'ɨ', U['J'] = 'ʝ', U['K'] = 'ӄ', U['L'] = 'ʟ', U['M'] = 'ʍ', U['N'] = 'ռ', U['O'] = 'օ', U['P'] = 'ք', U['Q'] = 'զ', U['R'] = 'ʀ', U['S'] = 'ֆ', U['T'] = 'ȶ', U['U'] = 'ʊ', U['V'] = 'ʋ', U['W'] = 'ա', U['X'] = 'Ӽ', U['Y'] = 'ʏ', U['Z'] = 'ʐ';
const squiggle3CharMap = U;
var V = {};
V['0'] = '𝟶', V['1'] = '𝟷', V['2'] = '𝟸', V['3'] = '𝟹', V['4'] = '𝟺', V['5'] = '𝟻', V['6'] = '𝟼', V['7'] = '𝟽', V['8'] = '𝟾', V['9'] = '𝟿', V['a'] = '𝚊', V['b'] = '𝚋', V['c'] = '𝚌', V['d'] = '𝚍', V['e'] = '𝚎', V['f'] = '𝚏', V['g'] = '𝚐', V['h'] = '𝚑', V['i'] = '𝚒', V['j'] = '𝚓', V['k'] = '𝚔', V['l'] = '𝚕', V['m'] = '𝚖', V['n'] = '𝚗', V['o'] = '𝚘', V['p'] = '𝚙', V['q'] = '𝚚', V['r'] = '𝚛', V['s'] = '𝚜', V['t'] = '𝚝', V['u'] = '𝚞', V['v'] = '𝚟', V['w'] = '𝚠', V['x'] = '𝚡', V['y'] = '𝚢', V['z'] = '𝚣', V['A'] = '𝙰', V['B'] = '𝙱', V['C'] = '𝙲', V['D'] = '𝙳', V['E'] = '𝙴', V['F'] = '𝙵', V['G'] = '𝙶', V['H'] = '𝙷', V['I'] = '𝙸', V['J'] = '𝙹', V['K'] = '𝙺', V['L'] = '𝙻', V['M'] = '𝙼', V['N'] = '𝙽', V['O'] = '𝙾', V['P'] = '𝙿', V['Q'] = '𝚀', V['R'] = '𝚁', V['S'] = '𝚂', V['T'] = '𝚃', V['U'] = '𝚄', V['V'] = '𝚅', V['W'] = '𝚆', V['X'] = '𝚇', V['Y'] = '𝚈', V['Z'] = '𝚉';
const monospaceCharMap = V;
var W = {};
W['0'] = '0', W['1'] = '1', W['2'] = '2', W['3'] = '3', W['4'] = '4', W['5'] = '5', W['6'] = '6', W['7'] = '7', W['8'] = '8', W['9'] = '9', W['a'] = '𝙖', W['b'] = '𝙗', W['c'] = '𝙘', W['d'] = '𝙙', W['e'] = '𝙚', W['f'] = '𝙛', W['g'] = '𝙜', W['h'] = '𝙝', W['i'] = '𝙞', W['j'] = '𝙟', W['k'] = '𝙠', W['l'] = '𝙡', W['m'] = '𝙢', W['n'] = '𝙣', W['o'] = '𝙤', W['p'] = '𝙥', W['q'] = '𝙦', W['r'] = '𝙧', W['s'] = '𝙨', W['t'] = '𝙩', W['u'] = '𝙪', W['v'] = '𝙫', W['w'] = '𝙬', W['x'] = '𝙭', W['y'] = '𝙮', W['z'] = '𝙯', W['A'] = '𝘼', W['B'] = '𝘽', W['C'] = '𝘾', W['D'] = '𝘿', W['E'] = '𝙀', W['F'] = '𝙁', W['G'] = '𝙂', W['H'] = '𝙃', W['I'] = '𝙄', W['J'] = '𝙅', W['K'] = '𝙆', W['L'] = '𝙇', W['M'] = '𝙈', W['N'] = '𝙉', W['O'] = '𝙊', W['P'] = '𝙋', W['Q'] = '𝙌', W['R'] = '𝙍', W['S'] = '𝙎', W['T'] = '𝙏', W['U'] = '𝙐', W['V'] = '𝙑', W['W'] = '𝙒', W['X'] = '𝙓', W['Y'] = '𝙔', W['Z'] = '𝙕';
const boldItalicCharMap = W;
var X = {};
X['0'] = '𝟎', X['1'] = '𝟏', X['2'] = '𝟐', X['3'] = '𝟑', X['4'] = '𝟒', X['5'] = '𝟓', X['6'] = '𝟔', X['7'] = '𝟕', X['8'] = '𝟖', X['9'] = '𝟗', X['a'] = '𝐚', X['b'] = '𝐛', X['c'] = '𝐜', X['d'] = '𝐝', X['e'] = '𝐞', X['f'] = '𝐟', X['g'] = '𝐠', X['h'] = '𝐡', X['i'] = '𝐢', X['j'] = '𝐣', X['k'] = '𝐤', X['l'] = '𝐥', X['m'] = '𝐦', X['n'] = '𝐧', X['o'] = '𝐨', X['p'] = '𝐩', X['q'] = '𝐪', X['r'] = '𝐫', X['s'] = '𝐬', X['t'] = '𝐭', X['u'] = '𝐮', X['v'] = '𝐯', X['w'] = '𝐰', X['x'] = '𝐱', X['y'] = '𝐲', X['z'] = '𝐳', X['A'] = '𝐀', X['B'] = '𝐁', X['C'] = '𝐂', X['D'] = '𝐃', X['E'] = '𝐄', X['F'] = '𝐅', X['G'] = '𝐆', X['H'] = '𝐇', X['I'] = '𝐈', X['J'] = '𝐉', X['K'] = '𝐊', X['L'] = '𝐋', X['M'] = '𝐌', X['N'] = '𝐍', X['O'] = '𝐎', X['P'] = '𝐏', X['Q'] = '𝐐', X['R'] = '𝐑', X['S'] = '𝐒', X['T'] = '𝐓', X['U'] = '𝐔', X['V'] = '𝐕', X['W'] = '𝐖', X['X'] = '𝐗', X['Y'] = '𝐘', X['Z'] = '𝐙';
const boldCharMap = X;
var Y = {};
Y['0'] = '0', Y['1'] = '1', Y['2'] = '2', Y['3'] = '3', Y['4'] = '4', Y['5'] = '5', Y['6'] = '6', Y['7'] = '7', Y['8'] = '8', Y['9'] = '9', Y['a'] = '𝘢', Y['b'] = '𝘣', Y['c'] = '𝘤', Y['d'] = '𝘥', Y['e'] = '𝘦', Y['f'] = '𝘧', Y['g'] = '𝘨', Y['h'] = '𝘩', Y['i'] = '𝘪', Y['j'] = '𝘫', Y['k'] = '𝘬', Y['l'] = '𝘭', Y['m'] = '𝘮', Y['n'] = '𝘯', Y['o'] = '𝘰', Y['p'] = '𝘱', Y['q'] = '𝘲', Y['r'] = '𝘳', Y['s'] = '𝘴', Y['t'] = '𝘵', Y['u'] = '𝘶', Y['v'] = '𝘷', Y['w'] = '𝘸', Y['x'] = '𝘹', Y['y'] = '𝘺', Y['z'] = '𝘻', Y['A'] = '𝘈', Y['B'] = '𝘉', Y['C'] = '𝘊', Y['D'] = '𝘋', Y['E'] = '𝘌', Y['F'] = '𝘍', Y['G'] = '𝘎', Y['H'] = '𝘏', Y['I'] = '𝘐', Y['J'] = '𝘑', Y['K'] = '𝘒', Y['L'] = '𝘓', Y['M'] = '𝘔', Y['N'] = '𝘕', Y['O'] = '𝘖', Y['P'] = '𝘗', Y['Q'] = '𝘘', Y['R'] = '𝘙', Y['S'] = '𝘚', Y['T'] = '𝘛', Y['U'] = '𝘜', Y['V'] = '𝘝', Y['W'] = '𝘞', Y['X'] = '𝘟', Y['Y'] = '𝘠', Y['Z'] = '𝘡';
const italicCharMap = Y;
var Z = {};
Z['0'] = '0', Z['1'] = '1', Z['2'] = '2', Z['3'] = '3', Z['4'] = '4', Z['5'] = '5', Z['6'] = '6', Z['7'] = '7', Z['8'] = '8', Z['9'] = '9', Z['a'] = 'α', Z['b'] = 'Ⴆ', Z['c'] = 'ƈ', Z['d'] = 'ԃ', Z['e'] = 'ҽ', Z['f'] = 'ϝ', Z['g'] = 'ɠ', Z['h'] = 'ԋ', Z['i'] = 'ι', Z['j'] = 'ʝ', Z['k'] = 'ƙ', Z['l'] = 'ʅ', Z['m'] = 'ɱ', Z['n'] = 'ɳ', Z['o'] = 'σ', Z['p'] = 'ρ', Z['q'] = 'ϙ', Z['r'] = 'ɾ', Z['s'] = 'ʂ', Z['t'] = 'ƚ', Z['u'] = 'υ', Z['v'] = 'ʋ', Z['w'] = 'ɯ', Z['x'] = 'x', Z['y'] = 'ყ', Z['z'] = 'ȥ', Z['A'] = 'A', Z['B'] = 'B', Z['C'] = 'C', Z['D'] = 'D', Z['E'] = 'E', Z['F'] = 'F', Z['G'] = 'G', Z['H'] = 'H', Z['I'] = 'I', Z['J'] = 'J', Z['K'] = 'K', Z['L'] = 'L', Z['M'] = 'M', Z['N'] = 'N', Z['O'] = 'O', Z['P'] = 'P', Z['Q'] = 'Q', Z['R'] = 'R', Z['S'] = 'S', Z['T'] = 'T', Z['U'] = 'U', Z['V'] = 'V', Z['W'] = 'W', Z['X'] = 'X', Z['Y'] = 'Y', Z['Z'] = 'Z';
const squiggle2CharMap = Z;
var a0 = {};
a0['0'] = '0', a0['1'] = '1', a0['2'] = '2', a0['3'] = '3', a0['4'] = '4', a0['5'] = '5', a0['6'] = '6', a0['7'] = '7', a0['8'] = '8', a0['9'] = '9', a0['a'] = '₳', a0['b'] = '฿', a0['c'] = '₵', a0['d'] = 'Đ', a0['e'] = 'Ɇ', a0['f'] = '₣', a0['g'] = '₲', a0['h'] = 'Ⱨ', a0['i'] = 'ł', a0['j'] = 'J', a0['k'] = '₭', a0['l'] = 'Ⱡ', a0['m'] = '₥', a0['n'] = '₦', a0['o'] = 'Ø', a0['p'] = '₱', a0['q'] = 'Q', a0['r'] = 'Ɽ', a0['s'] = '₴', a0['t'] = '₮', a0['u'] = 'Ʉ', a0['v'] = 'V', a0['w'] = '₩', a0['x'] = 'Ӿ', a0['y'] = 'Ɏ', a0['z'] = 'Ⱬ', a0['A'] = '₳', a0['B'] = '฿', a0['C'] = '₵', a0['D'] = 'Đ', a0['E'] = 'Ɇ', a0['F'] = '₣', a0['G'] = '₲', a0['H'] = 'Ⱨ', a0['I'] = 'ł', a0['J'] = 'J', a0['K'] = '₭', a0['L'] = 'Ⱡ', a0['M'] = '₥', a0['N'] = '₦', a0['O'] = 'Ø', a0['P'] = '₱', a0['Q'] = 'Q', a0['R'] = 'Ɽ', a0['S'] = '₴', a0['T'] = '₮', a0['U'] = 'Ʉ', a0['V'] = 'V', a0['W'] = '₩', a0['X'] = 'Ӿ', a0['Y'] = 'Ɏ', a0['Z'] = 'Ⱬ';
const currencyCharMap = a0;
var a1 = {};
a1['0'] = '0', a1['1'] = '1', a1['2'] = '2', a1['3'] = '3', a1['4'] = '4', a1['5'] = '5', a1['6'] = '6', a1['7'] = '7', a1['8'] = '8', a1['9'] = '9', a1['a'] = 'å', a1['b'] = 'ß', a1['c'] = '¢', a1['d'] = 'Ð', a1['e'] = 'ê', a1['f'] = '£', a1['g'] = 'g', a1['h'] = 'h', a1['i'] = 'ï', a1['j'] = 'j', a1['k'] = 'k', a1['l'] = 'l', a1['m'] = 'm', a1['n'] = 'ñ', a1['o'] = 'ð', a1['p'] = 'þ', a1['q'] = 'q', a1['r'] = 'r', a1['s'] = '§', a1['t'] = '†', a1['u'] = 'µ', a1['v'] = 'v', a1['w'] = 'w', a1['x'] = 'x', a1['y'] = '¥', a1['z'] = 'z', a1['A'] = 'Ä', a1['B'] = 'ß', a1['C'] = 'Ç', a1['D'] = 'Ð', a1['E'] = 'È', a1['F'] = '£', a1['G'] = 'G', a1['H'] = 'H', a1['I'] = 'Ì', a1['J'] = 'J', a1['K'] = 'K', a1['L'] = 'L', a1['M'] = 'M', a1['N'] = 'ñ', a1['O'] = 'Ö', a1['P'] = 'þ', a1['Q'] = 'Q', a1['R'] = 'R', a1['S'] = '§', a1['T'] = '†', a1['U'] = 'Ú', a1['V'] = 'V', a1['W'] = 'W', a1['X'] = '×', a1['Y'] = '¥', a1['Z'] = 'Z';
const symbolsCharMap = a1;
var a2 = {};
a2['0'] = '0', a2['1'] = '1', a2['2'] = '2', a2['3'] = '3', a2['4'] = '4', a2['5'] = '5', a2['6'] = '6', a2['7'] = '7', a2['8'] = '8', a2['9'] = '9', a2['a'] = 'α', a2['b'] = 'в', a2['c'] = '¢', a2['d'] = '∂', a2['e'] = 'є', a2['f'] = 'ƒ', a2['g'] = 'g', a2['h'] = 'н', a2['i'] = 'ι', a2['j'] = 'נ', a2['k'] = 'к', a2['l'] = 'ℓ', a2['m'] = 'м', a2['n'] = 'η', a2['o'] = 'σ', a2['p'] = 'ρ', a2['q'] = 'q', a2['r'] = 'я', a2['s'] = 'ѕ', a2['t'] = 'т', a2['u'] = 'υ', a2['v'] = 'ν', a2['w'] = 'ω', a2['x'] = 'χ', a2['y'] = 'у', a2['z'] = 'z', a2['A'] = 'α', a2['B'] = 'в', a2['C'] = '¢', a2['D'] = '∂', a2['E'] = 'є', a2['F'] = 'ƒ', a2['G'] = 'g', a2['H'] = 'н', a2['I'] = 'ι', a2['J'] = 'נ', a2['K'] = 'к', a2['L'] = 'ℓ', a2['M'] = 'м', a2['N'] = 'η', a2['O'] = 'σ', a2['P'] = 'ρ', a2['Q'] = 'q', a2['R'] = 'я', a2['S'] = 'ѕ', a2['T'] = 'т', a2['U'] = 'υ', a2['V'] = 'ν', a2['W'] = 'ω', a2['X'] = 'χ', a2['Y'] = 'у', a2['Z'] = 'z';
const greekCharMap = a2;
var a3 = {};
a3['0'] = '⊘', a3['1'] = '𝟙', a3['2'] = 'ϩ', a3['3'] = 'Ӡ', a3['4'] = '५', a3['5'] = 'Ƽ', a3['6'] = 'Ϭ', a3['7'] = '7', a3['8'] = '𝟠', a3['9'] = '९', a3['a'] = 'ą', a3['b'] = 'ҍ', a3['c'] = 'ç', a3['d'] = 'ժ', a3['e'] = 'ҽ', a3['f'] = 'ƒ', a3['g'] = 'ց', a3['h'] = 'հ', a3['i'] = 'ì', a3['j'] = 'ʝ', a3['k'] = 'ҟ', a3['l'] = 'Ӏ', a3['m'] = 'ʍ', a3['n'] = 'ղ', a3['o'] = 'օ', a3['p'] = 'ք', a3['q'] = 'զ', a3['r'] = 'ɾ', a3['s'] = 'ʂ', a3['t'] = 'է', a3['u'] = 'մ', a3['v'] = 'ѵ', a3['w'] = 'ա', a3['x'] = '×', a3['y'] = 'վ', a3['z'] = 'Հ', a3['A'] = 'Ⱥ', a3['B'] = 'β', a3['C'] = '↻', a3['D'] = 'Ꭰ', a3['E'] = 'Ɛ', a3['F'] = 'Ƒ', a3['G'] = 'Ɠ', a3['H'] = 'Ƕ', a3['I'] = 'į', a3['J'] = 'ل', a3['K'] = 'Ҡ', a3['L'] = 'Ꝉ', a3['M'] = 'Ɱ', a3['N'] = 'ហ', a3['O'] = 'ට', a3['P'] = 'φ', a3['Q'] = 'Ҩ', a3['R'] = 'འ', a3['S'] = 'Ϛ', a3['T'] = 'Ͳ', a3['U'] = 'Ա', a3['V'] = 'Ỽ', a3['W'] = 'చ', a3['X'] = 'ჯ', a3['Y'] = 'Ӌ', a3['Z'] = 'ɀ';
const bentTextCharMap = a3;
var a4 = {};
a4['0'] = '0', a4['1'] = '1', a4['2'] = '2', a4['3'] = '3', a4['4'] = '4', a4['5'] = '5', a4['6'] = '6', a4['7'] = '7', a4['8'] = '8', a4['9'] = '9', a4['a'] = 'Λ', a4['b'] = 'B', a4['c'] = 'ᄃ', a4['d'] = 'D', a4['e'] = 'Σ', a4['f'] = 'F', a4['g'] = 'G', a4['h'] = 'Ή', a4['i'] = 'I', a4['j'] = 'J', a4['k'] = 'K', a4['l'] = 'ᄂ', a4['m'] = 'M', a4['n'] = 'П', a4['o'] = 'Ө', a4['p'] = 'P', a4['q'] = 'Q', a4['r'] = 'Я', a4['s'] = 'Ƨ', a4['t'] = 'Ƭ', a4['u'] = 'Ц', a4['v'] = 'V', a4['w'] = 'Щ', a4['x'] = 'X', a4['y'] = 'Y', a4['z'] = 'Z', a4['A'] = 'Λ', a4['B'] = 'B', a4['C'] = 'ᄃ', a4['D'] = 'D', a4['E'] = 'Σ', a4['F'] = 'F', a4['G'] = 'G', a4['H'] = 'Ή', a4['I'] = 'I', a4['J'] = 'J', a4['K'] = 'K', a4['L'] = 'ᄂ', a4['M'] = 'M', a4['N'] = 'П', a4['O'] = 'Ө', a4['P'] = 'P', a4['Q'] = 'Q', a4['R'] = 'Я', a4['S'] = 'Ƨ', a4['T'] = 'Ƭ', a4['U'] = 'Ц', a4['V'] = 'V', a4['W'] = 'Щ', a4['X'] = 'X', a4['Y'] = 'Y', a4['Z'] = 'Z';
const upperAnglesCharMap = a4;
var a5 = {};
a5['0'] = '₀', a5['1'] = '₁', a5['2'] = '₂', a5['3'] = '₃', a5['4'] = '₄', a5['5'] = '₅', a5['6'] = '₆', a5['7'] = '₇', a5['8'] = '₈', a5['9'] = '₉', a5['a'] = 'ₐ', a5['b'] = 'b', a5['c'] = 'c', a5['d'] = 'd', a5['e'] = 'ₑ', a5['f'] = 'f', a5['g'] = 'g', a5['h'] = 'ₕ', a5['i'] = 'ᵢ', a5['j'] = 'ⱼ', a5['k'] = 'ₖ', a5['l'] = 'ₗ', a5['m'] = 'ₘ', a5['n'] = 'ₙ', a5['o'] = 'ₒ', a5['p'] = 'ₚ', a5['q'] = 'q', a5['r'] = 'ᵣ', a5['s'] = 'ₛ', a5['t'] = 'ₜ', a5['u'] = 'ᵤ', a5['v'] = 'ᵥ', a5['w'] = 'w', a5['x'] = 'ₓ', a5['y'] = 'y', a5['z'] = 'z', a5['A'] = 'ₐ', a5['B'] = 'B', a5['C'] = 'C', a5['D'] = 'D', a5['E'] = 'ₑ', a5['F'] = 'F', a5['G'] = 'G', a5['H'] = 'ₕ', a5['I'] = 'ᵢ', a5['J'] = 'ⱼ', a5['K'] = 'ₖ', a5['L'] = 'ₗ', a5['M'] = 'ₘ', a5['N'] = 'ₙ', a5['O'] = 'ₒ', a5['P'] = 'ₚ', a5['Q'] = 'Q', a5['R'] = 'ᵣ', a5['S'] = 'ₛ', a5['T'] = 'ₜ', a5['U'] = 'ᵤ', a5['V'] = 'ᵥ', a5['W'] = 'W', a5['X'] = 'ₓ', a5['Y'] = 'Y', a5['Z'] = 'Z', a5['+'] = '₊', a5['-'] = '₋', a5['='] = '₌', a5['('] = '₍', a5[')'] = '₎';
const subscriptCharMap = a5;
var a6 = {};
a6['0'] = '⁰', a6['1'] = '¹', a6['2'] = '²', a6['3'] = '³', a6['4'] = '⁴', a6['5'] = '⁵', a6['6'] = '⁶', a6['7'] = '⁷', a6['8'] = '⁸', a6['9'] = '⁹', a6['a'] = 'ᵃ', a6['b'] = 'ᵇ', a6['c'] = 'ᶜ', a6['d'] = 'ᵈ', a6['e'] = 'ᵉ', a6['f'] = 'ᶠ', a6['g'] = 'ᵍ', a6['h'] = 'ʰ', a6['i'] = 'ⁱ', a6['j'] = 'ʲ', a6['k'] = 'ᵏ', a6['l'] = 'ˡ', a6['m'] = 'ᵐ', a6['n'] = 'ⁿ', a6['o'] = 'ᵒ', a6['p'] = 'ᵖ', a6['q'] = 'q', a6['r'] = 'ʳ', a6['s'] = 'ˢ', a6['t'] = 'ᵗ', a6['u'] = 'ᵘ', a6['v'] = 'ᵛ', a6['w'] = 'ʷ', a6['x'] = 'ˣ', a6['y'] = 'ʸ', a6['z'] = 'ᶻ', a6['A'] = 'ᴬ', a6['B'] = 'ᴮ', a6['C'] = 'ᶜ', a6['D'] = 'ᴰ', a6['E'] = 'ᴱ', a6['F'] = 'ᶠ', a6['G'] = 'ᴳ', a6['H'] = 'ᴴ', a6['I'] = 'ᴵ', a6['J'] = 'ᴶ', a6['K'] = 'ᴷ', a6['L'] = 'ᴸ', a6['M'] = 'ᴹ', a6['N'] = 'ᴺ', a6['O'] = 'ᴼ', a6['P'] = 'ᴾ', a6['Q'] = 'Q', a6['R'] = 'ᴿ', a6['S'] = 'ˢ', a6['T'] = 'ᵀ', a6['U'] = 'ᵁ', a6['V'] = 'ⱽ', a6['W'] = 'ᵂ', a6['X'] = 'ˣ', a6['Y'] = 'ʸ', a6['Z'] = 'ᶻ', a6['+'] = '⁺', a6['-'] = '⁻', a6['='] = '⁼', a6['('] = '⁽', a6[')'] = '⁾';
const superscriptCharMap = a6;
var a7 = {};
a7['0'] = '0', a7['1'] = '1', a7['2'] = '2', a7['3'] = '3', a7['4'] = '4', a7['5'] = '5', a7['6'] = '6', a7['7'] = '7', a7['8'] = '8', a7['9'] = '9', a7['a'] = 'ค', a7['b'] = '๒', a7['c'] = 'ς', a7['d'] = '๔', a7['e'] = 'є', a7['f'] = 'Ŧ', a7['g'] = 'ﻮ', a7['h'] = 'ђ', a7['i'] = 'เ', a7['j'] = 'ן', a7['k'] = 'к', a7['l'] = 'ɭ', a7['m'] = '๓', a7['n'] = 'ภ', a7['o'] = '๏', a7['p'] = 'ק', a7['q'] = 'ợ', a7['r'] = 'г', a7['s'] = 'ร', a7['t'] = 'Շ', a7['u'] = 'ย', a7['v'] = 'ש', a7['w'] = 'ฬ', a7['x'] = 'א', a7['y'] = 'ץ', a7['z'] = 'չ', a7['A'] = 'ค', a7['B'] = '๒', a7['C'] = 'ς', a7['D'] = '๔', a7['E'] = 'є', a7['F'] = 'Ŧ', a7['G'] = 'ﻮ', a7['H'] = 'ђ', a7['I'] = 'เ', a7['J'] = 'ן', a7['K'] = 'к', a7['L'] = 'ɭ', a7['M'] = '๓', a7['N'] = 'ภ', a7['O'] = '๏', a7['P'] = 'ק', a7['Q'] = 'ợ', a7['R'] = 'г', a7['S'] = 'ร', a7['T'] = 'Շ', a7['U'] = 'ย', a7['V'] = 'ש', a7['W'] = 'ฬ', a7['X'] = 'א', a7['Y'] = 'ץ', a7['Z'] = 'չ';
const squiggleCharMap = a7;
var a8 = {};
a8['0'] = '𝟘', a8['1'] = '𝟙', a8['2'] = '𝟚', a8['3'] = '𝟛', a8['4'] = '𝟜', a8['5'] = '𝟝', a8['6'] = '𝟞', a8['7'] = '𝟟', a8['8'] = '𝟠', a8['9'] = '𝟡', a8['a'] = '𝕒', a8['b'] = '𝕓', a8['c'] = '𝕔', a8['d'] = '𝕕', a8['e'] = '𝕖', a8['f'] = '𝕗', a8['g'] = '𝕘', a8['h'] = '𝕙', a8['i'] = '𝕚', a8['j'] = '𝕛', a8['k'] = '𝕜', a8['l'] = '𝕝', a8['m'] = '𝕞', a8['n'] = '𝕟', a8['o'] = '𝕠', a8['p'] = '𝕡', a8['q'] = '𝕢', a8['r'] = '𝕣', a8['s'] = '𝕤', a8['t'] = '𝕥', a8['u'] = '𝕦', a8['v'] = '𝕧', a8['w'] = '𝕨', a8['x'] = '𝕩', a8['y'] = '𝕪', a8['z'] = '𝕫', a8['A'] = '𝔸', a8['B'] = '𝔹', a8['C'] = 'ℂ', a8['D'] = '𝔻', a8['E'] = '𝔼', a8['F'] = '𝔽', a8['G'] = '𝔾', a8['H'] = 'ℍ', a8['I'] = '𝕀', a8['J'] = '𝕁', a8['K'] = '𝕂', a8['L'] = '𝕃', a8['M'] = '𝕄', a8['N'] = 'ℕ', a8['O'] = '𝕆', a8['P'] = 'ℙ', a8['Q'] = 'ℚ', a8['R'] = 'ℝ', a8['S'] = '𝕊', a8['T'] = '𝕋', a8['U'] = '𝕌', a8['V'] = '𝕍', a8['W'] = '𝕎', a8['X'] = '𝕏', a8['Y'] = '𝕐', a8['Z'] = 'ℤ';
const doubleStruckCharMap = a8;
var a9 = {};

function _0x5239() {
    var _0x3d15a1 = ['&#8023;', '&#10125;', '&#40984;', '°°°·.°·..·°¯°·._.·\x20[[text]]\x20·._.·°¯°·.·°\x20.·°°°', '&#120828;&#823;', 'F&#866;', '.result-s3', 'esrever', '&#1040;', '&#40996;', 'squares', 'S&#846;', '-·=»‡«=·-\x20[[text]]\x20-·=»‡«=·-', '🖂︎', 's&#829;&#851;', '(y)', '.stylenamerecentlist\x20.stylename', 'boldCharMapFun', 'match', '&#120831;&#823;', '&#1094;', '&#41433;', 'F&#846;', '[[text]]', 'c&#857;', '&#23610;', '&#41045;', '.squiggle5CharMap', 'toLowerCase', 'location', 'S&#799;', 'D&#826;', 'S&#826;', 'j&#799;', '8&#857;', '.flourish7', 'X&#830;', '&eta;', '&#3619;', '.lunicreepify', 'b&#857;', 'v&#799;', '&#120476;&#823;', 'h&#826;', '&szlig;', '\x20⋆\x20', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20', 'p&#826;', 'P&#846;', 'n&#857;', 'k&#826;', '9&#846;', 'L&#799;', '&#607;', 'maxHeight', '&#10124;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', '&#41037;', 'X&#829;&#851;', '&#654;', 'ready', 'g&#799;', '(\x20ﾟ∀ﾟ)ﾉ【[[text]]】', 'y&#838;', 'i&#826;', '◦•●◉✿\x20[[text]]\x20✿◉●•◦', '9&#829;&#851;', 'removeAllRanges', 'r&#838;', '◠◡◠', '&#4318;', '【$1】', '&#2792;', '💧︎', 'decode', '5&#830;', '.vaporwaveText2', '&#1064;', '&#625;', '&beta;', 'y&#857;', '&#120438;&#823;', '.y2k-font', 'f&#829;&#851;', '&#1202;', '&#120447;&#823;', '5&#866;', 's15', '&#9837;', '&#5741;', '&#10130;', '🕚︎', 'w&#826;', 'g&#826;', '••¤(`×', 's30', '0&#829;&#851;', '&#391;', '7&#828;', '&#120483;&#823;', 'I&#829;&#851;', '`•.,¸¸,.•´¯\x20', '&oplus;', '$2$1', '&#10128;', 'e&#828;', '&#291;', '#textSize', '.cursiveCharMap', '&#41648;', '🖮︎', 's&#799;', '&euro;', '.lunitoolsbubbles', 'O&#799;', 'getSelection', '&#447;', 'u&#866;', 'u&#829;&#851;', 'c&#829;&#851;', '୧(•̀ᗝ•́)૭\x20[[text]]\x20୧(⇀‸↼‶)૭', '.result-s19', 'r&#857;', '&#120441;&#823;', '&#484;', '&#41508;', 'Q&#829;&#851;', '(✿╹◡╹)', 'H&#846;', 'firework', 'w&#830;', '&#1138;', '.result-s27', 'M&#838;', 'trim', 'J&#799;', 'charAt', '(人◕‿◕)', '&#41556;', '<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>', '&#41823;', '&Oslash;', 'creepify', '&#2414;', '&#41804;', 'U&#799;', '&#5290;', '&#120826;&#823;', '&#1111;', '&#4325;', '.flourish5', '12DxRbKA', '&#120479;&#823;', '∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ\x20[[text]]\x20ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙', '&#42015;', 'H&#828;', 'onload', 'F&#826;', 'scroll', 'v&#829;&#851;', '&#41074;', 'squiggle3CharMapFun', '&#40974;', 'l&#857;', '&forall;', '&#42014;', '.asianStyleCharMap', '2&#838;', '&#4306;', 'M&#830;', 'v&#846;', '&#618;', '&#7828;', '🖫︎', 'W&#829;&#851;', '&#41120;', '9&#866;', '&#5205;', '&#42171;', '.diametricAngleFrame', '&#411;', '&thorn;', '.result-s1', '.kirbyHug', 'asianStyleCharMapFun', 's24', 'ᵔᴥᵔ', '8&#838;', '▌│█║▌║▌║\x20[[text]]\x20║▌║▌║█│▌', 'X&#799;', 'l&#830;', '&#1079;', 'upperAnglesCharMapFun', '⁀‿⁀', 'Y&#829;&#851;', '&#5196;', '&#336;', 'x&#846;', '¸¸♬·¯·♩¸¸♪·¯·♫¸¸\x20[[text]]\x20¸¸♫·¯·♪¸¸♩·¯·♬¸¸', '.squaresCharMap', '6&#866;', '&#10081;', '&#639;', '&#41053;', '&#120477;&#823;', 'options', '&#351;', '(^▽^)', '&#653;', 's10', '.cuteText', 'T&#846;', 'R&#828;', 'c&#799;', 'symbolsCharMapFun', '••.•´¯`•.••\x20[[text]]\x20••.•´¯`•.••', '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', '◥꧁ད\x20ॐ卐[[text]]\x20卐ॐ\x20ཌ꧂◤', 'S&#838;', '&#1179;', '&#41863;', '&#387;', 'vaporwaveText', 'p&#829;&#851;', '.lunisquares', 'J&#826;', '&#9815;', 'z&#846;', 'v&#866;', '&#408;', 'L&#857;', 'ᵔ⌣ᵔ', '&#41005;', 'b&#828;', '&#1092;', '🖰︎', 'I&#828;', '✨✩✪✫✬✭✮✯✰✦✱✲✳✴✵✶✷֍֎✸✹✺✻✼✽✾✿❀❁❂❃❄★☆＊', 's23', 'f&#866;', 'w&#866;', '&#4308;', 'S&#857;', '0&#799;', 'p&#838;', '&epsilon;', '&#341;', 'E&#846;', 'c&#846;', '&#5262;', '&#1085;', '📬︎', '&#576;', 'o&#830;', '.wideTextCharMap', 'k&#828;', '</p></div>', 'fromCharCode', '7&#846;', 's25', 'N&#830;', 'B&#846;', 'squiggle6CharMapFun', '&#1044;', '｡*ﾟ.*.｡(っ\x20ᐛ\x20)っ✂╰⋃╯\x20[[text]]', '&#258;', 'm&#846;', '<div\x20class=\x22stylename\x22><span>Recently\x20Used</span><p\x20onclick=\x22copyit(this)\x22\x20data-clipboard-target=\x22.', '&#545;', 'roundsquares', '&#41712;', '&#41532;', '.vaporwaveText1', '&Omega;', 'v&#830;', 'max', '&#272;', '&#490;', 'insertBefore', 'fadeOut', 'W&#799;', '&#323;', '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', 'k&#866;', '0&#826;', 'toString', 'scriptify', 'show', '8&#866;', '&#2797;', '&#1071;', 'I&#830;', '🕗︎', '&#586;', 'U&#866;', 'undefined', 'expires', '&#120440;&#823;', '&#41240;', 'C&#846;', '&#41076;', '&#404;', '&#1360;', 'W&#830;', 'Q&#830;', 'u&#830;', '7&#857;', 'd&#830;', 'kirbyHug', '&#270;', '(っ◔◡◔)っ\x20♥\x20', '.result-s7', 'futureAlienCharMapFun', '🖳︎', '.leftsection\x20.close', 'E&#857;', '¤\x20(¯´☆✭.¸_)¤\x20[[text]]\x20¤(_¸.✭☆´¯)\x20¤', '&#41706;', '7&#866;', 'i&#857;', 'T&#799;', 'randomization', '8jBhwxU', 'L&#828;', '&#1075;', '5&#846;', 'P&#799;', '&#8134;', '&#5229;', 'w&#799;', '3&#829;&#851;', '&#9791;', 'd&#829;&#851;', 'oldEnglishCharMapFun', ',-*\x27\x20^\x20\x27~*-.,_,.-*~\x20[[text]]\x20~*-.,_,.-*~\x27\x20^\x20\x27*-,', '(づ｡◕‿‿◕｡)づ', '&#41157;', '&#41833;', '&#423;', 'A&#846;', '˜”*°•.˜”*°•\x20', 'y&#826;', '&#1488;', '(•◡•)', 'middle', '&#627;', '2&#828;', '&#7990;', 'object', '&#41081;', 'E&#826;', '&#41126;', 'href', '&#1506;', '&#120466;&#823;', '&#42130;', '&#1074;', 's16', '5&#857;', '•]••´º´•»\x20', '&#1028;', '&#7433;', '【｡_｡】\x20[[text]]\x20【｡_｡】', 'map', '&#638;', '0&#846;', 'exports', '&#1283;', 'D&#830;', '&#41426;', '_blank', '&#1076;', 'o&#829;&#851;', 'D&#866;', 'littleSparkles', 'readOnly', '&#422;', '&omega;', 'class', '&kappa;', 'H&#857;', '(✿ヘᴥヘ)', '&#381;', 'a&#866;', 'K&#826;', 'remove', 'j&#828;', '&#3057;', '&alpha;', 'attr', '&#120442;&#823;', '&sigmaf;', 's19', 'addRange', '&#4329;', 'ஜ۩۞۩ஜ\x20[[text]]\x20ஜ۩۞۩ஜ', '๑۞๑,¸¸,ø¤º°`°๑۩\x20', '&Lambda;', 'split', 'neonCharMapFun', '&#1063;', 'K&#830;', 'y&#830;', 'h&#857;', '&#292;', '-漫~*\x27¨¯¨\x27*·舞~\x20[[text]]\x20~舞*\x27¨¯¨\x27*·~漫-', '&#120478;&#823;', '&#41922;', '&#1348;', 'squiggle4CharMapFun', 'nodeType', 'O&#838;', '&#10003;', '&#41660;', 'i&#828;', '&#940;', ']|I{•------»\x20[[text]]\x20«------•}I|[', 'text', 'o&#866;', 'O&#866;', '▌│█║▌║▌║\x20', '&#42181;', '░▒▓█►─═\x20\x20[[text]]\x20═─◄█▓▒░', '&#1140;', 'x&#830;', 'P&#857;', '&#400;', '&fnof;', '•´¯`•.\x20[[text]]\x20.•´¯`•', '134472XrafiM', 'B&#830;', '.crossAboveBelow', '&#596;', '.squiggle4CharMap', '&#120460;&#823;', '169772BnQjog', 'E&#866;', 'pop', '<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22Press\x20CTRL+C\x20to\x20copy\x22\x20/></p>', 'floor', 'r&#826;', '.result-s10', '&#623;', '&#416;', 'P&#830;', '&#41731;', '★·.·´¯`·.·★\x20[[text]]\x20★·.·´¯`·.·★', '&#41079;', '•°¯`••\x20', '.scriptify', 'execCommand', '•´¯`•»\x20', '&#41807;', '&#120432;&#823;', '&#5029;', 'G&#857;', 'animate', 's&#838;', '&#120436;&#823;', '.superscriptCharMap', '&#10122;', '&phi;', '&#41105;', 'w&#829;&#851;', 'R&#826;', '805572NgUyVr', '•?((¯°·._.•\x20[[text]]\x20•._.·°¯))؟•', 'M&#857;', 's26', '.flourish4', 'setSelectionRange', '4&#826;', '&#1210;', '&#1052;', 'z&#799;', 'diacriticsMiddle', '&#1358;', '&#1338;', 'm&#830;', 's&#826;', '&#1048;', '8&#799;', 'dottyJoiner', '&#1359;', '&#4317;', '.•°¤*(¯`★´¯)*¤°\x20', 'W&#846;', '.rand', 'K&#857;', '¸„.-•~¹°”ˆ˜¨\x20', '.result-s21', '\x20\x20🎀\x20\x20', '.result-s22', '&#120434;&#823;', '&#9442;', '&#120449;&#823;', '&#120444;&#823;', 'z&#828;', '&#358;', 'currencyCharMapFun', '&#1049;', '3&#846;', 'a&#799;', '&#41042;', 'html', '👌︎', '&#120446;&#823;', 'n&#826;', 's21', 't&#846;', '0&#830;', 'diacriticsTop', '.squiggleCharMap', '&#120445;&#823;', '&#974;', '&#120482;&#823;', '&#120474;&#823;', 'B&#826;', 'weirdBox', 'b&#826;', '#load-more', 'D&#846;', '🕐︎', '.result-s23', '9&#826;', '&#1291;', 'u&#826;', '&#350;', '3&#838;', '&#120823;&#823;', '&#120475;&#823;', '😐︎', 'top', 'X&#846;', 'o&#857;', '&#315;', '<:::::[]=¤\x20[[text]]\x20(▀̿̿Ĺ̯̿̿▀̿\x20̿)', '&#372;', '6&#828;', '&#4315;', 'selectNodeContents', '&#286;', 'ღ(¯`◕‿◕´¯)\x20♫\x20♪\x20♫\x20[[text]]\x20♫\x20♪\x20♫\x20(¯`◕‿◕´¯)ღ', 'val', 'q&#826;', 'Y&#799;', '&#413;', '.result-s18', 'e&#846;', 'L&#830;', 'M&#826;', '.result-s8', 'createRange', '4&#828;', '.leftsection', '.fullCrazy', 'k&#799;', '&#2798;', 'H&#830;', '&#435;', '&#670;', '(-_-)\x20[[text]]\x20(-_-)', 'l&#866;', '&#1349;', 'M&#829;&#851;', '.flourish1', '▀▄▀▄▀▄\x20[[text]]\x20▄▀▄▀▄▀', '.boldItalicCharMap', 'H&#799;', 'H&#838;', 'crossAboveBelow', 'R&#866;', '&#5623;', '📄︎', '&#1347;', 'w&#838;', 'Q&#857;', '&#340;', '&#8627;', '7&#826;', 'https://montserratfont.one/', 'D&#857;', '.result-s2', 'J&#830;', 'o&#828;', '&#646;', 'h&#828;', 'test', '2&#799;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20[[text]]\x20█\x20▇\x20▆\x20▅\x20▄\x20▂\x20▁', 'v&#826;', '2&#866;', 'html,\x20body', 'Y&#828;', '.greekCharMap', '&#9739;', 'J&#866;', '&#595;', 'g&#846;', '📪︎', 'W&#857;', '.•♫•♬•\x20[[text]]\x20•♬•♫•.', '&#41991;', '&#403;', '】〗〙〛］', 'A&#866;', '.thickBlockFramed', 'G&#829;&#851;', '🕕︎', '&#418;', 'C&#829;&#851;', 'tildeStrikeThrough', '&#276;', 'hasOwnProperty', '&#2670;', '↤↤↤↤↤\x20[[text]]\x20↦↦↦↦↦', '★·.·´¯`·.·★\x20', 'e&#866;', '2&#830;', '&#41141;', '2&#857;', '&#652;', 'width', 'I&#826;', 'tiny', '(¯´•._.•\x20', 'q&#830;', '1719030xpevht', '&#434;', '(ɔ◔‿◔)ɔ', 'M&#866;', 'f&#830;', 'x&#829;&#851;', '&#394;', '(✿◕ᗜ◕)━♫.*･｡ﾟ', '&#548;', '&#356;', '★彡\x20[[text]]\x20彡★', '░▒▓█\x20[[text]]\x20█▓▒░', 'Z&#830;', 'W&#828;', 'N&#838;', '4&#799;', 'C&#799;', '&Mu;', 'round', '.strikeThrough', 'k&#838;', '♪ღ♪*•.¸¸.•*¨¨*•.♪\x20[[text]]\x20♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪', '26682300mEqXbG', 'M&#799;', 'B&#857;', '&#42180;', 'y2kcredit', 'x&#799;', '&#41708;', '&#1180;', '&#669;', 'u&#828;', 'G&#828;', 'q&#866;', '&#120437;&#823;', '🕛︎', '&#1073;', '&#120471;&#823;', '🖲︎', '.squiggle6CharMap', '&#942;', '(✿^▽^)', '&#1065;', 'scrollTop', '&#385;', 'f&#846;', '8&#846;', '&#12425;', '&#1356;', 'S&#866;', '&Xi;', 'X&#828;', '|!¤*\x27~``~\x27*¤!|\x20[[text]]\x20|!¤*\x27~``~\x27*¤!|', 'ღƪ(ˆ◡ˆ)ʃ♡\x20[[text]]\x20♡ƪ(ˆ◡ˆ)ʃ♪', 'fixedtop', '&nu;', '.clear', 'Z&#826;', 'style', '[̲̅$1]', '&#1337;', '3&#799;', '\x22\x20/><span\x20class=\x22copybtn\x22>✔\x20Copied\x20!</span></p>', 'Q&#846;', '&#7918;', '.result-s14', '&Delta;', '&#1090;', 'i&#830;', 'I&#866;', '&#41080;', '&#311;', 'append', 'z&#838;', '.boldCharMap', '×º°”˜`”°º×\x20[[text]]\x20×º°”˜`”°º×', '&#19973;', '6&#799;', 'Q&#826;', 'replace', '&#428;', '🕈︎', 'slashThrough', '4&#830;', '.lunitoolstinyencode', 'V&#830;', 't&#799;', '9&#828;', '(≧◡≦)', 'setAttribute', '&#120452;&#823;', '🗐︎', '9&#838;', 'g&#866;', '&#4327;', '&#5198;', 'h&#846;', '&#313;', '&#8984;', 'L&#826;', 's20', 'z&#830;', '&#1060;', '7&#829;&#851;', '&rho;', '↫↫↫↫↫\x20[[text]]\x20↬↬↬↬↬', '&#941;', '`•.¸¸.•´´¯`••._.•\x20', '&#41686;', 'x&#857;', 'r&#866;', '.doubleStruckCharMap', 's29', 'S&#829;&#851;', '&#120450;&#823;', '🕮︎', 'I&#846;', '.result-s20', '&#2794;', 'monospaceCharMapFun', 'italicCharMapFun', 'j&#857;', '&#41296;', '🌘‿🌘', '2&#829;&#851;', '&#120824;&#823;', '&#5615;', '&#407;', 's12', 's(^‿^)-b', '&#4336;', '•]••´º´•»\x20[[text]]\x20«•´º´••[•', '•._.••´¯``•.¸¸.•`\x20', 'a&#828;', '&#295;', 'squaresCharMapFun', 'A&#829;&#851;', 'F&#829;&#851;', '°·.¸.·°¯°·.¸.·°¯°·.¸.->\x20', '&#1141;', '&#1082;', 'click', '&#1105;', 'b&#846;', '🕭︎', '.vaporwaveText', 'j&#838;', 'v&#857;', '&#1131;', '&#346;', '🕖︎', '&#1340;', 'recentlist', 'selecopyit', 's31', '&psi;', 'Q&#828;', 's27', 'J&#846;', '⚔️\x20[[text]]\x20⚔️', '&#989;', '.monospaceCharMap', '<%=\x20version\x20%>', '&#1051;', 'A&#857;', '&#5616;', 'T&#829;&#851;', 'b&#866;', '&#988;', '&#41674;', 'a&#826;', 'K&#799;', 'x&#838;', '5&#838;', '1&#826;', '.result-s4', '.squiggle3CharMap', '&#42148;', '&#1178;', 'i&#799;', '0&#838;', '&#120456;&#823;', '1&#828;', '&#1377;', 'join', '.result-s30', 'e&#830;', 'bottom', '^ㅂ^', '4&#829;&#851;', '.crazyWithFlourishOrSymbols', 'indexOf', 'E&#830;', '.result-s31', '1&#829;&#851;', '6&#830;', '^ㅅ^', 'charCodeAt', '🕓︎', '🖃︎', '&#120461;&#823;', '&#987;', '<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22', '&#120827;&#823;', 'J&#838;', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', 'squiggle2CharMapFun', 'random', 'z&#866;', 'Z&#828;', 'N&#866;', '&#12579;', 'l&#846;', '.firework', 'wideTextCharMapFun', '••¤(`×[¤\x20[[text]]\x20¤]×´)¤••', 'O&#829;&#851;', '&#41266;', '&#3588;', '•?((¯°·._.•\x20', '(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧', '3&#830;', '&#12581;', '&#9687;', '&#9834;', 'k&#830;', 'encode', '&#972;', 'g&#829;&#851;', '.medievalCharMap', '4&#857;', '&#41555;', 'textSize', '&#41007;', '.neonCharMap', 'E&#828;', '8&#826;', 'd&#846;', 'F&#838;', 'U&#826;', 'target', 'h&#830;', '&#5397;', '&#5597;', 'find', 'X&#857;', '.stylenamelist\x20.stylename', '٩(˘◡˘)۶', 'q&#828;', 'Y&#857;', '.slashThrough', 's22', '#mobile-fly-menu', 'k&#857;', '&#5167;', 'b&#838;', 'T&#826;', 'f&#838;', '『$1』', 'd&#838;', 'F&#799;', '(Y)', '&#2749;', 'm&#826;', 'a&#857;', '.result-s15', 'F&#830;', 'U&#828;', '⫷\x20[[text]]\x20⫸', '&ugrave;', '&#1171;', 'copy', 'p&#857;', '&#120463;&#823;', 'amd', '&#633;', 'Y2k\x20Font', '&#409;', 'input', '&#1041;', '&#4331;', '&#42128;', 'global', 'i&#829;&#851;', 'U&#857;', 'K&#846;', '&#41008;', 'v&#838;', 'B&#838;', '.italicCharMap', '&#996;', 'T&#830;', 'G&#830;', '.wavyJoiner', '`•.,¸¸,.•´¯\x20[[text]]\x20¯`•.,¸¸,.•´', 'h&#866;', '&#392;', '&#420;', 'r&#830;', '&#120465;&#823;', '&#642;', 'H&#829;&#851;', '꧁༒༻☬ད\x20[[text]]\x20ཌ☬༺༒꧂', '&sigma;', '꧁༒☬\x20[[text]]\x20☬༒꧂', '&#41427;', '(/◔◡◔)/', '&#1223;', 'window', '7&#838;', 'A&#830;', '.stylenamelist', 'V&#826;', '9&#830;', '&#1095;', 's&#828;', '(¯`*•.¸,¤°´✿.｡.:*\x20[[text]]\x20*.:｡.✿`°¤,¸.•*´¯)', 'TEXTAREA', '&#613;', '&#1097;', 'd&#799;', 'z&#829;&#851;', 'g&#830;', '&#x', '&#1185;', 's13', 'e&#838;', '&#120459;&#823;', '●‿●', '#y2k-font', '&#1351;', 's&#857;', '&#1331;', 'bubbles', 'u&#799;', '6&#838;', 'o&#826;', '<style>\x20.stylename\x20p{font-size:', '&#41754;', '&chi;', '4&#846;', 'f&#799;', '&#1046;', '&#406;', '&#943;', '\x22\x20class=\x22', '<br>\x0a', '&#5511;', '×º°”˜`”°º×\x20', '&#1008;', '&#1059;', '&#401;', '&Uacute;', 'diacriticsBottom', '5&#829;&#851;', '•._.••´¯``•.¸¸.•`\x20[[text]]\x20`•.¸¸.•´´¯`••._.•', 'O&#846;', '9&#799;', '&#120462;&#823;', 'Y&#866;', '&#614;', '&#9790;', '&iuml;', '🕑︎', '#scroll', '&#120481;&#823;', 'recenttext', '.asianStyle2CharMap', '&#308;', 'c&#866;', '💣︎', 'E&#838;', '&otilde;', '&#3648;', 'K&#838;', 'q&#846;', 'J&#857;', '&#120480;&#823;', '&#294;', '&#327;', 'hide', 'L&#866;', 'B&#829;&#851;', '&#8467;', 'noopener', 'i&#846;', 'U&#846;', 'init', '.copied', '&#41575;', 'N&#829;&#851;', 'subscriptCharMapFun', '6&#857;', '&#41949;', '&#998;', 'w&#846;', '&#1333;', 'R&#857;', 'x&#828;', 'body', '&#41155;', '&#5610;', '&#344;', '4&#866;', '§.•´¨\x27°÷•..×\x20', 'nodeName', '1&#857;', '&#120467;&#823;', 'prepend', '#loader', '••.•´¯`•.••\x20', '«-(¯`v´¯)-«\x20[[text]]\x20»-(¯`v´¯)-»', 'J&#829;&#851;', '¸,ø¤º°`°º¤ø,¸\x20', '&#120455;&#823;', '&#4357;', '&#41571;', '&#41751;', '&#5500;', 'h&#829;&#851;', '.stylenamerecentlist', 's11', '.luniroundsquares', '8&#828;', '&#1352;', ']|I{•------»\x20', 's17', 'boldItalicCharMapFun', '&#9761;', '.result-s13', '273HBFttn', 'z&#857;', 'squiggleCharMapFun', '4&#838;', '229890WVZXUD', '.heartsBetween', '📁︎', '👓︎', 't&#829;&#851;', '✿.｡.:*\x20☆:**:.\x20[[text]]\x20.:**:.☆*.:｡.✿', 's18', '&Gamma;', 'T&#866;', '.futureAlienCharMap', '&#645;', '&#41769;', 'D&#828;', 'S&#828;', '&#985;', '&#355;', '&#1330;', '&#120822;&#823;', 'y&#829;&#851;', '&#1192;', 't&#830;', '&#1213;', 'W&#826;', 'A&#828;', '🗄︎', '&#5556;', '&#382;', 'doubleStruckCharMapFun', 'r&#828;', '&#42131;', '·.¸¸.·♩♪♫\x20[[text]]\x20♫♪♩·.¸¸.·', 'Q&#799;', 'fadeIn', '0&#828;', '&#377;', 'flip', 's14', '(¯`·.¸¸.·´¯`·.¸¸.->\x20[[text]]\x20<-.¸¸.·´¯`·.¸¸.·´¯)', 'r&#799;', 'C&#857;', '🕒︎', 'Y&#846;', '&#1062;', '&#4310;', 'f&#828;', '`•.¸¸.•´´¯`••._.•\x20[[text]]\x20•._.••`¯´´•.¸¸.•`', 'o&#846;', '&#651;', 'y&#866;', '&#120830;&#823;', '¤¸¸.•´¯`•¸¸.•..>>\x20', '&#120451;&#823;', 'y&#799;', 'function', '&#321;', '&#42075;', '👎︎', '1&#830;', '&#20057;', '&#41766;', '◥꧁ད\x20[[text]]\x20ཌ꧂◤', 'O&#826;', 'd&#828;', '&dagger;', 'o&#799;', '&#9736;', 'contentEditable', '&#4330;', '&#65434;', '&#120448;&#823;', '&#262;', '.dottyJoiner', '&#438;', 'D&#829;&#851;', 'a&#830;', '&#10129;', '&#3182;', 'reverse', '.flourish6', '.squiggle2CharMap', '.subscriptCharMap', '.lunitoolsflipencode', '1&#799;', '&#3923;', '&#120433;&#823;', 'arrowBelow', 'h&#838;', 'M&#828;', '&#5609;', 'tools', '.result-s25', '&upsilon;', '6&#829;&#851;', 'Z&#799;', 'r&#846;', 'V&#846;', 'toUpperCase', 'M&#846;', 'V&#799;', 'U&#830;', '&ETH;', '&#1193;', '—(••÷', 'm&#828;', '&#4335;', 'B&#799;', 'q&#799;', '&#41346;', 'L&#838;', 'e&#829;&#851;', 'e&#826;', '.result-s12', '&#1130;', '&#120472;&#823;', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20[[text]]\x20¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', 'B&#866;', 'W&#838;', '&#12552;', '.result-s26', 'j&#846;', 'z&#826;', '—(••÷[\x20[[text]]\x20]÷••)—', '&#120468;&#823;', '&#1397;', 'l&#829;&#851;', 'P&#829;&#851;', '&#1056;', 'push', 'V&#857;', '&#41029;', 'E&#799;', '800901RNqgJH', '&#41392;', 'u&#846;', '(¯´•._.•\x20[[text]]\x20•._.•´¯)', '&#40983;', 'U&#838;', 'G&#799;', 'e&#857;', 'P&#826;', '&#41203;', '&#41204;', 'n&#799;', 'v&#828;', 'l&#799;', '&#477;', '➶➶➶➶➶\x20[[text]]\x20➷➷➷➷➷', '&#541;', '&#41295;', 'medievalCharMapFun', 'createTextRange', '&#2790;', 'i&#866;', '&#374;', '&#2799;', 't&#857;', '&#1344;', 'K&#866;', 'display:\x20inline-block!important;\x20font-size:\x20inherit!important;\x20color:\x20#0088ff!important;\x20visibility:\x20visible!important;z-index:99!important;\x20opacity:\x201!important;', '&#65420;', '&yen;', '&#9773;', 'length', 'N&#857;', '&#429;', '.result-s6', '5&#799;', '&#120443;&#823;', 'V&#838;', '&#41976;', '&#42150;', 'Y&#826;', '.flourish2', 'p&#830;', '&#412;', 'T&#828;', '*´¯`*.¸¸.*´¯`*\x20', '&#9835;', 'Z&#829;&#851;', '&#296;', 'Y&#830;', 'cookie', '(ㅅꈍ﹃ꈍ)*\x20[[text]]\x20*(ꈍ﹃ꈍㅅ)♡', 'queryCommandSupported', '.oldEnglishCharMap', '.result-s11', '&#5845;', 'n&#838;', '&#268;', '.bentTextCharMap', 'O&#857;', '🕙︎', 'j&#830;', '.tildeStrikeThrough', 'G&#846;', '꧁𓊈𒆜\x20[[text]]\x20𒆜𓊉꧂', '&#647;', 'mapInverse', '•°¯`••\x20[[text]]\x20••´¯°•', 'wavyJoiner', 'C&#838;', '&#41246;', 'l&#828;', '&#41733;', '&#120469;&#823;', '.flourish8', 'j&#866;'];
    _0x5239 = function() {
        return _0x3d15a1;
    };
    return _0x5239();
}
a9['0'] = '0', a9['1'] = '1', a9['2'] = '2', a9['3'] = '3', a9['4'] = '4', a9['5'] = '5', a9['6'] = '6', a9['7'] = '7', a9['8'] = '8', a9['9'] = '9', a9['a'] = '𝖆', a9['b'] = '𝖇', a9['c'] = '𝖈', a9['d'] = '𝖉', a9['e'] = '𝖊', a9['f'] = '𝖋', a9['g'] = '𝖌', a9['h'] = '𝖍', a9['i'] = '𝖎', a9['j'] = '𝖏', a9['k'] = '𝖐', a9['l'] = '𝖑', a9['m'] = '𝖒', a9['n'] = '𝖓', a9['o'] = '𝖔', a9['p'] = '𝖕', a9['q'] = '𝖖', a9['r'] = '𝖗', a9['s'] = '𝖘', a9['t'] = '𝖙', a9['u'] = '𝖚', a9['v'] = '𝖛', a9['w'] = '𝖜', a9['x'] = '𝖝', a9['y'] = '𝖞', a9['z'] = '𝖟', a9['A'] = '𝕬', a9['B'] = '𝕭', a9['C'] = '𝕮', a9['D'] = '𝕯', a9['E'] = '𝕰', a9['F'] = '𝕱', a9['G'] = '𝕲', a9['H'] = '𝕳', a9['I'] = '𝕴', a9['J'] = '𝕵', a9['K'] = '𝕶', a9['L'] = '𝕷', a9['M'] = '𝕸', a9['N'] = '𝕹', a9['O'] = '𝕺', a9['P'] = '𝕻', a9['Q'] = '𝕼', a9['R'] = '𝕽', a9['S'] = '𝕾', a9['T'] = '𝕿', a9['U'] = '𝖀', a9['V'] = '𝖁', a9['W'] = '𝖂', a9['X'] = '𝖃', a9['Y'] = '𝖄', a9['Z'] = '𝖅';
const medievalCharMap = a9;
var aa = {};
aa['q'] = '🆀', aa['w'] = '🆆', aa['e'] = '🅴', aa['r'] = '🆁', aa['t'] = '🆃', aa['y'] = '🆈', aa['u'] = '🆄', aa['i'] = '🅸', aa['o'] = '🅾', aa['p'] = '🅿', aa['a'] = '🅰', aa['s'] = '🆂', aa['d'] = '🅳', aa['f'] = '🅵', aa['g'] = '🅶', aa['h'] = '🅷', aa['j'] = '🅹', aa['k'] = '🅺', aa['l'] = '🅻', aa['z'] = '🆉', aa['x'] = '🆇', aa['c'] = '🅲', aa['v'] = '🆅', aa['b'] = '🅱', aa['n'] = '🅽', aa['m'] = '🅼';
const invertedSquaresCharMap = aa;
var ab = {};
ab['0'] = '0', ab['1'] = '1', ab['2'] = '2', ab['3'] = '3', ab['4'] = '4', ab['5'] = '5', ab['6'] = '6', ab['7'] = '7', ab['8'] = '8', ab['9'] = '9', ab['a'] = '𝓪', ab['b'] = '𝓫', ab['c'] = '𝓬', ab['d'] = '𝓭', ab['e'] = '𝓮', ab['f'] = '𝓯', ab['g'] = '𝓰', ab['h'] = '𝓱', ab['i'] = '𝓲', ab['j'] = '𝓳', ab['k'] = '𝓴', ab['l'] = '𝓵', ab['m'] = '𝓶', ab['n'] = '𝓷', ab['o'] = '𝓸', ab['p'] = '𝓹', ab['q'] = '𝓺', ab['r'] = '𝓻', ab['s'] = '𝓼', ab['t'] = '𝓽', ab['u'] = '𝓾', ab['v'] = '𝓿', ab['w'] = '𝔀', ab['x'] = '𝔁', ab['y'] = '𝔂', ab['z'] = '𝔃', ab['A'] = '𝓐', ab['B'] = '𝓑', ab['C'] = '𝓒', ab['D'] = '𝓓', ab['E'] = '𝓔', ab['F'] = '𝓕', ab['G'] = '𝓖', ab['H'] = '𝓗', ab['I'] = '𝓘', ab['J'] = '𝓙', ab['K'] = '𝓚', ab['L'] = '𝓛', ab['M'] = '𝓜', ab['N'] = '𝓝', ab['O'] = '𝓞', ab['P'] = '𝓟', ab['Q'] = '𝓠', ab['R'] = '𝓡', ab['S'] = '𝓢', ab['T'] = '𝓣', ab['U'] = '𝓤', ab['V'] = '𝓥', ab['W'] = '𝓦', ab['X'] = '𝓧', ab['Y'] = '𝓨', ab['Z'] = '𝓩';
const cursiveCharMap = ab;
var ac = {};
ac['a'] = '𝔞', ac['b'] = '𝔟', ac['c'] = '𝔠', ac['d'] = '𝔡', ac['e'] = '𝔢', ac['f'] = '𝔣', ac['g'] = '𝔤', ac['h'] = '𝔥', ac['i'] = '𝔦', ac['j'] = '𝔧', ac['k'] = '𝔨', ac['l'] = '𝔩', ac['m'] = '𝔪', ac['n'] = '𝔫', ac['o'] = '𝔬', ac['p'] = '𝔭', ac['q'] = '𝔮', ac['r'] = '𝔯', ac['s'] = '𝔰', ac['t'] = '𝔱', ac['u'] = '𝔲', ac['v'] = '𝔳', ac['w'] = '𝔴', ac['x'] = '𝔵', ac['y'] = '𝔶', ac['z'] = '𝔷', ac['A'] = '𝔄', ac['B'] = '𝔅', ac['C'] = 'ℭ', ac['D'] = '𝔇', ac['E'] = '𝔈', ac['F'] = '𝔉', ac['G'] = '𝔊', ac['H'] = 'ℌ', ac['I'] = 'ℑ', ac['J'] = '𝔍', ac['K'] = '𝔎', ac['L'] = '𝔏', ac['M'] = '𝔐', ac['N'] = '𝔑', ac['O'] = '𝔒', ac['P'] = '𝔓', ac['Q'] = '𝔔', ac['R'] = 'ℜ', ac['S'] = '𝔖', ac['T'] = '𝔗', ac['U'] = '𝔘', ac['V'] = '𝔙', ac['W'] = '𝔚', ac['X'] = '𝔛', ac['Y'] = '𝔜', ac['Z'] = 'ℨ';
const oldEnglishCharMap = ac;
var ad = {};
ad['`'] = '`', ad['1'] = '１', ad['2'] = '２', ad['3'] = '３', ad['4'] = '４', ad['5'] = '５', ad['6'] = '６', ad['7'] = '７', ad['8'] = '８', ad['9'] = '９', ad['0'] = '０', ad['-'] = '－', ad['='] = '＝', ad['~'] = '~', ad['!'] = '！', ad['@'] = '＠', ad['#'] = '＃', ad['$'] = '＄', ad['%'] = '％', ad['^'] = '^', ad['&'] = '＆', ad['*'] = '＊', ad['('] = '（', ad[')'] = '）', ad['_'] = '_', ad['+'] = '＋', ad['q'] = 'ｑ', ad['w'] = 'ｗ', ad['e'] = 'ｅ', ad['r'] = 'ｒ', ad['t'] = 'ｔ', ad['y'] = 'ｙ', ad['u'] = 'ｕ', ad['i'] = 'ｉ', ad['o'] = 'ｏ', ad['p'] = 'ｐ', ad['['] = '[', ad[']'] = ']', ad['\x5c'] = '\x5c', ad['Q'] = 'Ｑ', ad['W'] = 'Ｗ', ad['E'] = 'Ｅ', ad['R'] = 'Ｒ', ad['T'] = 'Ｔ', ad['Y'] = 'Ｙ', ad['U'] = 'Ｕ', ad['I'] = 'Ｉ', ad['O'] = 'Ｏ', ad['P'] = 'Ｐ', ad['{'] = '{', ad['}'] = '}', ad['|'] = '|', ad['a'] = 'ａ', ad['s'] = 'ｓ', ad['d'] = 'ｄ', ad['f'] = 'ｆ', ad['g'] = 'ｇ', ad['h'] = 'ｈ', ad['j'] = 'ｊ', ad['k'] = 'ｋ', ad['l'] = 'ｌ', ad[';'] = '；', ad['\x27'] = '＇', ad['A'] = 'Ａ', ad['S'] = 'Ｓ', ad['D'] = 'Ｄ', ad['F'] = 'Ｆ', ad['G'] = 'Ｇ', ad['H'] = 'Ｈ', ad['J'] = 'Ｊ', ad['K'] = 'Ｋ', ad['L'] = 'Ｌ', ad[':'] = '：', ad['\x22'] = '\x22', ad['z'] = 'ｚ', ad['x'] = 'ｘ', ad['c'] = 'ｃ', ad['v'] = 'ｖ', ad['b'] = 'ｂ', ad['n'] = 'ｎ', ad['m'] = 'ｍ', ad[','] = '，', ad['.'] = '．', ad['/'] = '／', ad['Z'] = 'Ｚ', ad['X'] = 'Ｘ', ad['C'] = 'Ｃ', ad['V'] = 'Ｖ', ad['B'] = 'Ｂ', ad['N'] = 'Ｎ', ad['M'] = 'Ｍ', ad['<'] = '<', ad['>'] = '>', ad['?'] = '？';
const wideTextCharMap = ad;

function Lunicode() {
    var _0x170bab = _0x30d44f,
        _0x30dfba = {};
    _0x30dfba['a'] = 'ɐ', _0x30dfba['b'] = 'q', _0x30dfba['c'] = 'ɔ', _0x30dfba['d'] = 'p', _0x30dfba['e'] = 'ǝ', _0x30dfba['f'] = 'ɟ', _0x30dfba['g'] = 'ɓ', _0x30dfba['h'] = 'ɥ', _0x30dfba['i'] = 'ı', _0x30dfba['j'] = 'ɾ', _0x30dfba['k'] = 'ʞ', _0x30dfba['l'] = 'l', _0x30dfba['m'] = 'ɯ', _0x30dfba['n'] = 'u', _0x30dfba['r'] = 'ɹ', _0x30dfba['t'] = 'ʇ', _0x30dfba['v'] = 'ʌ', _0x30dfba['w'] = 'ʍ', _0x30dfba['y'] = 'ʎ', _0x30dfba['A'] = '∀', _0x30dfba['B'] = 'ᙠ', _0x30dfba['C'] = 'Ɔ', _0x30dfba['D'] = 'ᗡ', _0x30dfba['E'] = 'Ǝ', _0x30dfba['F'] = 'Ⅎ', _0x30dfba['G'] = '⅁', _0x30dfba['J'] = 'ſ', _0x30dfba['K'] = '⋊', _0x30dfba['L'] = '˥', _0x30dfba['M'] = 'W', _0x30dfba['P'] = 'Ԁ', _0x30dfba['Q'] = 'Ό', _0x30dfba['R'] = 'ᴚ', _0x30dfba['T'] = '⊥', _0x30dfba['U'] = '∩', _0x30dfba['V'] = 'Λ', _0x30dfba['Y'] = '⅄', _0x30dfba['1'] = '⇂', _0x30dfba['2'] = 'ᄅ', _0x30dfba['3'] = 'Ɛ', _0x30dfba['4'] = 'ㄣ', _0x30dfba['5'] = 'ގ', _0x30dfba['6'] = '9', _0x30dfba['7'] = 'ㄥ', _0x30dfba['&'] = '⅋', _0x30dfba['.'] = '˙', _0x30dfba['\x22'] = '„', _0x30dfba[';'] = '؛', _0x30dfba['['] = ']', _0x30dfba['('] = ')', _0x30dfba['{'] = '}', _0x30dfba['?'] = '¿', _0x30dfba['!'] = '¡', _0x30dfba['\x27'] = ',', _0x30dfba['<'] = '>', _0x30dfba['‾'] = '_', _0x30dfba['¯'] = '_', _0x30dfba['‿'] = '⁀', _0x30dfba['⁅'] = '⁆', _0x30dfba['∴'] = '∵', _0x30dfba['\x0d'] = '\x0a', _0x30dfba['ß'] = 'ᙠ', _0x30dfba['̈'] = '̤', _0x30dfba['ä'] = 'ɐ̤', _0x30dfba['ö'] = 'o̤', _0x30dfba['ü'] = 'n̤', _0x30dfba['Ä'] = '∀̤', _0x30dfba['Ö'] = 'O̤', _0x30dfba['Ü'] = '∩̤', _0x30dfba['´'] = '\x20̗', _0x30dfba['é'] = 'ǝ̗', _0x30dfba['á'] = 'ɐ̗', _0x30dfba['ó'] = 'o̗', _0x30dfba['ú'] = 'n̗', _0x30dfba['É'] = 'Ǝ̗', _0x30dfba['Á'] = '∀̗', _0x30dfba['Ó'] = 'O̗', _0x30dfba['Ú'] = '∩̗', _0x30dfba['`'] = '\x20̖', _0x30dfba['è'] = 'ǝ̖', _0x30dfba['à'] = 'ɐ̖', _0x30dfba['ò'] = 'o̖', _0x30dfba['ù'] = 'n̖', _0x30dfba['È'] = 'Ǝ̖', _0x30dfba['À'] = '∀̖', _0x30dfba['Ò'] = 'O̖', _0x30dfba['Ù'] = '∩̖', _0x30dfba['^'] = '\x20̮', _0x30dfba['ê'] = 'ǝ̮', _0x30dfba['â'] = 'ɐ̮', _0x30dfba['ô'] = 'o̮', _0x30dfba['û'] = 'n̮', _0x30dfba['Ê'] = 'Ǝ̮', _0x30dfba['Â'] = '∀̮', _0x30dfba['Ô'] = 'O̮', _0x30dfba['Û'] = '∩̮';
    var _0x36da66 = {};
    _0x36da66[_0x170bab(0x459)] = function() {
        var _0x1c8ea8 = _0x170bab;
        for (i in this[_0x1c8ea8(0x1ce)]) this[_0x1c8ea8(0x1ce)][this[_0x1c8ea8(0x1ce)][i]] = i;
    }, _0x36da66[_0x170bab(0x3b8)] = function(_0x50691e) {
        var _0x25edaf = _0x170bab;
        for (var _0x241573, _0x146633 = [], _0x41a5dc = 0x0, _0x19d042 = _0x50691e[_0x25edaf(0x52a)]; _0x19d042 > _0x41a5dc; _0x41a5dc++) _0x241573 = _0x50691e[_0x25edaf(0x5df)](_0x41a5dc), _0x41a5dc > 0x0 && ('̤' == _0x241573 || '̗' == _0x241573 || '̖' == _0x241573 || '̮' == _0x241573) ? (_0x241573 = this[_0x25edaf(0x1ce)][_0x50691e[_0x25edaf(0x5df)](_0x41a5dc - 0x1) + _0x241573], _0x146633[_0x25edaf(0x218)]()) : (_0x241573 = this[_0x25edaf(0x1ce)][_0x241573], 'undefined' == typeof _0x241573 && (_0x241573 = _0x50691e[_0x25edaf(0x5df)](_0x41a5dc))), _0x146633[_0x25edaf(0x507)](_0x241573);
        return _0x146633['reverse']()['join']('');
    }, _0x36da66['decode'] = function(_0x3f93c1) {
        var _0x25be78 = _0x170bab;
        for (var _0x3230bc, _0x3cd226 = [], _0xea6876 = 0x0, _0x5b6785 = _0x3f93c1[_0x25be78(0x52a)]; _0x5b6785 > _0xea6876; _0xea6876++) _0x3230bc = _0x3f93c1[_0x25be78(0x5df)](_0xea6876), _0xea6876 > 0x0 && ('̤' == _0x3230bc || '̗' == _0x3230bc || '̖' == _0x3230bc || '̮' == _0x3230bc) ? (_0x3230bc = this[_0x25be78(0x1ce)][_0x3f93c1['charAt'](_0xea6876 - 0x1) + _0x3230bc], _0x3cd226['pop']()) : (_0x3230bc = this[_0x25be78(0x1ce)][_0x3230bc], 'undefined' == typeof _0x3230bc && (_0x3230bc = _0x3f93c1[_0x25be78(0x5df)](_0xea6876))), _0x3cd226[_0x25be78(0x507)](_0x3230bc);
        return _0x3cd226[_0x25be78(0x4d5)]()[_0x25be78(0x38e)]('');
    }, _0x36da66[_0x170bab(0x1ce)] = _0x30dfba;
    var _0x169656 = {};
    _0x169656['a'] = 'ɒ', _0x169656['b'] = 'd', _0x169656['c'] = 'ɔ', _0x169656['e'] = 'ɘ', _0x169656['f'] = 'Ꮈ', _0x169656['g'] = 'ǫ', _0x169656['h'] = 'ʜ', _0x169656['j'] = 'ꞁ', _0x169656['k'] = 'ʞ', _0x169656['l'] = '|', _0x169656['n'] = 'ᴎ', _0x169656['p'] = 'q', _0x169656['r'] = 'ɿ', _0x169656['s'] = 'ꙅ', _0x169656['t'] = 'ƚ', _0x169656['y'] = 'ʏ', _0x169656['z'] = 'ƹ', _0x169656['B'] = 'ᙠ', _0x169656['C'] = 'Ɔ', _0x169656['D'] = 'ᗡ', _0x169656['E'] = 'Ǝ', _0x169656['F'] = 'ꟻ', _0x169656['G'] = 'Ꭾ', _0x169656['J'] = 'Ⴑ', _0x169656['K'] = '⋊', _0x169656['L'] = '⅃', _0x169656['N'] = 'Ͷ', _0x169656['P'] = 'ꟼ', _0x169656['Q'] = 'Ọ', _0x169656['R'] = 'Я', _0x169656['S'] = 'Ꙅ', _0x169656['Z'] = 'Ƹ', _0x169656['1'] = '', _0x169656['2'] = '', _0x169656['3'] = '', _0x169656['4'] = '', _0x169656['5'] = '', _0x169656['6'] = '', _0x169656['7'] = '', _0x169656['&'] = '', _0x169656[';'] = '', _0x169656['['] = ']', _0x169656['('] = ')', _0x169656['{'] = '}', _0x169656['?'] = '⸮', _0x169656['<'] = '>', _0x169656['ä'] = 'ɒ̈', _0x169656['ß'] = 'ᙠ', _0x169656['´'] = '`', _0x169656['é'] = 'ɘ̀', _0x169656['á'] = 'ɒ̀', _0x169656['ó'] = 'ò', _0x169656['ú'] = 'ù', _0x169656['É'] = 'Ǝ̀', _0x169656['Á'] = 'À', _0x169656['Ó'] = 'Ò', _0x169656['Ú'] = 'Ù', _0x169656['`'] = '´', _0x169656['è'] = 'ɘ́', _0x169656['à'] = 'ɒ́', _0x169656['È'] = 'Ǝ́', _0x169656['ê'] = 'ɘ̂', _0x169656['â'] = 'ɒ̂', _0x169656['Ê'] = 'Ǝ̂', _0x169656['Ø'] = 'ᴓ', _0x169656['ø'] = 'ᴓ';
    var _0x547f58 = {};
    _0x547f58[_0x170bab(0x459)] = function() {
        var _0x17e36c = _0x170bab;
        for (i in this[_0x17e36c(0x1ce)]) this[_0x17e36c(0x1ce)][this['map'][i]] = i;
    }, _0x547f58[_0x170bab(0x3b8)] = function(_0x3cfa7f) {
        var _0x1be510 = _0x170bab;
        for (var _0x5a3afd, _0x3da683 = [], _0x5bd300 = [], _0x477e12 = 0x0, _0x1d15f7 = _0x3cfa7f[_0x1be510(0x52a)]; _0x1d15f7 > _0x477e12; _0x477e12++) _0x5a3afd = _0x3cfa7f['charAt'](_0x477e12), _0x477e12 > 0x0 && ('̈' == _0x5a3afd || '̀' == _0x5a3afd || '́' == _0x5a3afd || '̂' == _0x5a3afd) ? (_0x5a3afd = this['map'][_0x3cfa7f[_0x1be510(0x5df)](_0x477e12 - 0x1) + _0x5a3afd], _0x3da683[_0x1be510(0x218)]()) : (_0x5a3afd = this[_0x1be510(0x1ce)][_0x5a3afd], _0x1be510(0x18a) == typeof _0x5a3afd && (_0x5a3afd = _0x3cfa7f[_0x1be510(0x5df)](_0x477e12))), '\x0a' == _0x5a3afd ? (_0x5bd300['push'](_0x3da683['reverse']()[_0x1be510(0x38e)]('')), _0x3da683 = []) : _0x3da683[_0x1be510(0x507)](_0x5a3afd);
        return _0x5bd300['push'](_0x3da683[_0x1be510(0x4d5)]()[_0x1be510(0x38e)]('')), _0x5bd300[_0x1be510(0x38e)]('\x0a');
    }, _0x547f58[_0x170bab(0x5a1)] = function(_0x5d9fac) {
        var _0x16cfa9 = _0x170bab;
        for (var _0x132b3d, _0x599a26 = [], _0x2fe296 = [], _0x209b6a = 0x0, _0xcfd36 = _0x5d9fac[_0x16cfa9(0x52a)]; _0xcfd36 > _0x209b6a; _0x209b6a++) _0x132b3d = _0x5d9fac[_0x16cfa9(0x5df)](_0x209b6a), _0x209b6a > 0x0 && ('̈' == _0x132b3d || '̀' == _0x132b3d || '́' == _0x132b3d || '̂' == _0x132b3d) ? (_0x132b3d = this['map'][_0x5d9fac['charAt'](_0x209b6a - 0x1) + _0x132b3d], _0x599a26[_0x16cfa9(0x218)]()) : (_0x132b3d = this[_0x16cfa9(0x1ce)][_0x132b3d], _0x16cfa9(0x18a) == typeof _0x132b3d && (_0x132b3d = _0x5d9fac[_0x16cfa9(0x5df)](_0x209b6a))), '\x0a' == _0x132b3d ? (_0x2fe296[_0x16cfa9(0x507)](_0x599a26[_0x16cfa9(0x4d5)]()[_0x16cfa9(0x38e)]('')), _0x599a26 = []) : _0x599a26[_0x16cfa9(0x507)](_0x132b3d);
        return _0x2fe296['push'](_0x599a26[_0x16cfa9(0x4d5)]()[_0x16cfa9(0x38e)]('')), _0x2fe296['join']('\x0a');
    }, _0x547f58[_0x170bab(0x1ce)] = _0x169656;
    var _0x408406 = {};
    _0x408406['top'] = !0x0, _0x408406[_0x170bab(0x1bb)] = !0x0, _0x408406[_0x170bab(0x391)] = !0x0, _0x408406['maxHeight'] = 0xf, _0x408406[_0x170bab(0x1a4)] = 0x64;
    var _0x5ace66 = {};
    _0x5ace66[_0x170bab(0x459)] = function() {
        var _0x514d17 = _0x170bab;
        for (var _0x1935a0 = 0x300; 0x315 >= _0x1935a0; _0x1935a0++) this[_0x514d17(0x262)][_0x514d17(0x507)](String[_0x514d17(0x164)](_0x1935a0));
        for (var _0x1935a0 = 0x316; 0x333 >= _0x1935a0; _0x1935a0++) 0x31a != _0x1935a0 && 0x31b != _0x1935a0 && this[_0x514d17(0x437)][_0x514d17(0x507)](String[_0x514d17(0x164)](_0x1935a0));
        this[_0x514d17(0x262)]['push'](String[_0x514d17(0x164)](0x31a)), this[_0x514d17(0x262)][_0x514d17(0x507)](String[_0x514d17(0x164)](0x31b));
        for (var _0x1935a0 = 0x334; 0x338 >= _0x1935a0; _0x1935a0++) this['diacriticsMiddle'][_0x514d17(0x507)](String[_0x514d17(0x164)](_0x1935a0));
        for (var _0x1935a0 = 0x339; 0x33c >= _0x1935a0; _0x1935a0++) this['diacriticsBottom'][_0x514d17(0x507)](String[_0x514d17(0x164)](_0x1935a0));
        for (var _0x1935a0 = 0x33d; 0x344 >= _0x1935a0; _0x1935a0++) this[_0x514d17(0x262)]['push'](String[_0x514d17(0x164)](_0x1935a0));
        this['diacriticsTop'][_0x514d17(0x507)](String[_0x514d17(0x164)](0x344)), this[_0x514d17(0x437)][_0x514d17(0x507)](String['fromCharCode'](0x345)), this[_0x514d17(0x262)]['push'](String[_0x514d17(0x164)](0x346)), this[_0x514d17(0x437)][_0x514d17(0x507)](String['fromCharCode'](0x347)), this['diacriticsBottom'][_0x514d17(0x507)](String[_0x514d17(0x164)](0x348)), this[_0x514d17(0x437)][_0x514d17(0x507)](String[_0x514d17(0x164)](0x349)), this[_0x514d17(0x262)][_0x514d17(0x507)](String[_0x514d17(0x164)](0x34a)), this['diacriticsTop'][_0x514d17(0x507)](String[_0x514d17(0x164)](0x34b)), this[_0x514d17(0x262)][_0x514d17(0x507)](String[_0x514d17(0x164)](0x34c)), this[_0x514d17(0x437)][_0x514d17(0x507)](String['fromCharCode'](0x34d)), this[_0x514d17(0x437)][_0x514d17(0x507)](String[_0x514d17(0x164)](0x34e)), this[_0x514d17(0x262)][_0x514d17(0x507)](String['fromCharCode'](0x350)), this[_0x514d17(0x262)][_0x514d17(0x507)](String['fromCharCode'](0x351)), this[_0x514d17(0x262)][_0x514d17(0x507)](String[_0x514d17(0x164)](0x352)), this['diacriticsBottom'][_0x514d17(0x507)](String[_0x514d17(0x164)](0x353)), this[_0x514d17(0x437)]['push'](String['fromCharCode'](0x354)), this[_0x514d17(0x437)][_0x514d17(0x507)](String['fromCharCode'](0x355)), this[_0x514d17(0x437)][_0x514d17(0x507)](String[_0x514d17(0x164)](0x356)), this['diacriticsTop'][_0x514d17(0x507)](String[_0x514d17(0x164)](0x357)), this[_0x514d17(0x262)][_0x514d17(0x507)](String[_0x514d17(0x164)](0x358)), this[_0x514d17(0x437)][_0x514d17(0x507)](String[_0x514d17(0x164)](0x359)), this[_0x514d17(0x437)]['push'](String['fromCharCode'](0x35a)), this[_0x514d17(0x262)][_0x514d17(0x507)](String[_0x514d17(0x164)](0x35b)), this['diacriticsBottom']['push'](String[_0x514d17(0x164)](0x35c)), this['diacriticsTop'][_0x514d17(0x507)](String[_0x514d17(0x164)](0x35d)), this[_0x514d17(0x262)][_0x514d17(0x507)](String['fromCharCode'](0x35d)), this['diacriticsBottom'][_0x514d17(0x507)](String[_0x514d17(0x164)](0x35f)), this['diacriticsTop'][_0x514d17(0x507)](String[_0x514d17(0x164)](0x360)), this['diacriticsTop'][_0x514d17(0x507)](String['fromCharCode'](0x361));
    }, _0x5ace66[_0x170bab(0x3b8)] = function(_0x37ce36) {
        var _0x40de5c = _0x170bab,
            _0x5c9ea5, _0x5b9262 = '';
        for (i in _0x37ce36) {
            if (_0x5c9ea5 = _0x37ce36[i], this[_0x40de5c(0x130)][_0x40de5c(0x1bb)] && (_0x5c9ea5 += this[_0x40de5c(0x23e)][Math[_0x40de5c(0x21a)](Math[_0x40de5c(0x3a5)]() * this[_0x40de5c(0x23e)][_0x40de5c(0x52a)])]), this[_0x40de5c(0x130)][_0x40de5c(0x277)]) {
                for (var _0x3a8424 = this[_0x40de5c(0x262)][_0x40de5c(0x52a)] - 0x1, _0x47a954 = 0x0, _0x4d4a94 = this[_0x40de5c(0x130)][_0x40de5c(0x58d)] - Math['random']() * (this[_0x40de5c(0x130)][_0x40de5c(0x1a4)] / 0x64 * this[_0x40de5c(0x130)][_0x40de5c(0x58d)]); _0x4d4a94 > _0x47a954; _0x47a954++) _0x5c9ea5 += this[_0x40de5c(0x262)][Math[_0x40de5c(0x21a)](Math[_0x40de5c(0x3a5)]() * _0x3a8424)];
            }
            if (this[_0x40de5c(0x130)][_0x40de5c(0x391)]) {
                for (var _0x38bac1 = this[_0x40de5c(0x437)][_0x40de5c(0x52a)] - 0x1, _0x47a954 = 0x0, _0x4d4a94 = this[_0x40de5c(0x130)][_0x40de5c(0x58d)] - Math[_0x40de5c(0x3a5)]() * (this[_0x40de5c(0x130)][_0x40de5c(0x1a4)] / 0x64 * this['options'][_0x40de5c(0x58d)]); _0x4d4a94 > _0x47a954; _0x47a954++) _0x5c9ea5 += this[_0x40de5c(0x437)][Math[_0x40de5c(0x21a)](Math[_0x40de5c(0x3a5)]() * _0x38bac1)];
            }
            _0x5b9262 += _0x5c9ea5;
        }
        return _0x5b9262;
    }, _0x5ace66['decode'] = function(_0x2f4f1b) {
        var _0x26e196 = _0x170bab,
            _0x1bc401, _0x2b6426 = '';
        for (i in _0x2f4f1b) _0x1bc401 = _0x2f4f1b[i][_0x26e196(0x39b)](0x0), (0x300 > _0x1bc401 || _0x1bc401 > 0x361) && (_0x2b6426 += _0x2f4f1b[i]);
        return _0x2b6426;
    }, _0x5ace66[_0x170bab(0x262)] = [], _0x5ace66['diacriticsMiddle'] = [], _0x5ace66[_0x170bab(0x437)] = [], _0x5ace66[_0x170bab(0x130)] = _0x408406;
    var _0x1b9caf = {};
    _0x1b9caf['init'] = function() {
        var _0x421335 = _0x170bab;
        for (var _0x30ff5a = 0x31; 0x39 >= _0x30ff5a; _0x30ff5a++) this[_0x421335(0x1ce)][String[_0x421335(0x164)](_0x30ff5a)] = String[_0x421335(0x164)](_0x30ff5a + 0x242f);
        this[_0x421335(0x1ce)][0x0] = '⓪';
        for (var _0x30ff5a = 0x41; 0x5a >= _0x30ff5a; _0x30ff5a++) this[_0x421335(0x1ce)][String[_0x421335(0x164)](_0x30ff5a)] = String[_0x421335(0x164)](_0x30ff5a + 0x2475);
        for (var _0x30ff5a = 0x61; 0x7a >= _0x30ff5a; _0x30ff5a++) this[_0x421335(0x1ce)][String['fromCharCode'](_0x30ff5a)] = String[_0x421335(0x164)](_0x30ff5a + 0x246f);
        for (_0x30ff5a in this[_0x421335(0x1ce)]) this[_0x421335(0x54d)][this[_0x421335(0x1ce)][_0x30ff5a]] = _0x30ff5a;
    }, _0x1b9caf[_0x170bab(0x3b8)] = function(_0x2862ae) {
        var _0x6bb1b7 = _0x170bab,
            _0x1416fa, _0x4d5bb8 = '',
            _0x203746 = !0x0;
        for (i in _0x2862ae) _0x1416fa = this[_0x6bb1b7(0x1ce)][_0x2862ae[i]], 'undefined' == typeof _0x1416fa && (_0x2862ae[i]['charCodeAt'](0x0) >= 0x21 ? (_0x1416fa = _0x2862ae[i] + String[_0x6bb1b7(0x164)](0x20dd), _0x203746 || (_0x1416fa = String['fromCharCode'](0x202f) + String['fromCharCode'](0xa0) + String[_0x6bb1b7(0x164)](0xa0) + String[_0x6bb1b7(0x164)](0x202f) + _0x1416fa)) : _0x1416fa = _0x2862ae[i]), _0x4d5bb8 += _0x1416fa, _0x203746 = '\x0a' == _0x1416fa;
        return _0x4d5bb8;
    }, _0x1b9caf['decode'] = function(_0x19eaa9) {
        var _0x368dc8 = _0x170bab,
            _0x1e8a35, _0x4edbd8 = '',
            _0x2a21ca = '';
        for (i in _0x19eaa9) _0x1e8a35 = this['mapInverse'][_0x19eaa9[i]], _0x4edbd8 += _0x368dc8(0x18a) == typeof _0x1e8a35 ? _0x19eaa9[i] : _0x1e8a35;
        for (i in _0x4edbd8) _0x1e8a35 = _0x4edbd8[i][_0x368dc8(0x39b)](0x0), 0xa0 != _0x1e8a35 && 0x202f != _0x1e8a35 && 0x20dd != _0x1e8a35 && (_0x2a21ca += _0x4edbd8[i]);
        return _0x2a21ca;
    }, _0x1b9caf[_0x170bab(0x1ce)] = {}, _0x1b9caf['mapInverse'] = {};
    var _0x564b69 = {};
    _0x564b69[_0x170bab(0x459)] = function() {}, _0x564b69[_0x170bab(0x3b8)] = function(_0x45eead) {
        var _0x49cff4 = _0x170bab,
            _0x536b56, _0x46818b = '',
            _0x5db784 = !0x0;
        for (i in _0x45eead) _0x45eead[i][_0x49cff4(0x39b)](0x0) >= 0x21 ? (_0x536b56 = _0x45eead[i] + String[_0x49cff4(0x164)](0x20de), _0x5db784 || (_0x536b56 = String[_0x49cff4(0x164)](0x202f) + String[_0x49cff4(0x164)](0xa0) + String[_0x49cff4(0x164)](0xa0) + String['fromCharCode'](0x202f) + _0x536b56)) : _0x536b56 = _0x45eead[i], _0x46818b += _0x536b56, _0x5db784 = '\x0a' == _0x536b56;
        return _0x46818b;
    }, _0x564b69[_0x170bab(0x5a1)] = function(_0x1a9b90) {
        var _0x132eff, _0x1f6e21 = '';
        for (i in _0x1a9b90) _0x132eff = _0x1a9b90[i]['charCodeAt'](0x0), 0xa0 != _0x132eff && 0x202f != _0x132eff && 0x20de != _0x132eff && (_0x1f6e21 += _0x1a9b90[i]);
        return _0x1f6e21;
    };
    var _0x396a2f = {};
    _0x396a2f['init'] = function() {}, _0x396a2f[_0x170bab(0x3b8)] = function(_0x4cd0e0) {
        var _0x5f14c2 = _0x170bab,
            _0x1824cb, _0x2305cf = '',
            _0x564d12 = !0x0;
        for (i in _0x4cd0e0) _0x4cd0e0[i][_0x5f14c2(0x39b)](0x0) >= 0x21 ? (_0x1824cb = _0x4cd0e0[i] + String[_0x5f14c2(0x164)](0x20e3), _0x564d12 || (_0x1824cb = String[_0x5f14c2(0x164)](0xa0) + String['fromCharCode'](0xa0) + String[_0x5f14c2(0x164)](0xa0) + _0x1824cb)) : _0x1824cb = _0x4cd0e0[i], _0x2305cf += _0x1824cb, _0x564d12 = '\x0a' == _0x1824cb;
        return _0x2305cf;
    }, _0x396a2f[_0x170bab(0x5a1)] = function(_0x346d7b) {
        var _0x33ae0f = _0x170bab,
            _0x567805, _0x44356f = '';
        for (i in _0x346d7b) _0x567805 = _0x346d7b[i][_0x33ae0f(0x39b)](0x0), 0xa0 != _0x567805 && 0x202f != _0x567805 && 0x20e3 != _0x567805 && (_0x44356f += _0x346d7b[i]);
        return _0x44356f;
    };
    var _0x2327af = {};
    _0x2327af['a'] = 'ą', _0x2327af['b'] = 'ҍ', _0x2327af['c'] = 'ç', _0x2327af['d'] = 'ժ', _0x2327af['e'] = 'ҽ', _0x2327af['f'] = 'ƒ', _0x2327af['g'] = 'ց', _0x2327af['h'] = 'հ', _0x2327af['i'] = 'ì', _0x2327af['j'] = 'ʝ', _0x2327af['k'] = 'ҟ', _0x2327af['l'] = 'Ӏ', _0x2327af['m'] = 'ʍ', _0x2327af['n'] = 'ղ', _0x2327af['o'] = 'օ', _0x2327af['p'] = 'ք', _0x2327af['q'] = 'զ', _0x2327af['r'] = 'ɾ', _0x2327af['s'] = 'ʂ', _0x2327af['t'] = 'է', _0x2327af['u'] = 'մ', _0x2327af['v'] = 'ѵ', _0x2327af['w'] = 'ա', _0x2327af['x'] = '×', _0x2327af['y'] = 'վ', _0x2327af['z'] = 'Հ', _0x2327af['A'] = 'Ⱥ', _0x2327af['B'] = 'β', _0x2327af['C'] = '↻', _0x2327af['D'] = 'Ꭰ', _0x2327af['E'] = 'Ɛ', _0x2327af['F'] = 'Ƒ', _0x2327af['G'] = 'Ɠ', _0x2327af['H'] = 'Ƕ', _0x2327af['I'] = 'į', _0x2327af['J'] = 'ل', _0x2327af['K'] = 'Ҡ', _0x2327af['L'] = 'Ꝉ', _0x2327af['M'] = 'Ɱ', _0x2327af['N'] = 'ហ', _0x2327af['O'] = 'ට', _0x2327af['P'] = 'φ', _0x2327af['Q'] = 'Ҩ', _0x2327af['R'] = 'འ', _0x2327af['S'] = 'Ϛ', _0x2327af['T'] = 'Ͳ', _0x2327af['U'] = 'Ա', _0x2327af['V'] = 'Ỽ', _0x2327af['W'] = 'చ', _0x2327af['X'] = 'ჯ', _0x2327af['Y'] = 'Ӌ', _0x2327af['Z'] = 'ɀ', _0x2327af['0'] = '⊘', _0x2327af['1'] = '������', _0x2327af['2'] = 'ϩ', _0x2327af['3'] = 'Ӡ', _0x2327af['4'] = '५', _0x2327af['5'] = 'Ƽ', _0x2327af['6'] = 'Ϭ', _0x2327af['7'] = '7', _0x2327af['8'] = '������', _0x2327af['9'] = '९', _0x2327af['&'] = '⅋', _0x2327af['('] = '{', _0x2327af[')'] = '}', _0x2327af['{'] = '(', _0x2327af['}'] = ')', _0x2327af['ä'] = 'ą̈', _0x2327af['ö'] = 'օ̈', _0x2327af['ü'] = 'մ̈', _0x2327af['Ä'] = 'Ⱥ̈', _0x2327af['Ö'] = 'ට̈', _0x2327af['Ü'] = 'Ա̈', _0x2327af['é'] = 'ҽ́', _0x2327af['á'] = 'ą́', _0x2327af['ó'] = 'օ́', _0x2327af['ú'] = 'մ́', _0x2327af['É'] = 'Ɛ́', _0x2327af['Á'] = 'Ⱥ́', _0x2327af['Ó'] = 'ට́', _0x2327af['Ú'] = 'Ա́', _0x2327af['è'] = 'ҽ̀', _0x2327af['à'] = 'ą̀', _0x2327af['ò'] = 'օ̀', _0x2327af['ù'] = 'մ̀', _0x2327af['È'] = 'Ɛ̀', _0x2327af['À'] = 'Ⱥ̀', _0x2327af['Ò'] = 'ට̀', _0x2327af['Ù'] = 'Ա̀', _0x2327af['ê'] = 'ҽ̂', _0x2327af['â'] = 'ą̂', _0x2327af['ô'] = 'օ̂', _0x2327af['û'] = 'մ̂', _0x2327af['Ê'] = 'Ɛ̂', _0x2327af['Â'] = 'Ⱥ̂', _0x2327af['Ô'] = 'ට̂', _0x2327af['Û'] = 'Ա̂';
    var _0x4b4229 = {};
    _0x4b4229[_0x170bab(0x459)] = function() {
        var _0x116cb1 = _0x170bab;
        for (i in this[_0x116cb1(0x1ce)]) this['map'][this[_0x116cb1(0x1ce)][i]] = i;
    }, _0x4b4229['encode'] = function(_0x1bad1b) {
        var _0x58b8b3 = _0x170bab;
        for (var _0x4510ef, _0x56405b = '', _0x88fbb0 = 0x0, _0x3ec0a8 = _0x1bad1b[_0x58b8b3(0x52a)]; _0x3ec0a8 > _0x88fbb0; _0x88fbb0++) _0x4510ef = this[_0x58b8b3(0x1ce)][_0x1bad1b[_0x58b8b3(0x5df)](_0x88fbb0)], _0x58b8b3(0x18a) == typeof _0x4510ef && (_0x4510ef = _0x1bad1b['charAt'](_0x88fbb0)), _0x56405b += _0x4510ef;
        return _0x56405b;
    }, _0x4b4229[_0x170bab(0x5a1)] = function(_0x147280) {
        var _0x4376f9 = _0x170bab;
        for (var _0x4b651c, _0x2da360 = '', _0x441ae6 = 0x0, _0x3d0a01 = _0x147280[_0x4376f9(0x52a)]; _0x3d0a01 > _0x441ae6; _0x441ae6++) _0x4b651c = this[_0x4376f9(0x1ce)][_0x147280[_0x4376f9(0x5df)](_0x441ae6)], _0x4376f9(0x18a) == typeof _0x4b651c && (_0x4b651c = _0x147280[_0x4376f9(0x5df)](_0x441ae6)), _0x2da360 += _0x4b651c;
        return _0x2da360;
    }, _0x4b4229[_0x170bab(0x1ce)] = _0x2327af;
    var _0x27bd01 = {};
    _0x27bd01['A'] = 'ᴀ', _0x27bd01['B'] = 'ʙ', _0x27bd01['C'] = 'ᴄ', _0x27bd01['D'] = 'ᴅ', _0x27bd01['E'] = 'ᴇ', _0x27bd01['F'] = 'ꜰ', _0x27bd01['G'] = 'ɢ', _0x27bd01['H'] = 'ʜ', _0x27bd01['I'] = 'ɪ', _0x27bd01['J'] = 'ᴊ', _0x27bd01['K'] = 'ᴋ', _0x27bd01['L'] = 'ʟ', _0x27bd01['M'] = 'ᴍ', _0x27bd01['N'] = 'ɴ', _0x27bd01['O'] = 'ᴏ', _0x27bd01['P'] = 'ᴘ', _0x27bd01['Q'] = 'Q', _0x27bd01['R'] = 'ʀ', _0x27bd01['S'] = 'ꜱ', _0x27bd01['T'] = 'ᴛ', _0x27bd01['U'] = 'ᴜ', _0x27bd01['V'] = 'ᴠ', _0x27bd01['W'] = 'ᴡ', _0x27bd01['X'] = 'x', _0x27bd01['Y'] = 'ʏ', _0x27bd01['Z'] = 'ᴢ';
    var _0x10f8a9 = {};
    _0x10f8a9[_0x170bab(0x459)] = function() {
        var _0x498d9c = _0x170bab;
        for (i in this[_0x498d9c(0x1ce)]) this[_0x498d9c(0x1ce)][this[_0x498d9c(0x1ce)][i]] = i;
    }, _0x10f8a9[_0x170bab(0x3b8)] = function(_0x334328) {
        var _0x38e28d = _0x170bab,
            _0x5ce9a1, _0x8a161e = '';
        _0x334328 = _0x334328[_0x38e28d(0x4e8)]();
        for (var _0x1759ad = 0x0, _0x4271d8 = _0x334328[_0x38e28d(0x52a)]; _0x4271d8 > _0x1759ad; _0x1759ad++) _0x5ce9a1 = this['map'][_0x334328[_0x38e28d(0x5df)](_0x1759ad)], _0x38e28d(0x18a) == typeof _0x5ce9a1 && (_0x5ce9a1 = _0x334328[_0x38e28d(0x5df)](_0x1759ad)), _0x8a161e += _0x5ce9a1;
        return _0x8a161e;
    }, _0x10f8a9[_0x170bab(0x5a1)] = function(_0x3ac294) {
        var _0x586348 = _0x170bab;
        for (var _0x28c29e, _0x31d0a2 = '', _0xe74d93 = 0x0, _0x2d5240 = _0x3ac294[_0x586348(0x52a)]; _0x2d5240 > _0xe74d93; _0xe74d93++) _0x28c29e = this[_0x586348(0x1ce)][_0x3ac294[_0x586348(0x5df)](_0xe74d93)], _0x586348(0x18a) == typeof _0x28c29e && (_0x28c29e = _0x3ac294[_0x586348(0x5df)](_0xe74d93)), _0x31d0a2 += _0x28c29e;
        return _0x31d0a2;
    }, _0x10f8a9[_0x170bab(0x1ce)] = _0x27bd01;
    var _0x293c86 = {};
    _0x293c86[_0x170bab(0x4ab)] = _0x36da66, _0x293c86['mirror'] = _0x547f58, _0x293c86['creepify'] = _0x5ace66, _0x293c86[_0x170bab(0x423)] = _0x1b9caf, _0x293c86[_0x170bab(0x561)] = _0x564b69, _0x293c86[_0x170bab(0x170)] = _0x396a2f, _0x293c86['bent'] = _0x4b4229, _0x293c86[_0x170bab(0x2d3)] = _0x10f8a9, this['tools'] = _0x293c86;
    for (i in this[_0x170bab(0x4e1)]) this[_0x170bab(0x4e1)][i][_0x170bab(0x459)]();
    this['getHTML'] = function(_0x218ae2) {
        var _0x3a5c58 = _0x170bab;
        for (var _0xe3928d, _0x5f32f2 = '', _0x123eec = !0x0, _0x5c23f6 = 0x0, _0x35c1b3 = 0x0, _0x1f4110 = 0x0, _0x50fd8e = _0x218ae2['length']; _0x50fd8e > _0x1f4110; _0x1f4110++) _0xe3928d = _0x218ae2['charCodeAt'](_0x1f4110), 0xa == _0xe3928d || 0xd == _0xe3928d ? (_0x5f32f2 += _0x3a5c58(0x430), _0x123eec = !0x0) : 0x20 == _0xe3928d ? _0x123eec ? (_0x5f32f2 += '\x20', _0x123eec = !0x1) : (_0x5f32f2 += '\x20', _0x123eec = !0x0) : (_0xe3928d >= 0xd800 && 0xdbff >= _0xe3928d ? (_0x5c23f6 = _0xe3928d, _0x35c1b3 = 0x0) : _0x5c23f6 > 0x0 ? (_0xe3928d >= 0xdc00 && 0xdfff >= _0xe3928d && (_0x35c1b3 = 0x400 * (_0x5c23f6 - 0xd800) + (_0xe3928d - 0xdc00) + 0x10000), _0x5c23f6 = 0x0) : _0x35c1b3 = _0xe3928d, 0x0 != _0x35c1b3 && (_0x5f32f2 += _0x3a5c58(0x419) + _0x35c1b3[_0x3a5c58(0x180)](0x10) + ';', _0x123eec = !0x0));
        return _0x5f32f2;
    };
}

function cuteText(_0x1e7200) {
    var _0x260eed = _0x30d44f;
    if (_0x1e7200[_0x260eed(0x5dd)]() === '') return '';
    qi = -0x1;
    var _0x331667 = boundingString(Math[_0x260eed(0x21a)](Math[_0x260eed(0x3a5)]() * 0x2) + 0x1);
    return _0x331667 + '\x20\x20🎀\x20\x20' + _0x1e7200[_0x260eed(0x1f1)](/([!?.]+)/gi)[_0x260eed(0x1ce)](cuteSentence)['join']('') + _0x260eed(0x24e) + esrever['reverse'](_0x331667);
}

function cuteSentence(_0x59f498) {
    var _0x5b720a = _0x30d44f;
    return _0x59f498[_0x5b720a(0x1f1)](/([\s,]+)/gi)[_0x5b720a(0x1ce)](cuteWord)[_0x5b720a(0x38e)]('');
}

function cuteWord(_0x8d7bfe) {
    var _0xf1ccf7 = _0x30d44f;
    if (_0x8d7bfe === '' || /[[!?.\s,]+]/gi [_0xf1ccf7(0x2ae)](_0x8d7bfe)) return _0x8d7bfe;
    return _0x8d7bfe = roundReplace(_0x8d7bfe), _0x8d7bfe = punctReplace(_0x8d7bfe), _0x8d7bfe = emojiReplace(_0x8d7bfe), scriptify(_0x8d7bfe);
}
var qi = -0x1,
    qa = ['❝', '❞'];

function quotes() {
    qi++;
    if (qi === 0x2) qi = 0x0;
    return qa[qi];
}

function punctReplace(_0x1b5e46) {
    var _0x248908 = _0x30d44f;
    return _0x1b5e46[_0x248908(0x1f1)]('')['map'](function(_0x3bc923) {
        if (_0x3bc923 === '!') return randomElement(['❣', '❢']);
        else {
            if (_0x3bc923 === '?') return randomElement(['¿', '?']);
            else {
                if (_0x3bc923 === '\x22') return quotes();
                else return _0x3bc923;
            }
        }
    })[_0x248908(0x38e)]('');
}

function emojiReplace(_0x3a495a) {
    var _0x589b62 = _0x30d44f;
    return _0x3a495a[_0x589b62(0x325)](':)', randomElement(emoji[':)']))[_0x589b62(0x325)]('(:', randomElement(emoji[':)']))[_0x589b62(0x325)]('^^', randomElement(emoji['^^']))[_0x589b62(0x325)](':P', randomElement(emoji[':p']))[_0x589b62(0x325)](':p', randomElement(emoji[':p']))[_0x589b62(0x325)](':D', randomElement(emoji[':D']))[_0x589b62(0x325)]('<3', randomElement(emoji['<3']))[_0x589b62(0x325)](_0x589b62(0x566), randomElement(emoji[_0x589b62(0x566)]))['replace'](_0x589b62(0x3db), randomElement(emoji[_0x589b62(0x566)]));
}

function roundReplace(_0x3cf9b5) {
    var _0x130c47 = _0x30d44f;
    return _0x3cf9b5['split']('')[_0x130c47(0x1ce)](function(_0x50576e) {
        var _0x5101ae = _0x130c47;
        return _0x50576e[_0x5101ae(0x573)]() === 'o' || _0x50576e === '0' ? randomElement(round) : _0x50576e;
    })[_0x130c47(0x38e)]('');
}
var ar = {};
ar[':)'] = [_0x30d44f(0x3cd), _0x30d44f(0x1ba), _0x30d44f(0x2d8), '❀◕‿◕❀', '(｡◕‿◕｡)', _0x30d44f(0x41e), '◕‿◕', '😍', 'ツ', _0x30d44f(0x1e0), _0x30d44f(0x351), _0x30d44f(0x1b2), _0x30d44f(0x408), _0x30d44f(0x357), _0x30d44f(0x5e0), _0x30d44f(0x5d6), '◔◡◔'], ar['^^'] = [_0x30d44f(0x132), _0x30d44f(0x2ff), _0x30d44f(0x14a), _0x30d44f(0x11d), _0x30d44f(0x32e), _0x30d44f(0x39a), _0x30d44f(0x392), '(⌒‿⌒)', _0x30d44f(0x59c), _0x30d44f(0x124), ''], ar[':p'] = [':Þ', ''], ar[':D'] = [_0x30d44f(0x3b2), _0x30d44f(0x2dd), 'ᕕ(ᐛ)ᕗ'], ar['<3'] = ['♡', '❤', '♥', '❥', '💘', '💙', '💗', '💖', '💕', '💓', '💞', '💝', '💟'], ar[_0x30d44f(0x566)] = ['👍', '👌'];
var emoji = ar,
    round = ['❁', '🌺', '❀', '💮', '🏵', '🌸', '☯', '😍', '♡', '🍩', '🍬', '💙', '🌞', '💍', '🍪', '❤', '💗', '🍑', '💞'],
    food = ['🍬', '🍭', '🍒', '🍎', '🍉', '🍇', '🍓', '🍌', '🍑', '🍰', '🎂', '🍩', '🍪', '🍧', '🍦', '🍫', '🍡'],
    flowers = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    twinkles = ['⚛', '🌌', '🌠', '*', ':', '｡', '･ﾟ', '✧', '✮', '★', '✩', '⋆', '.', '°', '`', '✴', '｡', '✴', '⋆', '✳', '✶', '✷', '❈'],
    animals = ['🐯', '🐎', '🐖', '🐷', '🐏', '🐑', '🐐', '🐫', '🐘', '🐭', '🐁', '🐀', '🐹', '🐰', '🐇', '🐿', '🐻', '🐨', '🐼', '🐾', '🐔', '🐓', '🐣', '🐤', '🐥', '🐦', '🐧', '🕊', '🐸', '🐢', '🐳', '🐋', '🐬', '🐟', '🐠', '🐡', '🐙', '🐚', '🐌', '🐞'],
    plants = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    misc = ['🌌', '🌠', '🎉', '🎊', '🎈', '💌', '🎎', '🎁', '🎀', '🕯', '🔮', '🛀', '🎖', '🏆', '🏅', '👑', '💍', '👶', '👼', '👸', '👯', '👒', '👻'],
    music = ['♫', '♬', '♪', '♩', '°', '｡', '✧', '🎻', '🎺', '🎸', '🎷', '📯'],
    flourish = [_0x30d44f(0x3b1), 'ıllıllı\x20', _0x30d44f(0x585), '°°°·.°·..·°¯°·._.·\x20', '•´¯`•.\x20', _0x30d44f(0x432), _0x30d44f(0x1ca), _0x30d44f(0x47f), _0x30d44f(0x46a), _0x30d44f(0x223), '(¯`·.¸¸.·´¯`·.¸¸.->\x20', _0x30d44f(0x538), '(¯`·.¸¸.->\x20°º\x20', _0x30d44f(0x360), _0x30d44f(0x35a), _0x30d44f(0x24c), _0x30d44f(0x2d4), _0x30d44f(0x5b5), _0x30d44f(0x226), _0x30d44f(0x5bc), _0x30d44f(0x473), '.o0×X×0o.\x20', ',-*\x27^\x27~*-.,_,.-*~\x20', _0x30d44f(0x341), _0x30d44f(0x4ee), _0x30d44f(0x4ba), _0x30d44f(0x470), _0x30d44f(0x248), _0x30d44f(0x1ef), '-漫~*\x27¨¯¨\x27*·舞~\x20', _0x30d44f(0x2cb), _0x30d44f(0x58f), '▀▄▀▄▀▄\x20', _0x30d44f(0x207)];

function boundingString(_0x3a60ee) {
    return randomElement([foodString, twinkleString, animalString, flourishString])(_0x3a60ee);
}

function foodString(_0x4d4055) {
    var _0x2be073 = _0x30d44f;
    return new Array(_0x4d4055 + 0x1)[_0x2be073(0x38e)]('0')['split']('')[_0x2be073(0x1ce)](function(_0xd6ec9) {
        return randomElement(food);
    })[_0x2be073(0x38e)](_0x2be073(0x584));
}

function twinkleString(_0x315d30) {
    var _0x1972cd = _0x30d44f;
    return new Array(_0x315d30 + 0x1)[_0x1972cd(0x38e)]('0')['split']('')[_0x1972cd(0x1ce)](function() {
        return randomElement(twinkles);
    })[_0x1972cd(0x38e)]('');
}

function animalString(_0x3c2d0e) {
    var _0x5d122e = _0x30d44f;
    return new Array(_0x3c2d0e + 0x1)['join']('0')['split']('')[_0x5d122e(0x1ce)](function(_0x31889e) {
        return randomElement(animals);
    })[_0x5d122e(0x38e)](_0x5d122e(0x584));
}

function flourishString(_0x43cf75) {
    return randomElement(flourish);
}

function scriptify(_0x54b3e0) {
    var _0x507cf5 = _0x30d44f,
        _0x516489 = {};
    _0x516489['0'] = '𝟢', _0x516489['1'] = '𝟣', _0x516489['2'] = '𝟤', _0x516489['3'] = '𝟥', _0x516489['4'] = '𝟦', _0x516489['5'] = '𝟧', _0x516489['6'] = '𝟨', _0x516489['7'] = '𝟩', _0x516489['8'] = '𝟪', _0x516489['9'] = '𝟫', _0x516489['a'] = '𝒶', _0x516489['b'] = '𝒷', _0x516489['c'] = '𝒸', _0x516489['d'] = '𝒹', _0x516489['e'] = '𝑒', _0x516489['f'] = '𝒻', _0x516489['g'] = '𝑔', _0x516489['h'] = '𝒽', _0x516489['i'] = '𝒾', _0x516489['j'] = '𝒿', _0x516489['k'] = '𝓀', _0x516489['l'] = '𝓁', _0x516489['m'] = '𝓂', _0x516489['n'] = '𝓃', _0x516489['o'] = '𝑜', _0x516489['p'] = '𝓅', _0x516489['q'] = '𝓆', _0x516489['r'] = '𝓇', _0x516489['s'] = '𝓈', _0x516489['t'] = '𝓉', _0x516489['u'] = '𝓊', _0x516489['v'] = '𝓋', _0x516489['w'] = '𝓌', _0x516489['x'] = '𝓍', _0x516489['y'] = '𝓎', _0x516489['z'] = '𝓏', _0x516489['A'] = '𝒜', _0x516489['B'] = '𝐵', _0x516489['C'] = '𝒞', _0x516489['D'] = '𝒟', _0x516489['E'] = '𝐸', _0x516489['F'] = '𝐹', _0x516489['G'] = '𝒢', _0x516489['H'] = '𝐻', _0x516489['I'] = '𝐼', _0x516489['J'] = '𝒥', _0x516489['K'] = '𝒦', _0x516489['L'] = '𝐿', _0x516489['M'] = '𝑀', _0x516489['N'] = '𝒩', _0x516489['O'] = '𝒪', _0x516489['P'] = '𝒫', _0x516489['Q'] = '𝒬', _0x516489['R'] = '𝑅', _0x516489['S'] = '𝒮', _0x516489['T'] = '𝒯', _0x516489['U'] = '𝒰', _0x516489['V'] = '𝒱', _0x516489['W'] = '𝒲', _0x516489['X'] = '𝒳', _0x516489['Y'] = '𝒴', _0x516489['Z'] = '𝒵';
    var _0x22205e = _0x516489,
        _0x106576 = _0x54b3e0['split']('');
    for (var _0xf5b811 = 0x0; _0xf5b811 < _0x106576['length']; _0xf5b811++) {
        _0x22205e[_0x106576[_0xf5b811][_0x507cf5(0x573)]()] && (_0x106576[_0xf5b811] = _0x22205e[_0x106576[_0xf5b811]]);
    }
    return _0x54b3e0 = _0x106576[_0x507cf5(0x38e)](''), _0x54b3e0;
}

function shuffleArray(_0x4468b3) {
    var _0x12bf27 = _0x30d44f,
        _0x4ad892 = _0x4468b3[_0x12bf27(0x52a)],
        _0x224613, _0x1c1125;
    while (0x0 !== _0x4ad892) {
        _0x1c1125 = Math['floor'](Math[_0x12bf27(0x3a5)]() * _0x4ad892), _0x4ad892 -= 0x1, _0x224613 = _0x4468b3[_0x4ad892], _0x4468b3[_0x4ad892] = _0x4468b3[_0x1c1125], _0x4468b3[_0x1c1125] = _0x224613;
    }
    return _0x4468b3;
}

function randomElement(_0x727afe) {
    var _0xd4aa9f = _0x30d44f;
    return _0x727afe[Math[_0xd4aa9f(0x21a)](Math[_0xd4aa9f(0x3a5)]() * _0x727afe[_0xd4aa9f(0x52a)])];
}! function(_0x2cedf2) {
    var _0x2fda2a = _0x30d44f,
        _0x3c67a8 = _0x2fda2a(0x1bf) == typeof exports && exports,
        _0x3b6aa6 = _0x2fda2a(0x1bf) == typeof module && module && module[_0x2fda2a(0x1d1)] == _0x3c67a8 && module,
        _0x2c9c13 = _0x2fda2a(0x1bf) == typeof global && global;
    (_0x2c9c13[_0x2fda2a(0x3f0)] === _0x2c9c13 || _0x2c9c13[_0x2fda2a(0x40a)] === _0x2c9c13) && (_0x2cedf2 = _0x2c9c13);
    var _0x10ef1c = /(<%= allExceptCombiningMarks %>)(<%= combiningMarks %>+)/g,
        _0x58c075 = /([\uD800-\uDBFF])([\uDC00-\uDFFF])/g,
        _0x9bed34 = function(_0x28e5b2) {
            var _0x43af11 = _0x2fda2a;
            _0x28e5b2 = _0x28e5b2[_0x43af11(0x325)](_0x10ef1c, function(_0x77633b, _0x4c8b07, _0x33bc47) {
                return _0x9bed34(_0x33bc47) + _0x4c8b07;
            })[_0x43af11(0x325)](_0x58c075, _0x43af11(0x5be));
            for (var _0xd19bed = '', _0x5b679f = _0x28e5b2[_0x43af11(0x52a)]; _0x5b679f--;) _0xd19bed += _0x28e5b2[_0x43af11(0x5df)](_0x5b679f);
            return _0xd19bed;
        },
        _0x30d3e3 = {
            'version': _0x2fda2a(0x378),
            'reverse': _0x9bed34
        };
    if (_0x2fda2a(0x4bd) == typeof define && 'object' == typeof define[_0x2fda2a(0x3e8)] && define[_0x2fda2a(0x3e8)]) define(function() {
        return _0x30d3e3;
    });
    else {
        if (_0x3c67a8 && !_0x3c67a8[_0x2fda2a(0x1fd)]) {
            if (_0x3b6aa6) _0x3b6aa6[_0x2fda2a(0x1d1)] = _0x30d3e3;
            else {
                for (var _0x43e88 in _0x30d3e3) _0x30d3e3[_0x2fda2a(0x2c8)](_0x43e88) && (_0x3c67a8[_0x43e88] = _0x30d3e3[_0x43e88]);
            }
        } else _0x2cedf2[_0x2fda2a(0x55e)] = _0x30d3e3;
    }
}(this);

function fullCrazy(_0x2a9b47) {
    var _0x26acba = _0x30d44f;
    if (_0x2a9b47[_0x26acba(0x5dd)]() === '') return '';
    return randomSymbols(0x2) + '\x20\x20' + crazifyText(_0x2a9b47) + '\x20\x20' + randomSymbols(0x2);
}

function crazifyText(_0x1a8438) {
    var _0x2052dd = _0x30d44f;
    _0x1a8438 = _0x1a8438[_0x2052dd(0x1f1)]('');
    for (var _0x179588 = 0x0; _0x179588 < _0x1a8438[_0x2052dd(0x52a)]; _0x179588++) {
        _0x1a8438[_0x179588] = crazifyCharacter(_0x1a8438[_0x179588]);
    }
    return _0x1a8438[_0x2052dd(0x38e)]('');
}

function crazifyCharacter(_0x48f1c8) {
    var _0x373364 = _0x30d44f;
    _0x48f1c8 = _0x48f1c8[_0x373364(0x573)]();
    var _0x37412e = {};
    _0x37412e['&'] = '⅋', _0x37412e['%'] = ['⅍', '℀', '℁', '℆', '℅'], _0x37412e['0'] = ['０', 'Ѳ', 'ʘ'], _0x37412e['1'] = ['➀', '❶', '１'], _0x37412e['2'] = ['２', '❷', '➁'], _0x37412e['3'] = ['３', '❸', '➂'], _0x37412e['4'] = ['４', '❹', '➃'], _0x37412e['5'] = ['❺', '➄', '５'], _0x37412e['6'] = ['６', '❻', '➅'], _0x37412e['7'] = ['７', '❼', '➆'], _0x37412e['8'] = ['８', '➇', '❽'], _0x37412e['9'] = ['➈', '❾', '９'], _0x37412e['<'] = ['≼', '≺', '≪', '☾', '≾', '⋜', '⋞', '⋐', '⊂', '⊏', '⊑', '《', '＜', '❮', '❰', '⫷'], _0x37412e['>'] = '☽≫≻≽≿⋝⋟⋑⊃⊐⊒⫸》＞❯❱', _0x37412e['['] = '【〖〘〚［', _0x37412e[']'] = _0x373364(0x2bf), _0x37412e['*'] = _0x373364(0x150), _0x37412e['a'] = ['Ⓐ', 'ⓐ', 'α', 'Ａ', 'ａ', 'ᗩ', '卂', 'Δ', 'ค', 'α', 'ά', 'Ã', '𝔞', '𝓪', '𝒶', '𝓐', '𝐀', '𝐚', '𝔸', '𝕒', 'ᵃ'], _0x37412e['b'] = ['Ⓑ', 'ⓑ', 'в', 'Ｂ', '乃', 'ｂ', 'ᗷ', 'β', '๒', 'в', 'в', 'β', '𝔟', '𝓫', '𝒷', '𝓑', '𝐁', '𝐛', '𝔹', '𝕓', 'ᵇ'], _0x37412e['c'] = ['Ⓒ', 'ⓒ', '匚', '¢', 'Ｃ', 'ｃ', 'ᑕ', 'Ć', 'ς', 'c', 'ς', 'Č', '℃', '𝔠', '𝓬', '𝒸', '𝓒', '𝐂', '𝐜', 'ℂ', '𝕔', 'ᶜ'], _0x37412e['d'] = ['Ⓓ', 'ⓓ', '∂', 'Ｄ', 'ｄ', 'ᗪ', 'Đ', '๔', '∂', 'đ', 'Ď', '𝔡', '𝓭', '𝒹', '𝓓', '𝐃', 'ᗪ', '𝐝', '𝔻', '𝕕', 'ᵈ'], _0x37412e['e'] = ['Ⓔ', '乇', 'ⓔ', 'є', 'Ｅ', 'ｅ', 'ᗴ', '€', 'є', 'ε', 'έ', 'Ẹ', '𝔢', '𝒆', '𝑒', '𝓔', '𝐄', '𝐞', '𝔼', '𝕖', 'ᵉ'], _0x37412e['f'] = ['Ⓕ', 'ⓕ', 'ƒ', 'Ｆ', 'ｆ', '千', 'ᖴ', 'ℱ', 'Ŧ', 'ғ', 'ғ', 'Ƒ', '𝔣', '𝒇', '𝒻', '𝓕', '𝐅', '𝐟', '𝔽', '𝕗', 'ᶠ'], _0x37412e['g'] = ['Ⓖ', 'ⓖ', 'ق', 'g', 'Ｇ', 'ｇ', 'Ǥ', 'Ꮆ', 'ﻮ', 'g', 'ģ', 'Ğ', '𝔤', '𝓰', '𝑔', '𝓖', '𝐆', '𝐠', '𝔾', '𝕘', 'ᵍ', 'Ꮆ'], _0x37412e['h'] = ['Ⓗ', '卄', 'ⓗ', 'н', 'Ｈ', 'ｈ', 'ᕼ', 'Ħ', 'ђ', 'н', 'ħ', 'Ĥ', '𝔥', '𝓱', '𝒽', '𝓗', '𝐇', '𝐡', 'ℍ', '𝕙', 'ʰ'], _0x37412e['i'] = ['Ⓘ', 'ⓘ', 'ι', 'Ｉ', 'ｉ', 'Ꭵ', '丨', 'Ɨ', 'เ', 'ι', 'ί', 'Į', '𝔦', '𝓲', '𝒾', '𝓘', '𝐈', '𝐢', '𝕀', '𝕚', 'ᶤ'], _0x37412e['j'] = ['Ⓙ', 'ⓙ', 'נ', 'Ｊ', 'ڶ', 'ｊ', 'ᒎ', 'Ĵ', 'ן', 'נ', 'ј', 'Ĵ', '𝔧', '𝓳', '𝒿', '𝓙', '𝐉', '𝐣', '𝕁', '𝕛', 'ʲ'], _0x37412e['k'] = ['Ⓚ', 'ⓚ', 'к', 'Ｋ', 'ｋ', 'ᛕ', 'Ҝ', 'к', 'к', 'ķ', 'Ќ', '𝔨', '𝓴', '𝓀', '𝓚', '𝐊', '𝐤', '𝕂', '𝕜', 'ᵏ', 'Ҝ'], _0x37412e['l'] = ['Ⓛ', 'ⓛ', 'ℓ', 'ㄥ', 'Ｌ', 'ｌ', 'ᒪ', 'Ł', 'l', 'ℓ', 'Ļ', 'Ĺ', '𝔩', '𝓵', '𝓁', '𝓛', '𝐋', '𝐥', '𝕃', '𝕝', 'ˡ'], _0x37412e['m'] = ['Ⓜ', 'ⓜ', 'м', 'Ｍ', 'ｍ', 'ᗰ', 'Μ', '๓', 'м', 'м', 'ϻ', '𝔪', '𝓶', '𝓂', '𝓜', '𝐌', '𝐦', '𝕄', '𝕞', 'ᵐ', '爪'], _0x37412e['n'] = ['Ⓝ', '几', 'ⓝ', 'η', 'Ｎ', 'ｎ', 'ᑎ', 'Ň', 'ภ', 'η', 'ή', 'Ň', '𝔫', '𝓷', '𝓃', '𝓝', '𝐍', '𝐧', 'ℕ', '𝕟', 'ᶰ'], _0x37412e['o'] = ['Ⓞ', 'ㄖ', 'ⓞ', 'σ', 'Ｏ', 'ｏ', 'ᗝ', 'Ø', '๏', 'σ', 'ό', 'Ỗ', '𝔬', '𝓸', '𝑜', '𝓞', '𝐎', '𝐨', '𝕆', '𝕠', 'ᵒ'], _0x37412e['p'] = ['Ⓟ', 'ⓟ', 'ρ', 'Ｐ', 'ｐ', '卩', 'ᑭ', 'Ƥ', 'ק', 'ρ', 'ρ', 'Ƥ', '𝔭', '𝓹', '𝓅', '𝓟', '𝐏', '𝐩', 'ℙ', '𝕡', 'ᵖ'], _0x37412e['q'] = ['Ⓠ', 'ⓠ', 'q', 'Ｑ', 'ｑ', 'Ɋ', 'Ω', 'ợ', 'q', 'q', 'Ǫ', '𝔮', '𝓺', '𝓆', '𝓠', '𝐐', '𝐪', 'ℚ', '𝕢', 'ᵠ'], _0x37412e['r'] = ['Ⓡ', 'ⓡ', 'я', '尺', 'Ｒ', 'ｒ', 'ᖇ', 'Ř', 'г', 'я', 'ŕ', 'Ř', '𝔯', '𝓻', '𝓇', '𝓡', '𝐑', '𝐫', 'ℝ', '𝕣', 'ʳ'], _0x37412e['s'] = ['Ⓢ', 'ⓢ', 'ѕ', 'Ｓ', '丂', 'ｓ', 'ᔕ', 'Ş', 'ร', 's', 'ş', 'Ŝ', '𝔰', '𝓼', '𝓈', '𝓢', '𝐒', '𝐬', '𝕊', '𝕤', 'ˢ'], _0x37412e['t'] = ['Ⓣ', 'ⓣ', 'т', 'Ｔ', 'ｔ', '丅', 'Ŧ', 't', 'т', 'ţ', 'Ť', '𝔱', '𝓽', '𝓉', '𝓣', '𝐓', '𝐭', '𝕋', '𝕥', 'ᵗ'], _0x37412e['u'] = ['Ⓤ', 'ⓤ', 'υ', 'Ｕ', 'ｕ', 'ᑌ', 'Ữ', 'ย', 'υ', 'ù', 'Ǘ', '𝔲', '𝓾', '𝓊', '𝓤', '𝐔', '𝐮', '𝕌', '𝕦', 'ᵘ'], _0x37412e['v'] = ['Ⓥ', 'ⓥ', 'ν', 'Ｖ', 'ｖ', 'ᐯ', 'V', 'ש', 'v', 'ν', 'Ѷ', '𝔳', '𝓿', '𝓋', '𝓥', '𝐕', '𝐯', '𝕍', '𝕧', 'ᵛ'], _0x37412e['w'] = ['Ⓦ', 'ⓦ', 'ω', 'Ｗ', 'ｗ', 'ᗯ', 'Ŵ', 'ฬ', 'ω', 'ώ', 'Ŵ', '𝔴', '𝔀', '𝓌', '𝓦', '𝐖', '𝐰', '𝕎', '𝕨', 'ʷ', '山'], _0x37412e['x'] = ['Ⓧ', 'ⓧ', 'χ', 'Ｘ', '乂', 'ｘ', '᙭', 'Ж', 'א', 'x', 'x', 'Ж', '𝔵', '𝔁', '𝓍', '𝓧', '𝐗', '𝐱', '𝕏', '𝕩', 'ˣ'], _0x37412e['y'] = ['Ⓨ', 'ㄚ', 'ⓨ', 'у', 'Ｙ', 'ｙ', 'Ƴ', '¥', 'ץ', 'ү', 'ч', 'Ў', '𝔶', '𝔂', '𝓎', '𝓨', '𝐘', '𝐲', '𝕐', '𝕪', 'ʸ'], _0x37412e['z'] = ['Ⓩ', 'ⓩ', 'z', '乙', 'Ｚ', 'ｚ', 'Ƶ', 'Ž', 'z', 'z', 'ž', 'Ż', '𝔷', '𝔃', '𝓏', '𝓩', '𝐙', '𝐳', 'ℤ', '𝕫', 'ᶻ'];
    var _0x186a55 = _0x37412e;
    return _0x186a55[_0x48f1c8] ? randomElement(_0x186a55[_0x48f1c8]) : _0x48f1c8;
}

function randomElement(_0x17c1c8) {
    var _0x5e0c48 = _0x30d44f;
    return _0x17c1c8[Math[_0x5e0c48(0x21a)](Math[_0x5e0c48(0x3a5)]() * _0x17c1c8[_0x5e0c48(0x52a)])];
}

function randomSymbols(_0x8a5e70) {
    var _0x2a117c = ['🐙', '🐉', '🐊', '🐒', '🐝', '🐜', '🐚', '🐲', '🐳', '🐸', '👑', '👹', '👺', '👤', '💲', '💣', '💙', '💚', '💛', '💜', '💝', '💗', '💘', '💞', '💔', '💥', '🐯', '🐼', '🐻', '🐺', '👌', '🐍', '🐧', '🐟', '🐠', '🐨', '🎯', '🏆', '🎁', '🎀', '🎉', '🎈', '🍮', '🍭', '🍬', '🍫', '🍪', '🍧', '🌷', '🍓', '😺', '😾', '✎', '😎', '😝', '😂', '😈', '😡', '😲', '😳', '🍔', '🍟', '🍩', '🎃', '🎄', '🎅', '🐣', '🐤', '👍', '👊', '👻', '👽', '👮', '💎', '💋', '👣', '💀', '💢', '🔥', '♔', '♕', '♖', '♗', '♘', '♙', '♚', '♛', '♜', '♝', '♞', '♟', '♠', '♡', '♢', '♣', '♤', '♥', '♦', '♧', '♨', '♩', '♪', '♬', '★', '☆', '☺', '☹', '☯', '☮', '☢', '☠', '☟', '☞', '☝', '☜', '✌', '✋', '✊', '⛵', 'ൠ', '✌', 'ඏ'],
        _0x4e2340 = [];
    for (var _0x415216 = 0x0; _0x415216 < _0x8a5e70; _0x415216++) _0x4e2340['push'](randomElement(_0x2a117c));
    return _0x4e2340['join']('');
}

function randInt(_0x12ef12, _0x3733b1) {
    var _0xfe7c94 = _0x30d44f;
    return _0x12ef12 + Math[_0xfe7c94(0x21a)](Math[_0xfe7c94(0x3a5)]() * (_0x3733b1 - _0x12ef12 + 0x1));
}
$(document)['ready'](function() {
    var _0x3297dc = _0x30d44f;
    $(_0x3297dc(0x46f))[_0x3297dc(0x452)](), $(window)[_0x3297dc(0x5f5)](function() {
        var _0x441fb7 = _0x3297dc;
        $(this)[_0x441fb7(0x301)]() > 0x64 ? $('#scroll')['fadeIn']() : $('#scroll')[_0x441fb7(0x17a)]();
    }), $(_0x3297dc(0x442))[_0x3297dc(0x363)](function() {
        var _0x57e829 = _0x3297dc,
            _0xf5fd48 = {};
        return _0xf5fd48[_0x57e829(0x301)] = 0x0, $(_0x57e829(0x2b3))[_0x57e829(0x22b)](_0xf5fd48, 0x258), ![];
    });
}), $(document)[_0x30d44f(0x593)](function() {
    var _0x3dd701 = _0x30d44f;
    $('#textSize')['on']('input\x20change', function() {
        var _0x490393 = _0x19a6;
        $(_0x490393(0x427) + $(this)['val']() + 'px}\x20</style>')[_0x490393(0x179)](_0x490393(0x465));
        var _0x53235f = {};
        _0x53235f[_0x490393(0x18b)] = 0x16d, $['cookie'](_0x490393(0x3be), $(this)['val'](), _0x53235f);
    });
    $['cookie'](_0x3dd701(0x36e)) && $('.stylenamerecentlist')[_0x3dd701(0x25b)]($[_0x3dd701(0x53d)](_0x3dd701(0x36e)));
    $(_0x3dd701(0x5a9))['on'](_0x3dd701(0x3ec), function(_0x1b26d3) {
        var _0x1494a0 = _0x3dd701,
            _0x393e1c = $(_0x1494a0(0x41f))[_0x1494a0(0x282)]();
        _0x140abf(_0x393e1c);
        var _0x3cd253 = {};
        _0x3cd253['expires'] = 0x16d, $[_0x1494a0(0x53d)](_0x1494a0(0x444), _0x393e1c, _0x3cd253), $('#share-link')[_0x1494a0(0x25b)](siteurl + encodeURIComponent(_0x393e1c));
    });
    var _0x36d11a = window[_0x3dd701(0x574)][_0x3dd701(0x1c3)],
        _0xeafadb = _0x36d11a['split']('?=');
    urltext = _0xeafadb[0x1];
    if (urltext) {
        urltext = decodeURIComponent(urltext), $(_0x3dd701(0x41f))[_0x3dd701(0x282)](urltext), _0x140abf(urltext);
        var _0x5bcdba = {};
        _0x5bcdba['expires'] = 0x16d, $[_0x3dd701(0x53d)]('recenttext', urltext, _0x5bcdba), $('#share-link')[_0x3dd701(0x25b)](siteurl + encodeURIComponent(urltext));
    }
    $(document)['on'](_0x3dd701(0x363), _0x3dd701(0x3cc), function() {
        var _0xaca166 = _0x3dd701;
        $(_0xaca166(0x47a))[_0xaca166(0x46e)](_0xaca166(0x16e) + $(this)[_0xaca166(0x3ca)]('p')[_0xaca166(0x1e8)](_0xaca166(0x1dd)) + _0xaca166(0x42f) + $(this)['find']('p')[_0xaca166(0x1e8)](_0xaca166(0x1dd)) + '\x22>' + $(this)[_0xaca166(0x3ca)]('p')[_0xaca166(0x204)]() + _0xaca166(0x163));
        $(_0xaca166(0x567))[_0xaca166(0x52a)] > 0x3 && $(_0xaca166(0x567))['last']()['remove']();
        var _0x5d9125 = {};
        _0x5d9125[_0xaca166(0x18b)] = 0x16d, $['cookie']('recentlist', $(_0xaca166(0x47a))[_0xaca166(0x25b)](), _0x5d9125);
    });

    function _0x230961() {
        var _0x52361a = _0x3dd701,
            _0x521614 = $('#y2k-font')[_0x52361a(0x282)]();
        $(_0x52361a(0x298))[_0x52361a(0x25b)](wrapInFlourish(_0x411e9c(_0x521614))), $(_0x52361a(0x534))[_0x52361a(0x25b)](wrapInFlourish(_0x411e9c(_0x521614))), $('.flourish3')[_0x52361a(0x25b)](wrapInFlourish(_0x411e9c(_0x521614))), $(_0x52361a(0x238))[_0x52361a(0x25b)](wrapInFlourish(_0x411e9c(_0x521614))), $(_0x52361a(0x5ed))[_0x52361a(0x25b)](wrapInFlourish(_0x411e9c(_0x521614))), $(_0x52361a(0x4d6))[_0x52361a(0x25b)](wrapInFlourish(_0x411e9c(_0x521614))), $(_0x52361a(0x57a))[_0x52361a(0x25b)](wrapInFlourish(_0x411e9c(_0x521614))), $(_0x52361a(0x555))['html'](wrapInFlourish(_0x411e9c(_0x521614))), $('.flourish9')[_0x52361a(0x25b)](wrapInFlourish(_0x411e9c(_0x521614)));
    }

    function _0x140abf(_0x4b10af) {
        var _0x4a0440 = _0x3dd701;
        _0x4b10af = _0x4b10af['trim'](), $(_0x4a0440(0x119))[_0x4a0440(0x25b)](Change(_0x4b10af, 's1')), $(_0x4a0440(0x2a9))[_0x4a0440(0x25b)](Change(_0x4b10af, 's2')), $(_0x4a0440(0x55d))[_0x4a0440(0x25b)](Change(_0x4b10af, 's3')), $(_0x4a0440(0x385))[_0x4a0440(0x25b)](Change(_0x4b10af, 's4')), $('.result-s5')[_0x4a0440(0x25b)](Change(_0x4b10af, 's5')), $(_0x4a0440(0x52d))['html'](Change(_0x4b10af, 's6')), $(_0x4a0440(0x19a))['html'](Change(_0x4b10af, 's7')), $(_0x4a0440(0x28a))['html'](Change(_0x4b10af, 's8')), $('.result-s9')[_0x4a0440(0x25b)](Change(_0x4b10af, 's9')), $(_0x4a0440(0x21c))[_0x4a0440(0x25b)](Change(_0x4b10af, 's10')), $(_0x4a0440(0x541))['html'](Change(_0x4b10af, _0x4a0440(0x47b))), $(_0x4a0440(0x4f7))[_0x4a0440(0x25b)](Change(_0x4b10af, 's12')), $(_0x4a0440(0x483))[_0x4a0440(0x25b)](Change(_0x4b10af, 's13')), $(_0x4a0440(0x317))[_0x4a0440(0x25b)](Change(_0x4b10af, _0x4a0440(0x4ac))), $(_0x4a0440(0x3df))[_0x4a0440(0x25b)](Change(_0x4b10af, _0x4a0440(0x5ae))), $('.result-s16')['html'](Change(_0x4b10af, _0x4a0440(0x1c8))), $('.result-s17')[_0x4a0440(0x25b)](Change(_0x4b10af, _0x4a0440(0x480))), $(_0x4a0440(0x286))[_0x4a0440(0x25b)](Change(_0x4b10af, _0x4a0440(0x48e))), $(_0x4a0440(0x5d0))['html'](Change(_0x4b10af, _0x4a0440(0x1eb))), $(_0x4a0440(0x34b))[_0x4a0440(0x25b)](Change(_0x4b10af, _0x4a0440(0x33a))), $(_0x4a0440(0x24d))['html'](Change(_0x4b10af, _0x4a0440(0x25f))), $(_0x4a0440(0x24f))[_0x4a0440(0x25b)](Change(_0x4b10af, _0x4a0440(0x3d1))), $(_0x4a0440(0x26e))['html'](Change(_0x4b10af, _0x4a0440(0x151))), $('.result-s24')[_0x4a0440(0x25b)](Change(_0x4b10af, 's24')), $(_0x4a0440(0x4e2))['html'](Change(_0x4b10af, _0x4a0440(0x166))), $(_0x4a0440(0x4fe))[_0x4a0440(0x25b)](Change(_0x4b10af, _0x4a0440(0x237))), $(_0x4a0440(0x5db))[_0x4a0440(0x25b)](Change(_0x4b10af, 's27')), $('.result-s29')[_0x4a0440(0x25b)](Change(_0x4b10af, _0x4a0440(0x346))), $(_0x4a0440(0x38f))[_0x4a0440(0x25b)](Change(_0x4b10af, _0x4a0440(0x5b6))), $(_0x4a0440(0x397))[_0x4a0440(0x25b)](Change(_0x4b10af, _0x4a0440(0x370))), $(_0x4a0440(0x5c8))[_0x4a0440(0x25b)](luni[_0x4a0440(0x4e1)]['bubbles'][_0x4a0440(0x3b8)](_0x4b10af)), $('.invertedSquaresCharMap')[_0x4a0440(0x25b)](applyCharMap(invertedSquaresCharMap, _0x4b10af)), $(_0x4a0440(0x161))[_0x4a0440(0x25b)](applyCharMap(wideTextCharMap, _0x4b10af)), $(_0x4a0440(0x32a))[_0x4a0440(0x25b)](luni[_0x4a0440(0x4e1)][_0x4a0440(0x2d3)][_0x4a0440(0x3b8)](_0x4b10af)), $(_0x4a0440(0x4d9))[_0x4a0440(0x25b)](luni[_0x4a0440(0x4e1)][_0x4a0440(0x4ab)][_0x4a0440(0x3b8)](_0x4b10af)), $(_0x4a0440(0x12a))[_0x4a0440(0x25b)](applyCharMap(squaresCharMap, _0x4b10af)), $('.lunitoolsmirrorencode')['html'](luni[_0x4a0440(0x4e1)]['mirror']['encode'](_0x4b10af)), $(_0x4a0440(0x4d8))['html'](applyCharMap(subscriptCharMap, _0x4b10af)), $(_0x4a0440(0x22e))[_0x4a0440(0x25b)](applyCharMap(superscriptCharMap, _0x4b10af)), $(_0x4a0440(0x545))[_0x4a0440(0x25b)](applyCharMap(bentTextCharMap, _0x4b10af)), $(_0x4a0440(0x3c0))[_0x4a0440(0x25b)](applyCharMap(neonCharMap, _0x4b10af)), $(_0x4a0440(0x491))['html'](applyCharMap(futureAlienCharMap, _0x4b10af)), $(_0x4a0440(0x2e9))[_0x4a0440(0x25b)](strikeThrough(_0x4b10af)), $(_0x4a0440(0x549))[_0x4a0440(0x25b)](tildeStrikeThrough(_0x4b10af)), $(_0x4a0440(0x3d0))[_0x4a0440(0x25b)](slashThrough(_0x4b10af)), $('.underline')[_0x4a0440(0x25b)](underline(_0x4b10af)), $('.doubleUnderline')[_0x4a0440(0x25b)](doubleUnderline(_0x4b10af)), $(_0x4a0440(0x57e))[_0x4a0440(0x25b)](luni[_0x4a0440(0x4e1)][_0x4a0440(0x5e5)][_0x4a0440(0x3b8)](_0x4b10af)), $(_0x4a0440(0x263))[_0x4a0440(0x25b)](applyCharMap(squiggleCharMap, _0x4b10af)), $(_0x4a0440(0x4d7))[_0x4a0440(0x25b)](applyCharMap(squiggle2CharMap, _0x4b10af)), $(_0x4a0440(0x386))[_0x4a0440(0x25b)](applyCharMap(squiggle3CharMap, _0x4b10af)), $(_0x4a0440(0x214))['html'](applyCharMap(squiggle4CharMap, _0x4b10af)), $(_0x4a0440(0x572))[_0x4a0440(0x25b)](applyCharMap(squiggle5CharMap, _0x4b10af)), $(_0x4a0440(0x2fd))[_0x4a0440(0x25b)](applyCharMap(squiggle6CharMap, _0x4b10af)), $(_0x4a0440(0x320))[_0x4a0440(0x25b)](applyCharMap(boldCharMap, _0x4b10af)), $(_0x4a0440(0x47c))['html'](luni[_0x4a0440(0x4e1)][_0x4a0440(0x170)][_0x4a0440(0x3b8)](_0x4b10af)), $(_0x4a0440(0x143))[_0x4a0440(0x25b)](luni[_0x4a0440(0x4e1)]['squares'][_0x4a0440(0x3b8)](_0x4b10af)), $(_0x4a0440(0x540))['html'](applyCharMap(oldEnglishCharMap, _0x4b10af)), $(_0x4a0440(0x3bb))[_0x4a0440(0x25b)](applyCharMap(medievalCharMap, _0x4b10af)), $(_0x4a0440(0x5c3))[_0x4a0440(0x25b)](applyCharMap(cursiveCharMap, _0x4b10af)), $(_0x4a0440(0x224))[_0x4a0440(0x25b)](scriptify(_0x4b10af)), $(_0x4a0440(0x345))[_0x4a0440(0x25b)](applyCharMap(doubleStruckCharMap, _0x4b10af)), $(_0x4a0440(0x3f7))['html'](applyCharMap(italicCharMap, _0x4b10af)), $(_0x4a0440(0x29a))[_0x4a0440(0x25b)](applyCharMap(boldItalicCharMap, _0x4b10af)), $(_0x4a0440(0x377))['html'](applyCharMap(monospaceCharMap, _0x4b10af)), $('.upperAnglesCharMap')[_0x4a0440(0x25b)](applyCharMap(upperAnglesCharMap, _0x4b10af)), $(_0x4a0440(0x2b5))[_0x4a0440(0x25b)](applyCharMap(greekCharMap, _0x4b10af)), $('.symbolsCharMap')[_0x4a0440(0x25b)](applyCharMap(symbolsCharMap, _0x4b10af)), $('.currencyCharMap')[_0x4a0440(0x25b)](applyCharMap(currencyCharMap, _0x4b10af)), $(_0x4a0440(0x109))[_0x4a0440(0x25b)](applyCharMap(asianStyleCharMap, _0x4b10af)), $(_0x4a0440(0x445))[_0x4a0440(0x25b)](applyCharMap(asianStyle2CharMap, _0x4b10af)), $(_0x4a0440(0x2c1))['html'](thickBlockFramed(_0x4b10af)), $(_0x4a0440(0x116))[_0x4a0440(0x25b)](diametricAngleFrame(_0x4b10af)), $(_0x4a0440(0x3fb))['html'](wavyJoiner(_0x4b10af)), $(_0x4a0440(0x4cf))[_0x4a0440(0x25b)](dottyJoiner(_0x4b10af)), $(_0x4a0440(0x11a))[_0x4a0440(0x25b)](kirbyHug(_0x4b10af)), $(_0x4a0440(0x367))[_0x4a0440(0x25b)](vaporwaveText(_0x4b10af)), $(_0x4a0440(0x173))[_0x4a0440(0x25b)](vaporwaveText1(_0x4b10af)), $(_0x4a0440(0x5a3))[_0x4a0440(0x25b)](vaporwaveText2(_0x4b10af)), $('.littleSparkles')[_0x4a0440(0x25b)](littleSparkles(_0x4b10af)), $('.weirdBox')[_0x4a0440(0x25b)](weirdBox(_0x4b10af)), $(_0x4a0440(0x3ab))[_0x4a0440(0x25b)](firework(_0x4b10af)), $('.stinky')['html'](stinky(_0x4b10af)), $(_0x4a0440(0x489))[_0x4a0440(0x25b)](heartsBetween(_0x4b10af)), $('.arrowBelow')['html'](arrowBelow(_0x4b10af)), $(_0x4a0440(0x212))[_0x4a0440(0x25b)](crossAboveBelow(_0x4b10af)), $('.wingdings')[_0x4a0440(0x25b)](wingdings(_0x4b10af)), $(_0x4a0440(0x28e))[_0x4a0440(0x25b)](fullCrazy(_0x4b10af)), $(_0x4a0440(0x394))[_0x4a0440(0x25b)](crazyWithFlourishOrSymbols(_0x4b10af)), $(_0x4a0440(0x135))[_0x4a0440(0x25b)](cuteText(_0x4b10af)), _0x230961(), $(_0x4a0440(0x24a))['remove']();
    };
    $('#random')[_0x3dd701(0x363)](function() {
        var _0x7230af = _0x3dd701;
        $('#loader')['fadeIn'](), _0x230961(), $(_0x7230af(0x46f))[_0x7230af(0x17a)]();
    });

    function _0xec36() {
        var _0x296606 = _0x3dd701;
        return fontgenArray[Math[_0x296606(0x21a)](Math['random']() * fontgenArray[_0x296606(0x52a)])];
    }

    function _0x401807(_0x2da5f9) {
        var _0x203abb = _0xec36();
        return eval(_0x203abb + '(\x22' + _0x2da5f9 + '\x22)');
    }

    function _0x296650() {
        var _0xf7f508 = _0x3dd701;
        return fontgenArrayMap[Math[_0xf7f508(0x21a)](Math[_0xf7f508(0x3a5)]() * fontgenArrayMap[_0xf7f508(0x52a)])];
    }

    function _0x411e9c(_0x3b2a95) {
        var _0x2f5816 = _0x296650();
        return _0x3b2a95 = _0x3b2a95['trim'](), eval(_0x2f5816 + '(\x22' + _0x3b2a95 + '\x22)');
    }
    $(_0x3dd701(0x26b))[_0x3dd701(0x363)](function() {
        var _0xee32aa = _0x3dd701;
        $(_0xee32aa(0x46f))[_0xee32aa(0x4a8)]();
        var _0x54f5b8 = $(_0xee32aa(0x41f))[_0xee32aa(0x282)]();
        $(_0xee32aa(0x40d))['append'](_0xee32aa(0x5e2) + fullCrazy(_0x54f5b8) + _0xee32aa(0x163)), $('.stylenamelist')[_0xee32aa(0x31e)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + crazyWithFlourishOrSymbols(_0x54f5b8) + _0xee32aa(0x163)), $(_0xee32aa(0x40d))[_0xee32aa(0x31e)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x401807(_0x54f5b8)) + _0xee32aa(0x163)), $(_0xee32aa(0x40d))['append'](_0xee32aa(0x5e2) + cuteText(_0x54f5b8) + _0xee32aa(0x163)), $(_0xee32aa(0x40d))[_0xee32aa(0x31e)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x401807(_0x54f5b8)) + _0xee32aa(0x163)), $(_0xee32aa(0x40d))[_0xee32aa(0x31e)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x401807(_0x54f5b8)) + '</p></div>'), $(_0xee32aa(0x40d))[_0xee32aa(0x31e)](_0xee32aa(0x5e2) + wrapInFlourish(_0x411e9c(_0x54f5b8)) + _0xee32aa(0x163)), $(_0xee32aa(0x40d))[_0xee32aa(0x31e)](_0xee32aa(0x5e2) + wrapInFlourish(_0x411e9c(_0x54f5b8)) + '</p></div>'), $(_0xee32aa(0x40d))[_0xee32aa(0x31e)](_0xee32aa(0x5e2) + wrapInFlourish(_0x411e9c(_0x54f5b8)) + _0xee32aa(0x163)), $('#loader')[_0xee32aa(0x17a)]();
    }), $[_0x3dd701(0x53d)](_0x3dd701(0x3be)) && ($(_0x3dd701(0x427) + $['cookie']('textSize') + 'px}\x20</style>')['insertBefore']('body'), $(_0x3dd701(0x5c2))[_0x3dd701(0x282)]($['cookie'](_0x3dd701(0x3be)))), $(_0x3dd701(0x30e))[_0x3dd701(0x363)](function() {
        var _0xd85be1 = _0x3dd701;
        $(_0xd85be1(0x41f))[_0xd85be1(0x282)]('');
        var _0x378232 = {};
        _0x378232['expires'] = 0x16d, $[_0xd85be1(0x53d)]('recenttext', '', _0x378232);
    });
}), $(document)['ready'](function() {
    setInterval(function() {
        var _0x19a5a5 = _0x19a6;
        !$('#y2kcredit:visible')[_0x19a5a5(0x52a)] && (window[_0x19a5a5(0x574)]['href'] = _0x19a5a5(0x2a7));
    }, 0x186a0);
}), window[_0x30d44f(0x5f3)] = function() {
    var _0x1cd9c5 = _0x30d44f,
        _0x2d4d69 = document['getElementById'](_0x1cd9c5(0x2f0));
    _0x2d4d69['setAttribute']('href', _0x1cd9c5(0x2a7)), _0x2d4d69['setAttribute']('rel', _0x1cd9c5(0x456)), _0x2d4d69['setAttribute'](_0x1cd9c5(0x3c6), _0x1cd9c5(0x1d5)), _0x2d4d69[_0x1cd9c5(0x32f)]('title', _0x1cd9c5(0x3ea)), _0x2d4d69[_0x1cd9c5(0x32f)](_0x1cd9c5(0x310), _0x1cd9c5(0x526)), _0x2d4d69['innerHTML'] = _0x1cd9c5(0x3ea);
};

function copyit(_0x48fc7a) {
    var _0x1d9a40 = _0x30d44f;
    if (document[_0x1d9a40(0x465)]['createTextRange']) {
        var _0x349700 = document[_0x1d9a40(0x465)][_0x1d9a40(0x51e)]();
        _0x349700['moveToElementText'](_0x48fc7a), _0x349700[_0x1d9a40(0x36f)](), _0x349700['execCommand']('Copy');
    } else {
        if (window['getSelection'] && document[_0x1d9a40(0x28b)]) {
            var _0x1669a3 = _0x48fc7a['contentEditable'],
                _0x4c5f61 = _0x48fc7a[_0x1d9a40(0x1da)];
            _0x48fc7a[_0x1d9a40(0x4ca)] = !![], _0x48fc7a['readOnly'] = !![];
            var _0x2c8926 = document[_0x1d9a40(0x28b)]();
            _0x2c8926[_0x1d9a40(0x27f)](_0x48fc7a);
            var _0x19b1d8 = window[_0x1d9a40(0x5ca)]();
            _0x19b1d8[_0x1d9a40(0x59a)](), _0x19b1d8[_0x1d9a40(0x1ec)](_0x2c8926);
            if (_0x48fc7a[_0x1d9a40(0x46b)] == _0x1d9a40(0x413) || _0x48fc7a[_0x1d9a40(0x46b)] == 'INPUT') _0x48fc7a[_0x1d9a40(0x36f)]();
            if (_0x48fc7a[_0x1d9a40(0x239)]) _0x48fc7a[_0x1d9a40(0x239)](0x0, 0xf423f);
            _0x48fc7a[_0x1d9a40(0x4ca)] = _0x1669a3, _0x48fc7a[_0x1d9a40(0x1da)] = _0x4c5f61;
            if (document[_0x1d9a40(0x53f)](_0x1d9a40(0x3e5))) {
                var _0x333b76 = document[_0x1d9a40(0x225)](_0x1d9a40(0x3e5));
                if (_0x333b76) $(_0x1d9a40(0x465))['append'](_0x1d9a40(0x3a0) + $(_0x48fc7a)['text']() + _0x1d9a40(0x314)), setTimeout(function() {
                    var _0x3115 = _0x1d9a40;
                    $(_0x3115(0x45a))['remove']();
                }, 0x3e8);
                else $(_0x1d9a40(0x465))[_0x1d9a40(0x31e)](_0x1d9a40(0x219)), setTimeout(function() {
                    var _0x1e799b = _0x1d9a40;
                    $('.copied')[_0x1e799b(0x1e4)]();
                }, 0x3e8);
            } else {
                if (!navigator['userAgent'][_0x1d9a40(0x569)](/ipad|ipod|iphone|android|silk/i)) $('body')[_0x1d9a40(0x31e)]('<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22Press\x20CTRL+C\x20to\x20copy\x22\x20/></p>'), setTimeout(function() {
                    var _0x1dfe81 = _0x1d9a40;
                    $('.copied')[_0x1dfe81(0x1e4)]();
                }, 0x3e8);
            }
        }
    }
}
$(window)[_0x30d44f(0x2d1)]() > 0x3c0 && $(window)[_0x30d44f(0x5f5)](function() {
    var _0x66fafd = _0x30d44f,
        _0x550840 = $(window)[_0x66fafd(0x301)]();
    _0x550840 >= 0x64 ? $(_0x66fafd(0x5a9))['addClass'](_0x66fafd(0x30c)) : $(_0x66fafd(0x5a9))['removeClass'](_0x66fafd(0x30c));
});
$(_0x30d44f(0x3d2))[_0x30d44f(0x363)](function() {
    var _0x2a9bdf = _0x30d44f;
    $(_0x2a9bdf(0x28d))[_0x2a9bdf(0x182)](0x64);
}), $(_0x30d44f(0x19d))[_0x30d44f(0x363)](function() {
    var _0x3c3ea2 = _0x30d44f;
    $(_0x3c3ea2(0x28d))['hide'](0x64);
});
