var _0x4ca65f = _0x33b8;
(function(_0x33df72, _0xa896e1) {
    var _0x48fb9c = _0x33b8,
        _0x196c05 = _0x33df72();
    while (!![]) {
        try {
            var _0x39a3c5 = -parseInt(_0x48fb9c(0x1b7)) / 0x1 + -parseInt(_0x48fb9c(0x2ff)) / 0x2 + -parseInt(_0x48fb9c(0x157)) / 0x3 * (parseInt(_0x48fb9c(0x34a)) / 0x4) + parseInt(_0x48fb9c(0x4ba)) / 0x5 * (parseInt(_0x48fb9c(0x4a2)) / 0x6) + -parseInt(_0x48fb9c(0x1c7)) / 0x7 + parseInt(_0x48fb9c(0x4f7)) / 0x8 + parseInt(_0x48fb9c(0xcc)) / 0x9;
            if (_0x39a3c5 === _0xa896e1) break;
            else _0x196c05['push'](_0x196c05['shift']());
        } catch (_0x1cd0a9) {
            _0x196c05['push'](_0x196c05['shift']());
        }
    }
}(_0xc7c4, 0x67fa3));
var normal = _0x4ca65f(0x403);
const fontgenArray = [_0x4ca65f(0x4c3), _0x4ca65f(0x3c1), _0x4ca65f(0x392), 'diametricAngleFrame', _0x4ca65f(0x57a), _0x4ca65f(0x447), 'kirbyHug', _0x4ca65f(0x440), 'wavyJoiner', _0x4ca65f(0x31b), _0x4ca65f(0x248), 'crossAboveBelow', _0x4ca65f(0x3e1), _0x4ca65f(0x2ec), 'underline', _0x4ca65f(0x58f), _0x4ca65f(0x149), _0x4ca65f(0x33b)],
    fontgenArrayMap = [_0x4ca65f(0x578), _0x4ca65f(0x3ca), _0x4ca65f(0x320), 'subscriptCharMapFun', _0x4ca65f(0x3ff), _0x4ca65f(0x40b), _0x4ca65f(0x44e), _0x4ca65f(0x1e1), _0x4ca65f(0x572), 'squiggle3CharMapFun', 'squiggle4CharMapFun', _0x4ca65f(0x277), _0x4ca65f(0x1a7), _0x4ca65f(0x171), 'oldEnglishCharMapFun', _0x4ca65f(0xf2), _0x4ca65f(0x2f5), _0x4ca65f(0x52c), _0x4ca65f(0xbe), _0x4ca65f(0x432), _0x4ca65f(0x4ff), _0x4ca65f(0xcf), 'greekCharMapFun', 'symbolsCharMapFun', _0x4ca65f(0x56a), _0x4ca65f(0x388), _0x4ca65f(0x204)];

function applyCharMap(_0x368474, _0x259cb8) {
    var _0x30dc31 = _0x4ca65f;
    let _0x4ac3a3 = '';
    for (let _0x556943 of _0x259cb8[_0x30dc31(0x500)]('')) {
        if (_0x368474[_0x556943] !== undefined) _0x4ac3a3 += _0x368474[_0x556943];
        else {
            if (_0x368474[_0x556943[_0x30dc31(0x515)]()] !== undefined) _0x4ac3a3 += _0x368474[_0x556943[_0x30dc31(0x515)]()];
            else _0x4ac3a3 += _0x556943;
        }
    }
    return _0x4ac3a3;
}

function invertedSquaresCharMapFun(_0x16903b) {
    return applyCharMap(invertedSquaresCharMap, _0x16903b);
}

function wideTextCharMapFun(_0x4a933d) {
    return applyCharMap(wideTextCharMap, _0x4a933d);
}

function squaresCharMapFun(_0xb9de77) {
    return applyCharMap(squaresCharMap, _0xb9de77);
}

function subscriptCharMapFun(_0x13f68f) {
    return applyCharMap(subscriptCharMap, _0x13f68f);
}

function bentTextCharMapFun(_0x281eee) {
    return applyCharMap(bentTextCharMap, _0x281eee);
}

function neonCharMapFun(_0x2d4fbb) {
    return applyCharMap(neonCharMap, _0x2d4fbb);
}

function futureAlienCharMapFun(_0x4cce6c) {
    return applyCharMap(futureAlienCharMap, _0x4cce6c);
}

function squiggleCharMapFun(_0x570585) {
    return applyCharMap(squiggleCharMap, _0x570585);
}

function squiggle2CharMapFun(_0x3a8ad0) {
    return applyCharMap(squiggle2CharMap, _0x3a8ad0);
}

function squiggle3CharMapFun(_0x417f49) {
    return applyCharMap(squiggle3CharMap, _0x417f49);
}

function squiggle4CharMapFun(_0x247c08) {
    return applyCharMap(squiggle4CharMap, _0x247c08);
}

function squiggle5CharMapFun(_0x2eb2d8) {
    return applyCharMap(squiggle5CharMap, _0x2eb2d8);
}

function squiggle6CharMapFun(_0x4d2f82) {
    return applyCharMap(squiggle6CharMap, _0x4d2f82);
}

function boldCharMapFun(_0x4b2729) {
    return applyCharMap(boldCharMap, _0x4b2729);
}

function oldEnglishCharMapFun(_0x5a2cd9) {
    return applyCharMap(oldEnglishCharMap, _0x5a2cd9);
}

function medievalCharMapFun(_0x292aea) {
    return applyCharMap(medievalCharMap, _0x292aea);
}

function cursiveCharMapFun(_0x556ed1) {
    return applyCharMap(cursiveCharMap, _0x556ed1);
}

function doubleStruckCharMapFun(_0x43da6c) {
    return applyCharMap(doubleStruckCharMap, _0x43da6c);
}

function italicCharMapFun(_0x364019) {
    return applyCharMap(italicCharMap, _0x364019);
}

function boldItalicCharMapFun(_0xf5103c) {
    return applyCharMap(boldItalicCharMap, _0xf5103c);
}

function monospaceCharMapFun(_0x385eff) {
    return applyCharMap(monospaceCharMap, _0x385eff);
}

function upperAnglesCharMapFun(_0x1ac49a) {
    return applyCharMap(upperAnglesCharMap, _0x1ac49a);
}

function greekCharMapFun(_0x558902) {
    return applyCharMap(greekCharMap, _0x558902);
}

function symbolsCharMapFun(_0x106e78) {
    return applyCharMap(symbolsCharMap, _0x106e78);
}

function currencyCharMapFun(_0x58ac09) {
    return applyCharMap(currencyCharMap, _0x58ac09);
}

function asianStyleCharMapFun(_0xa2daf6) {
    return applyCharMap(asianStyleCharMap, _0xa2daf6);
}

function asianStyle2CharMapFun(_0x24dc8b) {
    return applyCharMap(asianStyle2CharMap, _0x24dc8b);
}
var luni = new Lunicode();
luni['tools'][_0x4ca65f(0x199)]['options'][_0x4ca65f(0x54b)] = 0xa;

function crazyWithFlourishOrSymbols(_0x518649) {
    var _0x2e0019 = _0x4ca65f;
    if (Math[_0x2e0019(0x4f1)]() < 0.7) return wrapInSymbols(crazifyText(_0x518649), 0x2);
    else return wrapInFlourish(crazifyText(_0x518649), 0x2);
}

function strikeThrough(_0x9be9d1) {
    var _0x42568f = _0x4ca65f;
    return _0x9be9d1[_0x42568f(0x500)]('')[_0x42568f(0x55c)]('̶') + '̶';
}

function tildeStrikeThrough(_0xef5ecf) {
    var _0x377abe = _0x4ca65f;
    return _0xef5ecf[_0x377abe(0x500)]('')[_0x377abe(0x55c)]('̴') + '̴';
}

function underline(_0x427134) {
    var _0x5beb20 = _0x4ca65f;
    return _0x427134[_0x5beb20(0x500)]('')[_0x5beb20(0x55c)]('̲') + '̲';
}

function doubleUnderline(_0x3c122c) {
    var _0x2b7f4c = _0x4ca65f;
    return _0x3c122c[_0x2b7f4c(0x500)]('')['join']('̳') + '̳';
}

function slashThrough(_0x18ba4b) {
    var _0x5d4e43 = _0x4ca65f;
    return _0x18ba4b[_0x5d4e43(0x500)]('')[_0x5d4e43(0x55c)]('̷') + '̷';
}

function stinky(_0x5337dc) {
    var _0xb55830 = _0x4ca65f;
    return _0x5337dc[_0xb55830(0x500)]('')['join']('̾') + '̾';
}

function heartsBetween(_0x1465f0) {
    return _0x1465f0['split']('')['join']('♥');
}

function arrowBelow(_0x5ca633) {
    var _0x302b88 = _0x4ca65f;
    return _0x5ca633[_0x302b88(0x500)]('')[_0x302b88(0x55c)]('͎') + '͎';
}

function crossAboveBelow(_0x3c47fb) {
    var _0x2c1750 = _0x4ca65f;
    return _0x3c47fb['split']('')[_0x2c1750(0x55c)]('͓̽') + '͓̽';
}
var f = {};
f['0'] = _0x4ca65f(0x1c4), f['1'] = _0x4ca65f(0x20c), f['2'] = _0x4ca65f(0x48b), f['3'] = _0x4ca65f(0xfb), f['4'] = _0x4ca65f(0xb6), f['5'] = '🗄︎', f['6'] = '⌛︎', f['7'] = _0x4ca65f(0x55a), f['8'] = _0x4ca65f(0x120), f['9'] = _0x4ca65f(0x17e), f['!'] = '✏︎', f['\x22'] = '✂︎', f['#'] = '✁︎', f['$'] = _0x4ca65f(0x534), f['%'] = _0x4ca65f(0x128), f['&'] = _0x4ca65f(0x446), f['\x27'] = _0x4ca65f(0x4a8), f['('] = '🕿︎', f[')'] = '✆︎', f['*'] = _0x4ca65f(0x3ba), f['+'] = _0x4ca65f(0x11f), f[','] = '📪︎', f['-'] = _0x4ca65f(0x1d7), f['.'] = _0x4ca65f(0x557), f['/'] = '📭︎', f[':'] = _0x4ca65f(0x241), f[';'] = _0x4ca65f(0x1d8), f['<'] = _0x4ca65f(0xd8), f['='] = _0x4ca65f(0x155), f['>'] = '✇︎', f['?'] = '✍︎', f['A'] = '✌︎', f['B'] = _0x4ca65f(0x327), f['C'] = _0x4ca65f(0x3a6), f['D'] = _0x4ca65f(0x3bf), f['E'] = '☜︎', f['F'] = '☞︎', f['G'] = '☝︎', f['H'] = '☟︎', f['I'] = '✋︎', f['J'] = '☺︎', f['K'] = _0x4ca65f(0x329), f['L'] = '☹︎', f['M'] = _0x4ca65f(0x4b2), f['N'] = '☠︎', f['O'] = '⚐︎', f['P'] = _0x4ca65f(0x41a), f['Q'] = '✈︎', f['R'] = '☼︎', f['S'] = _0x4ca65f(0x596), f['T'] = '❄︎', f['U'] = _0x4ca65f(0xfc), f['V'] = '✞︎', f['W'] = _0x4ca65f(0x35d), f['X'] = '✠︎', f['Y'] = '✡︎', f['Z'] = '☪︎', f['['] = '☯︎', f['\x5c'] = 'ॐ︎', f[']'] = '☸︎', f['^'] = '♈︎', f['_'] = '♉︎', f['`'] = '♊︎', f['a'] = '♋︎', f['b'] = '♌︎', f['c'] = '♍︎', f['d'] = '♎︎', f['e'] = '♏︎', f['f'] = '♐︎', f['g'] = '♑︎', f['h'] = '♒︎', f['i'] = '♓︎', f['j'] = '🙰', f['k'] = '🙵', f['l'] = '●︎', f['m'] = '❍︎', f['n'] = '■︎', f['o'] = '□︎', f['p'] = '◻︎', f['q'] = '❑︎', f['r'] = '❒︎', f['s'] = '⬧︎', f['t'] = '⧫︎', f['u'] = '◆︎', f['v'] = '❖︎', f['w'] = '⬥︎', f['x'] = '⌧︎', f['y'] = '⍓︎', f['z'] = '⌘︎', f['{'] = '❀︎', f['|'] = '✿︎', f['}'] = '❝︎', f['~'] = '❞︎', f['\x20'] = '▯︎', f['€'] = '⓪︎', f['\x20'] = '①︎', f['‚'] = '②︎', f['ƒ'] = '③︎', f['„'] = '④︎', f['…'] = '⑤︎', f['†'] = '⑥︎', f['‡'] = '⑦︎', f['ˆ'] = '⑧︎', f['‰'] = '⑨︎', f['Š'] = '⑩︎', f['‹'] = '⓿︎', f['Œ'] = '❶︎', f['\x20'] = '❷︎', f['Ž'] = '❸︎', f['\x20'] = '❹︎', f['\x20'] = '❺︎', f['‘'] = '❻︎', f['’'] = '❼︎', f['“'] = '❽︎', f['”'] = '❾︎', f['•'] = '❿︎', f['–'] = '◻︎', f['—'] = '◻︎', f['˜'] = '◻︎', f['™'] = '◻︎', f['š'] = '◻︎', f['›'] = '◻︎', f['œ'] = '◻︎', f['\x20'] = '◻︎', f['ž'] = '·︎', f['Ÿ'] = '•︎', f['¡'] = '○︎', f['¢'] = '⭕︎', f['£'] = '◻︎', f['¤'] = '◉︎', f['¥'] = '◎︎', f['¦'] = '◻︎', f['§'] = '▪︎', f['¨'] = '◻︎', f['©'] = '◻︎', f['ª'] = '✦︎', f['«'] = '★︎', f['¬'] = '✶︎', f['®'] = '✹︎', f['¯'] = '✵︎', f['°'] = '◻︎', f['±'] = '⌖︎', f['²'] = '⟡︎', f['³'] = '⌑︎', f['´'] = '◻︎', f['µ'] = '✪︎', f['¶'] = '✰︎', f['·'] = _0x4ca65f(0x504), f['¸'] = _0x4ca65f(0x2d4), f['¹'] = _0x4ca65f(0x322), f['º'] = _0x4ca65f(0x2e7), f['»'] = _0x4ca65f(0x1d0), f['¼'] = '🕕︎', f['½'] = '🕖︎', f['¾'] = _0x4ca65f(0x269), f['¿'] = _0x4ca65f(0x2f0), f['À'] = '🕙︎', f['Á'] = _0x4ca65f(0x2a9), f['Â'] = _0x4ca65f(0x4ab), f['Ã'] = '◻︎', f['Ä'] = '◻︎', f['Å'] = '◻︎', f['Æ'] = '◻︎', f['Ç'] = '◻︎', f['È'] = '◻︎', f['É'] = '◻︎', f['Ê'] = '◻︎', f['Ë'] = '◻︎', f['Ì'] = '◻︎', f['Í'] = '◻︎', f['Î'] = '◻︎', f['Ï'] = '◻︎', f['Ð'] = '◻︎', f['Ñ'] = '◻︎', f['Ò'] = '◻︎', f['Ó'] = '◻︎', f['Ô'] = '◻︎', f['Õ'] = '⌫︎', f['Ö'] = '⌦︎', f['×'] = '◻︎', f['Ø'] = '➢︎', f['Ù'] = '◻︎', f['Ú'] = '◻︎', f['Û'] = '◻︎', f['Ü'] = '➲︎', f['Ý'] = '◻︎', f['Þ'] = '◻︎', f['ß'] = '◻︎', f['à'] = '◻︎', f['á'] = '◻︎', f['â'] = '◻︎', f['ã'] = '◻︎', f['ä'] = '◻︎', f['å'] = '◻︎', f['æ'] = '◻︎', f['ç'] = '◻︎', f['è'] = '➔︎', f['é'] = '◻︎', f['ê'] = '◻︎', f['ë'] = '◻︎', f['ì'] = '◻︎', f['í'] = '◻︎', f['î'] = '◻︎', f['ï'] = '⇦︎', f['ð'] = '⇨︎', f['ñ'] = '⇧︎', f['ò'] = '⇩︎', f['ó'] = '⬄︎', f['ô'] = '⇳︎', f['õ'] = '⬀︎', f['ö'] = '⬁︎', f['÷'] = '⬃︎', f['ø'] = '⬂︎', f['ù'] = '▭︎', f['ú'] = '▫︎', f['û'] = '✗︎', f['ü'] = '✓︎', f['ý'] = '☒︎', f['þ'] = '☑︎', f['ÿ'] = '◻︎';
const wingdingsCharMap = f;

function wingdings(_0x559664) {
    var _0xcc55f9 = _0x4ca65f;
    return _0x559664[_0xcc55f9(0x500)]('')[_0xcc55f9(0x303)](function(_0x28db78) {
        return wingdingsCharMap[_0x28db78] ? wingdingsCharMap[_0x28db78] : _0x28db78;
    })[_0xcc55f9(0x55c)]('');
}
var g = {};
g['\x20'] = '\u3000', g['`'] = '`', g['1'] = '１', g['2'] = '２', g['3'] = '３', g['4'] = '４', g['5'] = '５', g['6'] = '６', g['7'] = '７', g['8'] = '８', g['9'] = '９', g['0'] = '０', g['-'] = '－', g['='] = '＝', g['~'] = '~', g['!'] = '！', g['@'] = '＠', g['#'] = '＃', g['$'] = '＄', g['%'] = '％', g['^'] = '^', g['&'] = '＆', g['*'] = '＊', g['('] = '（', g[')'] = '）', g['_'] = '_', g['+'] = '＋', g['q'] = 'ｑ', g['w'] = 'ｗ', g['e'] = 'ｅ', g['r'] = 'ｒ', g['t'] = 'ｔ', g['y'] = 'ｙ', g['u'] = 'ｕ', g['i'] = 'ｉ', g['o'] = 'ｏ', g['p'] = 'ｐ', g['['] = '[', g[']'] = ']', g['\x5c'] = '\x5c', g['Q'] = 'Ｑ', g['W'] = 'Ｗ', g['E'] = 'Ｅ', g['R'] = 'Ｒ', g['T'] = 'Ｔ', g['Y'] = 'Ｙ', g['U'] = 'Ｕ', g['I'] = 'Ｉ', g['O'] = 'Ｏ', g['P'] = 'Ｐ', g['{'] = '{', g['}'] = '}', g['|'] = '|', g['a'] = 'ａ', g['s'] = 'ｓ', g['d'] = 'ｄ', g['f'] = 'ｆ', g['g'] = 'ｇ', g['h'] = 'ｈ', g['j'] = 'ｊ', g['k'] = 'ｋ', g['l'] = 'ｌ', g[';'] = '；', g['\x27'] = '＇', g['A'] = 'Ａ', g['S'] = 'Ｓ', g['D'] = 'Ｄ', g['F'] = 'Ｆ', g['G'] = 'Ｇ', g['H'] = 'Ｈ', g['J'] = 'Ｊ', g['K'] = 'Ｋ', g['L'] = 'Ｌ', g[':'] = '：', g['\x22'] = '\x22', g['z'] = 'ｚ', g['x'] = 'ｘ', g['c'] = 'ｃ', g['v'] = 'ｖ', g['b'] = 'ｂ', g['n'] = 'ｎ', g['m'] = 'ｍ', g[','] = '，', g['.'] = '．', g['/'] = '／', g['Z'] = 'Ｚ', g['X'] = 'Ｘ', g['C'] = 'Ｃ', g['V'] = 'Ｖ', g['B'] = 'Ｂ', g['N'] = 'Ｎ', g['M'] = 'Ｍ', g['<'] = '<', g['>'] = '>', g['?'] = '？';
const vaporwaveCharMap = g;

function vaporwaveText(_0x45cdd7) {
    var _0x56ce26 = _0x4ca65f,
        _0x555747 = _0x45cdd7[_0x56ce26(0x500)]('\x20')['length'];
    _0x45cdd7 = applyCharMap(vaporwaveCharMap, _0x45cdd7);
    var _0x221f0d = getAsianChars(Math[_0x56ce26(0x312)](0x3, _0x555747));
    if (_0x555747 > 0x6) _0x221f0d = _0x221f0d[_0x56ce26(0x500)]('')['map'](_0xbeabc1 => _0xbeabc1 + ['', ''][Math[_0x56ce26(0x1bc)](Math[_0x56ce26(0x4f1)]() * 0.6)])[_0x56ce26(0x55c)]('');
    var _0x8da584 = [];
    return _0x8da584['push'](_0x45cdd7), _0x8da584[_0x56ce26(0x55c)]();
}

function vaporwaveText1(_0x4b2f9a) {
    var _0x528cf8 = _0x4ca65f,
        _0x2e903d = _0x4b2f9a[_0x528cf8(0x500)]('\x20')['length'];
    _0x4b2f9a = applyCharMap(vaporwaveCharMap, _0x4b2f9a);
    var _0x23e4c5 = getAsianChars(Math['max'](0x3, _0x2e903d));
    if (_0x2e903d > 0x6) _0x23e4c5 = _0x23e4c5[_0x528cf8(0x500)]('')[_0x528cf8(0x303)](_0x48098d => _0x48098d + ['', ''][Math['round'](Math[_0x528cf8(0x4f1)]() * 0.6)])['join']('');
    var _0x77e596 = [];
    return _0x77e596['push'](_0x4b2f9a['replace'](/　/g, '░')['replace'](/ａｅ/, 'æ')[_0x528cf8(0x582)](/Ａ/g, 'Λ')[_0x528cf8(0x582)](/Ｅ/g, function() {
        var _0x31769 = _0x528cf8;
        return Math[_0x31769(0x4f1)]() > 0.5 ? 'Ξ' : 'Σ';
    })[_0x528cf8(0x582)](/Ｏ/g, '♢')), _0x77e596[_0x528cf8(0x55c)]();
}

function vaporwaveText2(_0x5d2155) {
    var _0x45ec65 = _0x4ca65f,
        _0x3ce3cc = _0x5d2155[_0x45ec65(0x500)]('\x20')[_0x45ec65(0x4ce)];
    _0x5d2155 = applyCharMap(vaporwaveCharMap, _0x5d2155);
    var _0x581c22 = getAsianChars(Math[_0x45ec65(0x312)](0x3, _0x3ce3cc));
    if (_0x3ce3cc > 0x6) _0x581c22 = _0x581c22['split']('')[_0x45ec65(0x303)](_0x146482 => _0x146482 + ['', ''][Math[_0x45ec65(0x1bc)](Math[_0x45ec65(0x4f1)]() * 0.6)])[_0x45ec65(0x55c)]('');
    var _0x4873bd = [];
    return _0x4873bd[_0x45ec65(0x477)]('【\ufeff' + _0x5d2155 + '】'), _0x4873bd[_0x45ec65(0x55c)]();
}

function getAsianChars(_0x411936) {
    var _0x1bef6c = _0x4ca65f;
    if (!_0x411936) _0x411936 = 0x1;
    var _0x2d6410 = _0x1bef6c(0x3fc),
        _0x12060c = '';
    for (var _0x12f783 = 0x0; _0x12f783 < _0x411936; _0x12f783++) {
        _0x12060c += _0x2d6410[Math[_0x1bef6c(0x1c8)](Math[_0x1bef6c(0x4f1)]() * _0x2d6410[_0x1bef6c(0x4ce)])];
    }
    return _0x12060c;
}
const flourishArray = [_0x4ca65f(0x238), _0x4ca65f(0xc2), _0x4ca65f(0xc3), _0x4ca65f(0x53e), '꧁༒༻☬ད\x20[[text]]\x20ཌ☬༺༒꧂', _0x4ca65f(0x1ac), _0x4ca65f(0x273), _0x4ca65f(0x3e6), 'ღƪ(ˆ◡ˆ)ʃ♡\x20[[text]]\x20♡ƪ(ˆ◡ˆ)ʃ♪', _0x4ca65f(0x2a6), _0x4ca65f(0x266), '<:::::[]=¤\x20[[text]]\x20(▀̿̿Ĺ̯̿̿▀̿\x20̿)', '｡*ﾟ.*.｡(っ\x20ᐛ\x20)っ✂╰⋃╯\x20[[text]]', _0x4ca65f(0x518), '(ㅅꈍ﹃ꈍ)*\x20[[text]]\x20*(ꈍ﹃ꈍㅅ)♡', _0x4ca65f(0x33e), _0x4ca65f(0xec), _0x4ca65f(0x2b7), _0x4ca65f(0x18b), _0x4ca65f(0x3d6), _0x4ca65f(0x123), '•?((¯°·._.•\x20[[text]]\x20•._.·°¯))؟•', _0x4ca65f(0xff), _0x4ca65f(0x1a2), _0x4ca65f(0x107), _0x4ca65f(0x1ad), _0x4ca65f(0x33a), _0x4ca65f(0x347), '(¯´•._.•\x20[[text]]\x20•._.•´¯)', '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', _0x4ca65f(0x34c), _0x4ca65f(0x1d5), _0x4ca65f(0x169), _0x4ca65f(0x514), '§.•´¨\x27°÷•..×\x20[[text]]\x20×,.•´¨\x27°÷•..§', _0x4ca65f(0x20f), _0x4ca65f(0x4e1), _0x4ca65f(0x579), _0x4ca65f(0x200), _0x4ca65f(0x3a3), '(¯´•._.•\x20[[text]]\x20•._.•´¯)', _0x4ca65f(0x4e5), '•´¯`•»\x20[[text]]\x20«•´¯`•', _0x4ca65f(0xba), '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', _0x4ca65f(0x588), '¸,ø¤º°`°º¤ø,¸\x20[[text]]\x20¸,ø¤º°`°º¤ø,¸', _0x4ca65f(0x16e), _0x4ca65f(0x22a), _0x4ca65f(0x46a), '↤↤↤↤↤\x20[[text]]\x20↦↦↦↦↦', _0x4ca65f(0x559), _0x4ca65f(0x4ed), _0x4ca65f(0x24d), _0x4ca65f(0x53f), _0x4ca65f(0x32e), _0x4ca65f(0x339), _0x4ca65f(0x25a), _0x4ca65f(0x514), _0x4ca65f(0x314), _0x4ca65f(0x341), _0x4ca65f(0x347), _0x4ca65f(0xf3), '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', _0x4ca65f(0x2c5), _0x4ca65f(0x335), _0x4ca65f(0x267), _0x4ca65f(0x53d), _0x4ca65f(0x224), '∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ\x20[[text]]\x20ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙', _0x4ca65f(0x538), _0x4ca65f(0x16c), _0x4ca65f(0x173), _0x4ca65f(0x5a4), _0x4ca65f(0x22d), '.•♫•♬•\x20[[text]]\x20•♬•♫•.', _0x4ca65f(0x40d), '«-(¯`v´¯)-«\x20[[text]]\x20»-(¯`v´¯)-»'];

function wrapInFlourish(_0x19f1e0) {
    var _0x411ccd = _0x4ca65f;
    return flourishArray[Math[_0x411ccd(0x1c8)](Math['random']() * flourishArray[_0x411ccd(0x4ce)])][_0x411ccd(0x582)](_0x411ccd(0x509), _0x19f1e0);
}

function Flourishlist(_0x2057ae, _0xc3f6ee) {
    var _0x1e0d69 = _0x4ca65f;
    return flourishArray[_0x2057ae][_0x1e0d69(0x582)](_0x1e0d69(0x509), _0xc3f6ee);
}

function wrapInSymbols(_0xdd0269, _0x597a14) {
    return randomSymbols(_0x597a14) + '\x20\x20' + _0xdd0269 + '\x20\x20' + randomSymbols(_0x597a14);
}

function firework(_0xcff148) {
    var _0xa95c53 = _0x4ca65f;
    return _0xcff148[_0xa95c53(0x500)]('')[_0xa95c53(0x55c)]('҉') + '҉';
}

function weirdBox(_0x5d4fda) {
    var _0x497bb3 = _0x4ca65f;
    return _0x5d4fda[_0x497bb3(0x582)](/([^\s])/g, _0x497bb3(0x3cd));
}

function littleSparkles(_0x4fa272) {
    var _0x159590 = _0x4ca65f;
    return _0x159590(0x466) + _0x4fa272 + _0x159590(0x50c);
}

function kirbyHug(_0x41d79a) {
    var _0x40fd3f = _0x4ca65f;
    return _0x40fd3f(0x4cf) + _0x41d79a + '\x20♥';
}

function dottyJoiner(_0x211951) {
    var _0x451505 = _0x4ca65f;
    return '░' + _0x211951[_0x451505(0x500)]('')[_0x451505(0x55c)]('░') + '░';
}

function wavyJoiner(_0x34c960) {
    var _0x3c5b32 = _0x4ca65f;
    return '≋' + _0x34c960[_0x3c5b32(0x500)]('')['join']('≋') + '≋';
}

function diametricAngleFrame(_0x4b51b0) {
    var _0x1e4be2 = _0x4ca65f;
    return _0x4b51b0[_0x1e4be2(0x582)](/([^\s])/g, _0x1e4be2(0x50a));
}

function thickBlockFramed(_0x1d95f0) {
    var _0x249dd = _0x4ca65f;
    return _0x1d95f0[_0x249dd(0x582)](/([^\s])/g, '【$1】');
}
var h = {};
h['1'] = _0x4ca65f(0x307), h['2'] = _0x4ca65f(0x52e), h['3'] = _0x4ca65f(0x2ad), h['4'] = _0x4ca65f(0x498), h['5'] = '&#1213;', h['6'] = _0x4ca65f(0xe3), h['7'] = _0x4ca65f(0x51a), h['8'] = _0x4ca65f(0x20d), h['9'] = _0x4ca65f(0xd4), h['10'] = _0x4ca65f(0x3d7), h['11'] = _0x4ca65f(0x59a), h['12'] = _0x4ca65f(0x436), h['13'] = _0x4ca65f(0x17c), h['14'] = _0x4ca65f(0x49c), h['15'] = _0x4ca65f(0xca), h['16'] = _0x4ca65f(0x2bf), h['17'] = _0x4ca65f(0x109), h['18'] = _0x4ca65f(0x517), h['19'] = _0x4ca65f(0x289), h['20'] = _0x4ca65f(0x2e0), h['21'] = '&upsilon;', h['22'] = _0x4ca65f(0x3ce), h['23'] = _0x4ca65f(0x16b), h['24'] = 'x', h['25'] = _0x4ca65f(0x4b6), h['26'] = _0x4ca65f(0x4af), h['27'] = 'A', h['28'] = 'B', h['29'] = 'C', h['30'] = 'D', h['31'] = 'E', h['32'] = 'F', h['33'] = 'G', h['34'] = 'H', h['35'] = 'I', h['36'] = 'J', h['37'] = 'K', h['38'] = 'L', h['39'] = 'M', h['40'] = 'N', h['41'] = 'O', h['42'] = 'P', h['43'] = 'Q', h['44'] = 'R', h['45'] = 'S', h['46'] = 'T', h['47'] = 'U', h['48'] = 'V', h['49'] = 'W', h['50'] = 'X', h['51'] = 'Y', h['52'] = 'Z', h['53'] = '1', h['54'] = '2', h['55'] = '3', h['56'] = '4', h['57'] = '5', h['58'] = '6', h['59'] = '7', h['60'] = '8', h['61'] = '9', h['62'] = '0';
var i = {};
i['1'] = _0x4ca65f(0x3c5), i['2'] = _0x4ca65f(0x525), i['3'] = '&#9790;', i['4'] = _0x4ca65f(0x372), i['5'] = _0x4ca65f(0x37b), i['6'] = _0x4ca65f(0x2e6), i['7'] = _0x4ca65f(0x4d5), i['8'] = '&#9796;', i['9'] = _0x4ca65f(0x564), i['10'] = '&#9834;', i['11'] = _0x4ca65f(0x164), i['12'] = _0x4ca65f(0x2a7), i['13'] = _0x4ca65f(0x537), i['14'] = '&#9835;', i['15'] = _0x4ca65f(0x53c), i['16'] = '&rho;', i['17'] = _0x4ca65f(0x26e), i['18'] = _0x4ca65f(0x247), i['19'] = _0x4ca65f(0x59c), i['20'] = '&#9730;', i['21'] = '&#9739;', i['22'] = _0x4ca65f(0x427), i['23'] = _0x4ca65f(0x18d), i['24'] = '&#8984;', i['25'] = _0x4ca65f(0x4e6), i['26'] = '&#9761;', i['27'] = _0x4ca65f(0x3c5), i['28'] = '&#9837;', i['29'] = _0x4ca65f(0x142), i['30'] = _0x4ca65f(0x372), i['31'] = _0x4ca65f(0x37b), i['32'] = _0x4ca65f(0x2e6), i['33'] = '&#10081;', i['34'] = _0x4ca65f(0x398), i['35'] = _0x4ca65f(0x564), i['36'] = _0x4ca65f(0x458), i['37'] = _0x4ca65f(0x164), i['38'] = _0x4ca65f(0x2a7), i['39'] = _0x4ca65f(0x537), i['40'] = _0x4ca65f(0x42d), i['41'] = _0x4ca65f(0x53c), i['42'] = '&rho;', i['43'] = _0x4ca65f(0x26e), i['44'] = _0x4ca65f(0x247), i['45'] = _0x4ca65f(0x59c), i['46'] = _0x4ca65f(0x404), i['47'] = _0x4ca65f(0x4d3), i['48'] = _0x4ca65f(0x427), i['49'] = _0x4ca65f(0x18d), i['50'] = _0x4ca65f(0x145), i['51'] = _0x4ca65f(0x4e6), i['52'] = '&#9761;', i['53'] = _0x4ca65f(0x2fe), i['54'] = '&#10123;', i['55'] = _0x4ca65f(0x23b), i['56'] = '&#10125;', i['57'] = '&#10126;', i['58'] = _0x4ca65f(0x50e), i['59'] = '&#10128;', i['60'] = _0x4ca65f(0x462), i['61'] = '&#10130;', i['62'] = _0x4ca65f(0x368);
var j = {};
j['1'] = _0x4ca65f(0x1fa), j['2'] = _0x4ca65f(0x118), j['3'] = _0x4ca65f(0x54e), j['4'] = _0x4ca65f(0x585), j['5'] = _0x4ca65f(0x452), j['6'] = '&#358;', j['7'] = _0x4ca65f(0x479), j['8'] = '&#292;', j['9'] = _0x4ca65f(0x39a), j['10'] = _0x4ca65f(0x3b4), j['11'] = _0x4ca65f(0x354), j['12'] = _0x4ca65f(0x4e3), j['13'] = _0x4ca65f(0x1c1), j['14'] = '&#323;', j['15'] = '&#336;', j['16'] = _0x4ca65f(0x150), j['17'] = 'Q', j['18'] = _0x4ca65f(0x25e), j['19'] = _0x4ca65f(0x166), j['20'] = _0x4ca65f(0x18c), j['21'] = _0x4ca65f(0x2f4), j['22'] = 'V', j['23'] = '&#372;', j['24'] = _0x4ca65f(0x22c), j['25'] = _0x4ca65f(0x2b6), j['26'] = _0x4ca65f(0x264), j['27'] = _0x4ca65f(0x1fa), j['28'] = '&beta;', j['29'] = _0x4ca65f(0x54e), j['30'] = _0x4ca65f(0x585), j['31'] = '&#276;', j['32'] = _0x4ca65f(0x179), j['33'] = _0x4ca65f(0x479), j['34'] = _0x4ca65f(0x300), j['35'] = _0x4ca65f(0x39a), j['36'] = '&#308;', j['37'] = _0x4ca65f(0x354), j['38'] = _0x4ca65f(0x4e3), j['39'] = _0x4ca65f(0x1c1), j['40'] = _0x4ca65f(0x1c9), j['41'] = _0x4ca65f(0x48a), j['42'] = '&#1056;', j['43'] = 'Q', j['44'] = _0x4ca65f(0x25e), j['45'] = _0x4ca65f(0x166), j['46'] = _0x4ca65f(0x18c), j['47'] = _0x4ca65f(0x2f4), j['48'] = 'V', j['49'] = _0x4ca65f(0x305), j['50'] = _0x4ca65f(0x22c), j['51'] = _0x4ca65f(0x2b6), j['52'] = _0x4ca65f(0x264), j['53'] = '1', j['54'] = '2', j['55'] = '3', j['56'] = '4', j['57'] = '5', j['58'] = '6', j['59'] = '7', j['60'] = '8', j['61'] = '9', j['62'] = '0';
var k = {};
k['1'] = _0x4ca65f(0x407), k['2'] = 'q', k['3'] = '&#596;', k['4'] = 'p', k['5'] = _0x4ca65f(0xbf), k['6'] = _0x4ca65f(0x1f7), k['7'] = _0x4ca65f(0x503), k['8'] = _0x4ca65f(0x583), k['9'] = _0x4ca65f(0x3c6), k['10'] = '&#638;', k['11'] = '&#670;', k['12'] = 'l', k['13'] = _0x4ca65f(0x16b), k['14'] = 'u', k['15'] = 'o', k['16'] = 'd', k['17'] = 'b', k['18'] = '&#633;', k['19'] = 's', k['20'] = '&#647;', k['21'] = 'n', k['22'] = _0x4ca65f(0x48c), k['23'] = '&#653;', k['24'] = 'x', k['25'] = _0x4ca65f(0x2dc), k['26'] = 'z', k['27'] = _0x4ca65f(0x407), k['28'] = 'q', k['29'] = '&#596;', k['30'] = 'p', k['31'] = _0x4ca65f(0xbf), k['32'] = _0x4ca65f(0x1f7), k['33'] = _0x4ca65f(0x503), k['34'] = _0x4ca65f(0x583), k['35'] = _0x4ca65f(0x3c6), k['36'] = '&#638;', k['37'] = _0x4ca65f(0x3da), k['38'] = 'l', k['39'] = '&#623;', k['40'] = 'u', k['41'] = 'o', k['42'] = 'd', k['43'] = 'b', k['44'] = _0x4ca65f(0x236), k['45'] = 's', k['46'] = _0x4ca65f(0x2f6), k['47'] = 'n', k['48'] = '&#652;', k['49'] = _0x4ca65f(0x3a7), k['50'] = 'x', k['51'] = _0x4ca65f(0x2dc), k['52'] = 'z', k['53'] = _0x4ca65f(0x27e), k['54'] = _0x4ca65f(0x36e), k['55'] = '&#400;', k['56'] = '&#12579;', k['57'] = _0x4ca65f(0x364), k['58'] = '9', k['59'] = _0x4ca65f(0x3ac), k['60'] = '8', k['61'] = '6', k['62'] = '0';
var l = {};
l['1'] = '&Delta;', l['2'] = _0x4ca65f(0x118), l['3'] = '&#262;', l['4'] = _0x4ca65f(0x449), l['5'] = _0x4ca65f(0x37b), l['6'] = _0x4ca65f(0x423), l['7'] = '&#484;', l['8'] = _0x4ca65f(0xc0), l['9'] = _0x4ca65f(0x594), l['10'] = _0x4ca65f(0x3b4), l['11'] = _0x4ca65f(0x511), l['12'] = '&#321;', l['13'] = _0x4ca65f(0x2c1), l['14'] = _0x4ca65f(0x4a9), l['15'] = _0x4ca65f(0x2c0), l['16'] = _0x4ca65f(0x3fe), l['17'] = _0x4ca65f(0x4f9), l['18'] = _0x4ca65f(0x178), l['19'] = _0x4ca65f(0x1cb), l['20'] = _0x4ca65f(0x179), l['21'] = _0x4ca65f(0x249), l['22'] = 'V', l['23'] = _0x4ca65f(0x305), l['24'] = _0x4ca65f(0x22c), l['25'] = _0x4ca65f(0x4fa), l['26'] = _0x4ca65f(0x482), l['27'] = _0x4ca65f(0x1ea), l['28'] = _0x4ca65f(0x118), l['29'] = '&#262;', l['30'] = '&#272;', l['31'] = _0x4ca65f(0x37b), l['32'] = _0x4ca65f(0x423), l['33'] = _0x4ca65f(0x2e9), l['34'] = _0x4ca65f(0xc0), l['35'] = _0x4ca65f(0x594), l['36'] = _0x4ca65f(0x3b4), l['37'] = _0x4ca65f(0x511), l['38'] = _0x4ca65f(0x2f7), l['39'] = _0x4ca65f(0x2c1), l['40'] = _0x4ca65f(0x4a9), l['41'] = '&Oslash;', l['42'] = _0x4ca65f(0x3fe), l['43'] = _0x4ca65f(0x4f9), l['44'] = '&#344;', l['45'] = _0x4ca65f(0x1cb), l['46'] = _0x4ca65f(0x179), l['47'] = _0x4ca65f(0x249), l['48'] = 'V', l['49'] = _0x4ca65f(0x305), l['50'] = _0x4ca65f(0x22c), l['51'] = '&yen;', l['52'] = _0x4ca65f(0x482), l['53'] = '1', l['54'] = '2', l['55'] = '3', l['56'] = '4', l['57'] = '5', l['58'] = '6', l['59'] = '7', l['60'] = '8', l['61'] = '9', l['62'] = '0';
var m = {};
m['1'] = _0x4ca65f(0x307), m['2'] = _0x4ca65f(0x10c), m['3'] = _0x4ca65f(0x15f), m['4'] = '&part;', m['5'] = '&epsilon;', m['6'] = '&fnof;', m['7'] = _0x4ca65f(0x51a), m['8'] = '&#614;', m['9'] = _0x4ca65f(0x221), m['10'] = '&#669;', m['11'] = _0x4ca65f(0x540), m['12'] = _0x4ca65f(0x371), m['13'] = '&#625;', m['14'] = _0x4ca65f(0x49c), m['15'] = _0x4ca65f(0xca), m['16'] = _0x4ca65f(0x2bf), m['17'] = _0x4ca65f(0x1b1), m['18'] = _0x4ca65f(0x19b), m['19'] = '&#3619;', m['20'] = _0x4ca65f(0x41c), m['21'] = _0x4ca65f(0xd5), m['22'] = '&#1141;', m['23'] = _0x4ca65f(0x18d), m['24'] = _0x4ca65f(0x108), m['25'] = _0x4ca65f(0x4b6), m['26'] = _0x4ca65f(0x474), m['27'] = _0x4ca65f(0x307), m['28'] = _0x4ca65f(0x10c), m['29'] = '&#2798;', m['30'] = _0x4ca65f(0x1f4), m['31'] = _0x4ca65f(0x524), m['32'] = _0x4ca65f(0x332), m['33'] = '&#608;', m['34'] = _0x4ca65f(0x1da), m['35'] = _0x4ca65f(0x221), m['36'] = _0x4ca65f(0x3d7), m['37'] = _0x4ca65f(0x540), m['38'] = _0x4ca65f(0x371), m['39'] = '&#625;', m['40'] = _0x4ca65f(0x49c), m['41'] = _0x4ca65f(0xca), m['42'] = '&rho;', m['43'] = _0x4ca65f(0x1b1), m['44'] = _0x4ca65f(0x19b), m['45'] = '&#3619;', m['46'] = _0x4ca65f(0x41c), m['47'] = _0x4ca65f(0xd5), m['48'] = '&#1141;', m['49'] = _0x4ca65f(0x18d), m['50'] = _0x4ca65f(0x108), m['51'] = _0x4ca65f(0x4b6), m['52'] = _0x4ca65f(0x474), m['53'] = '1', m['54'] = '2', m['55'] = '3', m['56'] = '4', m['57'] = '5', m['58'] = '6', m['59'] = '7', m['60'] = '8', m['61'] = '9', m['62'] = '0';
var n = {};
n['1'] = _0x4ca65f(0x399), n['2'] = '&#5623;', n['3'] = _0x4ca65f(0x296), n['4'] = _0x4ca65f(0x1ef), n['5'] = _0x4ca65f(0x290), n['6'] = _0x4ca65f(0x198), n['7'] = '&#484;', n['8'] = _0x4ca65f(0x55d), n['9'] = _0x4ca65f(0xeb), n['10'] = '&#5262;', n['11'] = _0x4ca65f(0x542), n['12'] = _0x4ca65f(0x3b5), n['13'] = '&#5616;', n['14'] = '&#5198;', n['15'] = '&#5597;', n['16'] = '&#5229;', n['17'] = _0x4ca65f(0x418), n['18'] = _0x4ca65f(0x505), n['19'] = _0x4ca65f(0x568), n['20'] = '&#19973;', n['21'] = _0x4ca65f(0x35b), n['22'] = _0x4ca65f(0xc4), n['23'] = _0x4ca65f(0x4ca), n['24'] = _0x4ca65f(0x159), n['25'] = _0x4ca65f(0x42e), n['26'] = '&#20057;', n['27'] = '&#5609;', n['28'] = _0x4ca65f(0x523), n['29'] = _0x4ca65f(0x296), n['30'] = _0x4ca65f(0x1ef), n['31'] = _0x4ca65f(0x290), n['32'] = '&#5556;', n['33'] = _0x4ca65f(0x2e9), n['34'] = _0x4ca65f(0x55d), n['35'] = _0x4ca65f(0xeb), n['36'] = _0x4ca65f(0x506), n['37'] = _0x4ca65f(0x542), n['38'] = _0x4ca65f(0x3b5), n['39'] = '&#5616;', n['40'] = _0x4ca65f(0x3dd), n['41'] = '&#5597;', n['42'] = _0x4ca65f(0x284), n['43'] = _0x4ca65f(0x418), n['44'] = '&#5511;', n['45'] = _0x4ca65f(0x568), n['46'] = '&#19973;', n['47'] = _0x4ca65f(0x35b), n['48'] = _0x4ca65f(0xc4), n['49'] = _0x4ca65f(0x4ca), n['50'] = _0x4ca65f(0x159), n['51'] = _0x4ca65f(0x42e), n['52'] = _0x4ca65f(0x351), n['53'] = '1', n['54'] = '2', n['55'] = '3', n['56'] = '4', n['57'] = '5', n['58'] = '6', n['59'] = '7', n['60'] = '8', n['61'] = '9', n['62'] = '0';
var o = {};
o['1'] = _0x4ca65f(0x298), o['2'] = _0x4ca65f(0x3c2), o['3'] = _0x4ca65f(0x197), o['4'] = '&#4331;', o['5'] = _0x4ca65f(0x544), o['6'] = 'f', o['7'] = _0x4ca65f(0x4f8), o['8'] = 'h', o['9'] = _0x4ca65f(0x1b6), o['10'] = _0x4ca65f(0x215), o['11'] = _0x4ca65f(0x20a), o['12'] = 'l', o['13'] = _0x4ca65f(0x21f), o['14'] = '&#8134;', o['15'] = _0x4ca65f(0x119), o['16'] = _0x4ca65f(0x2bf), o['17'] = _0x4ca65f(0x184), o['18'] = _0x4ca65f(0x102), o['19'] = _0x4ca65f(0x539), o['20'] = _0x4ca65f(0x180), o['21'] = _0x4ca65f(0x365), o['22'] = _0x4ca65f(0x38e), o['23'] = 'w', o['24'] = _0x4ca65f(0x4d7), o['25'] = _0x4ca65f(0x4b6), o['26'] = _0x4ca65f(0x283), o['27'] = _0x4ca65f(0x298), o['28'] = _0x4ca65f(0x3c2), o['29'] = '&#4308;', o['30'] = _0x4ca65f(0x486), o['31'] = _0x4ca65f(0x544), o['32'] = 'f', o['33'] = _0x4ca65f(0x4f8), o['34'] = 'h', o['35'] = _0x4ca65f(0x1b6), o['36'] = _0x4ca65f(0x215), o['37'] = '&kappa;', o['38'] = 'l', o['39'] = _0x4ca65f(0x21f), o['40'] = _0x4ca65f(0x592), o['41'] = '&otilde;', o['42'] = _0x4ca65f(0x2bf), o['43'] = _0x4ca65f(0x184), o['44'] = _0x4ca65f(0x102), o['45'] = _0x4ca65f(0x539), o['46'] = '&#3923;', o['47'] = '&upsilon;', o['48'] = _0x4ca65f(0x38e), o['49'] = 'w', o['50'] = _0x4ca65f(0x4d7), o['51'] = _0x4ca65f(0x4b6), o['52'] = _0x4ca65f(0x283), o['53'] = '1', o['54'] = '2', o['55'] = '3', o['56'] = '4', o['57'] = '5', o['58'] = '6', o['59'] = '7', o['60'] = '8', o['61'] = '9', o['62'] = '0';
var p = {};
p['1'] = _0x4ca65f(0x139), p['2'] = _0x4ca65f(0x4a1), p['3'] = _0x4ca65f(0x2d0), p['4'] = '&#545;', p['5'] = _0x4ca65f(0x57f), p['6'] = '&#1171;', p['7'] = '&#291;', p['8'] = _0x4ca65f(0x1d6), p['9'] = _0x4ca65f(0x3d3), p['10'] = _0x4ca65f(0x1c6), p['11'] = _0x4ca65f(0x2fd), p['12'] = _0x4ca65f(0x285), p['13'] = _0x4ca65f(0x237), p['14'] = _0x4ca65f(0x103), p['15'] = '&#972;', p['16'] = '&rho;', p['17'] = 'q', p['18'] = _0x4ca65f(0x4df), p['19'] = _0x4ca65f(0x46b), p['20'] = _0x4ca65f(0x2b0), p['21'] = _0x4ca65f(0x47a), p['22'] = _0x4ca65f(0x34b), p['23'] = _0x4ca65f(0x38b), p['24'] = 'x', p['25'] = _0x4ca65f(0x1c0), p['26'] = _0x4ca65f(0x206), p['27'] = _0x4ca65f(0x139), p['28'] = _0x4ca65f(0x4a1), p['29'] = '&sigmaf;', p['30'] = _0x4ca65f(0x433), p['31'] = '&#941;', p['32'] = _0x4ca65f(0x194), p['33'] = _0x4ca65f(0x4a5), p['34'] = '&#295;', p['35'] = _0x4ca65f(0x3d3), p['36'] = _0x4ca65f(0x1c6), p['37'] = _0x4ca65f(0x2fd), p['38'] = _0x4ca65f(0x285), p['39'] = _0x4ca65f(0x237), p['40'] = '&#942;', p['41'] = '&#972;', p['42'] = _0x4ca65f(0x2bf), p['43'] = 'q', p['44'] = _0x4ca65f(0x4df), p['45'] = _0x4ca65f(0x46b), p['46'] = _0x4ca65f(0x2b0), p['47'] = _0x4ca65f(0x47a), p['48'] = _0x4ca65f(0x34b), p['49'] = _0x4ca65f(0x38b), p['50'] = 'x', p['51'] = _0x4ca65f(0x1c0), p['52'] = _0x4ca65f(0x206), p['53'] = '1', p['54'] = '2', p['55'] = '3', p['56'] = '4', p['57'] = '5', p['58'] = '6', p['59'] = '7', p['60'] = '8', p['61'] = '9', p['62'] = '0';
var q = {};
q['1'] = _0x4ca65f(0x2b3), q['2'] = _0x4ca65f(0x26d), q['3'] = '&#41976;', q['4'] = _0x4ca65f(0xd2), q['5'] = _0x4ca65f(0xe5), q['6'] = '&#41240;', q['7'] = _0x4ca65f(0x54f), q['8'] = _0x4ca65f(0xf5), q['9'] = _0x4ca65f(0x584), q['10'] = _0x4ca65f(0x185), q['11'] = _0x4ca65f(0x2f9), q['12'] = _0x4ca65f(0x177), q['13'] = _0x4ca65f(0x110), q['14'] = _0x4ca65f(0x187), q['15'] = _0x4ca65f(0x3d9), q['16'] = _0x4ca65f(0x586), q['17'] = _0x4ca65f(0x21b), q['18'] = '&#42131;', q['19'] = _0x4ca65f(0x434), q['20'] = _0x4ca65f(0x31e), q['21'] = '&#41991;', q['22'] = '&#41949;', q['23'] = _0x4ca65f(0x3be), q['24'] = _0x4ca65f(0xde), q['25'] = '&#42015;', q['26'] = _0x4ca65f(0x409), q['27'] = _0x4ca65f(0x2b3), q['28'] = _0x4ca65f(0x26d), q['29'] = '&#41976;', q['30'] = _0x4ca65f(0xd2), q['31'] = _0x4ca65f(0xe5), q['32'] = _0x4ca65f(0x2da), q['33'] = _0x4ca65f(0x54f), q['34'] = _0x4ca65f(0xf5), q['35'] = _0x4ca65f(0x584), q['36'] = _0x4ca65f(0x185), q['37'] = _0x4ca65f(0x2f9), q['38'] = _0x4ca65f(0x177), q['39'] = '&#41042;', q['40'] = _0x4ca65f(0x187), q['41'] = _0x4ca65f(0x3d9), q['42'] = '&#41571;', q['43'] = _0x4ca65f(0x21b), q['44'] = '&#42131;', q['45'] = _0x4ca65f(0x434), q['46'] = _0x4ca65f(0x31e), q['47'] = _0x4ca65f(0x28f), q['48'] = _0x4ca65f(0x13d), q['49'] = _0x4ca65f(0x3be), q['50'] = _0x4ca65f(0xde), q['51'] = '&#42015;', q['52'] = '&#41076;', q['53'] = '1', q['54'] = '2', q['55'] = '3', q['56'] = '4', q['57'] = '5', q['58'] = '6', q['59'] = '7', q['60'] = '8', q['61'] = '9', q['62'] = '0';
var r = {};
r['1'] = _0x4ca65f(0x27a), r['2'] = _0x4ca65f(0x2de), r['3'] = 'C', r['4'] = 'D', r['5'] = '&Xi;', r['6'] = 'F', r['7'] = 'G', r['8'] = 'H', r['9'] = 'I', r['10'] = 'J', r['11'] = _0x4ca65f(0x511), r['12'] = 'L', r['13'] = 'M', r['14'] = '&#1048;', r['15'] = _0x4ca65f(0x271), r['16'] = 'P', r['17'] = _0x4ca65f(0x3f3), r['18'] = _0x4ca65f(0x3db), r['19'] = 'S', r['20'] = _0x4ca65f(0x102), r['21'] = '&#1062;', r['22'] = 'V', r['23'] = '&#1065;', r['24'] = _0x4ca65f(0x22c), r['25'] = _0x4ca65f(0x40c), r['26'] = 'Z', r['27'] = _0x4ca65f(0x27a), r['28'] = _0x4ca65f(0x2de), r['29'] = 'C', r['30'] = 'D', r['31'] = _0x4ca65f(0x246), r['32'] = 'F', r['33'] = 'G', r['34'] = 'H', r['35'] = 'I', r['36'] = 'J', r['37'] = _0x4ca65f(0x511), r['38'] = 'L', r['39'] = 'M', r['40'] = _0x4ca65f(0x472), r['41'] = _0x4ca65f(0x271), r['42'] = 'P', r['43'] = _0x4ca65f(0x3f3), r['44'] = '&#1071;', r['45'] = 'S', r['46'] = '&Gamma;', r['47'] = _0x4ca65f(0x545), r['48'] = 'V', r['49'] = _0x4ca65f(0x18f), r['50'] = _0x4ca65f(0x22c), r['51'] = '&#1059;', r['52'] = 'Z', r['53'] = '1', r['54'] = '2', r['55'] = '3', r['56'] = '4', r['57'] = '5', r['58'] = '6', r['59'] = '7', r['60'] = '8', r['61'] = '9', r['62'] = '0';
var s = {};
s['1'] = _0x4ca65f(0x3c5), s['2'] = '&#41731;', s['3'] = _0x4ca65f(0x3bc), s['4'] = _0x4ca65f(0x497), s['5'] = _0x4ca65f(0xe5), s['6'] = '&#41863;', s['7'] = '&#41029;', s['8'] = _0x4ca65f(0x3c9), s['9'] = _0x4ca65f(0x234), s['10'] = _0x4ca65f(0x185), s['11'] = _0x4ca65f(0x4c2), s['12'] = _0x4ca65f(0x177), s['13'] = _0x4ca65f(0x441), s['14'] = _0x4ca65f(0x489), s['15'] = _0x4ca65f(0xf6), s['16'] = _0x4ca65f(0x586), s['17'] = _0x4ca65f(0x156), s['18'] = '&#41706;', s['19'] = _0x4ca65f(0x1e8), s['20'] = _0x4ca65f(0x4dd), s['21'] = _0x4ca65f(0x1c5), s['22'] = _0x4ca65f(0x100), s['23'] = _0x4ca65f(0x126), s['24'] = _0x4ca65f(0x162), s['25'] = _0x4ca65f(0x589), s['26'] = _0x4ca65f(0x409), s['27'] = '&#41807;', s['28'] = '&#41731;', s['29'] = _0x4ca65f(0x3bc), s['30'] = _0x4ca65f(0x497), s['31'] = _0x4ca65f(0xe5), s['32'] = '&#41863;', s['33'] = '&#41029;', s['34'] = _0x4ca65f(0x3c9), s['35'] = '&#40996;', s['36'] = _0x4ca65f(0x185), s['37'] = _0x4ca65f(0x4c2), s['38'] = _0x4ca65f(0x177), s['39'] = _0x4ca65f(0x441), s['40'] = _0x4ca65f(0x489), s['41'] = _0x4ca65f(0xf6), s['42'] = '&#41571;', s['43'] = _0x4ca65f(0x156), s['44'] = '&#41706;', s['45'] = _0x4ca65f(0x1e8), s['46'] = _0x4ca65f(0x4dd), s['47'] = _0x4ca65f(0x1c5), s['48'] = _0x4ca65f(0x100), s['49'] = _0x4ca65f(0x126), s['50'] = _0x4ca65f(0x162), s['51'] = _0x4ca65f(0x589), s['52'] = _0x4ca65f(0x409), s['53'] = '1', s['54'] = '2', s['55'] = '3', s['56'] = '4', s['57'] = '5', s['58'] = '6', s['59'] = '7', s['60'] = '8', s['61'] = '9', s['62'] = '0';
var t = {};
t['1'] = _0x4ca65f(0x338), t['2'] = _0x4ca65f(0x56d), t['3'] = _0x4ca65f(0x299), t['4'] = '&#42159;', t['5'] = _0x4ca65f(0x35a), t['6'] = _0x4ca65f(0xef), t['7'] = _0x4ca65f(0x42f), t['8'] = _0x4ca65f(0x297), t['9'] = _0x4ca65f(0x44d), t['10'] = _0x4ca65f(0x37f), t['11'] = _0x4ca65f(0x4c2), t['12'] = _0x4ca65f(0x177), t['13'] = _0x4ca65f(0x441), t['14'] = _0x4ca65f(0x1f5), t['15'] = '&#41266;', t['16'] = _0x4ca65f(0x586), t['17'] = _0x4ca65f(0x156), t['18'] = _0x4ca65f(0x13a), t['19'] = '&#41433;', t['20'] = '&#42180;', t['21'] = _0x4ca65f(0x3e7), t['22'] = '&#42150;', t['23'] = _0x4ca65f(0x3be), t['24'] = '&#41575;', t['25'] = '&#41766;', t['26'] = '&#41076;', t['27'] = _0x4ca65f(0x338), t['28'] = _0x4ca65f(0x56d), t['29'] = _0x4ca65f(0x299), t['30'] = _0x4ca65f(0x127), t['31'] = _0x4ca65f(0x35a), t['32'] = _0x4ca65f(0xef), t['33'] = '&#41804;', t['34'] = _0x4ca65f(0x297), t['35'] = '&#42128;', t['36'] = _0x4ca65f(0x37f), t['37'] = _0x4ca65f(0x4c2), t['38'] = _0x4ca65f(0x177), t['39'] = _0x4ca65f(0x441), t['40'] = _0x4ca65f(0x1f5), t['41'] = _0x4ca65f(0x214), t['42'] = '&#41571;', t['43'] = _0x4ca65f(0x156), t['44'] = _0x4ca65f(0x13a), t['45'] = _0x4ca65f(0x11a), t['46'] = _0x4ca65f(0x4dd), t['47'] = _0x4ca65f(0x3e7), t['48'] = _0x4ca65f(0x39c), t['49'] = _0x4ca65f(0x3be), t['50'] = '&#41575;', t['51'] = '&#41766;', t['52'] = _0x4ca65f(0x409), t['53'] = '1', t['54'] = '2', t['55'] = '3', t['56'] = '4', t['57'] = '5', t['58'] = '6', t['59'] = '7', t['60'] = '8', t['61'] = '9', t['62'] = '0';
var u = {};
u['1'] = _0x4ca65f(0x37c), u['2'] = _0x4ca65f(0x587), u['3'] = _0x4ca65f(0x161), u['4'] = '&ETH;', u['5'] = _0x4ca65f(0x170), u['6'] = 'F', u['7'] = _0x4ca65f(0x342), u['8'] = _0x4ca65f(0x288), u['9'] = _0x4ca65f(0x384), u['10'] = _0x4ca65f(0x4de), u['11'] = '&#1178;', u['12'] = _0x4ca65f(0x2f7), u['13'] = _0x4ca65f(0xe1), u['14'] = _0x4ca65f(0x373), u['15'] = _0x4ca65f(0x2c0), u['16'] = _0x4ca65f(0x301), u['17'] = _0x4ca65f(0x51d), u['18'] = '&#23610;', u['19'] = _0x4ca65f(0x3d5), u['20'] = _0x4ca65f(0x18c), u['21'] = _0x4ca65f(0x545), u['22'] = _0x4ca65f(0x2ba), u['23'] = _0x4ca65f(0x294), u['24'] = '&chi;', u['25'] = _0x4ca65f(0x4a0), u['26'] = '&#7828;', u['27'] = _0x4ca65f(0x37c), u['28'] = _0x4ca65f(0x587), u['29'] = _0x4ca65f(0x161), u['30'] = '&ETH;', u['31'] = _0x4ca65f(0x170), u['32'] = 'F', u['33'] = _0x4ca65f(0x342), u['34'] = '&#1085;', u['35'] = _0x4ca65f(0x384), u['36'] = _0x4ca65f(0x4de), u['37'] = '&#1178;', u['38'] = _0x4ca65f(0x2f7), u['39'] = '&#3057;', u['40'] = _0x4ca65f(0x373), u['41'] = _0x4ca65f(0x2c0), u['42'] = _0x4ca65f(0x301), u['43'] = _0x4ca65f(0x51d), u['44'] = _0x4ca65f(0x12d), u['45'] = _0x4ca65f(0x3d5), u['46'] = _0x4ca65f(0x18c), u['47'] = _0x4ca65f(0x545), u['48'] = '&#404;', u['49'] = _0x4ca65f(0x294), u['50'] = _0x4ca65f(0x360), u['51'] = _0x4ca65f(0x4a0), u['52'] = _0x4ca65f(0x367), u['53'] = '1', u['54'] = '2', u['55'] = '3', u['56'] = '4', u['57'] = '5', u['58'] = '6', u['59'] = '7', u['60'] = '8', u['61'] = '9', u['62'] = '0';
var v = {};
v['1'] = _0x4ca65f(0x160), v['2'] = _0x4ca65f(0x310), v['3'] = '&#391;', v['4'] = _0x4ca65f(0x44f), v['5'] = _0x4ca65f(0x496), v['6'] = _0x4ca65f(0x465), v['7'] = _0x4ca65f(0x342), v['8'] = _0x4ca65f(0x4c8), v['9'] = _0x4ca65f(0x27e), v['10'] = '&#646;', v['11'] = _0x4ca65f(0x4cc), v['12'] = _0x4ca65f(0x20e), v['13'] = 'M', v['14'] = _0x4ca65f(0x1f0), v['15'] = _0x4ca65f(0x29c), v['16'] = _0x4ca65f(0x3fe), v['17'] = '&#418;', v['18'] = _0x4ca65f(0x378), v['19'] = _0x4ca65f(0x4c7), v['20'] = _0x4ca65f(0x28e), v['21'] = _0x4ca65f(0x4da), v['22'] = _0x4ca65f(0x2ba), v['23'] = _0x4ca65f(0x294), v['24'] = _0x4ca65f(0x28d), v['25'] = _0x4ca65f(0x42e), v['26'] = _0x4ca65f(0x468), v['27'] = _0x4ca65f(0x160), v['28'] = _0x4ca65f(0x310), v['29'] = _0x4ca65f(0x220), v['30'] = _0x4ca65f(0x44f), v['31'] = _0x4ca65f(0x496), v['32'] = _0x4ca65f(0x465), v['33'] = _0x4ca65f(0x342), v['34'] = _0x4ca65f(0x4c8), v['35'] = _0x4ca65f(0x27e), v['36'] = '&#646;', v['37'] = _0x4ca65f(0x4cc), v['38'] = '&#1340;', v['39'] = 'M', v['40'] = _0x4ca65f(0x1f0), v['41'] = _0x4ca65f(0x29c), v['42'] = _0x4ca65f(0x3fe), v['43'] = '&#418;', v['44'] = _0x4ca65f(0x378), v['45'] = _0x4ca65f(0x4c7), v['46'] = _0x4ca65f(0x28e), v['47'] = _0x4ca65f(0x4da), v['48'] = _0x4ca65f(0x2ba), v['49'] = _0x4ca65f(0x294), v['50'] = _0x4ca65f(0x28d), v['51'] = _0x4ca65f(0x42e), v['52'] = _0x4ca65f(0x468), v['53'] = '1', v['54'] = '2', v['55'] = '3', v['56'] = '4', v['57'] = '5', v['58'] = '6', v['59'] = '7', v['60'] = '8', v['61'] = '9', v['62'] = '0';
var w = {};
w['1'] = _0x4ca65f(0x134), w['2'] = '&#41712;', w['3'] = _0x4ca65f(0x455), w['4'] = _0x4ca65f(0x262), w['5'] = _0x4ca65f(0x3b1), w['6'] = _0x4ca65f(0xdb), w['7'] = _0x4ca65f(0xfd), w['8'] = '&#41833;', w['9'] = _0x4ca65f(0x584), w['10'] = _0x4ca65f(0x37f), w['11'] = _0x4ca65f(0x2f9), w['12'] = _0x4ca65f(0x177), w['13'] = _0x4ca65f(0x441), w['14'] = '&#41674;', w['15'] = _0x4ca65f(0xf6), w['16'] = _0x4ca65f(0x586), w['17'] = _0x4ca65f(0x2f8), w['18'] = _0x4ca65f(0x1ee), w['19'] = _0x4ca65f(0x434), w['20'] = _0x4ca65f(0x1bd), w['21'] = '&#41991;', w['22'] = _0x4ca65f(0x1f6), w['23'] = _0x4ca65f(0x126), w['24'] = _0x4ca65f(0x4d8), w['25'] = '&#42014;', w['26'] = _0x4ca65f(0x409), w['27'] = '&#41074;', w['28'] = _0x4ca65f(0xce), w['29'] = _0x4ca65f(0x455), w['30'] = '&#41120;', w['31'] = _0x4ca65f(0x3b1), w['32'] = _0x4ca65f(0xdb), w['33'] = _0x4ca65f(0xfd), w['34'] = _0x4ca65f(0x547), w['35'] = _0x4ca65f(0x584), w['36'] = '&#42171;', w['37'] = '&#40983;', w['38'] = _0x4ca65f(0x177), w['39'] = _0x4ca65f(0x441), w['40'] = _0x4ca65f(0x1f5), w['41'] = _0x4ca65f(0xf6), w['42'] = _0x4ca65f(0x586), w['43'] = '&#41079;', w['44'] = _0x4ca65f(0x1ee), w['45'] = _0x4ca65f(0x434), w['46'] = _0x4ca65f(0x1bd), w['47'] = '&#41991;', w['48'] = '&#41008;', w['49'] = _0x4ca65f(0x126), w['50'] = _0x4ca65f(0x4d8), w['51'] = _0x4ca65f(0x32f), w['52'] = _0x4ca65f(0x409), w['53'] = '1', w['54'] = '2', w['55'] = '3', w['56'] = '4', w['57'] = '5', w['58'] = '6', w['59'] = '7', w['60'] = '8', w['61'] = '9', w['62'] = '0';
var x = {};
x['1'] = _0x4ca65f(0x29a), x['2'] = '&#1349;', x['3'] = _0x4ca65f(0x2a1), x['4'] = _0x4ca65f(0x222), x['5'] = _0x4ca65f(0x4c9), x['6'] = _0x4ca65f(0x21e), x['7'] = _0x4ca65f(0x45c), x['8'] = _0x4ca65f(0x250), x['9'] = _0x4ca65f(0xd0), x['10'] = _0x4ca65f(0x3d7), x['11'] = '&#409;', x['12'] = '&#645;', x['13'] = _0x4ca65f(0x3a7), x['14'] = _0x4ca65f(0x189), x['15'] = _0x4ca65f(0x414), x['16'] = '&rho;', x['17'] = _0x4ca65f(0x1b1), x['18'] = '&#1360;', x['19'] = _0x4ca65f(0x476), x['20'] = _0x4ca65f(0x35e), x['21'] = _0x4ca65f(0x1ab), x['22'] = _0x4ca65f(0x295), x['23'] = _0x4ca65f(0x4e0), x['24'] = _0x4ca65f(0x138), x['25'] = _0x4ca65f(0x553), x['26'] = _0x4ca65f(0x16f), x['27'] = '&#1337;', x['28'] = _0x4ca65f(0x394), x['29'] = _0x4ca65f(0x2a1), x['30'] = '&#1338;', x['31'] = '&#541;', x['32'] = _0x4ca65f(0x21e), x['33'] = _0x4ca65f(0x45c), x['34'] = _0x4ca65f(0x250), x['35'] = _0x4ca65f(0xd0), x['36'] = _0x4ca65f(0x3d7), x['37'] = '&#409;', x['38'] = _0x4ca65f(0x436), x['39'] = _0x4ca65f(0x3a7), x['40'] = _0x4ca65f(0x189), x['41'] = _0x4ca65f(0x414), x['42'] = _0x4ca65f(0x2bf), x['43'] = _0x4ca65f(0x1b1), x['44'] = _0x4ca65f(0x3cf), x['45'] = _0x4ca65f(0x476), x['46'] = _0x4ca65f(0x35e), x['47'] = _0x4ca65f(0x1ab), x['48'] = '&#1506;', x['49'] = _0x4ca65f(0x4e0), x['50'] = '&#1347;', x['51'] = _0x4ca65f(0x553), x['52'] = _0x4ca65f(0x16f), x['53'] = '1', x['54'] = '2', x['55'] = '3', x['56'] = '4', x['57'] = '5', x['58'] = '6', x['59'] = '7', x['60'] = '8', x['61'] = '9', x['62'] = '0';
var y = {};
y['1'] = _0x4ca65f(0x307), y['2'] = _0x4ca65f(0x56f), y['3'] = _0x4ca65f(0x2d0), y['4'] = 'd', y['5'] = '&epsilon;', y['6'] = _0x4ca65f(0x332), y['7'] = 'g', y['8'] = 'h', y['9'] = _0x4ca65f(0x546), y['10'] = _0x4ca65f(0x4bf), y['11'] = _0x4ca65f(0x20a), y['12'] = _0x4ca65f(0x576), y['13'] = 'm', y['14'] = _0x4ca65f(0x395), y['15'] = '&oplus;', y['16'] = 'p', y['17'] = _0x4ca65f(0x4f9), y['18'] = 'r', y['19'] = _0x4ca65f(0x42c), y['20'] = '&dagger;', y['21'] = 'u', y['22'] = _0x4ca65f(0x39f), y['23'] = _0x4ca65f(0x18d), y['24'] = 'x', y['25'] = _0x4ca65f(0x376), y['26'] = 'z', y['27'] = _0x4ca65f(0x307), y['28'] = _0x4ca65f(0x56f), y['29'] = _0x4ca65f(0x2d0), y['30'] = 'd', y['31'] = _0x4ca65f(0x524), y['32'] = _0x4ca65f(0x332), y['33'] = 'g', y['34'] = 'h', y['35'] = _0x4ca65f(0x546), y['36'] = _0x4ca65f(0x4bf), y['37'] = _0x4ca65f(0x20a), y['38'] = _0x4ca65f(0x576), y['39'] = 'm', y['40'] = _0x4ca65f(0x395), y['41'] = '&oplus;', y['42'] = 'p', y['43'] = _0x4ca65f(0x4f9), y['44'] = 'r', y['45'] = _0x4ca65f(0x42c), y['46'] = _0x4ca65f(0x1a3), y['47'] = 'u', y['48'] = _0x4ca65f(0x39f), y['49'] = _0x4ca65f(0x18d), y['50'] = 'x', y['51'] = _0x4ca65f(0x376), y['52'] = 'z', y['53'] = '1', y['54'] = '2', y['55'] = '3', y['56'] = '4', y['57'] = '5', y['58'] = '6', y['59'] = '7', y['60'] = '8', y['61'] = '9', y['62'] = '0';
var z = {};
z['1'] = _0x4ca65f(0x287), z['2'] = '&#4330;', z['3'] = _0x4ca65f(0x2e8), z['4'] = '&#4331;', z['5'] = _0x4ca65f(0x556), z['6'] = '&#1330;', z['7'] = '&#2797;', z['8'] = _0x4ca65f(0x599), z['9'] = _0x4ca65f(0xd0), z['10'] = _0x4ca65f(0x144), z['11'] = _0x4ca65f(0x45e), z['12'] = '&#1350;', z['13'] = _0x4ca65f(0x17c), z['14'] = _0x4ca65f(0x38f), z['15'] = '&#2790;', z['16'] = _0x4ca65f(0x1f1), z['17'] = _0x4ca65f(0x216), z['18'] = _0x4ca65f(0x3cf), z['19'] = _0x4ca65f(0x2d0), z['20'] = _0x4ca65f(0x3f4), z['21'] = _0x4ca65f(0x365), z['22'] = _0x4ca65f(0x25b), z['23'] = _0x4ca65f(0x18d), z['24'] = _0x4ca65f(0x175), z['25'] = _0x4ca65f(0x295), z['26'] = _0x4ca65f(0x176), z['27'] = _0x4ca65f(0x287), z['28'] = '&#4330;', z['29'] = _0x4ca65f(0x2e8), z['30'] = _0x4ca65f(0x486), z['31'] = _0x4ca65f(0x556), z['32'] = _0x4ca65f(0x21e), z['33'] = _0x4ca65f(0x52b), z['34'] = _0x4ca65f(0x599), z['35'] = _0x4ca65f(0xd0), z['36'] = _0x4ca65f(0x144), z['37'] = _0x4ca65f(0x45e), z['38'] = _0x4ca65f(0x2e2), z['39'] = '&#625;', z['40'] = _0x4ca65f(0x38f), z['41'] = _0x4ca65f(0x2ed), z['42'] = _0x4ca65f(0x1f1), z['43'] = _0x4ca65f(0x216), z['44'] = _0x4ca65f(0x3cf), z['45'] = _0x4ca65f(0x2d0), z['46'] = _0x4ca65f(0x3f4), z['47'] = _0x4ca65f(0x365), z['48'] = _0x4ca65f(0x25b), z['49'] = _0x4ca65f(0x18d), z['50'] = _0x4ca65f(0x175), z['51'] = '&#1506;', z['52'] = '&#2749;', z['53'] = '1', z['54'] = '2', z['55'] = '3', z['56'] = '4', z['57'] = '5', z['58'] = '6', z['59'] = '7', z['60'] = '8', z['61'] = '9', z['62'] = '0';
var A = {};
A['1'] = _0x4ca65f(0x1e5), A['2'] = _0x4ca65f(0x3bb), A['3'] = 'c', A['4'] = _0x4ca65f(0x4be), A['5'] = '&#1105;', A['6'] = 'f', A['7'] = 'g', A['8'] = _0x4ca65f(0x288), A['9'] = _0x4ca65f(0x464), A['10'] = 'j', A['11'] = _0x4ca65f(0x1ca), A['12'] = _0x4ca65f(0x12c), A['13'] = _0x4ca65f(0x326), A['14'] = _0x4ca65f(0x4e8), A['15'] = '&#1139;', A['16'] = 'p', A['17'] = _0x4ca65f(0x3e8), A['18'] = _0x4ca65f(0x306), A['19'] = '$', A['20'] = _0x4ca65f(0x17d), A['21'] = _0x4ca65f(0x30c), A['22'] = _0x4ca65f(0x575), A['23'] = _0x4ca65f(0x4aa), A['24'] = '&#1078;', A['25'] = _0x4ca65f(0x1c0), A['26'] = '&#1079;', A['27'] = '&#1040;', A['28'] = _0x4ca65f(0x2de), A['29'] = 'C', A['30'] = '&#1044;', A['31'] = '&#1028;', A['32'] = 'F', A['33'] = 'G', A['34'] = 'H', A['35'] = _0x4ca65f(0x2ac), A['36'] = 'J', A['37'] = _0x4ca65f(0x11c), A['38'] = '&#1043;', A['39'] = _0x4ca65f(0x361), A['40'] = _0x4ca65f(0x21c), A['41'] = _0x4ca65f(0x356), A['42'] = 'P', A['43'] = '&#1060;', A['44'] = _0x4ca65f(0x3db), A['45'] = '$', A['46'] = 'T', A['47'] = '&#1062;', A['48'] = '&#1140;', A['49'] = _0x4ca65f(0x17a), A['50'] = _0x4ca65f(0x22c), A['51'] = _0x4ca65f(0x48e), A['52'] = _0x4ca65f(0x1ce), A['53'] = '1', A['54'] = '2', A['55'] = '3', A['56'] = '4', A['57'] = '5', A['58'] = '6', A['59'] = '7', A['60'] = '8', A['61'] = '9', A['62'] = '0';
var B = {};
B['1'] = 'a&#830;', B['2'] = _0x4ca65f(0x47e), B['3'] = _0x4ca65f(0x421), B['4'] = 'd&#830;', B['5'] = _0x4ca65f(0x32d), B['6'] = 'f&#830;', B['7'] = _0x4ca65f(0x3a5), B['8'] = 'h&#830;', B['9'] = _0x4ca65f(0x2ee), B['10'] = _0x4ca65f(0x135), B['11'] = 'k&#830;', B['12'] = _0x4ca65f(0x208), B['13'] = _0x4ca65f(0xb7), B['14'] = _0x4ca65f(0x560), B['15'] = 'o&#830;', B['16'] = _0x4ca65f(0x190), B['17'] = _0x4ca65f(0x552), B['18'] = 'r&#830;', B['19'] = _0x4ca65f(0x152), B['20'] = _0x4ca65f(0x4d1), B['21'] = _0x4ca65f(0x1b9), B['22'] = _0x4ca65f(0x29b), B['23'] = _0x4ca65f(0x4c1), B['24'] = _0x4ca65f(0x1b5), B['25'] = _0x4ca65f(0x242), B['26'] = 'z&#830;', B['27'] = _0x4ca65f(0x47c), B['28'] = 'B&#830;', B['29'] = _0x4ca65f(0x3f9), B['30'] = 'D&#830;', B['31'] = _0x4ca65f(0x521), B['32'] = _0x4ca65f(0xee), B['33'] = _0x4ca65f(0x10f), B['34'] = _0x4ca65f(0x3ad), B['35'] = _0x4ca65f(0x233), B['36'] = _0x4ca65f(0x2fc), B['37'] = _0x4ca65f(0x541), B['38'] = _0x4ca65f(0x2ae), B['39'] = _0x4ca65f(0x31f), B['40'] = _0x4ca65f(0x1ae), B['41'] = _0x4ca65f(0x1cf), B['42'] = 'P&#830;', B['43'] = _0x4ca65f(0x313), B['44'] = _0x4ca65f(0x1de), B['45'] = _0x4ca65f(0x196), B['46'] = _0x4ca65f(0x251), B['47'] = _0x4ca65f(0x4fc), B['48'] = 'V&#830;', B['49'] = _0x4ca65f(0x37d), B['50'] = 'X&#830;', B['51'] = _0x4ca65f(0x420), B['52'] = 'Z&#830;', B['53'] = _0x4ca65f(0x442), B['54'] = _0x4ca65f(0x4fb), B['55'] = _0x4ca65f(0x23c), B['56'] = _0x4ca65f(0x393), B['57'] = _0x4ca65f(0x1ba), B['58'] = _0x4ca65f(0x4d9), B['59'] = _0x4ca65f(0x1a1), B['60'] = _0x4ca65f(0x34d), B['61'] = _0x4ca65f(0x4e9), B['62'] = _0x4ca65f(0x37a);
var C = {};
C['1'] = _0x4ca65f(0x44a), C['2'] = _0x4ca65f(0x45d), C['3'] = _0x4ca65f(0x448), C['4'] = _0x4ca65f(0x366), C['5'] = _0x4ca65f(0x2ab), C['6'] = _0x4ca65f(0x574), C['7'] = _0x4ca65f(0x14f), C['8'] = _0x4ca65f(0x3d8), C['9'] = 'i&#838;', C['10'] = 'j&#838;', C['11'] = 'k&#838;', C['12'] = _0x4ca65f(0x168), C['13'] = 'm&#838;', C['14'] = _0x4ca65f(0x2db), C['15'] = _0x4ca65f(0x4a7), C['16'] = _0x4ca65f(0x375), C['17'] = 'q&#838;', C['18'] = 'r&#838;', C['19'] = _0x4ca65f(0x193), C['20'] = _0x4ca65f(0x385), C['21'] = _0x4ca65f(0x531), C['22'] = 'v&#838;', C['23'] = _0x4ca65f(0x4f2), C['24'] = _0x4ca65f(0x358), C['25'] = _0x4ca65f(0x24f), C['26'] = 'z&#838;', C['27'] = 'A&#838;', C['28'] = _0x4ca65f(0x51c), C['29'] = _0x4ca65f(0x478), C['30'] = _0x4ca65f(0x147), C['31'] = _0x4ca65f(0x231), C['32'] = _0x4ca65f(0x4ee), C['33'] = _0x4ca65f(0x125), C['34'] = _0x4ca65f(0x23a), C['35'] = _0x4ca65f(0x1f3), C['36'] = _0x4ca65f(0x4b7), C['37'] = _0x4ca65f(0x516), C['38'] = _0x4ca65f(0x257), C['39'] = _0x4ca65f(0x383), C['40'] = _0x4ca65f(0x130), C['41'] = _0x4ca65f(0x2c6), C['42'] = _0x4ca65f(0x3f5), C['43'] = _0x4ca65f(0x3ae), C['44'] = 'R&#838;', C['45'] = _0x4ca65f(0x15e), C['46'] = 'T&#838;', C['47'] = _0x4ca65f(0x419), C['48'] = _0x4ca65f(0x390), C['49'] = _0x4ca65f(0x51b), C['50'] = _0x4ca65f(0x2d7), C['51'] = _0x4ca65f(0x5a7), C['52'] = _0x4ca65f(0xc5), C['53'] = '1&#838;', C['54'] = _0x4ca65f(0x3b7), C['55'] = _0x4ca65f(0x16a), C['56'] = _0x4ca65f(0x56e), C['57'] = _0x4ca65f(0x29e), C['58'] = _0x4ca65f(0x355), C['59'] = '7&#838;', C['60'] = _0x4ca65f(0x36c), C['61'] = _0x4ca65f(0x36f), C['62'] = '0&#838;';
var D = {};
D['1'] = _0x4ca65f(0x480), D['2'] = _0x4ca65f(0xe6), D['3'] = _0x4ca65f(0x167), D['4'] = 'd&#826;', D['5'] = _0x4ca65f(0x4e7), D['6'] = _0x4ca65f(0x1e0), D['7'] = _0x4ca65f(0xe8), D['8'] = _0x4ca65f(0x143), D['9'] = _0x4ca65f(0x528), D['10'] = _0x4ca65f(0x2dd), D['11'] = _0x4ca65f(0x116), D['12'] = _0x4ca65f(0x3f7), D['13'] = _0x4ca65f(0x3e4), D['14'] = _0x4ca65f(0x1bb), D['15'] = _0x4ca65f(0xd3), D['16'] = _0x4ca65f(0x1b8), D['17'] = _0x4ca65f(0xc9), D['18'] = _0x4ca65f(0x3f2), D['19'] = _0x4ca65f(0x40a), D['20'] = _0x4ca65f(0x15b), D['21'] = 'u&#826;', D['22'] = _0x4ca65f(0x484), D['23'] = _0x4ca65f(0x1e3), D['24'] = _0x4ca65f(0x30d), D['25'] = _0x4ca65f(0x3f6), D['26'] = _0x4ca65f(0x28c), D['27'] = 'A&#826;', D['28'] = _0x4ca65f(0x3ef), D['29'] = _0x4ca65f(0x2cb), D['30'] = 'D&#826;', D['31'] = _0x4ca65f(0x33d), D['32'] = 'F&#826;', D['33'] = 'G&#826;', D['34'] = _0x4ca65f(0x549), D['35'] = _0x4ca65f(0xb9), D['36'] = 'J&#826;', D['37'] = _0x4ca65f(0x43d), D['38'] = _0x4ca65f(0x1e9), D['39'] = _0x4ca65f(0x3ed), D['40'] = _0x4ca65f(0x274), D['41'] = _0x4ca65f(0x281), D['42'] = _0x4ca65f(0x3bd), D['43'] = _0x4ca65f(0x4ac), D['44'] = _0x4ca65f(0x5a2), D['45'] = _0x4ca65f(0x16d), D['46'] = _0x4ca65f(0x5a1), D['47'] = _0x4ca65f(0x1d1), D['48'] = _0x4ca65f(0x1d4), D['49'] = 'W&#826;', D['50'] = _0x4ca65f(0x1db), D['51'] = _0x4ca65f(0x467), D['52'] = _0x4ca65f(0x22e), D['53'] = _0x4ca65f(0x2d2), D['54'] = _0x4ca65f(0x55b), D['55'] = _0x4ca65f(0x13c), D['56'] = _0x4ca65f(0x41f), D['57'] = _0x4ca65f(0x38a), D['58'] = '6&#826;', D['59'] = _0x4ca65f(0x54d), D['60'] = _0x4ca65f(0x3d1), D['61'] = _0x4ca65f(0x4cb), D['62'] = '0&#826;';
var E = {};
E['1'] = _0x4ca65f(0xd7), E['2'] = _0x4ca65f(0x3c8), E['3'] = _0x4ca65f(0x377), E['4'] = 'd&#857;', E['5'] = 'e&#857;', E['6'] = _0x4ca65f(0x223), E['7'] = 'g&#857;', E['8'] = 'h&#857;', E['9'] = 'i&#857;', E['10'] = _0x4ca65f(0x2eb), E['11'] = _0x4ca65f(0xc6), E['12'] = _0x4ca65f(0x410), E['13'] = 'm&#857;', E['14'] = 'n&#857;', E['15'] = 'o&#857;', E['16'] = _0x4ca65f(0x382), E['17'] = _0x4ca65f(0x45b), E['18'] = _0x4ca65f(0x270), E['19'] = 's&#857;', E['20'] = _0x4ca65f(0x1b2), E['21'] = _0x4ca65f(0x3ec), E['22'] = _0x4ca65f(0x370), E['23'] = _0x4ca65f(0x2d8), E['24'] = _0x4ca65f(0x424), E['25'] = _0x4ca65f(0x58e), E['26'] = _0x4ca65f(0x573), E['27'] = _0x4ca65f(0x255), E['28'] = _0x4ca65f(0x3d2), E['29'] = _0x4ca65f(0x258), E['30'] = _0x4ca65f(0x453), E['31'] = _0x4ca65f(0x1cc), E['32'] = _0x4ca65f(0x154), E['33'] = _0x4ca65f(0x13e), E['34'] = 'H&#857;', E['35'] = _0x4ca65f(0x3a4), E['36'] = _0x4ca65f(0x1f2), E['37'] = 'K&#857;', E['38'] = _0x4ca65f(0x104), E['39'] = _0x4ca65f(0x2bb), E['40'] = _0x4ca65f(0xdc), E['41'] = _0x4ca65f(0x282), E['42'] = 'P&#857;', E['43'] = _0x4ca65f(0x183), E['44'] = _0x4ca65f(0xf4), E['45'] = _0x4ca65f(0x2c9), E['46'] = _0x4ca65f(0x3a1), E['47'] = _0x4ca65f(0x229), E['48'] = 'V&#857;', E['49'] = _0x4ca65f(0x4f6), E['50'] = 'X&#857;', E['51'] = _0x4ca65f(0x391), E['52'] = 'Z&#857;', E['53'] = _0x4ca65f(0x4db), E['54'] = _0x4ca65f(0x163), E['55'] = _0x4ca65f(0x202), E['56'] = _0x4ca65f(0x2bc), E['57'] = _0x4ca65f(0x23f), E['58'] = _0x4ca65f(0x4dc), E['59'] = _0x4ca65f(0x33f), E['60'] = _0x4ca65f(0x2ea), E['61'] = '9&#857;', E['62'] = _0x4ca65f(0x56c);
var F = {};
F['1'] = _0x4ca65f(0xdd), F['2'] = _0x4ca65f(0x18a), F['3'] = 'c&#799;', F['4'] = _0x4ca65f(0x40f), F['5'] = _0x4ca65f(0x4d2), F['6'] = _0x4ca65f(0x265), F['7'] = _0x4ca65f(0x1fe), F['8'] = 'h&#799;', F['9'] = 'i&#799;', F['10'] = 'j&#799;', F['11'] = 'k&#799;', F['12'] = _0x4ca65f(0x1a8), F['13'] = 'm&#799;', F['14'] = _0x4ca65f(0x413), F['15'] = _0x4ca65f(0x316), F['16'] = 'p&#799;', F['17'] = _0x4ca65f(0x598), F['18'] = _0x4ca65f(0x153), F['19'] = 's&#799;', F['20'] = _0x4ca65f(0x431), F['21'] = _0x4ca65f(0x2b4), F['22'] = _0x4ca65f(0x4c5), F['23'] = _0x4ca65f(0x10a), F['24'] = _0x4ca65f(0x55e), F['25'] = _0x4ca65f(0x131), F['26'] = 'z&#799;', F['27'] = _0x4ca65f(0xe4), F['28'] = 'B&#799;', F['29'] = _0x4ca65f(0x2d5), F['30'] = _0x4ca65f(0x124), F['31'] = _0x4ca65f(0x3a0), F['32'] = _0x4ca65f(0x451), F['33'] = _0x4ca65f(0x315), F['34'] = _0x4ca65f(0x39e), F['35'] = 'I&#799;', F['36'] = _0x4ca65f(0x554), F['37'] = _0x4ca65f(0x172), F['38'] = 'L&#799;', F['39'] = _0x4ca65f(0x2a5), F['40'] = _0x4ca65f(0x4bc), F['41'] = _0x4ca65f(0x263), F['42'] = _0x4ca65f(0x495), F['43'] = _0x4ca65f(0x36a), F['44'] = _0x4ca65f(0x21a), F['45'] = _0x4ca65f(0x2ef), F['46'] = _0x4ca65f(0x1e4), F['47'] = _0x4ca65f(0x380), F['48'] = _0x4ca65f(0x331), F['49'] = _0x4ca65f(0x1e6), F['50'] = 'X&#799;', F['51'] = _0x4ca65f(0x571), F['52'] = _0x4ca65f(0x429), F['53'] = _0x4ca65f(0x57c), F['54'] = '2&#799;', F['55'] = _0x4ca65f(0x20b), F['56'] = _0x4ca65f(0x12a), F['57'] = _0x4ca65f(0x308), F['58'] = _0x4ca65f(0x32b), F['59'] = _0x4ca65f(0x337), F['60'] = _0x4ca65f(0x232), F['61'] = _0x4ca65f(0x4ad), F['62'] = _0x4ca65f(0x181);
var G = {};
G['1'] = 'a&#846;', G['2'] = _0x4ca65f(0x443), G['3'] = 'c&#846;', G['4'] = _0x4ca65f(0x1fc), G['5'] = 'e&#846;', G['6'] = _0x4ca65f(0x1fd), G['7'] = _0x4ca65f(0x445), G['8'] = _0x4ca65f(0x4ea), G['9'] = _0x4ca65f(0x401), G['10'] = _0x4ca65f(0xbb), G['11'] = 'k&#846;', G['12'] = _0x4ca65f(0x101), G['13'] = _0x4ca65f(0x426), G['14'] = 'n&#846;', G['15'] = _0x4ca65f(0x13f), G['16'] = _0x4ca65f(0x49f), G['17'] = _0x4ca65f(0x17b), G['18'] = _0x4ca65f(0x261), G['19'] = _0x4ca65f(0x439), G['20'] = _0x4ca65f(0x386), G['21'] = _0x4ca65f(0x3ab), G['22'] = _0x4ca65f(0x260), G['23'] = _0x4ca65f(0x4c0), G['24'] = 'x&#846;', G['25'] = _0x4ca65f(0x4fd), G['26'] = 'z&#846;', G['27'] = _0x4ca65f(0x2fb), G['28'] = 'B&#846;', G['29'] = 'C&#846;', G['30'] = 'D&#846;', G['31'] = _0x4ca65f(0x225), G['32'] = 'F&#846;', G['33'] = 'G&#846;', G['34'] = _0x4ca65f(0x174), G['35'] = 'I&#846;', G['36'] = _0x4ca65f(0x51f), G['37'] = _0x4ca65f(0x561), G['38'] = _0x4ca65f(0x24c), G['39'] = _0x4ca65f(0x362), G['40'] = _0x4ca65f(0x47f), G['41'] = _0x4ca65f(0x379), G['42'] = _0x4ca65f(0x59d), G['43'] = _0x4ca65f(0x569), G['44'] = _0x4ca65f(0xcd), G['45'] = _0x4ca65f(0x2b5), G['46'] = _0x4ca65f(0x481), G['47'] = 'U&#846;', G['48'] = 'V&#846;', G['49'] = _0x4ca65f(0x430), G['50'] = _0x4ca65f(0x14a), G['51'] = _0x4ca65f(0x405), G['52'] = _0x4ca65f(0x459), G['53'] = _0x4ca65f(0x389), G['54'] = _0x4ca65f(0x58b), G['55'] = _0x4ca65f(0x182), G['56'] = _0x4ca65f(0x112), G['57'] = _0x4ca65f(0x41e), G['58'] = _0x4ca65f(0x19e), G['59'] = _0x4ca65f(0x14d), G['60'] = '8&#846;', G['61'] = _0x4ca65f(0x1aa), G['62'] = _0x4ca65f(0x188);
var H = {};
H['1'] = _0x4ca65f(0x321), H['2'] = _0x4ca65f(0x417), H['3'] = 'c&#829;&#851;', H['4'] = _0x4ca65f(0x2e5), H['5'] = _0x4ca65f(0x2f3), H['6'] = 'f&#829;&#851;', H['7'] = _0x4ca65f(0x512), H['8'] = _0x4ca65f(0xe2), H['9'] = _0x4ca65f(0x2c8), H['10'] = 'j&#829;&#851;', H['11'] = _0x4ca65f(0x243), H['12'] = _0x4ca65f(0x513), H['13'] = 'm&#829;&#851;', H['14'] = 'n&#829;&#851;', H['15'] = _0x4ca65f(0x2be), H['16'] = _0x4ca65f(0x1bf), H['17'] = 'q&#829;&#851;', H['18'] = _0x4ca65f(0x279), H['19'] = _0x4ca65f(0x49e), H['20'] = _0x4ca65f(0x352), H['21'] = 'u&#829;&#851;', H['22'] = _0x4ca65f(0x58c), H['23'] = _0x4ca65f(0x30b), H['24'] = _0x4ca65f(0x44c), H['25'] = _0x4ca65f(0x3e3), H['26'] = _0x4ca65f(0x3f0), H['27'] = 'A&#829;&#851;', H['28'] = _0x4ca65f(0x43f), H['29'] = _0x4ca65f(0x15c), H['30'] = _0x4ca65f(0x22f), H['31'] = _0x4ca65f(0x1b3), H['32'] = _0x4ca65f(0x47d), H['33'] = _0x4ca65f(0xbd), H['34'] = _0x4ca65f(0x4bb), H['35'] = _0x4ca65f(0x117), H['36'] = _0x4ca65f(0x158), H['37'] = _0x4ca65f(0x165), H['38'] = 'L&#829;&#851;', H['39'] = _0x4ca65f(0x26c), H['40'] = _0x4ca65f(0x137), H['41'] = 'O&#829;&#851;', H['42'] = 'P&#829;&#851;', H['43'] = 'Q&#829;&#851;', H['44'] = _0x4ca65f(0x52f), H['45'] = _0x4ca65f(0x12b), H['46'] = 'T&#829;&#851;', H['47'] = _0x4ca65f(0x3b0), H['48'] = _0x4ca65f(0x4d4), H['49'] = _0x4ca65f(0x33c), H['50'] = 'X&#829;&#851;', H['51'] = _0x4ca65f(0x2bd), H['52'] = 'Z&#829;&#851;', H['53'] = _0x4ca65f(0x491), H['54'] = _0x4ca65f(0x32a), H['55'] = _0x4ca65f(0x55f), H['56'] = _0x4ca65f(0x272), H['57'] = '5&#829;&#851;', H['58'] = _0x4ca65f(0x533), H['59'] = _0x4ca65f(0x10e), H['60'] = _0x4ca65f(0x501), H['61'] = '9&#829;&#851;', H['62'] = _0x4ca65f(0x1d9);
var I = {};
I['1'] = _0x4ca65f(0x3cb), I['2'] = '&#120459;&#823;', I['3'] = '&#120460;&#823;', I['4'] = '&#120461;&#823;', I['5'] = '&#120462;&#823;', I['6'] = _0x4ca65f(0xe0), I['7'] = _0x4ca65f(0x580), I['8'] = _0x4ca65f(0x2c4), I['9'] = _0x4ca65f(0x3b2), I['10'] = _0x4ca65f(0x485), I['11'] = _0x4ca65f(0x5a5), I['12'] = _0x4ca65f(0x2a4), I['13'] = _0x4ca65f(0x54a), I['14'] = _0x4ca65f(0x3b9), I['15'] = _0x4ca65f(0x217), I['16'] = _0x4ca65f(0x30e), I['17'] = _0x4ca65f(0x435), I['18'] = _0x4ca65f(0xc1), I['19'] = _0x4ca65f(0x1c3), I['20'] = _0x4ca65f(0x415), I['21'] = _0x4ca65f(0xe9), I['22'] = '&#120479;&#823;', I['23'] = _0x4ca65f(0x4b9), I['24'] = _0x4ca65f(0x121), I['25'] = _0x4ca65f(0x416), I['26'] = '&#120483;&#823;', I['27'] = '&#120432;&#823;', I['28'] = _0x4ca65f(0x210), I['29'] = _0x4ca65f(0x31c), I['30'] = _0x4ca65f(0x218), I['31'] = _0x4ca65f(0x195), I['32'] = '&#120437;&#823;', I['33'] = _0x4ca65f(0x2e3), I['34'] = _0x4ca65f(0x292), I['35'] = _0x4ca65f(0x2aa), I['36'] = _0x4ca65f(0x457), I['37'] = _0x4ca65f(0x3f1), I['38'] = _0x4ca65f(0x562), I['39'] = _0x4ca65f(0x1cd), I['40'] = _0x4ca65f(0x340), I['41'] = _0x4ca65f(0x49a), I['42'] = _0x4ca65f(0x1e7), I['43'] = _0x4ca65f(0xfe), I['44'] = _0x4ca65f(0x50f), I['45'] = _0x4ca65f(0x5a8), I['46'] = _0x4ca65f(0x12e), I['47'] = _0x4ca65f(0x374), I['48'] = _0x4ca65f(0x1ed), I['49'] = _0x4ca65f(0x4cd), I['50'] = _0x4ca65f(0x2b2), I['51'] = _0x4ca65f(0x141), I['52'] = _0x4ca65f(0x26b), I['53'] = _0x4ca65f(0x363), I['54'] = _0x4ca65f(0x469), I['55'] = _0x4ca65f(0x3aa), I['56'] = _0x4ca65f(0x3a9), I['57'] = _0x4ca65f(0x203), I['58'] = '&#120828;&#823;', I['59'] = _0x4ca65f(0x36d), I['60'] = _0x4ca65f(0x2ca), I['61'] = _0x4ca65f(0x471), I['62'] = _0x4ca65f(0x406);
var J = {};
J['1'] = _0x4ca65f(0x235), J['2'] = _0x4ca65f(0x58d), J['3'] = _0x4ca65f(0x425), J['4'] = _0x4ca65f(0x1be), J['5'] = _0x4ca65f(0x39b), J['6'] = 'f&#866;', J['7'] = _0x4ca65f(0x3dc), J['8'] = _0x4ca65f(0x555), J['9'] = _0x4ca65f(0x567), J['10'] = _0x4ca65f(0x304), J['11'] = 'k&#866;', J['12'] = _0x4ca65f(0x227), J['13'] = _0x4ca65f(0x23e), J['14'] = _0x4ca65f(0x4ef), J['15'] = 'o&#866;', J['16'] = _0x4ca65f(0x488), J['17'] = _0x4ca65f(0x4c4), J['18'] = _0x4ca65f(0x115), J['19'] = _0x4ca65f(0x3fd), J['20'] = _0x4ca65f(0x186), J['21'] = _0x4ca65f(0x3a8), J['22'] = _0x4ca65f(0x4b0), J['23'] = _0x4ca65f(0x526), J['24'] = _0x4ca65f(0x2e4), J['25'] = _0x4ca65f(0x1dc), J['26'] = 'z&#866;', J['27'] = _0x4ca65f(0x492), J['28'] = 'B&#866;', J['29'] = 'C&#866;', J['30'] = 'D&#866;', J['31'] = _0x4ca65f(0x336), J['32'] = 'F&#866;', J['33'] = _0x4ca65f(0x49d), J['34'] = _0x4ca65f(0x369), J['35'] = 'I&#866;', J['36'] = _0x4ca65f(0x2b9), J['37'] = 'K&#866;', J['38'] = _0x4ca65f(0x19d), J['39'] = _0x4ca65f(0x1a6), J['40'] = _0x4ca65f(0x334), J['41'] = _0x4ca65f(0x570), J['42'] = _0x4ca65f(0x256), J['43'] = _0x4ca65f(0x519), J['44'] = _0x4ca65f(0x46f), J['45'] = _0x4ca65f(0x333), J['46'] = _0x4ca65f(0x276), J['47'] = _0x4ca65f(0x43c), J['48'] = _0x4ca65f(0x1b0), J['49'] = 'W&#866;', J['50'] = _0x4ca65f(0x4ae), J['51'] = _0x4ca65f(0x25f), J['52'] = 'Z&#866;', J['53'] = '1&#866;', J['54'] = '2&#866;', J['55'] = _0x4ca65f(0x319), J['56'] = '4&#866;', J['57'] = '5&#866;', J['58'] = _0x4ca65f(0x330), J['59'] = _0x4ca65f(0x133), J['60'] = _0x4ca65f(0x3fa), J['61'] = '9&#866;', J['62'] = _0x4ca65f(0x3b6);
var K = {};
K['1'] = _0x4ca65f(0x345), K['2'] = _0x4ca65f(0x29d), K['3'] = _0x4ca65f(0x5a3), K['4'] = 'd&#828;', K['5'] = _0x4ca65f(0x1e2), K['6'] = _0x4ca65f(0xb8), K['7'] = _0x4ca65f(0x473), K['8'] = _0x4ca65f(0x1a9), K['9'] = _0x4ca65f(0x4a6), K['10'] = _0x4ca65f(0x510), K['11'] = 'k&#828;', K['12'] = _0x4ca65f(0x146), K['13'] = 'm&#828;', K['14'] = 'n&#828;', K['15'] = 'o&#828;', K['16'] = _0x4ca65f(0x2f2), K['17'] = _0x4ca65f(0x31a), K['18'] = 'r&#828;', K['19'] = _0x4ca65f(0x4a3), K['20'] = _0x4ca65f(0x18e), K['21'] = _0x4ca65f(0xf8), K['22'] = _0x4ca65f(0x27b), K['23'] = _0x4ca65f(0x219), K['24'] = _0x4ca65f(0x3af), K['25'] = 'y&#828;', K['26'] = 'z&#828;', K['27'] = _0x4ca65f(0x3c0), K['28'] = 'B&#828;', K['29'] = 'C&#828;', K['30'] = 'D&#828;', K['31'] = _0x4ca65f(0x4bd), K['32'] = _0x4ca65f(0x14b), K['33'] = _0x4ca65f(0x56b), K['34'] = _0x4ca65f(0x29f), K['35'] = _0x4ca65f(0x3f8), K['36'] = _0x4ca65f(0x3ea), K['37'] = _0x4ca65f(0x34f), K['38'] = _0x4ca65f(0x4f0), K['39'] = _0x4ca65f(0x460), K['40'] = _0x4ca65f(0x353), K['41'] = _0x4ca65f(0x507), K['42'] = _0x4ca65f(0x346), K['43'] = 'Q&#828;', K['44'] = _0x4ca65f(0x239), K['45'] = _0x4ca65f(0xda), K['46'] = _0x4ca65f(0x22b), K['47'] = _0x4ca65f(0x302), K['48'] = _0x4ca65f(0x28b), K['49'] = _0x4ca65f(0x37e), K['50'] = 'X&#828;', K['51'] = _0x4ca65f(0x1d3), K['52'] = 'Z&#828;', K['53'] = _0x4ca65f(0x25d), K['54'] = _0x4ca65f(0x42b), K['55'] = '3&#828;', K['56'] = '4&#828;', K['57'] = _0x4ca65f(0x280), K['58'] = _0x4ca65f(0x309), K['59'] = '7&#828;', K['60'] = _0x4ca65f(0xd9), K['61'] = _0x4ca65f(0x4fe), K['62'] = '0&#828;';
var L = {};
L['s1'] = h, L['s2'] = i, L['s3'] = j, L['s4'] = k, L['s5'] = l, L['s6'] = m, L['s7'] = n, L['s8'] = o, L['s9'] = p, L['s10'] = q, L[_0x4ca65f(0x527)] = r, L['s12'] = s, L[_0x4ca65f(0x444)] = t, L[_0x4ca65f(0x114)] = u, L[_0x4ca65f(0x36b)] = v, L['s16'] = w, L['s17'] = x, L['s18'] = y, L['s19'] = z, L[_0x4ca65f(0x30a)] = A, L[_0x4ca65f(0x1af)] = B, L['s22'] = C, L[_0x4ca65f(0x43a)] = D, L['s24'] = E, L['s25'] = F, L[_0x4ca65f(0x325)] = G, L[_0x4ca65f(0x3e9)] = H, L['s29'] = I, L[_0x4ca65f(0x387)] = J, L[_0x4ca65f(0x3c4)] = K;
var newtext = L;

function Change(_0x3f75b7, _0x531378) {
    var _0x37f02a = _0x4ca65f,
        _0x14c5ea = '',
        _0x3f75b7 = _0x3f75b7;
    if (_0x3f75b7['length'] == 0x0) return;
    for (i = 0x0; i < _0x3f75b7[_0x37f02a(0x4ce)]; i++) {
        var _0x46ed75 = _0x3f75b7[_0x37f02a(0x27c)](i),
            _0x432656 = normal[_0x37f02a(0x50b)](_0x46ed75) + 0x1;
        if (_0x46ed75 == '\x20') _0x14c5ea += '\x20';
        else !_0x432656 ? _0x14c5ea += _0x46ed75 : _0x14c5ea += newtext[_0x531378][_0x432656];
    }
    return _0x14c5ea;
}
var M = {};
M['0'] = '0', M['1'] = '1', M['2'] = '2', M['3'] = '3', M['4'] = '4', M['5'] = '5', M['6'] = '6', M['7'] = '7', M['8'] = '8', M['9'] = '9', M['a'] = 'ᗩ', M['b'] = 'ᗷ', M['c'] = 'ᑢ', M['d'] = 'ᕲ', M['e'] = 'ᘿ', M['f'] = 'ᖴ', M['g'] = 'ᘜ', M['h'] = 'ᕼ', M['i'] = 'ᓰ', M['j'] = 'ᒚ', M['k'] = 'ᖽᐸ', M['l'] = 'ᒪ', M['m'] = 'ᘻ', M['n'] = 'ᘉ', M['o'] = 'ᓍ', M['p'] = 'ᕵ', M['q'] = 'ᕴ', M['r'] = 'ᖇ', M['s'] = 'S', M['t'] = 'ᖶ', M['u'] = 'ᑘ', M['v'] = 'ᐺ', M['w'] = 'ᘺ', M['x'] = '᙭', M['y'] = 'ᖻ', M['z'] = 'ᗱ', M['A'] = 'ᗩ', M['B'] = 'ᗷ', M['C'] = 'ᑢ', M['D'] = 'ᕲ', M['E'] = 'ᘿ', M['F'] = 'ᖴ', M['G'] = 'ᘜ', M['H'] = 'ᕼ', M['I'] = 'ᓰ', M['J'] = 'ᒚ', M['K'] = 'ᖽᐸ', M['L'] = 'ᒪ', M['M'] = 'ᘻ', M['N'] = 'ᘉ', M['O'] = 'ᓍ', M['P'] = 'ᕵ', M['Q'] = 'ᕴ', M['R'] = 'ᖇ', M['S'] = 'S', M['T'] = 'ᖶ', M['U'] = 'ᑘ', M['V'] = 'ᐺ', M['W'] = 'ᘺ', M['X'] = '᙭', M['Y'] = 'ᖻ', M['Z'] = 'ᗱ';
const futureAlienCharMap = M;
var N = {};
N['0'] = '0', N['1'] = '1', N['2'] = '2', N['3'] = '3', N['4'] = '4', N['5'] = '5', N['6'] = '6', N['7'] = '7', N['8'] = '8', N['9'] = '9', N['a'] = 'ค', N['b'] = '๖', N['c'] = '¢', N['d'] = '໓', N['e'] = 'ē', N['f'] = 'f', N['g'] = 'ງ', N['h'] = 'h', N['i'] = 'i', N['j'] = 'ว', N['k'] = 'k', N['l'] = 'l', N['m'] = '๓', N['n'] = 'ຖ', N['o'] = '໐', N['p'] = 'p', N['q'] = '๑', N['r'] = 'r', N['s'] = 'Ş', N['t'] = 't', N['u'] = 'น', N['v'] = 'ง', N['w'] = 'ຟ', N['x'] = 'x', N['y'] = 'ฯ', N['z'] = 'ຊ', N['A'] = 'ค', N['B'] = '๖', N['C'] = '¢', N['D'] = '໓', N['E'] = 'ē', N['F'] = 'f', N['G'] = 'ງ', N['H'] = 'h', N['I'] = 'i', N['J'] = 'ว', N['K'] = 'k', N['L'] = 'l', N['M'] = '๓', N['N'] = 'ຖ', N['O'] = '໐', N['P'] = 'p', N['Q'] = '๑', N['R'] = 'r', N['S'] = 'Ş', N['T'] = 't', N['U'] = 'น', N['V'] = 'ง', N['W'] = 'ຟ', N['X'] = 'x', N['Y'] = 'ฯ', N['Z'] = 'ຊ';
const squiggle6CharMap = N;
var O = {};
O['0'] = '0', O['1'] = '1', O['2'] = '2', O['3'] = '3', O['4'] = '4', O['5'] = '5', O['6'] = '6', O['7'] = '7', O['8'] = '8', O['9'] = '9', O['a'] = 'ą', O['b'] = 'ც', O['c'] = 'ƈ', O['d'] = 'ɖ', O['e'] = 'ɛ', O['f'] = 'ʄ', O['g'] = 'ɠ', O['h'] = 'ɧ', O['i'] = 'ı', O['j'] = 'ʝ', O['k'] = 'ƙ', O['l'] = 'Ɩ', O['m'] = 'ɱ', O['n'] = 'ŋ', O['o'] = 'ơ', O['p'] = '℘', O['q'] = 'զ', O['r'] = 'ཞ', O['s'] = 'ʂ', O['t'] = 'ɬ', O['u'] = 'ų', O['v'] = '۷', O['w'] = 'ῳ', O['x'] = 'ҳ', O['y'] = 'ყ', O['z'] = 'ʑ', O['A'] = 'ą', O['B'] = 'ც', O['C'] = 'ƈ', O['D'] = 'ɖ', O['E'] = 'ɛ', O['F'] = 'ʄ', O['G'] = 'ɠ', O['H'] = 'ɧ', O['I'] = 'ı', O['J'] = 'ʝ', O['K'] = 'ƙ', O['L'] = 'Ɩ', O['M'] = 'ɱ', O['N'] = 'ŋ', O['O'] = 'ơ', O['P'] = '℘', O['Q'] = 'զ', O['R'] = 'ཞ', O['S'] = 'ʂ', O['T'] = 'ɬ', O['U'] = 'ų', O['V'] = '۷', O['W'] = 'ῳ', O['X'] = 'ҳ', O['Y'] = 'ყ', O['Z'] = 'ʑ';
const squiggle5CharMap = O;
var P = {};
P['0'] = '0', P['1'] = '1', P['2'] = '2', P['3'] = '3', P['4'] = '4', P['5'] = '5', P['6'] = '6', P['7'] = '7', P['8'] = '8', P['9'] = '9', P['a'] = 'ﾑ', P['b'] = '乃', P['c'] = 'ᄃ', P['d'] = 'り', P['e'] = '乇', P['f'] = 'ｷ', P['g'] = 'ム', P['h'] = 'ん', P['i'] = 'ﾉ', P['j'] = 'ﾌ', P['k'] = 'ズ', P['l'] = 'ﾚ', P['m'] = 'ﾶ', P['n'] = '刀', P['o'] = 'の', P['p'] = 'ｱ', P['q'] = 'ゐ', P['r'] = '尺', P['s'] = '丂', P['t'] = 'ｲ', P['u'] = 'ひ', P['v'] = '√', P['w'] = 'W', P['x'] = 'ﾒ', P['y'] = 'ﾘ', P['z'] = '乙', P['A'] = 'ﾑ', P['B'] = '乃', P['C'] = 'ᄃ', P['D'] = 'り', P['E'] = '乇', P['F'] = 'ｷ', P['G'] = 'ム', P['H'] = 'ん', P['I'] = 'ﾉ', P['J'] = 'ﾌ', P['K'] = 'ズ', P['L'] = 'ﾚ', P['M'] = 'ﾶ', P['N'] = '刀', P['O'] = 'の', P['P'] = 'ｱ', P['Q'] = 'ゐ', P['R'] = '尺', P['S'] = '丂', P['T'] = 'ｲ', P['U'] = 'ひ', P['V'] = '√', P['W'] = 'W', P['X'] = 'ﾒ', P['Y'] = 'ﾘ', P['Z'] = '乙';
const asianStyle2CharMap = P;
var Q = {};
Q['0'] = '0', Q['1'] = '1', Q['2'] = '2', Q['3'] = '3', Q['4'] = '4', Q['5'] = '5', Q['6'] = '6', Q['7'] = '7', Q['8'] = '8', Q['9'] = '9', Q['a'] = '卂', Q['b'] = '乃', Q['c'] = '匚', Q['d'] = 'ᗪ', Q['e'] = '乇', Q['f'] = '千', Q['g'] = 'Ꮆ', Q['h'] = '卄', Q['i'] = '丨', Q['j'] = 'ﾌ', Q['k'] = 'Ҝ', Q['l'] = 'ㄥ', Q['m'] = '爪', Q['n'] = '几', Q['o'] = 'ㄖ', Q['p'] = '卩', Q['q'] = 'Ɋ', Q['r'] = '尺', Q['s'] = '丂', Q['t'] = 'ㄒ', Q['u'] = 'ㄩ', Q['v'] = 'ᐯ', Q['w'] = '山', Q['x'] = '乂', Q['y'] = 'ㄚ', Q['z'] = '乙', Q['A'] = '卂', Q['B'] = '乃', Q['C'] = '匚', Q['D'] = 'ᗪ', Q['E'] = '乇', Q['F'] = '千', Q['G'] = 'Ꮆ', Q['H'] = '卄', Q['I'] = '丨', Q['J'] = 'ﾌ', Q['K'] = 'Ҝ', Q['L'] = 'ㄥ', Q['M'] = '爪', Q['N'] = '几', Q['O'] = 'ㄖ', Q['P'] = '卩', Q['Q'] = 'Ɋ', Q['R'] = '尺', Q['S'] = '丂', Q['T'] = 'ㄒ', Q['U'] = 'ㄩ', Q['V'] = 'ᐯ', Q['W'] = '山', Q['X'] = '乂', Q['Y'] = 'ㄚ', Q['Z'] = '乙';
const asianStyleCharMap = Q;
var R = {};
R['0'] = '0', R['1'] = '1', R['2'] = '2', R['3'] = '3', R['4'] = '4', R['5'] = '5', R['6'] = '6', R['7'] = '7', R['8'] = '8', R['9'] = '9', R['a'] = '🄰', R['b'] = '🄱', R['c'] = '🄲', R['d'] = '🄳', R['e'] = '🄴', R['f'] = '🄵', R['g'] = '🄶', R['h'] = '🄷', R['i'] = '🄸', R['j'] = '🄹', R['k'] = '🄺', R['l'] = '🄻', R['m'] = '🄼', R['n'] = '🄽', R['o'] = '🄾', R['p'] = '🄿', R['q'] = '🅀', R['r'] = '🅁', R['s'] = '🅂', R['t'] = '🅃', R['u'] = '🅄', R['v'] = '🅅', R['w'] = '🅆', R['x'] = '🅇', R['y'] = '🅈', R['z'] = '🅉', R['A'] = '🄰', R['B'] = '🄱', R['C'] = '🄲', R['D'] = '🄳', R['E'] = '🄴', R['F'] = '🄵', R['G'] = '🄶', R['H'] = '🄷', R['I'] = '🄸', R['J'] = '🄹', R['K'] = '🄺', R['L'] = '🄻', R['M'] = '🄼', R['N'] = '🄽', R['O'] = '🄾', R['P'] = '🄿', R['Q'] = '🅀', R['R'] = '🅁', R['S'] = '🅂', R['T'] = '🅃', R['U'] = '🅄', R['V'] = '🅅', R['W'] = '🅆', R['X'] = '🅇', R['Y'] = '🅈', R['Z'] = '🅉';
const squaresCharMap = R;
var S = {};
S['0'] = '0', S['1'] = '1', S['2'] = '2', S['3'] = '3', S['4'] = '4', S['5'] = '5', S['6'] = '6', S['7'] = '7', S['8'] = '8', S['9'] = '9', S['a'] = 'Ꮧ', S['b'] = 'Ᏸ', S['c'] = 'ፈ', S['d'] = 'Ꮄ', S['e'] = 'Ꮛ', S['f'] = 'Ꭶ', S['g'] = 'Ꮆ', S['h'] = 'Ꮒ', S['i'] = 'Ꭵ', S['j'] = 'Ꮰ', S['k'] = 'Ꮶ', S['l'] = 'Ꮭ', S['m'] = 'Ꮇ', S['n'] = 'Ꮑ', S['o'] = 'Ꭷ', S['p'] = 'Ꭾ', S['q'] = 'Ꭴ', S['r'] = 'Ꮢ', S['s'] = 'Ꮥ', S['t'] = 'Ꮦ', S['u'] = 'Ꮼ', S['v'] = 'Ꮙ', S['w'] = 'Ꮗ', S['x'] = 'ጀ', S['y'] = 'Ꭹ', S['z'] = 'ፚ', S['A'] = 'Ꮧ', S['B'] = 'Ᏸ', S['C'] = 'ፈ', S['D'] = 'Ꮄ', S['E'] = 'Ꮛ', S['F'] = 'Ꭶ', S['G'] = 'Ꮆ', S['H'] = 'Ꮒ', S['I'] = 'Ꭵ', S['J'] = 'Ꮰ', S['K'] = 'Ꮶ', S['L'] = 'Ꮭ', S['M'] = 'Ꮇ', S['N'] = 'Ꮑ', S['O'] = 'Ꭷ', S['P'] = 'Ꭾ', S['Q'] = 'Ꭴ', S['R'] = 'Ꮢ', S['S'] = 'Ꮥ', S['T'] = 'Ꮦ', S['U'] = 'Ꮼ', S['V'] = 'Ꮙ', S['W'] = 'Ꮗ', S['X'] = 'ጀ', S['Y'] = 'Ꭹ', S['Z'] = 'ፚ';
const squiggle4CharMap = S;
var T = {};
T['0'] = '0', T['1'] = '1', T['2'] = '2', T['3'] = '3', T['4'] = '4', T['5'] = '5', T['6'] = '6', T['7'] = '7', T['8'] = '8', T['9'] = '9', T['a'] = 'ᗩ', T['b'] = 'ᗷ', T['c'] = 'ᑕ', T['d'] = 'ᗪ', T['e'] = 'E', T['f'] = 'ᖴ', T['g'] = 'G', T['h'] = 'ᕼ', T['i'] = 'I', T['j'] = 'ᒍ', T['k'] = 'K', T['l'] = 'ᒪ', T['m'] = 'ᗰ', T['n'] = 'ᑎ', T['o'] = 'O', T['p'] = 'ᑭ', T['q'] = 'ᑫ', T['r'] = 'ᖇ', T['s'] = 'ᔕ', T['t'] = 'T', T['u'] = 'ᑌ', T['v'] = 'ᐯ', T['w'] = 'ᗯ', T['x'] = '᙭', T['y'] = 'Y', T['z'] = 'ᘔ', T['A'] = 'ᗩ', T['B'] = 'ᗷ', T['C'] = 'ᑕ', T['D'] = 'ᗪ', T['E'] = 'E', T['F'] = 'ᖴ', T['G'] = 'G', T['H'] = 'ᕼ', T['I'] = 'I', T['J'] = 'ᒍ', T['K'] = 'K', T['L'] = 'ᒪ', T['M'] = 'ᗰ', T['N'] = 'ᑎ', T['O'] = 'O', T['P'] = 'ᑭ', T['Q'] = 'ᑫ', T['R'] = 'ᖇ', T['S'] = 'ᔕ', T['T'] = 'T', T['U'] = 'ᑌ', T['V'] = 'ᐯ', T['W'] = 'ᗯ', T['X'] = '᙭', T['Y'] = 'Y', T['Z'] = 'ᘔ';
const neonCharMap = T;
var U = {};
U['0'] = '0', U['1'] = '1', U['2'] = '2', U['3'] = '3', U['4'] = '4', U['5'] = '5', U['6'] = '6', U['7'] = '7', U['8'] = '8', U['9'] = '9', U['a'] = 'ǟ', U['b'] = 'ɮ', U['c'] = 'ƈ', U['d'] = 'ɖ', U['e'] = 'ɛ', U['f'] = 'ʄ', U['g'] = 'ɢ', U['h'] = 'ɦ', U['i'] = 'ɨ', U['j'] = 'ʝ', U['k'] = 'ӄ', U['l'] = 'ʟ', U['m'] = 'ʍ', U['n'] = 'ռ', U['o'] = 'օ', U['p'] = 'ք', U['q'] = 'զ', U['r'] = 'ʀ', U['s'] = 'ֆ', U['t'] = 'ȶ', U['u'] = 'ʊ', U['v'] = 'ʋ', U['w'] = 'ա', U['x'] = 'Ӽ', U['y'] = 'ʏ', U['z'] = 'ʐ', U['A'] = 'ǟ', U['B'] = 'ɮ', U['C'] = 'ƈ', U['D'] = 'ɖ', U['E'] = 'ɛ', U['F'] = 'ʄ', U['G'] = 'ɢ', U['H'] = 'ɦ', U['I'] = 'ɨ', U['J'] = 'ʝ', U['K'] = 'ӄ', U['L'] = 'ʟ', U['M'] = 'ʍ', U['N'] = 'ռ', U['O'] = 'օ', U['P'] = 'ք', U['Q'] = 'զ', U['R'] = 'ʀ', U['S'] = 'ֆ', U['T'] = 'ȶ', U['U'] = 'ʊ', U['V'] = 'ʋ', U['W'] = 'ա', U['X'] = 'Ӽ', U['Y'] = 'ʏ', U['Z'] = 'ʐ';
const squiggle3CharMap = U;
var V = {};
V['0'] = '𝟶', V['1'] = '𝟷', V['2'] = '𝟸', V['3'] = '𝟹', V['4'] = '𝟺', V['5'] = '𝟻', V['6'] = '𝟼', V['7'] = '𝟽', V['8'] = '𝟾', V['9'] = '𝟿', V['a'] = '𝚊', V['b'] = '𝚋', V['c'] = '𝚌', V['d'] = '𝚍', V['e'] = '𝚎', V['f'] = '𝚏', V['g'] = '𝚐', V['h'] = '𝚑', V['i'] = '𝚒', V['j'] = '𝚓', V['k'] = '𝚔', V['l'] = '𝚕', V['m'] = '𝚖', V['n'] = '𝚗', V['o'] = '𝚘', V['p'] = '𝚙', V['q'] = '𝚚', V['r'] = '𝚛', V['s'] = '𝚜', V['t'] = '𝚝', V['u'] = '𝚞', V['v'] = '𝚟', V['w'] = '𝚠', V['x'] = '𝚡', V['y'] = '𝚢', V['z'] = '𝚣', V['A'] = '𝙰', V['B'] = '𝙱', V['C'] = '𝙲', V['D'] = '𝙳', V['E'] = '𝙴', V['F'] = '𝙵', V['G'] = '𝙶', V['H'] = '𝙷', V['I'] = '𝙸', V['J'] = '𝙹', V['K'] = '𝙺', V['L'] = '𝙻', V['M'] = '𝙼', V['N'] = '𝙽', V['O'] = '𝙾', V['P'] = '𝙿', V['Q'] = '𝚀', V['R'] = '𝚁', V['S'] = '𝚂', V['T'] = '𝚃', V['U'] = '𝚄', V['V'] = '𝚅', V['W'] = '𝚆', V['X'] = '𝚇', V['Y'] = '𝚈', V['Z'] = '𝚉';
const monospaceCharMap = V;
var W = {};
W['0'] = '0', W['1'] = '1', W['2'] = '2', W['3'] = '3', W['4'] = '4', W['5'] = '5', W['6'] = '6', W['7'] = '7', W['8'] = '8', W['9'] = '9', W['a'] = '𝙖', W['b'] = '𝙗', W['c'] = '𝙘', W['d'] = '𝙙', W['e'] = '𝙚', W['f'] = '𝙛', W['g'] = '𝙜', W['h'] = '𝙝', W['i'] = '𝙞', W['j'] = '𝙟', W['k'] = '𝙠', W['l'] = '𝙡', W['m'] = '𝙢', W['n'] = '𝙣', W['o'] = '𝙤', W['p'] = '𝙥', W['q'] = '𝙦', W['r'] = '𝙧', W['s'] = '𝙨', W['t'] = '𝙩', W['u'] = '𝙪', W['v'] = '𝙫', W['w'] = '𝙬', W['x'] = '𝙭', W['y'] = '𝙮', W['z'] = '𝙯', W['A'] = '𝘼', W['B'] = '𝘽', W['C'] = '𝘾', W['D'] = '𝘿', W['E'] = '𝙀', W['F'] = '𝙁', W['G'] = '𝙂', W['H'] = '𝙃', W['I'] = '𝙄', W['J'] = '𝙅', W['K'] = '𝙆', W['L'] = '𝙇', W['M'] = '𝙈', W['N'] = '𝙉', W['O'] = '𝙊', W['P'] = '𝙋', W['Q'] = '𝙌', W['R'] = '𝙍', W['S'] = '𝙎', W['T'] = '𝙏', W['U'] = '𝙐', W['V'] = '𝙑', W['W'] = '𝙒', W['X'] = '𝙓', W['Y'] = '𝙔', W['Z'] = '𝙕';
const boldItalicCharMap = W;
var X = {};
X['0'] = '𝟎', X['1'] = '𝟏', X['2'] = '𝟐', X['3'] = '𝟑', X['4'] = '𝟒', X['5'] = '𝟓', X['6'] = '𝟔', X['7'] = '𝟕', X['8'] = '𝟖', X['9'] = '𝟗', X['a'] = '𝐚', X['b'] = '𝐛', X['c'] = '𝐜', X['d'] = '𝐝', X['e'] = '𝐞', X['f'] = '𝐟', X['g'] = '𝐠', X['h'] = '𝐡', X['i'] = '𝐢', X['j'] = '𝐣', X['k'] = '𝐤', X['l'] = '𝐥', X['m'] = '𝐦', X['n'] = '𝐧', X['o'] = '𝐨', X['p'] = '𝐩', X['q'] = '𝐪', X['r'] = '𝐫', X['s'] = '𝐬', X['t'] = '𝐭', X['u'] = '𝐮', X['v'] = '𝐯', X['w'] = '𝐰', X['x'] = '𝐱', X['y'] = '𝐲', X['z'] = '𝐳', X['A'] = '𝐀', X['B'] = '𝐁', X['C'] = '𝐂', X['D'] = '𝐃', X['E'] = '𝐄', X['F'] = '𝐅', X['G'] = '𝐆', X['H'] = '𝐇', X['I'] = '𝐈', X['J'] = '𝐉', X['K'] = '𝐊', X['L'] = '𝐋', X['M'] = '𝐌', X['N'] = '𝐍', X['O'] = '𝐎', X['P'] = '𝐏', X['Q'] = '𝐐', X['R'] = '𝐑', X['S'] = '𝐒', X['T'] = '𝐓', X['U'] = '𝐔', X['V'] = '𝐕', X['W'] = '𝐖', X['X'] = '𝐗', X['Y'] = '𝐘', X['Z'] = '𝐙';
const boldCharMap = X;
var Y = {};
Y['0'] = '0', Y['1'] = '1', Y['2'] = '2', Y['3'] = '3', Y['4'] = '4', Y['5'] = '5', Y['6'] = '6', Y['7'] = '7', Y['8'] = '8', Y['9'] = '9', Y['a'] = '𝘢', Y['b'] = '𝘣', Y['c'] = '𝘤', Y['d'] = '𝘥', Y['e'] = '𝘦', Y['f'] = '𝘧', Y['g'] = '𝘨', Y['h'] = '𝘩', Y['i'] = '𝘪', Y['j'] = '𝘫', Y['k'] = '𝘬', Y['l'] = '𝘭', Y['m'] = '𝘮', Y['n'] = '𝘯', Y['o'] = '𝘰', Y['p'] = '𝘱', Y['q'] = '𝘲', Y['r'] = '𝘳', Y['s'] = '𝘴', Y['t'] = '𝘵', Y['u'] = '𝘶', Y['v'] = '𝘷', Y['w'] = '𝘸', Y['x'] = '𝘹', Y['y'] = '𝘺', Y['z'] = '𝘻', Y['A'] = '𝘈', Y['B'] = '𝘉', Y['C'] = '𝘊', Y['D'] = '𝘋', Y['E'] = '𝘌', Y['F'] = '𝘍', Y['G'] = '𝘎', Y['H'] = '𝘏', Y['I'] = '𝘐', Y['J'] = '𝘑', Y['K'] = '𝘒', Y['L'] = '𝘓', Y['M'] = '𝘔', Y['N'] = '𝘕', Y['O'] = '𝘖', Y['P'] = '𝘗', Y['Q'] = '𝘘', Y['R'] = '𝘙', Y['S'] = '𝘚', Y['T'] = '𝘛', Y['U'] = '𝘜', Y['V'] = '𝘝', Y['W'] = '𝘞', Y['X'] = '𝘟', Y['Y'] = '𝘠', Y['Z'] = '𝘡';
const italicCharMap = Y;
var Z = {};
Z['0'] = '0', Z['1'] = '1', Z['2'] = '2', Z['3'] = '3', Z['4'] = '4', Z['5'] = '5', Z['6'] = '6', Z['7'] = '7', Z['8'] = '8', Z['9'] = '9', Z['a'] = 'α', Z['b'] = 'Ⴆ', Z['c'] = 'ƈ', Z['d'] = 'ԃ', Z['e'] = 'ҽ', Z['f'] = 'ϝ', Z['g'] = 'ɠ', Z['h'] = 'ԋ', Z['i'] = 'ι', Z['j'] = 'ʝ', Z['k'] = 'ƙ', Z['l'] = 'ʅ', Z['m'] = 'ɱ', Z['n'] = 'ɳ', Z['o'] = 'σ', Z['p'] = 'ρ', Z['q'] = 'ϙ', Z['r'] = 'ɾ', Z['s'] = 'ʂ', Z['t'] = 'ƚ', Z['u'] = 'υ', Z['v'] = 'ʋ', Z['w'] = 'ɯ', Z['x'] = 'x', Z['y'] = 'ყ', Z['z'] = 'ȥ', Z['A'] = 'A', Z['B'] = 'B', Z['C'] = 'C', Z['D'] = 'D', Z['E'] = 'E', Z['F'] = 'F', Z['G'] = 'G', Z['H'] = 'H', Z['I'] = 'I', Z['J'] = 'J', Z['K'] = 'K', Z['L'] = 'L', Z['M'] = 'M', Z['N'] = 'N', Z['O'] = 'O', Z['P'] = 'P', Z['Q'] = 'Q', Z['R'] = 'R', Z['S'] = 'S', Z['T'] = 'T', Z['U'] = 'U', Z['V'] = 'V', Z['W'] = 'W', Z['X'] = 'X', Z['Y'] = 'Y', Z['Z'] = 'Z';
const squiggle2CharMap = Z;
var a0 = {};
a0['0'] = '0', a0['1'] = '1', a0['2'] = '2', a0['3'] = '3', a0['4'] = '4', a0['5'] = '5', a0['6'] = '6', a0['7'] = '7', a0['8'] = '8', a0['9'] = '9', a0['a'] = '₳', a0['b'] = '฿', a0['c'] = '₵', a0['d'] = 'Đ', a0['e'] = 'Ɇ', a0['f'] = '₣', a0['g'] = '₲', a0['h'] = 'Ⱨ', a0['i'] = 'ł', a0['j'] = 'J', a0['k'] = '₭', a0['l'] = 'Ⱡ', a0['m'] = '₥', a0['n'] = '₦', a0['o'] = 'Ø', a0['p'] = '₱', a0['q'] = 'Q', a0['r'] = 'Ɽ', a0['s'] = '₴', a0['t'] = '₮', a0['u'] = 'Ʉ', a0['v'] = 'V', a0['w'] = '₩', a0['x'] = 'Ӿ', a0['y'] = 'Ɏ', a0['z'] = 'Ⱬ', a0['A'] = '₳', a0['B'] = '฿', a0['C'] = '₵', a0['D'] = 'Đ', a0['E'] = 'Ɇ', a0['F'] = '₣', a0['G'] = '₲', a0['H'] = 'Ⱨ', a0['I'] = 'ł', a0['J'] = 'J', a0['K'] = '₭', a0['L'] = 'Ⱡ', a0['M'] = '₥', a0['N'] = '₦', a0['O'] = 'Ø', a0['P'] = '₱', a0['Q'] = 'Q', a0['R'] = 'Ɽ', a0['S'] = '₴', a0['T'] = '₮', a0['U'] = 'Ʉ', a0['V'] = 'V', a0['W'] = '₩', a0['X'] = 'Ӿ', a0['Y'] = 'Ɏ', a0['Z'] = 'Ⱬ';
const currencyCharMap = a0;
var a1 = {};
a1['0'] = '0', a1['1'] = '1', a1['2'] = '2', a1['3'] = '3', a1['4'] = '4', a1['5'] = '5', a1['6'] = '6', a1['7'] = '7', a1['8'] = '8', a1['9'] = '9', a1['a'] = 'å', a1['b'] = 'ß', a1['c'] = '¢', a1['d'] = 'Ð', a1['e'] = 'ê', a1['f'] = '£', a1['g'] = 'g', a1['h'] = 'h', a1['i'] = 'ï', a1['j'] = 'j', a1['k'] = 'k', a1['l'] = 'l', a1['m'] = 'm', a1['n'] = 'ñ', a1['o'] = 'ð', a1['p'] = 'þ', a1['q'] = 'q', a1['r'] = 'r', a1['s'] = '§', a1['t'] = '†', a1['u'] = 'µ', a1['v'] = 'v', a1['w'] = 'w', a1['x'] = 'x', a1['y'] = '¥', a1['z'] = 'z', a1['A'] = 'Ä', a1['B'] = 'ß', a1['C'] = 'Ç', a1['D'] = 'Ð', a1['E'] = 'È', a1['F'] = '£', a1['G'] = 'G', a1['H'] = 'H', a1['I'] = 'Ì', a1['J'] = 'J', a1['K'] = 'K', a1['L'] = 'L', a1['M'] = 'M', a1['N'] = 'ñ', a1['O'] = 'Ö', a1['P'] = 'þ', a1['Q'] = 'Q', a1['R'] = 'R', a1['S'] = '§', a1['T'] = '†', a1['U'] = 'Ú', a1['V'] = 'V', a1['W'] = 'W', a1['X'] = '×', a1['Y'] = '¥', a1['Z'] = 'Z';
const symbolsCharMap = a1;
var a2 = {};
a2['0'] = '0', a2['1'] = '1', a2['2'] = '2', a2['3'] = '3', a2['4'] = '4', a2['5'] = '5', a2['6'] = '6', a2['7'] = '7', a2['8'] = '8', a2['9'] = '9', a2['a'] = 'α', a2['b'] = 'в', a2['c'] = '¢', a2['d'] = '∂', a2['e'] = 'є', a2['f'] = 'ƒ', a2['g'] = 'g', a2['h'] = 'н', a2['i'] = 'ι', a2['j'] = 'נ', a2['k'] = 'к', a2['l'] = 'ℓ', a2['m'] = 'м', a2['n'] = 'η', a2['o'] = 'σ', a2['p'] = 'ρ', a2['q'] = 'q', a2['r'] = 'я', a2['s'] = 'ѕ', a2['t'] = 'т', a2['u'] = 'υ', a2['v'] = 'ν', a2['w'] = 'ω', a2['x'] = 'χ', a2['y'] = 'у', a2['z'] = 'z', a2['A'] = 'α', a2['B'] = 'в', a2['C'] = '¢', a2['D'] = '∂', a2['E'] = 'є', a2['F'] = 'ƒ', a2['G'] = 'g', a2['H'] = 'н', a2['I'] = 'ι', a2['J'] = 'נ', a2['K'] = 'к', a2['L'] = 'ℓ', a2['M'] = 'м', a2['N'] = 'η', a2['O'] = 'σ', a2['P'] = 'ρ', a2['Q'] = 'q', a2['R'] = 'я', a2['S'] = 'ѕ', a2['T'] = 'т', a2['U'] = 'υ', a2['V'] = 'ν', a2['W'] = 'ω', a2['X'] = 'χ', a2['Y'] = 'у', a2['Z'] = 'z';
const greekCharMap = a2;
var a3 = {};
a3['0'] = '⊘', a3['1'] = '𝟙', a3['2'] = 'ϩ', a3['3'] = 'Ӡ', a3['4'] = '५', a3['5'] = 'Ƽ', a3['6'] = 'Ϭ', a3['7'] = '7', a3['8'] = '𝟠', a3['9'] = '९', a3['a'] = 'ą', a3['b'] = 'ҍ', a3['c'] = 'ç', a3['d'] = 'ժ', a3['e'] = 'ҽ', a3['f'] = 'ƒ', a3['g'] = 'ց', a3['h'] = 'հ', a3['i'] = 'ì', a3['j'] = 'ʝ', a3['k'] = 'ҟ', a3['l'] = 'Ӏ', a3['m'] = 'ʍ', a3['n'] = 'ղ', a3['o'] = 'օ', a3['p'] = 'ք', a3['q'] = 'զ', a3['r'] = 'ɾ', a3['s'] = 'ʂ', a3['t'] = 'է', a3['u'] = 'մ', a3['v'] = 'ѵ', a3['w'] = 'ա', a3['x'] = '×', a3['y'] = 'վ', a3['z'] = 'Հ', a3['A'] = 'Ⱥ', a3['B'] = 'β', a3['C'] = '↻', a3['D'] = 'Ꭰ', a3['E'] = 'Ɛ', a3['F'] = 'Ƒ', a3['G'] = 'Ɠ', a3['H'] = 'Ƕ', a3['I'] = 'į', a3['J'] = 'ل', a3['K'] = 'Ҡ', a3['L'] = 'Ꝉ', a3['M'] = 'Ɱ', a3['N'] = 'ហ', a3['O'] = 'ට', a3['P'] = 'φ', a3['Q'] = 'Ҩ', a3['R'] = 'འ', a3['S'] = 'Ϛ', a3['T'] = 'Ͳ', a3['U'] = 'Ա', a3['V'] = 'Ỽ', a3['W'] = 'చ', a3['X'] = 'ჯ', a3['Y'] = 'Ӌ', a3['Z'] = 'ɀ';
const bentTextCharMap = a3;
var a4 = {};
a4['0'] = '0', a4['1'] = '1', a4['2'] = '2', a4['3'] = '3', a4['4'] = '4', a4['5'] = '5', a4['6'] = '6', a4['7'] = '7', a4['8'] = '8', a4['9'] = '9', a4['a'] = 'Λ', a4['b'] = 'B', a4['c'] = 'ᄃ', a4['d'] = 'D', a4['e'] = 'Σ', a4['f'] = 'F', a4['g'] = 'G', a4['h'] = 'Ή', a4['i'] = 'I', a4['j'] = 'J', a4['k'] = 'K', a4['l'] = 'ᄂ', a4['m'] = 'M', a4['n'] = 'П', a4['o'] = 'Ө', a4['p'] = 'P', a4['q'] = 'Q', a4['r'] = 'Я', a4['s'] = 'Ƨ', a4['t'] = 'Ƭ', a4['u'] = 'Ц', a4['v'] = 'V', a4['w'] = 'Щ', a4['x'] = 'X', a4['y'] = 'Y', a4['z'] = 'Z', a4['A'] = 'Λ', a4['B'] = 'B', a4['C'] = 'ᄃ', a4['D'] = 'D', a4['E'] = 'Σ', a4['F'] = 'F', a4['G'] = 'G', a4['H'] = 'Ή', a4['I'] = 'I', a4['J'] = 'J', a4['K'] = 'K', a4['L'] = 'ᄂ', a4['M'] = 'M', a4['N'] = 'П', a4['O'] = 'Ө', a4['P'] = 'P', a4['Q'] = 'Q', a4['R'] = 'Я', a4['S'] = 'Ƨ', a4['T'] = 'Ƭ', a4['U'] = 'Ц', a4['V'] = 'V', a4['W'] = 'Щ', a4['X'] = 'X', a4['Y'] = 'Y', a4['Z'] = 'Z';

function _0x33b8(_0x3673fb, _0x5b9a8a) {
    var _0xc7c472 = _0xc7c4();
    return _0x33b8 = function(_0x33b8c4, _0x1b076e) {
        _0x33b8c4 = _0x33b8c4 - 0xb5;
        var _0x30032e = _0xc7c472[_0x33b8c4];
        return _0x30032e;
    }, _0x33b8(_0x3673fb, _0x5b9a8a);
}
const upperAnglesCharMap = a4;
var a5 = {};
a5['0'] = '₀', a5['1'] = '₁', a5['2'] = '₂', a5['3'] = '₃', a5['4'] = '₄', a5['5'] = '₅', a5['6'] = '₆', a5['7'] = '₇', a5['8'] = '₈', a5['9'] = '₉', a5['a'] = 'ₐ', a5['b'] = 'b', a5['c'] = 'c', a5['d'] = 'd', a5['e'] = 'ₑ', a5['f'] = 'f', a5['g'] = 'g', a5['h'] = 'ₕ', a5['i'] = 'ᵢ', a5['j'] = 'ⱼ', a5['k'] = 'ₖ', a5['l'] = 'ₗ', a5['m'] = 'ₘ', a5['n'] = 'ₙ', a5['o'] = 'ₒ', a5['p'] = 'ₚ', a5['q'] = 'q', a5['r'] = 'ᵣ', a5['s'] = 'ₛ', a5['t'] = 'ₜ', a5['u'] = 'ᵤ', a5['v'] = 'ᵥ', a5['w'] = 'w', a5['x'] = 'ₓ', a5['y'] = 'y', a5['z'] = 'z', a5['A'] = 'ₐ', a5['B'] = 'B', a5['C'] = 'C', a5['D'] = 'D', a5['E'] = 'ₑ', a5['F'] = 'F', a5['G'] = 'G', a5['H'] = 'ₕ', a5['I'] = 'ᵢ', a5['J'] = 'ⱼ', a5['K'] = 'ₖ', a5['L'] = 'ₗ', a5['M'] = 'ₘ', a5['N'] = 'ₙ', a5['O'] = 'ₒ', a5['P'] = 'ₚ', a5['Q'] = 'Q', a5['R'] = 'ᵣ', a5['S'] = 'ₛ', a5['T'] = 'ₜ', a5['U'] = 'ᵤ', a5['V'] = 'ᵥ', a5['W'] = 'W', a5['X'] = 'ₓ', a5['Y'] = 'Y', a5['Z'] = 'Z', a5['+'] = '₊', a5['-'] = '₋', a5['='] = '₌', a5['('] = '₍', a5[')'] = '₎';
const subscriptCharMap = a5;
var a6 = {};
a6['0'] = '⁰', a6['1'] = '¹', a6['2'] = '²', a6['3'] = '³', a6['4'] = '⁴', a6['5'] = '⁵', a6['6'] = '⁶', a6['7'] = '⁷', a6['8'] = '⁸', a6['9'] = '⁹', a6['a'] = 'ᵃ', a6['b'] = 'ᵇ', a6['c'] = 'ᶜ', a6['d'] = 'ᵈ', a6['e'] = 'ᵉ', a6['f'] = 'ᶠ', a6['g'] = 'ᵍ', a6['h'] = 'ʰ', a6['i'] = 'ⁱ', a6['j'] = 'ʲ', a6['k'] = 'ᵏ', a6['l'] = 'ˡ', a6['m'] = 'ᵐ', a6['n'] = 'ⁿ', a6['o'] = 'ᵒ', a6['p'] = 'ᵖ', a6['q'] = 'q', a6['r'] = 'ʳ', a6['s'] = 'ˢ', a6['t'] = 'ᵗ', a6['u'] = 'ᵘ', a6['v'] = 'ᵛ', a6['w'] = 'ʷ', a6['x'] = 'ˣ', a6['y'] = 'ʸ', a6['z'] = 'ᶻ', a6['A'] = 'ᴬ', a6['B'] = 'ᴮ', a6['C'] = 'ᶜ', a6['D'] = 'ᴰ', a6['E'] = 'ᴱ', a6['F'] = 'ᶠ', a6['G'] = 'ᴳ', a6['H'] = 'ᴴ', a6['I'] = 'ᴵ', a6['J'] = 'ᴶ', a6['K'] = 'ᴷ', a6['L'] = 'ᴸ', a6['M'] = 'ᴹ', a6['N'] = 'ᴺ', a6['O'] = 'ᴼ', a6['P'] = 'ᴾ', a6['Q'] = 'Q', a6['R'] = 'ᴿ', a6['S'] = 'ˢ', a6['T'] = 'ᵀ', a6['U'] = 'ᵁ', a6['V'] = 'ⱽ', a6['W'] = 'ᵂ', a6['X'] = 'ˣ', a6['Y'] = 'ʸ', a6['Z'] = 'ᶻ', a6['+'] = '⁺', a6['-'] = '⁻', a6['='] = '⁼', a6['('] = '⁽', a6[')'] = '⁾';
const superscriptCharMap = a6;
var a7 = {};
a7['0'] = '0', a7['1'] = '1', a7['2'] = '2', a7['3'] = '3', a7['4'] = '4', a7['5'] = '5', a7['6'] = '6', a7['7'] = '7', a7['8'] = '8', a7['9'] = '9', a7['a'] = 'ค', a7['b'] = '๒', a7['c'] = 'ς', a7['d'] = '๔', a7['e'] = 'є', a7['f'] = 'Ŧ', a7['g'] = 'ﻮ', a7['h'] = 'ђ', a7['i'] = 'เ', a7['j'] = 'ן', a7['k'] = 'к', a7['l'] = 'ɭ', a7['m'] = '๓', a7['n'] = 'ภ', a7['o'] = '๏', a7['p'] = 'ק', a7['q'] = 'ợ', a7['r'] = 'г', a7['s'] = 'ร', a7['t'] = 'Շ', a7['u'] = 'ย', a7['v'] = 'ש', a7['w'] = 'ฬ', a7['x'] = 'א', a7['y'] = 'ץ', a7['z'] = 'չ', a7['A'] = 'ค', a7['B'] = '๒', a7['C'] = 'ς', a7['D'] = '๔', a7['E'] = 'є', a7['F'] = 'Ŧ', a7['G'] = 'ﻮ', a7['H'] = 'ђ', a7['I'] = 'เ', a7['J'] = 'ן', a7['K'] = 'к', a7['L'] = 'ɭ', a7['M'] = '๓', a7['N'] = 'ภ', a7['O'] = '๏', a7['P'] = 'ק', a7['Q'] = 'ợ', a7['R'] = 'г', a7['S'] = 'ร', a7['T'] = 'Շ', a7['U'] = 'ย', a7['V'] = 'ש', a7['W'] = 'ฬ', a7['X'] = 'א', a7['Y'] = 'ץ', a7['Z'] = 'չ';
const squiggleCharMap = a7;
var a8 = {};
a8['0'] = '𝟘', a8['1'] = '𝟙', a8['2'] = '𝟚', a8['3'] = '𝟛', a8['4'] = '𝟜', a8['5'] = '𝟝', a8['6'] = '𝟞', a8['7'] = '𝟟', a8['8'] = '𝟠', a8['9'] = '𝟡', a8['a'] = '𝕒', a8['b'] = '𝕓', a8['c'] = '𝕔', a8['d'] = '𝕕', a8['e'] = '𝕖', a8['f'] = '𝕗', a8['g'] = '𝕘', a8['h'] = '𝕙', a8['i'] = '𝕚', a8['j'] = '𝕛', a8['k'] = '𝕜', a8['l'] = '𝕝', a8['m'] = '𝕞', a8['n'] = '𝕟', a8['o'] = '𝕠', a8['p'] = '𝕡', a8['q'] = '𝕢', a8['r'] = '𝕣', a8['s'] = '𝕤', a8['t'] = '𝕥', a8['u'] = '𝕦', a8['v'] = '𝕧', a8['w'] = '𝕨', a8['x'] = '𝕩', a8['y'] = '𝕪', a8['z'] = '𝕫', a8['A'] = '𝔸', a8['B'] = '𝔹', a8['C'] = 'ℂ', a8['D'] = '𝔻', a8['E'] = '𝔼', a8['F'] = '𝔽', a8['G'] = '𝔾', a8['H'] = 'ℍ', a8['I'] = '𝕀', a8['J'] = '𝕁', a8['K'] = '𝕂', a8['L'] = '𝕃', a8['M'] = '𝕄', a8['N'] = 'ℕ', a8['O'] = '𝕆', a8['P'] = 'ℙ', a8['Q'] = 'ℚ', a8['R'] = 'ℝ', a8['S'] = '𝕊', a8['T'] = '𝕋', a8['U'] = '𝕌', a8['V'] = '𝕍', a8['W'] = '𝕎', a8['X'] = '𝕏', a8['Y'] = '𝕐', a8['Z'] = 'ℤ';
const doubleStruckCharMap = a8;
var a9 = {};
a9['0'] = '0', a9['1'] = '1', a9['2'] = '2', a9['3'] = '3', a9['4'] = '4', a9['5'] = '5', a9['6'] = '6', a9['7'] = '7', a9['8'] = '8', a9['9'] = '9', a9['a'] = '𝖆', a9['b'] = '𝖇', a9['c'] = '𝖈', a9['d'] = '𝖉', a9['e'] = '𝖊', a9['f'] = '𝖋', a9['g'] = '𝖌', a9['h'] = '𝖍', a9['i'] = '𝖎', a9['j'] = '𝖏', a9['k'] = '𝖐', a9['l'] = '𝖑', a9['m'] = '𝖒', a9['n'] = '𝖓', a9['o'] = '𝖔', a9['p'] = '𝖕', a9['q'] = '𝖖', a9['r'] = '𝖗', a9['s'] = '𝖘', a9['t'] = '𝖙', a9['u'] = '𝖚', a9['v'] = '𝖛', a9['w'] = '𝖜', a9['x'] = '𝖝', a9['y'] = '𝖞', a9['z'] = '𝖟', a9['A'] = '𝕬', a9['B'] = '𝕭', a9['C'] = '𝕮', a9['D'] = '𝕯', a9['E'] = '𝕰', a9['F'] = '𝕱', a9['G'] = '𝕲', a9['H'] = '𝕳', a9['I'] = '𝕴', a9['J'] = '𝕵', a9['K'] = '𝕶', a9['L'] = '𝕷', a9['M'] = '𝕸', a9['N'] = '𝕹', a9['O'] = '𝕺', a9['P'] = '𝕻', a9['Q'] = '𝕼', a9['R'] = '𝕽', a9['S'] = '𝕾', a9['T'] = '𝕿', a9['U'] = '𝖀', a9['V'] = '𝖁', a9['W'] = '𝖂', a9['X'] = '𝖃', a9['Y'] = '𝖄', a9['Z'] = '𝖅';
const medievalCharMap = a9;
var aa = {};
aa['q'] = '🆀', aa['w'] = '🆆', aa['e'] = '🅴', aa['r'] = '🆁', aa['t'] = '🆃', aa['y'] = '🆈', aa['u'] = '🆄', aa['i'] = '🅸', aa['o'] = '🅾', aa['p'] = '🅿', aa['a'] = '🅰', aa['s'] = '🆂', aa['d'] = '🅳', aa['f'] = '🅵', aa['g'] = '🅶', aa['h'] = '🅷', aa['j'] = '🅹', aa['k'] = '🅺', aa['l'] = '🅻', aa['z'] = '🆉', aa['x'] = '🆇', aa['c'] = '🅲', aa['v'] = '🆅', aa['b'] = '🅱', aa['n'] = '🅽', aa['m'] = '🅼';
const invertedSquaresCharMap = aa;
var ab = {};
ab['0'] = '0', ab['1'] = '1', ab['2'] = '2', ab['3'] = '3', ab['4'] = '4', ab['5'] = '5', ab['6'] = '6', ab['7'] = '7', ab['8'] = '8', ab['9'] = '9', ab['a'] = '𝓪', ab['b'] = '𝓫', ab['c'] = '𝓬', ab['d'] = '𝓭', ab['e'] = '𝓮', ab['f'] = '𝓯', ab['g'] = '𝓰', ab['h'] = '𝓱', ab['i'] = '𝓲', ab['j'] = '𝓳', ab['k'] = '𝓴', ab['l'] = '𝓵', ab['m'] = '𝓶', ab['n'] = '𝓷', ab['o'] = '𝓸', ab['p'] = '𝓹', ab['q'] = '𝓺', ab['r'] = '𝓻', ab['s'] = '𝓼', ab['t'] = '𝓽', ab['u'] = '𝓾', ab['v'] = '𝓿', ab['w'] = '𝔀', ab['x'] = '𝔁', ab['y'] = '𝔂', ab['z'] = '𝔃', ab['A'] = '𝓐', ab['B'] = '𝓑', ab['C'] = '𝓒', ab['D'] = '𝓓', ab['E'] = '𝓔', ab['F'] = '𝓕', ab['G'] = '𝓖', ab['H'] = '𝓗', ab['I'] = '𝓘', ab['J'] = '𝓙', ab['K'] = '𝓚', ab['L'] = '𝓛', ab['M'] = '𝓜', ab['N'] = '𝓝', ab['O'] = '𝓞', ab['P'] = '𝓟', ab['Q'] = '𝓠', ab['R'] = '𝓡', ab['S'] = '𝓢', ab['T'] = '𝓣', ab['U'] = '𝓤', ab['V'] = '𝓥', ab['W'] = '𝓦', ab['X'] = '𝓧', ab['Y'] = '𝓨', ab['Z'] = '𝓩';
const cursiveCharMap = ab;
var ac = {};
ac['a'] = '𝔞', ac['b'] = '𝔟', ac['c'] = '𝔠', ac['d'] = '𝔡', ac['e'] = '𝔢', ac['f'] = '𝔣', ac['g'] = '𝔤', ac['h'] = '𝔥', ac['i'] = '𝔦', ac['j'] = '𝔧', ac['k'] = '𝔨', ac['l'] = '𝔩', ac['m'] = '𝔪', ac['n'] = '𝔫', ac['o'] = '𝔬', ac['p'] = '𝔭', ac['q'] = '𝔮', ac['r'] = '𝔯', ac['s'] = '𝔰', ac['t'] = '𝔱', ac['u'] = '𝔲', ac['v'] = '𝔳', ac['w'] = '𝔴', ac['x'] = '𝔵', ac['y'] = '𝔶', ac['z'] = '𝔷', ac['A'] = '𝔄', ac['B'] = '𝔅', ac['C'] = 'ℭ', ac['D'] = '𝔇', ac['E'] = '𝔈', ac['F'] = '𝔉', ac['G'] = '𝔊', ac['H'] = 'ℌ', ac['I'] = 'ℑ', ac['J'] = '𝔍', ac['K'] = '𝔎', ac['L'] = '𝔏', ac['M'] = '𝔐', ac['N'] = '𝔑', ac['O'] = '𝔒', ac['P'] = '𝔓', ac['Q'] = '𝔔', ac['R'] = 'ℜ', ac['S'] = '𝔖', ac['T'] = '𝔗', ac['U'] = '𝔘', ac['V'] = '𝔙', ac['W'] = '𝔚', ac['X'] = '𝔛', ac['Y'] = '𝔜', ac['Z'] = 'ℨ';
const oldEnglishCharMap = ac;
var ad = {};
ad['`'] = '`', ad['1'] = '１', ad['2'] = '２', ad['3'] = '３', ad['4'] = '４', ad['5'] = '５', ad['6'] = '６', ad['7'] = '７', ad['8'] = '８', ad['9'] = '９', ad['0'] = '０', ad['-'] = '－', ad['='] = '＝', ad['~'] = '~', ad['!'] = '！', ad['@'] = '＠', ad['#'] = '＃', ad['$'] = '＄', ad['%'] = '％', ad['^'] = '^', ad['&'] = '＆', ad['*'] = '＊', ad['('] = '（', ad[')'] = '）', ad['_'] = '_', ad['+'] = '＋', ad['q'] = 'ｑ', ad['w'] = 'ｗ', ad['e'] = 'ｅ', ad['r'] = 'ｒ', ad['t'] = 'ｔ', ad['y'] = 'ｙ', ad['u'] = 'ｕ', ad['i'] = 'ｉ', ad['o'] = 'ｏ', ad['p'] = 'ｐ', ad['['] = '[', ad[']'] = ']', ad['\x5c'] = '\x5c', ad['Q'] = 'Ｑ', ad['W'] = 'Ｗ', ad['E'] = 'Ｅ', ad['R'] = 'Ｒ', ad['T'] = 'Ｔ', ad['Y'] = 'Ｙ', ad['U'] = 'Ｕ', ad['I'] = 'Ｉ', ad['O'] = 'Ｏ', ad['P'] = 'Ｐ', ad['{'] = '{', ad['}'] = '}', ad['|'] = '|', ad['a'] = 'ａ', ad['s'] = 'ｓ', ad['d'] = 'ｄ', ad['f'] = 'ｆ', ad['g'] = 'ｇ', ad['h'] = 'ｈ', ad['j'] = 'ｊ', ad['k'] = 'ｋ', ad['l'] = 'ｌ', ad[';'] = '；', ad['\x27'] = '＇', ad['A'] = 'Ａ', ad['S'] = 'Ｓ', ad['D'] = 'Ｄ', ad['F'] = 'Ｆ', ad['G'] = 'Ｇ', ad['H'] = 'Ｈ', ad['J'] = 'Ｊ', ad['K'] = 'Ｋ', ad['L'] = 'Ｌ', ad[':'] = '：', ad['\x22'] = '\x22', ad['z'] = 'ｚ', ad['x'] = 'ｘ', ad['c'] = 'ｃ', ad['v'] = 'ｖ', ad['b'] = 'ｂ', ad['n'] = 'ｎ', ad['m'] = 'ｍ', ad[','] = '，', ad['.'] = '．', ad['/'] = '／', ad['Z'] = 'Ｚ', ad['X'] = 'Ｘ', ad['C'] = 'Ｃ', ad['V'] = 'Ｖ', ad['B'] = 'Ｂ', ad['N'] = 'Ｎ', ad['M'] = 'Ｍ', ad['<'] = '<', ad['>'] = '>', ad['?'] = '？';
const wideTextCharMap = ad;

function Lunicode() {
    var _0x4144c3 = _0x4ca65f,
        _0x306eb0 = {};
    _0x306eb0['a'] = 'ɐ', _0x306eb0['b'] = 'q', _0x306eb0['c'] = 'ɔ', _0x306eb0['d'] = 'p', _0x306eb0['e'] = 'ǝ', _0x306eb0['f'] = 'ɟ', _0x306eb0['g'] = 'ɓ', _0x306eb0['h'] = 'ɥ', _0x306eb0['i'] = 'ı', _0x306eb0['j'] = 'ɾ', _0x306eb0['k'] = 'ʞ', _0x306eb0['l'] = 'l', _0x306eb0['m'] = 'ɯ', _0x306eb0['n'] = 'u', _0x306eb0['r'] = 'ɹ', _0x306eb0['t'] = 'ʇ', _0x306eb0['v'] = 'ʌ', _0x306eb0['w'] = 'ʍ', _0x306eb0['y'] = 'ʎ', _0x306eb0['A'] = '∀', _0x306eb0['B'] = 'ᙠ', _0x306eb0['C'] = 'Ɔ', _0x306eb0['D'] = 'ᗡ', _0x306eb0['E'] = 'Ǝ', _0x306eb0['F'] = 'Ⅎ', _0x306eb0['G'] = '⅁', _0x306eb0['J'] = 'ſ', _0x306eb0['K'] = '⋊', _0x306eb0['L'] = '˥', _0x306eb0['M'] = 'W', _0x306eb0['P'] = 'Ԁ', _0x306eb0['Q'] = 'Ό', _0x306eb0['R'] = 'ᴚ', _0x306eb0['T'] = '⊥', _0x306eb0['U'] = '∩', _0x306eb0['V'] = 'Λ', _0x306eb0['Y'] = '⅄', _0x306eb0['1'] = '⇂', _0x306eb0['2'] = 'ᄅ', _0x306eb0['3'] = 'Ɛ', _0x306eb0['4'] = 'ㄣ', _0x306eb0['5'] = 'ގ', _0x306eb0['6'] = '9', _0x306eb0['7'] = 'ㄥ', _0x306eb0['&'] = '⅋', _0x306eb0['.'] = '˙', _0x306eb0['\x22'] = '„', _0x306eb0[';'] = '؛', _0x306eb0['['] = ']', _0x306eb0['('] = ')', _0x306eb0['{'] = '}', _0x306eb0['?'] = '¿', _0x306eb0['!'] = '¡', _0x306eb0['\x27'] = ',', _0x306eb0['<'] = '>', _0x306eb0['‾'] = '_', _0x306eb0['¯'] = '_', _0x306eb0['‿'] = '⁀', _0x306eb0['⁅'] = '⁆', _0x306eb0['∴'] = '∵', _0x306eb0['\x0d'] = '\x0a', _0x306eb0['ß'] = 'ᙠ', _0x306eb0['̈'] = '̤', _0x306eb0['ä'] = 'ɐ̤', _0x306eb0['ö'] = 'o̤', _0x306eb0['ü'] = 'n̤', _0x306eb0['Ä'] = '∀̤', _0x306eb0['Ö'] = 'O̤', _0x306eb0['Ü'] = '∩̤', _0x306eb0['´'] = '\x20̗', _0x306eb0['é'] = 'ǝ̗', _0x306eb0['á'] = 'ɐ̗', _0x306eb0['ó'] = 'o̗', _0x306eb0['ú'] = 'n̗', _0x306eb0['É'] = 'Ǝ̗', _0x306eb0['Á'] = '∀̗', _0x306eb0['Ó'] = 'O̗', _0x306eb0['Ú'] = '∩̗', _0x306eb0['`'] = '\x20̖', _0x306eb0['è'] = 'ǝ̖', _0x306eb0['à'] = 'ɐ̖', _0x306eb0['ò'] = 'o̖', _0x306eb0['ù'] = 'n̖', _0x306eb0['È'] = 'Ǝ̖', _0x306eb0['À'] = '∀̖', _0x306eb0['Ò'] = 'O̖', _0x306eb0['Ù'] = '∩̖', _0x306eb0['^'] = '\x20̮', _0x306eb0['ê'] = 'ǝ̮', _0x306eb0['â'] = 'ɐ̮', _0x306eb0['ô'] = 'o̮', _0x306eb0['û'] = 'n̮', _0x306eb0['Ê'] = 'Ǝ̮', _0x306eb0['Â'] = '∀̮', _0x306eb0['Ô'] = 'O̮', _0x306eb0['Û'] = '∩̮';
    var _0x394c1c = {};
    _0x394c1c[_0x4144c3(0x2c2)] = function() {
        var _0x19ed9b = _0x4144c3;
        for (i in this[_0x19ed9b(0x303)]) this[_0x19ed9b(0x303)][this['map'][i]] = i;
    }, _0x394c1c['encode'] = function(_0x5839c1) {
        var _0x1e747f = _0x4144c3;
        for (var _0x2ab24e, _0x22da8a = [], _0x140598 = 0x0, _0x139e8c = _0x5839c1[_0x1e747f(0x4ce)]; _0x139e8c > _0x140598; _0x140598++) _0x2ab24e = _0x5839c1[_0x1e747f(0x27c)](_0x140598), _0x140598 > 0x0 && ('̤' == _0x2ab24e || '̗' == _0x2ab24e || '̖' == _0x2ab24e || '̮' == _0x2ab24e) ? (_0x2ab24e = this[_0x1e747f(0x303)][_0x5839c1[_0x1e747f(0x27c)](_0x140598 - 0x1) + _0x2ab24e], _0x22da8a['pop']()) : (_0x2ab24e = this[_0x1e747f(0x303)][_0x2ab24e], 'undefined' == typeof _0x2ab24e && (_0x2ab24e = _0x5839c1['charAt'](_0x140598))), _0x22da8a[_0x1e747f(0x477)](_0x2ab24e);
        return _0x22da8a['reverse']()[_0x1e747f(0x55c)]('');
    }, _0x394c1c[_0x4144c3(0x591)] = function(_0xcd7f24) {
        var _0x1376ca = _0x4144c3;
        for (var _0x348666, _0x19f608 = [], _0x4ff968 = 0x0, _0x79acd = _0xcd7f24['length']; _0x79acd > _0x4ff968; _0x4ff968++) _0x348666 = _0xcd7f24[_0x1376ca(0x27c)](_0x4ff968), _0x4ff968 > 0x0 && ('̤' == _0x348666 || '̗' == _0x348666 || '̖' == _0x348666 || '̮' == _0x348666) ? (_0x348666 = this[_0x1376ca(0x303)][_0xcd7f24['charAt'](_0x4ff968 - 0x1) + _0x348666], _0x19f608[_0x1376ca(0x3a2)]()) : (_0x348666 = this[_0x1376ca(0x303)][_0x348666], _0x1376ca(0x1c2) == typeof _0x348666 && (_0x348666 = _0xcd7f24[_0x1376ca(0x27c)](_0x4ff968))), _0x19f608[_0x1376ca(0x477)](_0x348666);
        return _0x19f608[_0x1376ca(0x402)]()[_0x1376ca(0x55c)]('');
    }, _0x394c1c[_0x4144c3(0x303)] = _0x306eb0;
    var _0xaa6bc2 = {};
    _0xaa6bc2['a'] = 'ɒ', _0xaa6bc2['b'] = 'd', _0xaa6bc2['c'] = 'ɔ', _0xaa6bc2['e'] = 'ɘ', _0xaa6bc2['f'] = 'Ꮈ', _0xaa6bc2['g'] = 'ǫ', _0xaa6bc2['h'] = 'ʜ', _0xaa6bc2['j'] = 'ꞁ', _0xaa6bc2['k'] = 'ʞ', _0xaa6bc2['l'] = '|', _0xaa6bc2['n'] = 'ᴎ', _0xaa6bc2['p'] = 'q', _0xaa6bc2['r'] = 'ɿ', _0xaa6bc2['s'] = 'ꙅ', _0xaa6bc2['t'] = 'ƚ', _0xaa6bc2['y'] = 'ʏ', _0xaa6bc2['z'] = 'ƹ', _0xaa6bc2['B'] = 'ᙠ', _0xaa6bc2['C'] = 'Ɔ', _0xaa6bc2['D'] = 'ᗡ', _0xaa6bc2['E'] = 'Ǝ', _0xaa6bc2['F'] = 'ꟻ', _0xaa6bc2['G'] = 'Ꭾ', _0xaa6bc2['J'] = 'Ⴑ', _0xaa6bc2['K'] = '⋊', _0xaa6bc2['L'] = '⅃', _0xaa6bc2['N'] = 'Ͷ', _0xaa6bc2['P'] = 'ꟼ', _0xaa6bc2['Q'] = 'Ọ', _0xaa6bc2['R'] = 'Я', _0xaa6bc2['S'] = 'Ꙅ', _0xaa6bc2['Z'] = 'Ƹ', _0xaa6bc2['1'] = '', _0xaa6bc2['2'] = '', _0xaa6bc2['3'] = '', _0xaa6bc2['4'] = '', _0xaa6bc2['5'] = '', _0xaa6bc2['6'] = '', _0xaa6bc2['7'] = '', _0xaa6bc2['&'] = '', _0xaa6bc2[';'] = '', _0xaa6bc2['['] = ']', _0xaa6bc2['('] = ')', _0xaa6bc2['{'] = '}', _0xaa6bc2['?'] = '⸮', _0xaa6bc2['<'] = '>', _0xaa6bc2['ä'] = 'ɒ̈', _0xaa6bc2['ß'] = 'ᙠ', _0xaa6bc2['´'] = '`', _0xaa6bc2['é'] = 'ɘ̀', _0xaa6bc2['á'] = 'ɒ̀', _0xaa6bc2['ó'] = 'ò', _0xaa6bc2['ú'] = 'ù', _0xaa6bc2['É'] = 'Ǝ̀', _0xaa6bc2['Á'] = 'À', _0xaa6bc2['Ó'] = 'Ò', _0xaa6bc2['Ú'] = 'Ù', _0xaa6bc2['`'] = '´', _0xaa6bc2['è'] = 'ɘ́', _0xaa6bc2['à'] = 'ɒ́', _0xaa6bc2['È'] = 'Ǝ́', _0xaa6bc2['ê'] = 'ɘ̂', _0xaa6bc2['â'] = 'ɒ̂', _0xaa6bc2['Ê'] = 'Ǝ̂', _0xaa6bc2['Ø'] = 'ᴓ', _0xaa6bc2['ø'] = 'ᴓ';
    var _0x1d7269 = {};
    _0x1d7269[_0x4144c3(0x2c2)] = function() {
        var _0x201cd0 = _0x4144c3;
        for (i in this['map']) this[_0x201cd0(0x303)][this[_0x201cd0(0x303)][i]] = i;
    }, _0x1d7269[_0x4144c3(0x254)] = function(_0xafa715) {
        var _0x21ca3a = _0x4144c3;
        for (var _0x590a96, _0x53e8bd = [], _0x1c60e5 = [], _0x1c9bc0 = 0x0, _0x51b70d = _0xafa715[_0x21ca3a(0x4ce)]; _0x51b70d > _0x1c9bc0; _0x1c9bc0++) _0x590a96 = _0xafa715[_0x21ca3a(0x27c)](_0x1c9bc0), _0x1c9bc0 > 0x0 && ('̈' == _0x590a96 || '̀' == _0x590a96 || '́' == _0x590a96 || '̂' == _0x590a96) ? (_0x590a96 = this[_0x21ca3a(0x303)][_0xafa715[_0x21ca3a(0x27c)](_0x1c9bc0 - 0x1) + _0x590a96], _0x53e8bd[_0x21ca3a(0x3a2)]()) : (_0x590a96 = this['map'][_0x590a96], 'undefined' == typeof _0x590a96 && (_0x590a96 = _0xafa715[_0x21ca3a(0x27c)](_0x1c9bc0))), '\x0a' == _0x590a96 ? (_0x1c60e5['push'](_0x53e8bd[_0x21ca3a(0x402)]()[_0x21ca3a(0x55c)]('')), _0x53e8bd = []) : _0x53e8bd['push'](_0x590a96);
        return _0x1c60e5[_0x21ca3a(0x477)](_0x53e8bd[_0x21ca3a(0x402)]()[_0x21ca3a(0x55c)]('')), _0x1c60e5[_0x21ca3a(0x55c)]('\x0a');
    }, _0x1d7269[_0x4144c3(0x591)] = function(_0x172cac) {
        var _0x5d9249 = _0x4144c3;
        for (var _0x550afe, _0x256769 = [], _0x37cbb6 = [], _0x3e6f43 = 0x0, _0x3da2e3 = _0x172cac['length']; _0x3da2e3 > _0x3e6f43; _0x3e6f43++) _0x550afe = _0x172cac[_0x5d9249(0x27c)](_0x3e6f43), _0x3e6f43 > 0x0 && ('̈' == _0x550afe || '̀' == _0x550afe || '́' == _0x550afe || '̂' == _0x550afe) ? (_0x550afe = this[_0x5d9249(0x303)][_0x172cac[_0x5d9249(0x27c)](_0x3e6f43 - 0x1) + _0x550afe], _0x256769[_0x5d9249(0x3a2)]()) : (_0x550afe = this[_0x5d9249(0x303)][_0x550afe], _0x5d9249(0x1c2) == typeof _0x550afe && (_0x550afe = _0x172cac[_0x5d9249(0x27c)](_0x3e6f43))), '\x0a' == _0x550afe ? (_0x37cbb6[_0x5d9249(0x477)](_0x256769[_0x5d9249(0x402)]()[_0x5d9249(0x55c)]('')), _0x256769 = []) : _0x256769[_0x5d9249(0x477)](_0x550afe);
        return _0x37cbb6[_0x5d9249(0x477)](_0x256769['reverse']()[_0x5d9249(0x55c)]('')), _0x37cbb6[_0x5d9249(0x55c)]('\x0a');
    }, _0x1d7269[_0x4144c3(0x303)] = _0xaa6bc2;
    var _0x57c5a2 = {};
    _0x57c5a2[_0x4144c3(0x566)] = !0x0, _0x57c5a2[_0x4144c3(0x1d2)] = !0x0, _0x57c5a2[_0x4144c3(0x106)] = !0x0, _0x57c5a2[_0x4144c3(0x54b)] = 0xf, _0x57c5a2[_0x4144c3(0xd6)] = 0x64;
    var _0xace9b6 = {};
    _0xace9b6[_0x4144c3(0x2c2)] = function() {
        var _0x466291 = _0x4144c3;
        for (var _0x4a5176 = 0x300; 0x315 >= _0x4a5176; _0x4a5176++) this[_0x466291(0x529)][_0x466291(0x477)](String[_0x466291(0x565)](_0x4a5176));
        for (var _0x4a5176 = 0x316; 0x333 >= _0x4a5176; _0x4a5176++) 0x31a != _0x4a5176 && 0x31b != _0x4a5176 && this[_0x466291(0x349)]['push'](String[_0x466291(0x565)](_0x4a5176));
        this[_0x466291(0x529)][_0x466291(0x477)](String[_0x466291(0x565)](0x31a)), this[_0x466291(0x529)][_0x466291(0x477)](String[_0x466291(0x565)](0x31b));
        for (var _0x4a5176 = 0x334; 0x338 >= _0x4a5176; _0x4a5176++) this[_0x466291(0x46d)][_0x466291(0x477)](String[_0x466291(0x565)](_0x4a5176));
        for (var _0x4a5176 = 0x339; 0x33c >= _0x4a5176; _0x4a5176++) this['diacriticsBottom'][_0x466291(0x477)](String[_0x466291(0x565)](_0x4a5176));
        for (var _0x4a5176 = 0x33d; 0x344 >= _0x4a5176; _0x4a5176++) this['diacriticsTop'][_0x466291(0x477)](String['fromCharCode'](_0x4a5176));
        this[_0x466291(0x529)][_0x466291(0x477)](String[_0x466291(0x565)](0x344)), this[_0x466291(0x349)][_0x466291(0x477)](String['fromCharCode'](0x345)), this[_0x466291(0x529)][_0x466291(0x477)](String['fromCharCode'](0x346)), this[_0x466291(0x349)][_0x466291(0x477)](String[_0x466291(0x565)](0x347)), this[_0x466291(0x349)]['push'](String[_0x466291(0x565)](0x348)), this[_0x466291(0x349)][_0x466291(0x477)](String[_0x466291(0x565)](0x349)), this[_0x466291(0x529)][_0x466291(0x477)](String[_0x466291(0x565)](0x34a)), this['diacriticsTop'][_0x466291(0x477)](String[_0x466291(0x565)](0x34b)), this[_0x466291(0x529)][_0x466291(0x477)](String['fromCharCode'](0x34c)), this[_0x466291(0x349)][_0x466291(0x477)](String[_0x466291(0x565)](0x34d)), this[_0x466291(0x349)]['push'](String['fromCharCode'](0x34e)), this[_0x466291(0x529)]['push'](String[_0x466291(0x565)](0x350)), this['diacriticsTop'][_0x466291(0x477)](String[_0x466291(0x565)](0x351)), this[_0x466291(0x529)][_0x466291(0x477)](String[_0x466291(0x565)](0x352)), this['diacriticsBottom'][_0x466291(0x477)](String['fromCharCode'](0x353)), this[_0x466291(0x349)][_0x466291(0x477)](String[_0x466291(0x565)](0x354)), this['diacriticsBottom'][_0x466291(0x477)](String['fromCharCode'](0x355)), this[_0x466291(0x349)][_0x466291(0x477)](String['fromCharCode'](0x356)), this[_0x466291(0x529)][_0x466291(0x477)](String[_0x466291(0x565)](0x357)), this['diacriticsTop'][_0x466291(0x477)](String[_0x466291(0x565)](0x358)), this[_0x466291(0x349)][_0x466291(0x477)](String[_0x466291(0x565)](0x359)), this[_0x466291(0x349)][_0x466291(0x477)](String['fromCharCode'](0x35a)), this[_0x466291(0x529)][_0x466291(0x477)](String['fromCharCode'](0x35b)), this[_0x466291(0x349)][_0x466291(0x477)](String[_0x466291(0x565)](0x35c)), this[_0x466291(0x529)][_0x466291(0x477)](String[_0x466291(0x565)](0x35d)), this[_0x466291(0x529)][_0x466291(0x477)](String[_0x466291(0x565)](0x35d)), this['diacriticsBottom'][_0x466291(0x477)](String[_0x466291(0x565)](0x35f)), this[_0x466291(0x529)][_0x466291(0x477)](String['fromCharCode'](0x360)), this['diacriticsTop'][_0x466291(0x477)](String[_0x466291(0x565)](0x361));
    }, _0xace9b6[_0x4144c3(0x254)] = function(_0x3e194b) {
        var _0x3774a0 = _0x4144c3,
            _0x556d81, _0x2b4033 = '';
        for (i in _0x3e194b) {
            if (_0x556d81 = _0x3e194b[i], this[_0x3774a0(0x2fa)][_0x3774a0(0x1d2)] && (_0x556d81 += this['diacriticsMiddle'][Math[_0x3774a0(0x1c8)](Math[_0x3774a0(0x4f1)]() * this[_0x3774a0(0x46d)][_0x3774a0(0x4ce)])]), this['options'][_0x3774a0(0x566)]) {
                for (var _0x80125c = this[_0x3774a0(0x529)][_0x3774a0(0x4ce)] - 0x1, _0x139c47 = 0x0, _0x5aff96 = this[_0x3774a0(0x2fa)][_0x3774a0(0x54b)] - Math[_0x3774a0(0x4f1)]() * (this[_0x3774a0(0x2fa)][_0x3774a0(0xd6)] / 0x64 * this[_0x3774a0(0x2fa)][_0x3774a0(0x54b)]); _0x5aff96 > _0x139c47; _0x139c47++) _0x556d81 += this[_0x3774a0(0x529)][Math['floor'](Math['random']() * _0x80125c)];
            }
            if (this[_0x3774a0(0x2fa)][_0x3774a0(0x106)]) {
                for (var _0x1f50f8 = this[_0x3774a0(0x349)][_0x3774a0(0x4ce)] - 0x1, _0x139c47 = 0x0, _0x5aff96 = this['options'][_0x3774a0(0x54b)] - Math[_0x3774a0(0x4f1)]() * (this[_0x3774a0(0x2fa)]['randomization'] / 0x64 * this[_0x3774a0(0x2fa)][_0x3774a0(0x54b)]); _0x5aff96 > _0x139c47; _0x139c47++) _0x556d81 += this[_0x3774a0(0x349)][Math[_0x3774a0(0x1c8)](Math[_0x3774a0(0x4f1)]() * _0x1f50f8)];
            }
            _0x2b4033 += _0x556d81;
        }
        return _0x2b4033;
    }, _0xace9b6[_0x4144c3(0x591)] = function(_0xf1258c) {
        var _0x4018da = _0x4144c3,
            _0x216c54, _0x3e9e35 = '';
        for (i in _0xf1258c) _0x216c54 = _0xf1258c[i][_0x4018da(0x4b3)](0x0), (0x300 > _0x216c54 || _0x216c54 > 0x361) && (_0x3e9e35 += _0xf1258c[i]);
        return _0x3e9e35;
    }, _0xace9b6['diacriticsTop'] = [], _0xace9b6[_0x4144c3(0x46d)] = [], _0xace9b6[_0x4144c3(0x349)] = [], _0xace9b6[_0x4144c3(0x2fa)] = _0x57c5a2;
    var _0x35829a = {};
    _0x35829a[_0x4144c3(0x2c2)] = function() {
        var _0x210394 = _0x4144c3;
        for (var _0x1537a0 = 0x31; 0x39 >= _0x1537a0; _0x1537a0++) this[_0x210394(0x303)][String[_0x210394(0x565)](_0x1537a0)] = String['fromCharCode'](_0x1537a0 + 0x242f);
        this[_0x210394(0x303)][0x0] = '⓪';
        for (var _0x1537a0 = 0x41; 0x5a >= _0x1537a0; _0x1537a0++) this[_0x210394(0x303)][String['fromCharCode'](_0x1537a0)] = String[_0x210394(0x565)](_0x1537a0 + 0x2475);
        for (var _0x1537a0 = 0x61; 0x7a >= _0x1537a0; _0x1537a0++) this[_0x210394(0x303)][String[_0x210394(0x565)](_0x1537a0)] = String[_0x210394(0x565)](_0x1537a0 + 0x246f);
        for (_0x1537a0 in this[_0x210394(0x303)]) this['mapInverse'][this[_0x210394(0x303)][_0x1537a0]] = _0x1537a0;
    }, _0x35829a[_0x4144c3(0x254)] = function(_0x345be3) {
        var _0x1cb782 = _0x4144c3,
            _0x314e5a, _0x23922e = '',
            _0x59ef55 = !0x0;
        for (i in _0x345be3) _0x314e5a = this['map'][_0x345be3[i]], 'undefined' == typeof _0x314e5a && (_0x345be3[i]['charCodeAt'](0x0) >= 0x21 ? (_0x314e5a = _0x345be3[i] + String[_0x1cb782(0x565)](0x20dd), _0x59ef55 || (_0x314e5a = String[_0x1cb782(0x565)](0x202f) + String[_0x1cb782(0x565)](0xa0) + String[_0x1cb782(0x565)](0xa0) + String[_0x1cb782(0x565)](0x202f) + _0x314e5a)) : _0x314e5a = _0x345be3[i]), _0x23922e += _0x314e5a, _0x59ef55 = '\x0a' == _0x314e5a;
        return _0x23922e;
    }, _0x35829a[_0x4144c3(0x591)] = function(_0x1162aa) {
        var _0x25b554 = _0x4144c3,
            _0x93c386, _0x530644 = '',
            _0xc3990a = '';
        for (i in _0x1162aa) _0x93c386 = this['mapInverse'][_0x1162aa[i]], _0x530644 += 'undefined' == typeof _0x93c386 ? _0x1162aa[i] : _0x93c386;
        for (i in _0x530644) _0x93c386 = _0x530644[i][_0x25b554(0x4b3)](0x0), 0xa0 != _0x93c386 && 0x202f != _0x93c386 && 0x20dd != _0x93c386 && (_0xc3990a += _0x530644[i]);
        return _0xc3990a;
    }, _0x35829a[_0x4144c3(0x303)] = {}, _0x35829a[_0x4144c3(0x48f)] = {};
    var _0x3f642c = {};
    _0x3f642c['init'] = function() {}, _0x3f642c[_0x4144c3(0x254)] = function(_0x3c157f) {
        var _0x20c565 = _0x4144c3,
            _0x5f25ea, _0x41a288 = '',
            _0x1f5017 = !0x0;
        for (i in _0x3c157f) _0x3c157f[i]['charCodeAt'](0x0) >= 0x21 ? (_0x5f25ea = _0x3c157f[i] + String['fromCharCode'](0x20de), _0x1f5017 || (_0x5f25ea = String[_0x20c565(0x565)](0x202f) + String[_0x20c565(0x565)](0xa0) + String[_0x20c565(0x565)](0xa0) + String[_0x20c565(0x565)](0x202f) + _0x5f25ea)) : _0x5f25ea = _0x3c157f[i], _0x41a288 += _0x5f25ea, _0x1f5017 = '\x0a' == _0x5f25ea;
        return _0x41a288;
    }, _0x3f642c[_0x4144c3(0x591)] = function(_0x5ab1aa) {
        var _0x11f3d7, _0x4c4444 = '';
        for (i in _0x5ab1aa) _0x11f3d7 = _0x5ab1aa[i]['charCodeAt'](0x0), 0xa0 != _0x11f3d7 && 0x202f != _0x11f3d7 && 0x20de != _0x11f3d7 && (_0x4c4444 += _0x5ab1aa[i]);
        return _0x4c4444;
    };
    var _0x22733f = {};
    _0x22733f[_0x4144c3(0x2c2)] = function() {}, _0x22733f['encode'] = function(_0x26be9d) {
        var _0x4f61b7 = _0x4144c3,
            _0x481242, _0x2c0a88 = '',
            _0x1ed175 = !0x0;
        for (i in _0x26be9d) _0x26be9d[i][_0x4f61b7(0x4b3)](0x0) >= 0x21 ? (_0x481242 = _0x26be9d[i] + String[_0x4f61b7(0x565)](0x20e3), _0x1ed175 || (_0x481242 = String[_0x4f61b7(0x565)](0xa0) + String['fromCharCode'](0xa0) + String['fromCharCode'](0xa0) + _0x481242)) : _0x481242 = _0x26be9d[i], _0x2c0a88 += _0x481242, _0x1ed175 = '\x0a' == _0x481242;
        return _0x2c0a88;
    }, _0x22733f['decode'] = function(_0x425d1a) {
        var _0x4d7efb, _0x5f3eb2 = '';
        for (i in _0x425d1a) _0x4d7efb = _0x425d1a[i]['charCodeAt'](0x0), 0xa0 != _0x4d7efb && 0x202f != _0x4d7efb && 0x20e3 != _0x4d7efb && (_0x5f3eb2 += _0x425d1a[i]);
        return _0x5f3eb2;
    };
    var _0x321322 = {};
    _0x321322['a'] = 'ą', _0x321322['b'] = 'ҍ', _0x321322['c'] = 'ç', _0x321322['d'] = 'ժ', _0x321322['e'] = 'ҽ', _0x321322['f'] = 'ƒ', _0x321322['g'] = 'ց', _0x321322['h'] = 'հ', _0x321322['i'] = 'ì', _0x321322['j'] = 'ʝ', _0x321322['k'] = 'ҟ', _0x321322['l'] = 'Ӏ', _0x321322['m'] = 'ʍ', _0x321322['n'] = 'ղ', _0x321322['o'] = 'օ', _0x321322['p'] = 'ք', _0x321322['q'] = 'զ', _0x321322['r'] = 'ɾ', _0x321322['s'] = 'ʂ', _0x321322['t'] = 'է', _0x321322['u'] = 'մ', _0x321322['v'] = 'ѵ', _0x321322['w'] = 'ա', _0x321322['x'] = '×', _0x321322['y'] = 'վ', _0x321322['z'] = 'Հ', _0x321322['A'] = 'Ⱥ', _0x321322['B'] = 'β', _0x321322['C'] = '↻', _0x321322['D'] = 'Ꭰ', _0x321322['E'] = 'Ɛ', _0x321322['F'] = 'Ƒ', _0x321322['G'] = 'Ɠ', _0x321322['H'] = 'Ƕ', _0x321322['I'] = 'į', _0x321322['J'] = 'ل', _0x321322['K'] = 'Ҡ', _0x321322['L'] = 'Ꝉ', _0x321322['M'] = 'Ɱ', _0x321322['N'] = 'ហ', _0x321322['O'] = 'ට', _0x321322['P'] = 'φ', _0x321322['Q'] = 'Ҩ', _0x321322['R'] = 'འ', _0x321322['S'] = 'Ϛ', _0x321322['T'] = 'Ͳ', _0x321322['U'] = 'Ա', _0x321322['V'] = 'Ỽ', _0x321322['W'] = 'చ', _0x321322['X'] = 'ჯ', _0x321322['Y'] = 'Ӌ', _0x321322['Z'] = 'ɀ', _0x321322['0'] = '⊘', _0x321322['1'] = _0x4144c3(0x4e4), _0x321322['2'] = 'ϩ', _0x321322['3'] = 'Ӡ', _0x321322['4'] = '५', _0x321322['5'] = 'Ƽ', _0x321322['6'] = 'Ϭ', _0x321322['7'] = '7', _0x321322['8'] = '������', _0x321322['9'] = '९', _0x321322['&'] = '⅋', _0x321322['('] = '{', _0x321322[')'] = '}', _0x321322['{'] = '(', _0x321322['}'] = ')', _0x321322['ä'] = 'ą̈', _0x321322['ö'] = 'օ̈', _0x321322['ü'] = 'մ̈', _0x321322['Ä'] = 'Ⱥ̈', _0x321322['Ö'] = 'ට̈', _0x321322['Ü'] = 'Ա̈', _0x321322['é'] = 'ҽ́', _0x321322['á'] = 'ą́', _0x321322['ó'] = 'օ́', _0x321322['ú'] = 'մ́', _0x321322['É'] = 'Ɛ́', _0x321322['Á'] = 'Ⱥ́', _0x321322['Ó'] = 'ට́', _0x321322['Ú'] = 'Ա́', _0x321322['è'] = 'ҽ̀', _0x321322['à'] = 'ą̀', _0x321322['ò'] = 'օ̀', _0x321322['ù'] = 'մ̀', _0x321322['È'] = 'Ɛ̀', _0x321322['À'] = 'Ⱥ̀', _0x321322['Ò'] = 'ට̀', _0x321322['Ù'] = 'Ա̀', _0x321322['ê'] = 'ҽ̂', _0x321322['â'] = 'ą̂', _0x321322['ô'] = 'օ̂', _0x321322['û'] = 'մ̂', _0x321322['Ê'] = 'Ɛ̂', _0x321322['Â'] = 'Ⱥ̂', _0x321322['Ô'] = 'ට̂', _0x321322['Û'] = 'Ա̂';
    var _0x459553 = {};
    _0x459553[_0x4144c3(0x2c2)] = function() {
        var _0xf10866 = _0x4144c3;
        for (i in this['map']) this['map'][this[_0xf10866(0x303)][i]] = i;
    }, _0x459553[_0x4144c3(0x254)] = function(_0x1b1f72) {
        var _0x33d0c1 = _0x4144c3;
        for (var _0x5d9bb9, _0x23d489 = '', _0x34f0dd = 0x0, _0x491e20 = _0x1b1f72[_0x33d0c1(0x4ce)]; _0x491e20 > _0x34f0dd; _0x34f0dd++) _0x5d9bb9 = this[_0x33d0c1(0x303)][_0x1b1f72['charAt'](_0x34f0dd)], _0x33d0c1(0x1c2) == typeof _0x5d9bb9 && (_0x5d9bb9 = _0x1b1f72[_0x33d0c1(0x27c)](_0x34f0dd)), _0x23d489 += _0x5d9bb9;
        return _0x23d489;
    }, _0x459553['decode'] = function(_0x310dcb) {
        var _0x3f2028 = _0x4144c3;
        for (var _0x46a9d0, _0x133aa5 = '', _0x3f7ed5 = 0x0, _0x50ac30 = _0x310dcb[_0x3f2028(0x4ce)]; _0x50ac30 > _0x3f7ed5; _0x3f7ed5++) _0x46a9d0 = this[_0x3f2028(0x303)][_0x310dcb['charAt'](_0x3f7ed5)], _0x3f2028(0x1c2) == typeof _0x46a9d0 && (_0x46a9d0 = _0x310dcb[_0x3f2028(0x27c)](_0x3f7ed5)), _0x133aa5 += _0x46a9d0;
        return _0x133aa5;
    }, _0x459553[_0x4144c3(0x303)] = _0x321322;
    var _0x582412 = {};
    _0x582412['A'] = 'ᴀ', _0x582412['B'] = 'ʙ', _0x582412['C'] = 'ᴄ', _0x582412['D'] = 'ᴅ', _0x582412['E'] = 'ᴇ', _0x582412['F'] = 'ꜰ', _0x582412['G'] = 'ɢ', _0x582412['H'] = 'ʜ', _0x582412['I'] = 'ɪ', _0x582412['J'] = 'ᴊ', _0x582412['K'] = 'ᴋ', _0x582412['L'] = 'ʟ', _0x582412['M'] = 'ᴍ', _0x582412['N'] = 'ɴ', _0x582412['O'] = 'ᴏ', _0x582412['P'] = 'ᴘ', _0x582412['Q'] = 'Q', _0x582412['R'] = 'ʀ', _0x582412['S'] = 'ꜱ', _0x582412['T'] = 'ᴛ', _0x582412['U'] = 'ᴜ', _0x582412['V'] = 'ᴠ', _0x582412['W'] = 'ᴡ', _0x582412['X'] = 'x', _0x582412['Y'] = 'ʏ', _0x582412['Z'] = 'ᴢ';
    var _0x15be88 = {};
    _0x15be88[_0x4144c3(0x2c2)] = function() {
        var _0x405392 = _0x4144c3;
        for (i in this[_0x405392(0x303)]) this[_0x405392(0x303)][this[_0x405392(0x303)][i]] = i;
    }, _0x15be88[_0x4144c3(0x254)] = function(_0x582b58) {
        var _0x1a7f22 = _0x4144c3,
            _0x19a593, _0x4af5a8 = '';
        _0x582b58 = _0x582b58[_0x1a7f22(0x1fb)]();
        for (var _0x509207 = 0x0, _0x45426c = _0x582b58[_0x1a7f22(0x4ce)]; _0x45426c > _0x509207; _0x509207++) _0x19a593 = this[_0x1a7f22(0x303)][_0x582b58[_0x1a7f22(0x27c)](_0x509207)], _0x1a7f22(0x1c2) == typeof _0x19a593 && (_0x19a593 = _0x582b58['charAt'](_0x509207)), _0x4af5a8 += _0x19a593;
        return _0x4af5a8;
    }, _0x15be88[_0x4144c3(0x591)] = function(_0x557a18) {
        var _0x50a4c8 = _0x4144c3;
        for (var _0x38bb85, _0xc19785 = '', _0x37a8af = 0x0, _0x9c6a94 = _0x557a18[_0x50a4c8(0x4ce)]; _0x9c6a94 > _0x37a8af; _0x37a8af++) _0x38bb85 = this[_0x50a4c8(0x303)][_0x557a18['charAt'](_0x37a8af)], _0x50a4c8(0x1c2) == typeof _0x38bb85 && (_0x38bb85 = _0x557a18[_0x50a4c8(0x27c)](_0x37a8af)), _0xc19785 += _0x38bb85;
        return _0xc19785;
    }, _0x15be88[_0x4144c3(0x303)] = _0x582412;
    var _0x1e9dfd = {};
    _0x1e9dfd[_0x4144c3(0x483)] = _0x394c1c, _0x1e9dfd['mirror'] = _0x1d7269, _0x1e9dfd[_0x4144c3(0x199)] = _0xace9b6, _0x1e9dfd[_0x4144c3(0x2cd)] = _0x35829a, _0x1e9dfd['squares'] = _0x3f642c, _0x1e9dfd[_0x4144c3(0x343)] = _0x22733f, _0x1e9dfd[_0x4144c3(0x111)] = _0x459553, _0x1e9dfd[_0x4144c3(0x357)] = _0x15be88, this[_0x4144c3(0x593)] = _0x1e9dfd;
    for (i in this[_0x4144c3(0x593)]) this['tools'][i]['init']();
    this[_0x4144c3(0x4b5)] = function(_0x184897) {
        var _0xf02e8d = _0x4144c3;
        for (var _0x33e17c, _0x24f265 = '', _0x5be009 = !0x0, _0x20d114 = 0x0, _0x5b7740 = 0x0, _0x36e43a = 0x0, _0x3d77d8 = _0x184897[_0xf02e8d(0x4ce)]; _0x3d77d8 > _0x36e43a; _0x36e43a++) _0x33e17c = _0x184897[_0xf02e8d(0x4b3)](_0x36e43a), 0xa == _0x33e17c || 0xd == _0x33e17c ? (_0x24f265 += '<br>\x0a', _0x5be009 = !0x0) : 0x20 == _0x33e17c ? _0x5be009 ? (_0x24f265 += '\x20', _0x5be009 = !0x1) : (_0x24f265 += '\x20', _0x5be009 = !0x0) : (_0x33e17c >= 0xd800 && 0xdbff >= _0x33e17c ? (_0x20d114 = _0x33e17c, _0x5b7740 = 0x0) : _0x20d114 > 0x0 ? (_0x33e17c >= 0xdc00 && 0xdfff >= _0x33e17c && (_0x5b7740 = 0x400 * (_0x20d114 - 0xd800) + (_0x33e17c - 0xdc00) + 0x10000), _0x20d114 = 0x0) : _0x5b7740 = _0x33e17c, 0x0 != _0x5b7740 && (_0x24f265 += _0xf02e8d(0x3eb) + _0x5b7740['toString'](0x10) + ';', _0x5be009 = !0x0));
        return _0x24f265;
    };
}

function cuteText(_0x1f3f64) {
    var _0xe5f847 = _0x4ca65f;
    if (_0x1f3f64['trim']() === '') return '';
    qi = -0x1;
    var _0x32fee9 = boundingString(Math[_0xe5f847(0x1c8)](Math[_0xe5f847(0x4f1)]() * 0x2) + 0x1);
    return _0x32fee9 + _0xe5f847(0x2a0) + _0x1f3f64['split'](/([!?.]+)/gi)[_0xe5f847(0x303)](cuteSentence)[_0xe5f847(0x55c)]('') + _0xe5f847(0x2a0) + esrever[_0xe5f847(0x402)](_0x32fee9);
}

function cuteSentence(_0x1650e1) {
    var _0x5440e2 = _0x4ca65f;
    return _0x1650e1[_0x5440e2(0x500)](/([\s,]+)/gi)[_0x5440e2(0x303)](cuteWord)['join']('');
}

function cuteWord(_0x38bad4) {
    var _0x11e7f3 = _0x4ca65f;
    if (_0x38bad4 === '' || /[[!?.\s,]+]/gi [_0x11e7f3(0x2ce)](_0x38bad4)) return _0x38bad4;
    return _0x38bad4 = roundReplace(_0x38bad4), _0x38bad4 = punctReplace(_0x38bad4), _0x38bad4 = emojiReplace(_0x38bad4), scriptify(_0x38bad4);
}
var qi = -0x1,
    qa = ['❝', '❞'];

function quotes() {
    qi++;
    if (qi === 0x2) qi = 0x0;
    return qa[qi];
}

function punctReplace(_0x2f5fa3) {
    var _0x122896 = _0x4ca65f;
    return _0x2f5fa3[_0x122896(0x500)]('')[_0x122896(0x303)](function(_0x454aa0) {
        if (_0x454aa0 === '!') return randomElement(['❣', '❢']);
        else {
            if (_0x454aa0 === '?') return randomElement(['¿', '?']);
            else {
                if (_0x454aa0 === '\x22') return quotes();
                else return _0x454aa0;
            }
        }
    })[_0x122896(0x55c)]('');
}

function emojiReplace(_0x4242b5) {
    var _0x44e634 = _0x4ca65f;
    return _0x4242b5[_0x44e634(0x582)](':)', randomElement(emoji[':)']))[_0x44e634(0x582)]('(:', randomElement(emoji[':)']))[_0x44e634(0x582)]('^^', randomElement(emoji['^^']))[_0x44e634(0x582)](':P', randomElement(emoji[':p']))[_0x44e634(0x582)](':p', randomElement(emoji[':p']))['replace'](':D', randomElement(emoji[':D']))[_0x44e634(0x582)]('<3', randomElement(emoji['<3']))['replace'](_0x44e634(0x558), randomElement(emoji['(y)']))[_0x44e634(0x582)](_0x44e634(0x470), randomElement(emoji[_0x44e634(0x558)]));
}

function roundReplace(_0x377135) {
    var _0x1d0dde = _0x4ca65f;
    return _0x377135[_0x1d0dde(0x500)]('')['map'](function(_0x370def) {
        var _0x24546c = _0x1d0dde;
        return _0x370def[_0x24546c(0x515)]() === 'o' || _0x370def === '0' ? randomElement(round) : _0x370def;
    })[_0x1d0dde(0x55c)]('');
}
var ar = {};
ar[':)'] = [_0x4ca65f(0x502), _0x4ca65f(0x3ee), _0x4ca65f(0x550), _0x4ca65f(0xb5), _0x4ca65f(0x48d), _0x4ca65f(0x23d), _0x4ca65f(0x1b4), '😍', 'ツ', _0x4ca65f(0x397), '🌘‿🌘', _0x4ca65f(0x43b), '(/◔◡◔)/', 's(^‿^)-b', _0x4ca65f(0x4f5), _0x4ca65f(0x268), _0x4ca65f(0x17f)], ar['^^'] = [_0x4ca65f(0x508), _0x4ca65f(0x411), _0x4ca65f(0xf7), _0x4ca65f(0x4b8), _0x4ca65f(0x520), '^ㅅ^', _0x4ca65f(0x24a), _0x4ca65f(0x2cf), _0x4ca65f(0x1a0), _0x4ca65f(0x24e), ''], ar[':p'] = [':Þ', ''], ar[':D'] = [_0x4ca65f(0x28a), '(✿◕ᗜ◕)━♫.*･｡ﾟ', _0x4ca65f(0x38c)], ar['<3'] = ['♡', '❤', '♥', '❥', '💘', '💙', '💗', '💖', '💕', '💓', '💞', '💝', '💟'], ar[_0x4ca65f(0x558)] = ['👍', '👌'];

function _0xc7c4() {
    var _0x147442 = ['2&#838;', '✨✩✪✫✬✭✮✯✰✦✱✲✳✴✵✶✷֍֎✸✹✺✻✼✽✾✿❀❁❂❃❄★☆＊', '&#120471;&#823;', '🖂︎', '&#1073;', '&#41555;', 'P&#826;', '&#41296;', '👎︎', 'A&#828;', 'weirdBox', '&#4329;', '.rand', 's31', '&#41807;', '&#7433;', 'class', 'b&#857;', '&#41157;', 'wideTextCharMapFun', '&#120458;&#823;', 'px}\x20</style>', '[̲̅$1]', '&#651;', '&#1360;', '.result-s8', '8&#826;', 'B&#857;', '&#943;', '.underline', '&#12425;', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20[[text]]\x20°º¤ø,¸¸,ø¤º°`°º¤ø,¸', '&#669;', 'h&#838;', '&#41346;', '&#670;', '&#1071;', 'g&#866;', '&#5198;', '•´¯`•.\x20', '\x22\x20/><span\x20class=\x22copybtn\x22>✔\x20Copied\x20!</span></p>', '••¤(`×', 'strikeThrough', '.littleSparkles', 'y&#829;&#851;', 'm&#826;', '.squiggle5CharMap', '(\x20ﾟ∀ﾟ)ﾉ【[[text]]】', '&#42148;', '&#1092;', 's27', 'J&#828;', '&#x', 'u&#857;', 'M&#826;', '(•◡•)', 'B&#826;', 'z&#829;&#851;', '&#120442;&#823;', 'r&#826;', '&#490;', '&#2670;', 'P&#838;', 'y&#826;', 'l&#826;', 'I&#828;', 'C&#830;', '8&#866;', 's29', 'リサフランク現代のコンピュ竹内\x20まりや若者が履く流行のスニーカー真夜中のドアホットドッグマスターストライカーソニーブギ新しい日の誕生ライフ\x20-\x20ヒスイ蒸気波\x20無線゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゙゚゛゜ゝゞゟ亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育壱逸茨芋引印因咽姻員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科', 's&#866;', '&#420;', 'bentTextCharMapFun', '▀▄▀▄▀▄\x20', 'i&#846;', 'reverse', 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890', '&#9730;', 'Y&#846;', '&#120822;&#823;', '&#592;', '.heartsBetween', '&#41076;', 's&#826;', 'neonCharMapFun', '&#1059;', 'ღ(¯`◕‿◕´¯)\x20♫\x20♪\x20♫\x20[[text]]\x20♫\x20♪\x20♫\x20(¯`◕‿◕´¯)ღ', 'selecopyit', 'd&#799;', 'l&#857;', '(✿^▽^)', '•?((¯°·._.•\x20', 'n&#799;', '&#1342;', '&#120477;&#823;', '&#120482;&#823;', 'b&#829;&#851;', '&#586;', 'U&#838;', '🏱︎', '.firework', '&#429;', '×º°”˜`”°º×\x20', '5&#846;', '4&#826;', 'Y&#830;', 'c&#830;', 'scroll', '&#8355;', 'x&#857;', 'c&#866;', 'm&#846;', '&#10003;', '.squiggle6CharMap', 'Z&#799;', '.stylenamelist\x20.stylename', '2&#828;', '&scaron;', '&#9835;', '&#435;', '&#41804;', 'W&#846;', 't&#799;', 'boldItalicCharMapFun', '&#545;', '&#41754;', '&#120474;&#823;', '&#645;', '.strikeThrough', 'cookie', 's&#846;', 's23', '(づ｡◕‿‿◕｡)づ', 'U&#866;', 'K&#826;', '.result-s15', 'B&#829;&#851;', 'dottyJoiner', '&#41141;', '1&#830;', 'b&#846;', 's13', 'g&#846;', '🕮︎', 'fullCrazy', 'c&#838;', '&#272;', 'a&#838;', '.scriptify', 'x&#829;&#851;', '&#42128;', 'futureAlienCharMapFun', '&#394;', 'ready', 'F&#799;', '&#276;', 'D&#857;', 'fixedtop', '&#41007;', '(¯`·.¸¸.->\x20°º\x20', '&#120441;&#823;', '&#9834;', 'Z&#846;', '-漫~*\x27¨¯¨\x27*·舞~\x20', 'q&#857;', '&#1331;', 'b&#838;', '&#1179;', '`•.,¸¸,.•´¯\x20', 'M&#828;', '—(••÷', '&#10129;', 'recentlist', '&#1111;', '&#401;', '˜”*°•.˜”*°•\x20', 'Y&#826;', '&#548;', '&#120824;&#823;', '`•.,¸¸,.•´¯\x20[[text]]\x20¯`•.,¸¸,.•´', '&#351;', 'window', 'diacriticsMiddle', '<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22', 'R&#866;', '(Y)', '&#120831;&#823;', '&#1048;', 'g&#828;', '&#438;', '.result-s5', '&#1359;', 'push', 'C&#838;', '&#286;', '&ugrave;', 'find', 'A&#830;', 'F&#829;&#851;', 'b&#830;', 'N&#846;', 'a&#826;', 'T&#846;', '&#381;', 'flip', 'v&#826;', '&#120467;&#823;', '&#4331;', 'html', 'p&#866;', '&#41508;', '&#336;', '📄︎', '&#652;', '(｡◕‿◕｡)', '&#1063;', 'mapInverse', 'text', '1&#829;&#851;', 'A&#866;', 's24', '.diametricAngleFrame', 'P&#799;', '&#1028;', '&#41016;', '&#1283;', '(¯`·.¸¸.·´¯`·.¸¸.->\x20', '&#120446;&#823;', 'execCommand', '&#627;', 'G&#866;', 's&#829;&#851;', 'p&#846;', '&#996;', '&#1074;', '570QRkrFU', 's&#828;', 'scrollTop', '&#291;', 'i&#828;', 'o&#838;', '🕯︎', '&#327;', '&#1097;', '🕛︎', 'Q&#826;', '9&#799;', 'X&#866;', '&#549;', 'v&#866;', '.vaporwaveText', '💣︎', 'charCodeAt', '#mobile-fly-menu', 'getHTML', '&#4327;', 'J&#838;', 'ᵔᴥᵔ', '&#120480;&#823;', '540taiuhY', 'H&#829;&#851;', 'N&#799;', 'E&#828;', '&#1076;', '&#1397;', 'w&#846;', 'w&#830;', '&#40984;', 'firework', 'q&#866;', 'v&#799;', 'contentEditable', '&#423;', '&#1223;', '&#541;', '&#5615;', '9&#826;', '&#408;', '&#120454;&#823;', 'length', '(っ◔◡◔)っ\x20♥\x20', '.slashThrough', 't&#830;', 'e&#799;', '&#9739;', 'V&#829;&#851;', '&#10081;', '#textSize', '&#4335;', '&#41426;', '6&#830;', '&#434;', '1&#857;', '6&#857;', '&#42180;', '&#65420;', '&#341;', '&#1377;', '(¯`*•.¸,¤°´✿.｡.:*\x20[[text]]\x20*.:｡.✿`°¤,¸.•*´¯)', '.flourish8', '&#313;', '������', '••¤(`×[¤\x20[[text]]\x20¤]×´)¤••', '&#9791;', 'e&#826;', '&#1087;', '9&#830;', 'h&#846;', '.result-s29', '#share-link', '↫↫↫↫↫\x20[[text]]\x20↬↬↬↬↬', 'F&#838;', 'n&#866;', 'L&#828;', 'random', 'w&#838;', '.currencyCharMap', '.lunicreepify', '(人◕‿◕)', 'W&#857;', '64872UgMFhe', '&#4330;', '&Omega;', '&yen;', '2&#830;', 'U&#830;', 'y&#846;', '9&#828;', 'monospaceCharMapFun', 'split', '8&#829;&#851;', '٩(˘◡˘)۶', '&#387;', '🕐︎', '&#5511;', '&#5262;', 'O&#828;', '(^▽^)', '[[text]]', '『$1』', 'indexOf', '\x20•°*”˜.•°*”˜', '.stinky', '&#10127;', '&#120449;&#823;', 'j&#828;', '&#1180;', 'g&#829;&#851;', 'l&#829;&#851;', '•´¯`•.\x20[[text]]\x20.•´¯`•', 'toLowerCase', 'K&#838;', '&#638;', '┗(^o^\x20)┓三\x20[[text]]\x20三\x20┗(^o^\x20)┓', 'Q&#866;', '&#608;', 'W&#838;', 'B&#838;', '&#1192;', 'selectNodeContents', 'J&#846;', '(≧◡≦)', 'E&#830;', '.stylenamerecentlist\x20.stylename', '&#5623;', '&epsilon;', '&#9837;', 'w&#866;', 's11', 'i&#826;', 'diacriticsTop', '#load-more', '&#2797;', 'doubleStruckCharMapFun', '.bentTextCharMap', '&#4310;', 'R&#829;&#851;', '#loader', 'u&#838;', '§.•´¨\x27°÷•..×\x20', '6&#829;&#851;', '👓︎', 's16', '☽≫≻≽≿⋝⋟⋑⊃⊐⊒⫸》＞❯❱', '&#9812;', '¸¸♬·¯·♩¸¸♪·¯·♫¸¸\x20[[text]]\x20¸¸♫·¯·♪¸¸♩·¯·♬¸¸', '&#4336;', '\x20⋆\x20', '.lunitoolsbubbles', '&#8857;', '⫷\x20[[text]]\x20⫸', '⚔️\x20[[text]]\x20⚔️', '【｡_｡】\x20[[text]]\x20【｡_｡】', '&#1185;', 'K&#830;', '&#5845;', 'addRange', '&#4318;', '&#1062;', '&iuml;', '&#41833;', 'match', 'H&#826;', '&#120470;&#823;', 'maxHeight', 'expires', '7&#826;', '&#268;', '&#41037;', '(ɔ◔‿◔)ɔ', '.result-s22', 'q&#830;', '&#1358;', 'J&#799;', 'h&#866;', '&#2799;', '📬︎', '(y)', '➶➶➶➶➶\x20[[text]]\x20➷➷➷➷➷', '🖮︎', '2&#826;', 'join', '&#5500;', 'x&#799;', '3&#829;&#851;', 'n&#830;', 'K&#846;', '&#120443;&#823;', '.cuteText', '&#9815;', 'fromCharCode', 'top', 'i&#866;', '&#5397;', 'Q&#846;', 'currencyCharMapFun', 'G&#828;', '0&#857;', '&#41203;', '4&#838;', '&szlig;', 'O&#866;', 'Y&#799;', 'squiggle2CharMapFun', 'z&#857;', 'f&#838;', '&#1141;', '&#65434;', 'createTextRange', 'invertedSquaresCharMapFun', '|!¤*\x27~``~\x27*¤!|\x20[[text]]\x20|!¤*\x27~``~\x27*¤!|', 'heartsBetween', 'nodeName', '1&#799;', '<style>\x20.stylename\x20p{font-size:', '.•°¤*(¯`★´¯)*¤°\x20', '&#941;', '&#120464;&#823;', 'setSelectionRange', 'replace', '&#613;', '&#41105;', '&#270;', '&#41571;', '&#998;', '—(••÷[\x20[[text]]\x20]÷••)—', '&#41769;', '.invertedSquaresCharMap', '2&#846;', 'v&#829;&#851;', 'b&#866;', 'y&#857;', 'doubleUnderline', '.leftsection\x20.close', 'decode', '&#8134;', 'tools', '&#407;', '.flourish1', '💧︎', 's19', 'q&#799;', '&#1210;', '&#409;', 'remove', '&#9442;', 'P&#846;', '.thickBlockFramed', '.squiggle2CharMap', '.result-s1', 'T&#826;', 'R&#826;', 'c&#828;', '(¯`·.¸¸.·´¯`·.¸¸.->\x20[[text]]\x20<-.¸¸.·´¯`·.¸¸.·´¯)', '&#120468;&#823;', '<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>', 'Y&#838;', '&#120450;&#823;', '❀◕‿◕❀', '🗐︎', 'm&#830;', 'f&#828;', 'I&#826;', '\x20.o0×X×0o.\x20[[text]]\x20.o0×X×0o.', 'j&#846;', '.copied', 'G&#829;&#851;', 'italicCharMapFun', '&#477;', '&#294;', '&#120475;&#823;', '◥꧁ད\x20[[text]]\x20ཌ꧂◤', '★·.·´¯`·.·★\x20[[text]]\x20★·.·´¯`·.·★', '&#5167;', 'Z&#838;', 'k&#857;', 'squares', '.flourish5', 'q&#826;', '&sigma;', 'Copy', '18770463RJowdp', 'R&#846;', '&#41712;', 'upperAnglesCharMapFun', '&#639;', 'input', '&#41045;', 'o&#826;', '&iota;', '&micro;', 'randomization', 'a&#857;', '🖫︎', '8&#828;', 'S&#828;', '&#41246;', 'N&#857;', 'a&#799;', '&#41427;', '`•.¸¸.•´´¯`••._.•\x20', '&#120463;&#823;', '&#3057;', 'h&#829;&#851;', '&#989;', 'A&#799;', '&#41823;', 'b&#826;', '★·.·´¯`·.·★\x20', 'g&#826;', '&#120478;&#823;', '.result-s7', '&#5029;', '୧(•̀ᗝ•́)૭\x20[[text]]\x20୧(⇀‸↼‶)૭', 'insertBefore', 'F&#830;', '&#41648;', '.stylenamelist', 'click', 'medievalCharMapFun', '••.•´¯`•.••\x20[[text]]\x20••.•´¯`•.••', 'R&#857;', '&#42075;', '&#41126;', 'ᵔ⌣ᵔ', 'u&#828;', '.result-s9', 'object', '🗏︎', '🕆︎', '&#41029;', '&#120448;&#823;', '▌│█║▌║▌║\x20[[text]]\x20║▌║▌║█│▌', '&#41204;', 'l&#846;', '&Gamma;', '&#942;', 'L&#857;', '#scroll', 'bottom', '•]••´º´•»\x20[[text]]\x20«•´º´••[•', '&#1488;', '&#985;', 'w&#799;', 'val', '&#595;', 's22', '7&#829;&#851;', 'G&#830;', '&#41042;', 'bent', '4&#846;', 'exports', 's14', 'r&#866;', 'k&#826;', 'I&#829;&#851;', '&beta;', '&otilde;', '&#41433;', 'input\x20change', '&#1050;', '</p></div>', 'animate', '🖃︎', '🖰︎', '&#120481;&#823;', '.result-s30', 'ıllıllı\x20[[text]]\x20ıllıllı', 'D&#799;', 'G&#838;', '&#41295;', '&#42159;', '🕭︎', '.oldEnglishCharMap', '4&#799;', 'S&#829;&#851;', '&#1075;', '&#23610;', '&#120451;&#823;', '.kirbyHug', 'N&#838;', 'y&#799;', '.leftsection', '7&#866;', '&#41074;', 'j&#830;', '.flourish7', 'N&#829;&#851;', '&#1347;', '&#940;', '&#41706;', '.italicCharMap', '3&#826;', '&#41949;', 'G&#857;', 'o&#846;', '.result-s20', '&#120456;&#823;', '&#9790;', 'h&#826;', '&#646;', '&#8984;', 'l&#828;', 'D&#838;', '.result-s12', 'slashThrough', 'X&#846;', 'F&#828;', 'addClass', '7&#846;', 'mirror', 'g&#838;', '&#1056;', 'fadeOut', 's&#830;', 'r&#799;', 'F&#857;', '🖬︎', '&#41392;', '667710HPLChL', 'J&#829;&#851;', '&#5741;', 'fadeIn', 't&#826;', 'C&#829;&#851;', '.result-s25', 'S&#838;', '&#2798;', '&#411;', '&#12552;', '&#41660;', '2&#857;', '&#1008;', 'K&#829;&#851;', '&#346;', 'c&#826;', 'l&#838;', '★彡\x20[[text]]\x20彡★', '3&#838;', '&#623;', 'ஜ۩۞۩ஜ\x20[[text]]\x20ஜ۩۞۩ஜ', 'S&#826;', '`•.¸¸.•´´¯`••._.•\x20[[text]]\x20•._.••`¯´´•.¸¸.•`', '&#1344;', '&#400;', 'boldCharMapFun', 'K&#799;', '¤\x20(¯´☆✭.¸_)¤\x20[[text]]\x20¤(_¸.✭☆´¯)\x20¤', 'H&#846;', '&#2794;', '&#2749;', '&#42130;', '&#344;', '&#358;', '&#1064;', 'q&#846;', '&#625;', '&#1090;', '🖲︎', '◔◡◔', '&#3923;', '0&#799;', '3&#846;', 'Q&#857;', '&#4306;', '&#41005;', 't&#866;', '&#41081;', '0&#846;', '&#1356;', 'b&#799;', '°°°·.°·..·°¯°·._.·\x20[[text]]\x20·._.·°¯°·.·°\x20.·°°°', '&#356;', '&omega;', 't&#828;', '&#1065;', 'p&#830;', '.wideTextCharMap', '.result-s17', 's&#838;', '&#1171;', '&#120436;&#823;', 'S&#830;', '&#4308;', '&#5556;', 'creepify', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20', '&#2792;', 'getSelection', 'L&#866;', '6&#846;', '.symbolsCharMap', '◠◡◠', '7&#830;', '×º°”˜`”°º×\x20[[text]]\x20×º°”˜`”°º×', '&dagger;', '#y2k-font', '(¯´•._.•\x20', 'M&#866;', 'squiggle6CharMapFun', 'l&#799;', 'h&#828;', '9&#846;', '&#1348;', '♪ღ♪*•.¸¸.•*¨¨*•.♪\x20[[text]]\x20♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪', '*•.¸♡\x20[[text]]\x20♡¸.•*', 'N&#830;', 's21', 'V&#866;', '&phi;', 't&#857;', 'E&#829;&#851;', '◕‿◕', 'x&#830;', '&#7990;', '817261WLPsod', 'p&#826;', 'u&#830;', '5&#830;', 'n&#826;', 'round', '&#41686;', 'd&#866;', 'p&#829;&#851;', '&#1095;', '&#1052;', 'undefined', '&#120476;&#823;', '📁︎', '&#40974;', '&#1112;', '410956yXFLDh', 'floor', '&#323;', '&#1082;', '&#350;', 'E&#857;', '&#120444;&#823;', '&#1047;', 'O&#830;', '🕔︎', 'U&#826;', 'middle', 'Y&#828;', 'V&#826;', '░▒▓█►─═\x20\x20[[text]]\x20═─◄█▓▒░', '&#295;', '📫︎', '🖴︎', '0&#829;&#851;', '&#614;', 'X&#826;', 'y&#866;', '.result-s14', 'R&#830;', '.crazyWithFlourishOrSymbols', 'f&#826;', 'squiggleCharMapFun', 'e&#828;', 'w&#826;', 'T&#799;', '&#1072;', 'W&#799;', '&#120447;&#823;', '&#41751;', 'L&#826;', '&Delta;', '.lunisquares', '.monospaceCharMap', '&#120453;&#823;', '&#41733;', '&#5610;', '&#413;', '&#447;', 'J&#857;', 'I&#838;', '&part;', '&#41674;', '&#41008;', '&#607;', '【〖〘〚［', 'hide', '&#258;', 'toUpperCase', 'd&#846;', 'f&#846;', 'g&#799;', '.squiggle3CharMap', '•._.••´¯``•.¸¸.•`\x20[[text]]\x20`•.¸¸.•´´¯`••._.•', 'textSize', '3&#857;', '&#120827;&#823;', 'asianStyle2CharMapFun', '.y2k-font', '&#382;', '.doubleUnderline', 'l&#830;', 'amd', '&kappa;', '3&#799;', '📂︎', '&#1291;', '&#1340;', '•°¯`••\x20[[text]]\x20••´¯°•', '&#120433;&#823;', 's25', 'copy', 'append', '&#41266;', '&#4325;', '&#1193;', '&#120472;&#823;', '&#120435;&#823;', 'w&#828;', 'R&#799;', '&#41080;', '&#1049;', '.medievalCharMap', '&#1330;', '&#4317;', '&#391;', '&#3648;', '&#1338;', 'f&#857;', '-·=»‡«=·-\x20[[text]]\x20-·=»‡«=·-', 'E&#846;', '•´¯`•»\x20', 'l&#866;', 'show', 'U&#857;', ',-*\x27\x20^\x20\x27~*-.,_,.-*~\x20[[text]]\x20~*-.,_,.-*~\x27\x20^\x20\x27*-,', 'T&#828;', '&#1046;', '✿.｡.:*\x20☆:**:.\x20[[text]]\x20.:**:.☆*.:｡.✿', 'Z&#826;', 'D&#829;&#851;', '.luniroundsquares', 'E&#838;', '8&#799;', 'I&#830;', '&#40996;', 'a&#866;', '&#633;', '&#1084;', '꧁༒☬\x20[[text]]\x20☬༒꧂', 'R&#828;', 'H&#838;', '&#10124;', '3&#830;', '●‿●', 'm&#866;', '5&#857;', '.result-s18', '🖳︎', 'y&#830;', 'k&#829;&#851;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', 'INPUT', '&Xi;', '&#9736;', 'arrowBelow', '&#7918;', '^ㅂ^', 'removeAllRanges', 'L&#846;', '·.¸¸.·♩♪♫\x20[[text]]\x20♫♪♩·.¸¸.·', '⁀‿⁀', 'y&#838;', '&#615;', 'T&#830;', 'body', '๑۞๑,¸¸,ø¤º°`°๑۩\x20', 'encode', 'A&#857;', 'P&#866;', 'L&#838;', 'C&#857;', '.wingdings', '(-_-)\x20[[text]]\x20(-_-)', '&#3182;', '.weirdBox', '1&#828;', '&#340;', 'Y&#866;', 'v&#846;', 'r&#846;', '&#41120;', 'O&#799;', '&#377;', 'f&#799;', '⎝⎝✧GͥOͣDͫ✧⎠⎠\x20[[text]]\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', '╚»★«╝\x20[[text]]\x20╚»★«╝', '(✿╹◡╹)', '🕗︎', '<%=\x20version\x20%>', '&#120457;&#823;', 'M&#829;&#851;', '&#41155;', '&#9773;', 'userAgent', 'r&#857;', '&#1060;', '4&#829;&#851;', '◥꧁ད\x20ॐ卐[[text]]\x20卐ॐ\x20ཌ꧂◤', 'N&#826;', '.fullCrazy', 'T&#866;', 'squiggle5CharMapFun', 's18', 'r&#829;&#851;', '&#1044;', 'v&#828;', 'charAt', '¤¸¸.•´¯`•¸¸.•..>>\x20', '&#406;', '.result-s19', '5&#828;', 'O&#826;', 'O&#857;', '&#576;', '&#5229;', '&#315;', '•._.••´¯``•.¸¸.•`\x20', '&#3588;', '&#1085;', '&#642;', '(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧', 'V&#828;', 'z&#826;', '&#1202;', '&#428;', '&#41991;', '&#5620;', '.result-s3', '&#120439;&#823;', '.vaporwaveText2', '&#412;', '&#1506;', '&#5205;', '&#41053;', '&#4315;', '&#41556;', '&#1337;', 'v&#830;', '&#416;', 'b&#828;', '5&#838;', 'H&#828;', '\x20\x20🎀\x20\x20', '&#1351;', ']|I{•------»\x20', '.tildeStrikeThrough', '&#120469;&#823;', 'M&#799;', '[[text]]\x20☜(`o´)', '&#8627;', '.stylenamerecentlist', '🕚︎', '&#120440;&#823;', 'e&#838;', '&#1031;', '&#392;', 'L&#830;', 'function', '&#355;', 'readOnly', '&#120455;&#823;', '&#41707;', 'u&#799;', 'S&#846;', '&#374;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20[[text]]\x20█\x20▇\x20▆\x20▅\x20▄\x20▂\x20▁', 'hasOwnProperty', 'J&#866;', '&#404;', 'M&#857;', '4&#857;', 'Y&#829;&#851;', 'o&#829;&#851;', '&rho;', '&Oslash;', '&Mu;', 'init', '.vaporwaveText1', '&#120465;&#823;', '◦•●◉✿\x20[[text]]\x20✿◉●•◦', 'O&#838;', '.result-s11', 'i&#829;&#851;', 'S&#857;', '&#120830;&#823;', 'C&#826;', 'html,\x20body', 'bubbles', 'test', '(⌒‿⌒)', '&sigmaf;', '¸,ø¤º°`°º¤ø,¸\x20', '1&#826;', '.result-s21', '🕑︎', 'C&#799;', '.squiggle4CharMap', 'X&#838;', 'w&#857;', 'createRange', '&#41240;', 'n&#838;', '&#654;', 'j&#826;', '&#1041;', 'TEXTAREA', '&#410;', '.wavyJoiner', '&#1350;', '&#120438;&#823;', 'x&#866;', 'd&#829;&#851;', '&#988;', '🕓︎', '&#2414;', '&#484;', '8&#857;', 'j&#857;', 'tildeStrikeThrough', '&#2790;', 'i&#830;', 'S&#799;', '🕘︎', '.result-s16', 'p&#828;', 'e&#829;&#851;', '&Uacute;', 'cursiveCharMapFun', '&#647;', '&#321;', '&#41079;', '&#40983;', 'options', 'A&#846;', 'J&#830;', '&#311;', '&#10122;', '1159092aqOrvR', '&#292;', '&thorn;', 'U&#828;', 'map', 'j&#866;', '&#372;', '&#1103;', '&alpha;', '5&#799;', '6&#828;', 's20', 'w&#829;&#851;', '&#1094;', 'x&#826;', '&#120473;&#823;', '<div\x20class=\x22stylename\x22><span>Recently\x20Used</span><p\x20onclick=\x22copyit(this)\x22\x20data-clipboard-target=\x22.', '&#385;', '.cursiveCharMap', 'max', 'Q&#830;', '-漫~*\x27¨¯¨\x27*·舞~\x20[[text]]\x20~舞*\x27¨¯¨\x27*·~漫-', 'G&#799;', 'o&#799;', '.result-s27', '.dottyJoiner', '3&#866;', 'q&#828;', 'vaporwaveText', '&#120434;&#823;', '.squaresCharMap', '&#42181;', 'M&#830;', 'squaresCharMapFun', 'a&#829;&#851;', '🕒︎', 'nodeType', '$2$1', 's26', '&#1131;', '👌︎', '.superscriptCharMap', '😐︎', '2&#829;&#851;', '6&#799;', 'trim', 'e&#830;', ']|I{•------»\x20[[text]]\x20«------•}I|[', '&#42014;', '6&#866;', 'V&#799;', '&fnof;', 'S&#866;', 'N&#866;', '꧁𓊈𒆜\x20[[text]]\x20𒆜𓊉꧂', 'E&#866;', '7&#799;', '&#41708;', '▀▄▀▄▀▄\x20[[text]]\x20▄▀▄▀▄▀', '╰☆☆\x20[[text]]\x20☆☆╮', 'scriptify', 'W&#829;&#851;', 'E&#826;', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20[[text]]\x20¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', '7&#857;', '&#120445;&#823;', '๑۞๑,¸¸,ø¤º°`°๑۩\x20[[text]]\x20๑۩\x20,¸¸,ø¤º°`°๑۞๑', '&#403;', 'roundsquares', '.flourish6', 'a&#828;', 'P&#828;', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', '.greekCharMap', 'diacriticsBottom', '4EXOnoz', '&nu;', '░▒▓█\x20[[text]]\x20█▓▒░', '8&#830;', '】〗〙〛］', 'K&#828;', '¸„.-•~¹°”ˆ˜¨\x20', '&#20057;', 't&#829;&#851;', 'N&#828;', '&#310;', '6&#838;', '&#1138;', 'tiny', 'x&#838;', 's12', '&#41922;', '&#5196;', '.result-s26', '🕈︎', '&#1333;', '<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22Press\x20CTRL+C\x20to\x20copy\x22\x20/></p>', '&chi;', '&#1130;', 'M&#846;', '&#120823;&#823;', '&#987;', '&upsilon;', 'd&#838;', '&#7828;', '&#9450;', 'H&#866;', 'Q&#799;', 's15', '8&#838;', '&#120829;&#823;', '&#4357;', '9&#838;', 'v&#857;', '&#8467;', '&#9687;', '&#1051;', '&#120452;&#823;', 'p&#838;', '&psi;', 'c&#857;', '&#422;', 'O&#846;', '0&#830;', '&euro;', '&Lambda;', 'W&#830;', 'W&#828;', '&#42171;', 'U&#799;', '.squiggleCharMap', 'p&#857;', 'M&#838;', '&#618;', 't&#838;', 't&#846;', 's30', 'asianStyleCharMapFun', '1&#846;', '5&#826;', '&#974;', 'ᕕ(ᐛ)ᕗ', 'recenttext', '&#8023;', '&#1352;', 'V&#838;', 'Y&#857;', 'littleSparkles', '4&#830;', '&#1349;', '&eta;', 'moveToElementText', '(✿ヘᴥヘ)', '&#9796;', '&#5609;', '&#296;', 'e&#866;', '&#42150;', '.lunitoolsflipencode', 'H&#799;', '&forall;', 'E&#799;', 'T&#857;', 'pop', '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', 'I&#857;', 'g&#830;', '👍︎', '&#653;', 'u&#866;', '&#120826;&#823;', '&#120825;&#823;', 'u&#846;', '&#12581;', 'H&#830;', 'Q&#838;', 'x&#828;', 'U&#829;&#851;', '&#41532;', '&#120466;&#823;', '.result-s4', '&#308;', '&#5290;', '0&#866;'];
    _0xc7c4 = function() {
        return _0x147442;
    };
    return _0xc7c4();
}
var emoji = ar,
    round = ['❁', '🌺', '❀', '💮', '🏵', '🌸', '☯', '😍', '♡', '🍩', '🍬', '💙', '🌞', '💍', '🍪', '❤', '💗', '🍑', '💞'],
    food = ['🍬', '🍭', '🍒', '🍎', '🍉', '🍇', '🍓', '🍌', '🍑', '🍰', '🎂', '🍩', '🍪', '🍧', '🍦', '🍫', '🍡'],
    flowers = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    twinkles = ['⚛', '🌌', '🌠', '*', ':', '｡', '･ﾟ', '✧', '✮', '★', '✩', '⋆', '.', '°', '`', '✴', '｡', '✴', '⋆', '✳', '✶', '✷', '❈'],
    animals = ['🐯', '🐎', '🐖', '🐷', '🐏', '🐑', '🐐', '🐫', '🐘', '🐭', '🐁', '🐀', '🐹', '🐰', '🐇', '🐿', '🐻', '🐨', '🐼', '🐾', '🐔', '🐓', '🐣', '🐤', '🐥', '🐦', '🐧', '🕊', '🐸', '🐢', '🐳', '🐋', '🐬', '🐟', '🐠', '🐡', '🐙', '🐚', '🐌', '🐞'],
    plants = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    misc = ['🌌', '🌠', '🎉', '🎊', '🎈', '💌', '🎎', '🎁', '🎀', '🕯', '🔮', '🛀', '🎖', '🏆', '🏅', '👑', '💍', '👶', '👼', '👸', '👯', '👒', '👻'],
    music = ['♫', '♬', '♪', '♩', '°', '｡', '✧', '🎻', '🎺', '🎸', '🎷', '📯'],
    flourish = [_0x4ca65f(0x412), 'ıllıllı\x20', _0x4ca65f(0x19a), '°°°·.°·..·°¯°·._.·\x20', _0x4ca65f(0x3de), _0x4ca65f(0x41d), '•]••´º´•»\x20', _0x4ca65f(0x2a2), _0x4ca65f(0x532), '•°¯`••\x20', _0x4ca65f(0x499), '*´¯`*.¸¸.*´¯`*\x20', _0x4ca65f(0x456), '°·.¸.·°¯°·.¸.·°¯°·.¸.->\x20', _0x4ca65f(0x286), _0x4ca65f(0x350), _0x4ca65f(0x1a5), _0x4ca65f(0x3e0), _0x4ca65f(0x226), _0x4ca65f(0x45f), _0x4ca65f(0x2d1), '.o0×X×0o.\x20', ',-*\x27^\x27~*-.,_,.-*~\x20', _0x4ca65f(0xdf), _0x4ca65f(0x461), _0x4ca65f(0x27d), '••.•´¯`•.••\x20', _0x4ca65f(0x57e), _0x4ca65f(0x253), _0x4ca65f(0x45a), _0x4ca65f(0xe7), _0x4ca65f(0x244), _0x4ca65f(0x400), '▌│█║▌║▌║\x20'];

function boundingString(_0x498aed) {
    return randomElement([foodString, twinkleString, animalString, flourishString])(_0x498aed);
}

function foodString(_0x2a06bd) {
    var _0x281a7b = _0x4ca65f;
    return new Array(_0x2a06bd + 0x1)[_0x281a7b(0x55c)]('0')[_0x281a7b(0x500)]('')[_0x281a7b(0x303)](function(_0x33035a) {
        return randomElement(food);
    })[_0x281a7b(0x55c)](_0x281a7b(0x53a));
}

function twinkleString(_0x451037) {
    var _0xf8c709 = _0x4ca65f;
    return new Array(_0x451037 + 0x1)[_0xf8c709(0x55c)]('0')[_0xf8c709(0x500)]('')['map'](function() {
        return randomElement(twinkles);
    })[_0xf8c709(0x55c)]('');
}

function animalString(_0x687310) {
    var _0x257a33 = _0x4ca65f;
    return new Array(_0x687310 + 0x1)[_0x257a33(0x55c)]('0')[_0x257a33(0x500)]('')[_0x257a33(0x303)](function(_0x2c471a) {
        return randomElement(animals);
    })[_0x257a33(0x55c)](_0x257a33(0x53a));
}

function flourishString(_0x321ffb) {
    return randomElement(flourish);
}

function scriptify(_0x51c937) {
    var _0x3bf52c = _0x4ca65f,
        _0x42b4fd = {};
    _0x42b4fd['0'] = '𝟢', _0x42b4fd['1'] = '𝟣', _0x42b4fd['2'] = '𝟤', _0x42b4fd['3'] = '𝟥', _0x42b4fd['4'] = '𝟦', _0x42b4fd['5'] = '𝟧', _0x42b4fd['6'] = '𝟨', _0x42b4fd['7'] = '𝟩', _0x42b4fd['8'] = '𝟪', _0x42b4fd['9'] = '𝟫', _0x42b4fd['a'] = '𝒶', _0x42b4fd['b'] = '𝒷', _0x42b4fd['c'] = '𝒸', _0x42b4fd['d'] = '𝒹', _0x42b4fd['e'] = '𝑒', _0x42b4fd['f'] = '𝒻', _0x42b4fd['g'] = '𝑔', _0x42b4fd['h'] = '𝒽', _0x42b4fd['i'] = '𝒾', _0x42b4fd['j'] = '𝒿', _0x42b4fd['k'] = '𝓀', _0x42b4fd['l'] = '𝓁', _0x42b4fd['m'] = '𝓂', _0x42b4fd['n'] = '𝓃', _0x42b4fd['o'] = '𝑜', _0x42b4fd['p'] = '𝓅', _0x42b4fd['q'] = '𝓆', _0x42b4fd['r'] = '𝓇', _0x42b4fd['s'] = '𝓈', _0x42b4fd['t'] = '𝓉', _0x42b4fd['u'] = '𝓊', _0x42b4fd['v'] = '𝓋', _0x42b4fd['w'] = '𝓌', _0x42b4fd['x'] = '𝓍', _0x42b4fd['y'] = '𝓎', _0x42b4fd['z'] = '𝓏', _0x42b4fd['A'] = '𝒜', _0x42b4fd['B'] = '𝐵', _0x42b4fd['C'] = '𝒞', _0x42b4fd['D'] = '𝒟', _0x42b4fd['E'] = '𝐸', _0x42b4fd['F'] = '𝐹', _0x42b4fd['G'] = '𝒢', _0x42b4fd['H'] = '𝐻', _0x42b4fd['I'] = '𝐼', _0x42b4fd['J'] = '𝒥', _0x42b4fd['K'] = '𝒦', _0x42b4fd['L'] = '𝐿', _0x42b4fd['M'] = '𝑀', _0x42b4fd['N'] = '𝒩', _0x42b4fd['O'] = '𝒪', _0x42b4fd['P'] = '𝒫', _0x42b4fd['Q'] = '𝒬', _0x42b4fd['R'] = '𝑅', _0x42b4fd['S'] = '𝒮', _0x42b4fd['T'] = '𝒯', _0x42b4fd['U'] = '𝒰', _0x42b4fd['V'] = '𝒱', _0x42b4fd['W'] = '𝒲', _0x42b4fd['X'] = '𝒳', _0x42b4fd['Y'] = '𝒴', _0x42b4fd['Z'] = '𝒵';
    var _0xf6233f = _0x42b4fd,
        _0x2b9d0f = _0x51c937['split']('');
    for (var _0x41869e = 0x0; _0x41869e < _0x2b9d0f[_0x3bf52c(0x4ce)]; _0x41869e++) {
        _0xf6233f[_0x2b9d0f[_0x41869e][_0x3bf52c(0x515)]()] && (_0x2b9d0f[_0x41869e] = _0xf6233f[_0x2b9d0f[_0x41869e]]);
    }
    return _0x51c937 = _0x2b9d0f[_0x3bf52c(0x55c)](''), _0x51c937;
}

function shuffleArray(_0x13f79f) {
    var _0x4ed587 = _0x4ca65f,
        _0x538363 = _0x13f79f['length'],
        _0x172cbf, _0x441992;
    while (0x0 !== _0x538363) {
        _0x441992 = Math[_0x4ed587(0x1c8)](Math[_0x4ed587(0x4f1)]() * _0x538363), _0x538363 -= 0x1, _0x172cbf = _0x13f79f[_0x538363], _0x13f79f[_0x538363] = _0x13f79f[_0x441992], _0x13f79f[_0x441992] = _0x172cbf;
    }
    return _0x13f79f;
}

function randomElement(_0x4c14b5) {
    var _0x688bfe = _0x4ca65f;
    return _0x4c14b5[Math[_0x688bfe(0x1c8)](Math[_0x688bfe(0x4f1)]() * _0x4c14b5[_0x688bfe(0x4ce)])];
}! function(_0x2813e3) {
    var _0x21bb8d = _0x4ca65f,
        _0x21045d = _0x21bb8d(0xfa) == typeof exports && exports,
        _0xc8b66e = _0x21bb8d(0xfa) == typeof module && module && module[_0x21bb8d(0x113)] == _0x21045d && module,
        _0xcbebe8 = _0x21bb8d(0xfa) == typeof global && global;
    (_0xcbebe8['global'] === _0xcbebe8 || _0xcbebe8[_0x21bb8d(0x46c)] === _0xcbebe8) && (_0x2813e3 = _0xcbebe8);
    var _0x123c4b = /(<%= allExceptCombiningMarks %>)(<%= combiningMarks %>+)/g,
        _0x578768 = /([\uD800-\uDBFF])([\uDC00-\uDFFF])/g,
        _0x1c8d1b = function(_0x324b41) {
            var _0x54caea = _0x21bb8d;
            _0x324b41 = _0x324b41[_0x54caea(0x582)](_0x123c4b, function(_0x117499, _0x525986, _0x1c7fa7) {
                return _0x1c8d1b(_0x1c7fa7) + _0x525986;
            })[_0x54caea(0x582)](_0x578768, _0x54caea(0x324));
            for (var _0x21f470 = '', _0x5ee98c = _0x324b41[_0x54caea(0x4ce)]; _0x5ee98c--;) _0x21f470 += _0x324b41['charAt'](_0x5ee98c);
            return _0x21f470;
        },
        _0x58c9de = {
            'version': _0x21bb8d(0x26a),
            'reverse': _0x1c8d1b
        };
    if (_0x21bb8d(0x2af) == typeof define && 'object' == typeof define[_0x21bb8d(0x209)] && define[_0x21bb8d(0x209)]) define(function() {
        return _0x58c9de;
    });
    else {
        if (_0x21045d && !_0x21045d[_0x21bb8d(0x323)]) {
            if (_0xc8b66e) _0xc8b66e[_0x21bb8d(0x113)] = _0x58c9de;
            else {
                for (var _0x482e71 in _0x58c9de) _0x58c9de[_0x21bb8d(0x2b8)](_0x482e71) && (_0x21045d[_0x482e71] = _0x58c9de[_0x482e71]);
            }
        } else _0x2813e3['esrever'] = _0x58c9de;
    }
}(this);

function fullCrazy(_0x5e6e71) {
    var _0x157e3e = _0x4ca65f;
    if (_0x5e6e71[_0x157e3e(0x32c)]() === '') return '';
    return randomSymbols(0x2) + '\x20\x20' + crazifyText(_0x5e6e71) + '\x20\x20' + randomSymbols(0x2);
}

function crazifyText(_0x49db43) {
    var _0x2cdaae = _0x4ca65f;
    _0x49db43 = _0x49db43['split']('');
    for (var _0x5fe6a8 = 0x0; _0x5fe6a8 < _0x49db43[_0x2cdaae(0x4ce)]; _0x5fe6a8++) {
        _0x49db43[_0x5fe6a8] = crazifyCharacter(_0x49db43[_0x5fe6a8]);
    }
    return _0x49db43[_0x2cdaae(0x55c)]('');
}

function crazifyCharacter(_0x34111c) {
    var _0x292f45 = _0x4ca65f;
    _0x34111c = _0x34111c[_0x292f45(0x515)]();
    var _0x2aea04 = {};
    _0x2aea04['&'] = '⅋', _0x2aea04['%'] = ['⅍', '℀', '℁', '℆', '℅'], _0x2aea04['0'] = ['０', 'Ѳ', 'ʘ'], _0x2aea04['1'] = ['➀', '❶', '１'], _0x2aea04['2'] = ['２', '❷', '➁'], _0x2aea04['3'] = ['３', '❸', '➂'], _0x2aea04['4'] = ['４', '❹', '➃'], _0x2aea04['5'] = ['❺', '➄', '５'], _0x2aea04['6'] = ['６', '❻', '➅'], _0x2aea04['7'] = ['７', '❼', '➆'], _0x2aea04['8'] = ['８', '➇', '❽'], _0x2aea04['9'] = ['➈', '❾', '９'], _0x2aea04['<'] = ['≼', '≺', '≪', '☾', '≾', '⋜', '⋞', '⋐', '⊂', '⊏', '⊑', '《', '＜', '❮', '❰', '⫷'], _0x2aea04['>'] = _0x292f45(0x536), _0x2aea04['['] = _0x292f45(0x1f8), _0x2aea04[']'] = _0x292f45(0x34e), _0x2aea04['*'] = _0x292f45(0x3b8), _0x2aea04['a'] = ['Ⓐ', 'ⓐ', 'α', 'Ａ', 'ａ', 'ᗩ', '卂', 'Δ', 'ค', 'α', 'ά', 'Ã', '𝔞', '𝓪', '𝒶', '𝓐', '𝐀', '𝐚', '𝔸', '𝕒', 'ᵃ'], _0x2aea04['b'] = ['Ⓑ', 'ⓑ', 'в', 'Ｂ', '乃', 'ｂ', 'ᗷ', 'β', '๒', 'в', 'в', 'β', '𝔟', '𝓫', '𝒷', '𝓑', '𝐁', '𝐛', '𝔹', '𝕓', 'ᵇ'], _0x2aea04['c'] = ['Ⓒ', 'ⓒ', '匚', '¢', 'Ｃ', 'ｃ', 'ᑕ', 'Ć', 'ς', 'c', 'ς', 'Č', '℃', '𝔠', '𝓬', '𝒸', '𝓒', '𝐂', '𝐜', 'ℂ', '𝕔', 'ᶜ'], _0x2aea04['d'] = ['Ⓓ', 'ⓓ', '∂', 'Ｄ', 'ｄ', 'ᗪ', 'Đ', '๔', '∂', 'đ', 'Ď', '𝔡', '𝓭', '𝒹', '𝓓', '𝐃', 'ᗪ', '𝐝', '𝔻', '𝕕', 'ᵈ'], _0x2aea04['e'] = ['Ⓔ', '乇', 'ⓔ', 'є', 'Ｅ', 'ｅ', 'ᗴ', '€', 'є', 'ε', 'έ', 'Ẹ', '𝔢', '𝒆', '𝑒', '𝓔', '𝐄', '𝐞', '𝔼', '𝕖', 'ᵉ'], _0x2aea04['f'] = ['Ⓕ', 'ⓕ', 'ƒ', 'Ｆ', 'ｆ', '千', 'ᖴ', 'ℱ', 'Ŧ', 'ғ', 'ғ', 'Ƒ', '𝔣', '𝒇', '𝒻', '𝓕', '𝐅', '𝐟', '𝔽', '𝕗', 'ᶠ'], _0x2aea04['g'] = ['Ⓖ', 'ⓖ', 'ق', 'g', 'Ｇ', 'ｇ', 'Ǥ', 'Ꮆ', 'ﻮ', 'g', 'ģ', 'Ğ', '𝔤', '𝓰', '𝑔', '𝓖', '𝐆', '𝐠', '𝔾', '𝕘', 'ᵍ', 'Ꮆ'], _0x2aea04['h'] = ['Ⓗ', '卄', 'ⓗ', 'н', 'Ｈ', 'ｈ', 'ᕼ', 'Ħ', 'ђ', 'н', 'ħ', 'Ĥ', '𝔥', '𝓱', '𝒽', '𝓗', '𝐇', '𝐡', 'ℍ', '𝕙', 'ʰ'], _0x2aea04['i'] = ['Ⓘ', 'ⓘ', 'ι', 'Ｉ', 'ｉ', 'Ꭵ', '丨', 'Ɨ', 'เ', 'ι', 'ί', 'Į', '𝔦', '𝓲', '𝒾', '𝓘', '𝐈', '𝐢', '𝕀', '𝕚', 'ᶤ'], _0x2aea04['j'] = ['Ⓙ', 'ⓙ', 'נ', 'Ｊ', 'ڶ', 'ｊ', 'ᒎ', 'Ĵ', 'ן', 'נ', 'ј', 'Ĵ', '𝔧', '𝓳', '𝒿', '𝓙', '𝐉', '𝐣', '𝕁', '𝕛', 'ʲ'], _0x2aea04['k'] = ['Ⓚ', 'ⓚ', 'к', 'Ｋ', 'ｋ', 'ᛕ', 'Ҝ', 'к', 'к', 'ķ', 'Ќ', '𝔨', '𝓴', '𝓀', '𝓚', '𝐊', '𝐤', '𝕂', '𝕜', 'ᵏ', 'Ҝ'], _0x2aea04['l'] = ['Ⓛ', 'ⓛ', 'ℓ', 'ㄥ', 'Ｌ', 'ｌ', 'ᒪ', 'Ł', 'l', 'ℓ', 'Ļ', 'Ĺ', '𝔩', '𝓵', '𝓁', '𝓛', '𝐋', '𝐥', '𝕃', '𝕝', 'ˡ'], _0x2aea04['m'] = ['Ⓜ', 'ⓜ', 'м', 'Ｍ', 'ｍ', 'ᗰ', 'Μ', '๓', 'м', 'м', 'ϻ', '𝔪', '𝓶', '𝓂', '𝓜', '𝐌', '𝐦', '𝕄', '𝕞', 'ᵐ', '爪'], _0x2aea04['n'] = ['Ⓝ', '几', 'ⓝ', 'η', 'Ｎ', 'ｎ', 'ᑎ', 'Ň', 'ภ', 'η', 'ή', 'Ň', '𝔫', '𝓷', '𝓃', '𝓝', '𝐍', '𝐧', 'ℕ', '𝕟', 'ᶰ'], _0x2aea04['o'] = ['Ⓞ', 'ㄖ', 'ⓞ', 'σ', 'Ｏ', 'ｏ', 'ᗝ', 'Ø', '๏', 'σ', 'ό', 'Ỗ', '𝔬', '𝓸', '𝑜', '𝓞', '𝐎', '𝐨', '𝕆', '𝕠', 'ᵒ'], _0x2aea04['p'] = ['Ⓟ', 'ⓟ', 'ρ', 'Ｐ', 'ｐ', '卩', 'ᑭ', 'Ƥ', 'ק', 'ρ', 'ρ', 'Ƥ', '𝔭', '𝓹', '𝓅', '𝓟', '𝐏', '𝐩', 'ℙ', '𝕡', 'ᵖ'], _0x2aea04['q'] = ['Ⓠ', 'ⓠ', 'q', 'Ｑ', 'ｑ', 'Ɋ', 'Ω', 'ợ', 'q', 'q', 'Ǫ', '𝔮', '𝓺', '𝓆', '𝓠', '𝐐', '𝐪', 'ℚ', '𝕢', 'ᵠ'], _0x2aea04['r'] = ['Ⓡ', 'ⓡ', 'я', '尺', 'Ｒ', 'ｒ', 'ᖇ', 'Ř', 'г', 'я', 'ŕ', 'Ř', '𝔯', '𝓻', '𝓇', '𝓡', '𝐑', '𝐫', 'ℝ', '𝕣', 'ʳ'], _0x2aea04['s'] = ['Ⓢ', 'ⓢ', 'ѕ', 'Ｓ', '丂', 'ｓ', 'ᔕ', 'Ş', 'ร', 's', 'ş', 'Ŝ', '𝔰', '𝓼', '𝓈', '𝓢', '𝐒', '𝐬', '𝕊', '𝕤', 'ˢ'], _0x2aea04['t'] = ['Ⓣ', 'ⓣ', 'т', 'Ｔ', 'ｔ', '丅', 'Ŧ', 't', 'т', 'ţ', 'Ť', '𝔱', '𝓽', '𝓉', '𝓣', '𝐓', '𝐭', '𝕋', '𝕥', 'ᵗ'], _0x2aea04['u'] = ['Ⓤ', 'ⓤ', 'υ', 'Ｕ', 'ｕ', 'ᑌ', 'Ữ', 'ย', 'υ', 'ù', 'Ǘ', '𝔲', '𝓾', '𝓊', '𝓤', '𝐔', '𝐮', '𝕌', '𝕦', 'ᵘ'], _0x2aea04['v'] = ['Ⓥ', 'ⓥ', 'ν', 'Ｖ', 'ｖ', 'ᐯ', 'V', 'ש', 'v', 'ν', 'Ѷ', '𝔳', '𝓿', '𝓋', '𝓥', '𝐕', '𝐯', '𝕍', '𝕧', 'ᵛ'], _0x2aea04['w'] = ['Ⓦ', 'ⓦ', 'ω', 'Ｗ', 'ｗ', 'ᗯ', 'Ŵ', 'ฬ', 'ω', 'ώ', 'Ŵ', '𝔴', '𝔀', '𝓌', '𝓦', '𝐖', '𝐰', '𝕎', '𝕨', 'ʷ', '山'], _0x2aea04['x'] = ['Ⓧ', 'ⓧ', 'χ', 'Ｘ', '乂', 'ｘ', '᙭', 'Ж', 'א', 'x', 'x', 'Ж', '𝔵', '𝔁', '𝓍', '𝓧', '𝐗', '𝐱', '𝕏', '𝕩', 'ˣ'], _0x2aea04['y'] = ['Ⓨ', 'ㄚ', 'ⓨ', 'у', 'Ｙ', 'ｙ', 'Ƴ', '¥', 'ץ', 'ү', 'ч', 'Ў', '𝔶', '𝔂', '𝓎', '𝓨', '𝐘', '𝐲', '𝕐', '𝕪', 'ʸ'], _0x2aea04['z'] = ['Ⓩ', 'ⓩ', 'z', '乙', 'Ｚ', 'ｚ', 'Ƶ', 'Ž', 'z', 'z', 'ž', 'Ż', '𝔷', '𝔃', '𝓏', '𝓩', '𝐙', '𝐳', 'ℤ', '𝕫', 'ᶻ'];
    var _0x10a287 = _0x2aea04;
    return _0x10a287[_0x34111c] ? randomElement(_0x10a287[_0x34111c]) : _0x34111c;
}

function randomElement(_0x5d96cc) {
    var _0x4eb543 = _0x4ca65f;
    return _0x5d96cc[Math[_0x4eb543(0x1c8)](Math[_0x4eb543(0x4f1)]() * _0x5d96cc['length'])];
}

function randomSymbols(_0x3ba3bc) {
    var _0x48fd28 = _0x4ca65f,
        _0xebae76 = ['🐙', '🐉', '🐊', '🐒', '🐝', '🐜', '🐚', '🐲', '🐳', '🐸', '👑', '👹', '👺', '👤', '💲', '💣', '💙', '💚', '💛', '💜', '💝', '💗', '💘', '💞', '💔', '💥', '🐯', '🐼', '🐻', '🐺', '👌', '🐍', '🐧', '🐟', '🐠', '🐨', '🎯', '🏆', '🎁', '🎀', '🎉', '🎈', '🍮', '🍭', '🍬', '🍫', '🍪', '🍧', '🌷', '🍓', '😺', '😾', '✎', '😎', '😝', '😂', '😈', '😡', '😲', '😳', '🍔', '🍟', '🍩', '🎃', '🎄', '🎅', '🐣', '🐤', '👍', '👊', '👻', '👽', '👮', '💎', '💋', '👣', '💀', '💢', '🔥', '♔', '♕', '♖', '♗', '♘', '♙', '♚', '♛', '♜', '♝', '♞', '♟', '♠', '♡', '♢', '♣', '♤', '♥', '♦', '♧', '♨', '♩', '♪', '♬', '★', '☆', '☺', '☹', '☯', '☮', '☢', '☠', '☟', '☞', '☝', '☜', '✌', '✋', '✊', '⛵', 'ൠ', '✌', 'ඏ'],
        _0x2944b3 = [];
    for (var _0x6353ba = 0x0; _0x6353ba < _0x3ba3bc; _0x6353ba++) _0x2944b3[_0x48fd28(0x477)](randomElement(_0xebae76));
    return _0x2944b3['join']('');
}

function randInt(_0x5731a4, _0x1e19cb) {
    var _0x5e7b96 = _0x4ca65f;
    return _0x5731a4 + Math[_0x5e7b96(0x1c8)](Math[_0x5e7b96(0x4f1)]() * (_0x1e19cb - _0x5731a4 + 0x1));
}
$(document)[_0x4ca65f(0x450)](function() {
    var _0x3c999a = _0x4ca65f;
    $(_0x3c999a(0x530))[_0x3c999a(0x1f9)](), $(window)['scroll'](function() {
        var _0x1b8cab = _0x3c999a;
        $(this)[_0x1b8cab(0x4a4)]() > 0x64 ? $(_0x1b8cab(0x105))[_0x1b8cab(0x15a)]() : $(_0x1b8cab(0x105))[_0x1b8cab(0x151)]();
    }), $('#scroll')[_0x3c999a(0xf1)](function() {
        var _0x8776e8 = _0x3c999a,
            _0x207234 = {};
        return _0x207234[_0x8776e8(0x4a4)] = 0x0, $(_0x8776e8(0x2cc))[_0x8776e8(0x11e)](_0x207234, 0x258), ![];
    });
}), $(document)[_0x4ca65f(0x450)](function() {
    var _0x104003 = _0x4ca65f;
    $(_0x104003(0x4d6))['on'](_0x104003(0x11b), function() {
        var _0x2d58e8 = _0x104003;
        $(_0x2d58e8(0x57d) + $(this)[_0x2d58e8(0x10b)]() + 'px}\x20</style>')[_0x2d58e8(0xed)]('body');
        var _0x1da404 = {};
        _0x1da404[_0x2d58e8(0x54c)] = 0x16d, $[_0x2d58e8(0x438)]('textSize', $(this)[_0x2d58e8(0x10b)](), _0x1da404);
    });
    $['cookie'](_0x104003(0x463)) && $(_0x104003(0x2a8))[_0x104003(0x487)]($['cookie'](_0x104003(0x463)));
    $('.y2k-font')['on'](_0x104003(0xd1), function(_0xd3578b) {
        var _0x50b1c = _0x104003,
            _0x290753 = $(_0x50b1c(0x1a4))[_0x50b1c(0x10b)]();
        _0x5ea9d7(_0x290753);
        var _0x4dea56 = {};
        _0x4dea56['expires'] = 0x16d, $[_0x50b1c(0x438)]('recenttext', _0x290753, _0x4dea56), $(_0x50b1c(0x4ec))[_0x50b1c(0x487)](siteurl + encodeURIComponent(_0x290753));
    });
    var _0x4d536d = window['location']['href'],
        _0x17bf91 = _0x4d536d[_0x104003(0x500)]('?=');
    urltext = _0x17bf91[0x1];
    if (urltext) {
        urltext = decodeURIComponent(urltext), $(_0x104003(0x1a4))[_0x104003(0x10b)](urltext), _0x5ea9d7(urltext);
        var _0x23abfc = {};
        _0x23abfc[_0x104003(0x54c)] = 0x16d, $['cookie'](_0x104003(0x38d), urltext, _0x23abfc), $(_0x104003(0x4ec))[_0x104003(0x487)](siteurl + encodeURIComponent(urltext));
    }
    $(document)['on'](_0x104003(0xf1), _0x104003(0x42a), function() {
        var _0xd4690b = _0x104003;
        $(_0xd4690b(0x2a8))['prepend'](_0xd4690b(0x30f) + $(this)['find']('p')['attr'](_0xd4690b(0x3c7)) + '\x22\x20class=\x22' + $(this)[_0xd4690b(0x47b)]('p')['attr']('class') + '\x22>' + $(this)[_0xd4690b(0x47b)]('p')[_0xd4690b(0x490)]() + _0xd4690b(0x11d));
        $(_0xd4690b(0x522))['length'] > 0x3 && $('.stylenamerecentlist\x20.stylename')['last']()[_0xd4690b(0x59b)]();
        var _0x250e38 = {};
        _0x250e38['expires'] = 0x16d, $[_0xd4690b(0x438)](_0xd4690b(0x463), $(_0xd4690b(0x2a8))['html'](), _0x250e38);
    });

    function _0x58c6e2() {
        var _0x1172f4 = _0x104003,
            _0x23c259 = $(_0x1172f4(0x1a4))[_0x1172f4(0x10b)]();
        $(_0x1172f4(0x595))['html'](wrapInFlourish(_0x2c3a96(_0x23c259))), $('.flourish2')[_0x1172f4(0x487)](wrapInFlourish(_0x2c3a96(_0x23c259))), $('.flourish3')['html'](wrapInFlourish(_0x2c3a96(_0x23c259))), $('.flourish4')['html'](wrapInFlourish(_0x2c3a96(_0x23c259))), $(_0x1172f4(0xc8))[_0x1172f4(0x487)](wrapInFlourish(_0x2c3a96(_0x23c259))), $(_0x1172f4(0x344))[_0x1172f4(0x487)](wrapInFlourish(_0x2c3a96(_0x23c259))), $(_0x1172f4(0x136))['html'](wrapInFlourish(_0x2c3a96(_0x23c259))), $(_0x1172f4(0x4e2))[_0x1172f4(0x487)](wrapInFlourish(_0x2c3a96(_0x23c259))), $('.flourish9')[_0x1172f4(0x487)](wrapInFlourish(_0x2c3a96(_0x23c259)));
    }

    function _0x5ea9d7(_0x40a612) {
        var _0x46aadf = _0x104003;
        _0x40a612 = _0x40a612[_0x46aadf(0x32c)](), $(_0x46aadf(0x5a0))['html'](Change(_0x40a612, 's1')), $('.result-s2')[_0x46aadf(0x487)](Change(_0x40a612, 's2')), $(_0x46aadf(0x291))[_0x46aadf(0x487)](Change(_0x40a612, 's3')), $(_0x46aadf(0x3b3))[_0x46aadf(0x487)](Change(_0x40a612, 's4')), $(_0x46aadf(0x475))[_0x46aadf(0x487)](Change(_0x40a612, 's5')), $('.result-s6')['html'](Change(_0x40a612, 's6')), $(_0x46aadf(0xea))[_0x46aadf(0x487)](Change(_0x40a612, 's7')), $(_0x46aadf(0x3d0))[_0x46aadf(0x487)](Change(_0x40a612, 's8')), $(_0x46aadf(0xf9))[_0x46aadf(0x487)](Change(_0x40a612, 's9')), $('.result-s10')[_0x46aadf(0x487)](Change(_0x40a612, 's10')), $(_0x46aadf(0x2c7))[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x527))), $(_0x46aadf(0x148))[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x359))), $('.result-s13')[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x444))), $(_0x46aadf(0x1dd))['html'](Change(_0x40a612, _0x46aadf(0x114))), $(_0x46aadf(0x43e))['html'](Change(_0x40a612, _0x46aadf(0x36b))), $(_0x46aadf(0x2f1))[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x535))), $(_0x46aadf(0x192))['html'](Change(_0x40a612, 's17')), $(_0x46aadf(0x240))[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x278))), $(_0x46aadf(0x27f))[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x597))), $(_0x46aadf(0x140))[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x30a))), $(_0x46aadf(0x2d3))[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x1af))), $(_0x46aadf(0x551))[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x10d))), $('.result-s23')['html'](Change(_0x40a612, _0x46aadf(0x43a))), $('.result-s24')['html'](Change(_0x40a612, _0x46aadf(0x493))), $(_0x46aadf(0x15d))[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x211))), $(_0x46aadf(0x35c))['html'](Change(_0x40a612, _0x46aadf(0x325))), $(_0x46aadf(0x317))['html'](Change(_0x40a612, 's27')), $(_0x46aadf(0x4eb))[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x3fb))), $(_0x46aadf(0x122))['html'](Change(_0x40a612, _0x46aadf(0x387))), $('.result-s31')[_0x46aadf(0x487)](Change(_0x40a612, _0x46aadf(0x3c4))), $(_0x46aadf(0x53b))['html'](luni[_0x46aadf(0x593)][_0x46aadf(0x2cd)]['encode'](_0x40a612)), $(_0x46aadf(0x58a))[_0x46aadf(0x487)](applyCharMap(invertedSquaresCharMap, _0x40a612)), $(_0x46aadf(0x191))['html'](applyCharMap(wideTextCharMap, _0x40a612)), $('.lunitoolstinyencode')[_0x46aadf(0x487)](luni[_0x46aadf(0x593)]['tiny']['encode'](_0x40a612)), $(_0x46aadf(0x39d))[_0x46aadf(0x487)](luni[_0x46aadf(0x593)][_0x46aadf(0x483)]['encode'](_0x40a612)), $(_0x46aadf(0x31d))[_0x46aadf(0x487)](applyCharMap(squaresCharMap, _0x40a612)), $('.lunitoolsmirrorencode')[_0x46aadf(0x487)](luni['tools'][_0x46aadf(0x14e)][_0x46aadf(0x254)](_0x40a612)), $('.subscriptCharMap')[_0x46aadf(0x487)](applyCharMap(subscriptCharMap, _0x40a612)), $(_0x46aadf(0x328))[_0x46aadf(0x487)](applyCharMap(superscriptCharMap, _0x40a612)), $(_0x46aadf(0x52d))[_0x46aadf(0x487)](applyCharMap(bentTextCharMap, _0x40a612)), $('.neonCharMap')['html'](applyCharMap(neonCharMap, _0x40a612)), $('.futureAlienCharMap')[_0x46aadf(0x487)](applyCharMap(futureAlienCharMap, _0x40a612)), $(_0x46aadf(0x437))[_0x46aadf(0x487)](strikeThrough(_0x40a612)), $(_0x46aadf(0x2a3))[_0x46aadf(0x487)](tildeStrikeThrough(_0x40a612)), $(_0x46aadf(0x4d0))[_0x46aadf(0x487)](slashThrough(_0x40a612)), $(_0x46aadf(0x3d4))[_0x46aadf(0x487)](underline(_0x40a612)), $(_0x46aadf(0x207))[_0x46aadf(0x487)](doubleUnderline(_0x40a612)), $(_0x46aadf(0x4f4))['html'](luni[_0x46aadf(0x593)][_0x46aadf(0x199)]['encode'](_0x40a612)), $(_0x46aadf(0x381))[_0x46aadf(0x487)](applyCharMap(squiggleCharMap, _0x40a612)), $(_0x46aadf(0x59f))[_0x46aadf(0x487)](applyCharMap(squiggle2CharMap, _0x40a612)), $(_0x46aadf(0x1ff))['html'](applyCharMap(squiggle3CharMap, _0x40a612)), $(_0x46aadf(0x2d6))[_0x46aadf(0x487)](applyCharMap(squiggle4CharMap, _0x40a612)), $(_0x46aadf(0x3e5))[_0x46aadf(0x487)](applyCharMap(squiggle5CharMap, _0x40a612)), $(_0x46aadf(0x428))[_0x46aadf(0x487)](applyCharMap(squiggle6CharMap, _0x40a612)), $('.boldCharMap')[_0x46aadf(0x487)](applyCharMap(boldCharMap, _0x40a612)), $(_0x46aadf(0x230))[_0x46aadf(0x487)](luni[_0x46aadf(0x593)][_0x46aadf(0x343)][_0x46aadf(0x254)](_0x40a612)), $(_0x46aadf(0x1eb))['html'](luni[_0x46aadf(0x593)][_0x46aadf(0xc7)]['encode'](_0x40a612)), $(_0x46aadf(0x129))[_0x46aadf(0x487)](applyCharMap(oldEnglishCharMap, _0x40a612)), $(_0x46aadf(0x21d))[_0x46aadf(0x487)](applyCharMap(medievalCharMap, _0x40a612)), $(_0x46aadf(0x311))[_0x46aadf(0x487)](applyCharMap(cursiveCharMap, _0x40a612)), $(_0x46aadf(0x44b))[_0x46aadf(0x487)](scriptify(_0x40a612)), $('.doubleStruckCharMap')[_0x46aadf(0x487)](applyCharMap(doubleStruckCharMap, _0x40a612)), $(_0x46aadf(0x13b))[_0x46aadf(0x487)](applyCharMap(italicCharMap, _0x40a612)), $('.boldItalicCharMap')[_0x46aadf(0x487)](applyCharMap(boldItalicCharMap, _0x40a612)), $(_0x46aadf(0x1ec))[_0x46aadf(0x487)](applyCharMap(monospaceCharMap, _0x40a612)), $('.upperAnglesCharMap')['html'](applyCharMap(upperAnglesCharMap, _0x40a612)), $(_0x46aadf(0x348))[_0x46aadf(0x487)](applyCharMap(greekCharMap, _0x40a612)), $(_0x46aadf(0x19f))[_0x46aadf(0x487)](applyCharMap(symbolsCharMap, _0x40a612)), $(_0x46aadf(0x4f3))[_0x46aadf(0x487)](applyCharMap(currencyCharMap, _0x40a612)), $('.asianStyleCharMap')[_0x46aadf(0x487)](applyCharMap(asianStyleCharMap, _0x40a612)), $('.asianStyle2CharMap')[_0x46aadf(0x487)](applyCharMap(asianStyle2CharMap, _0x40a612)), $(_0x46aadf(0x59e))['html'](thickBlockFramed(_0x40a612)), $(_0x46aadf(0x494))[_0x46aadf(0x487)](diametricAngleFrame(_0x40a612)), $(_0x46aadf(0x2e1))[_0x46aadf(0x487)](wavyJoiner(_0x40a612)), $(_0x46aadf(0x318))[_0x46aadf(0x487)](dottyJoiner(_0x40a612)), $(_0x46aadf(0x12f))[_0x46aadf(0x487)](kirbyHug(_0x40a612)), $(_0x46aadf(0x4b1))[_0x46aadf(0x487)](vaporwaveText(_0x40a612)), $(_0x46aadf(0x2c3))[_0x46aadf(0x487)](vaporwaveText1(_0x40a612)), $(_0x46aadf(0x293))[_0x46aadf(0x487)](vaporwaveText2(_0x40a612)), $(_0x46aadf(0x3e2))['html'](littleSparkles(_0x40a612)), $(_0x46aadf(0x25c))['html'](weirdBox(_0x40a612)), $(_0x46aadf(0x41b))['html'](firework(_0x40a612)), $(_0x46aadf(0x50d))[_0x46aadf(0x487)](stinky(_0x40a612)), $(_0x46aadf(0x408))[_0x46aadf(0x487)](heartsBetween(_0x40a612)), $('.arrowBelow')['html'](arrowBelow(_0x40a612)), $('.crossAboveBelow')[_0x46aadf(0x487)](crossAboveBelow(_0x40a612)), $(_0x46aadf(0x259))['html'](wingdings(_0x40a612)), $(_0x46aadf(0x275))[_0x46aadf(0x487)](fullCrazy(_0x40a612)), $(_0x46aadf(0x1df))[_0x46aadf(0x487)](crazyWithFlourishOrSymbols(_0x40a612)), $(_0x46aadf(0x563))[_0x46aadf(0x487)](cuteText(_0x40a612)), _0x58c6e2(), $(_0x46aadf(0x3c3))[_0x46aadf(0x59b)]();
    };
    $('#random')[_0x104003(0xf1)](function() {
        var _0x1f7d4d = _0x104003;
        $(_0x1f7d4d(0x530))[_0x1f7d4d(0x15a)](), _0x58c6e2(), $(_0x1f7d4d(0x530))['fadeOut']();
    });

    function _0x201f76() {
        var _0x146fdf = _0x104003;
        return fontgenArray[Math[_0x146fdf(0x1c8)](Math[_0x146fdf(0x4f1)]() * fontgenArray[_0x146fdf(0x4ce)])];
    }

    function _0x354b64(_0x4a5e88) {
        var _0x1ce76b = _0x201f76();
        return eval(_0x1ce76b + '(\x22' + _0x4a5e88 + '\x22)');
    }

    function _0x56aab2() {
        var _0x504233 = _0x104003;
        return fontgenArrayMap[Math[_0x504233(0x1c8)](Math[_0x504233(0x4f1)]() * fontgenArrayMap[_0x504233(0x4ce)])];
    }

    function _0x2c3a96(_0x4e5ddf) {
        var _0x51ea5d = _0x104003,
            _0x3d36c8 = _0x56aab2();
        return _0x4e5ddf = _0x4e5ddf[_0x51ea5d(0x32c)](), eval(_0x3d36c8 + '(\x22' + _0x4e5ddf + '\x22)');
    }
    $(_0x104003(0x52a))['click'](function() {
        var _0x2dcc07 = _0x104003;
        $(_0x2dcc07(0x530))[_0x2dcc07(0x15a)]();
        var _0x7bdfb6 = $(_0x2dcc07(0x1a4))[_0x2dcc07(0x10b)]();
        $(_0x2dcc07(0xf0))[_0x2dcc07(0x213)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + fullCrazy(_0x7bdfb6) + _0x2dcc07(0x11d)), $(_0x2dcc07(0xf0))['append'](_0x2dcc07(0x5a6) + crazyWithFlourishOrSymbols(_0x7bdfb6) + '</p></div>'), $('.stylenamelist')[_0x2dcc07(0x213)](_0x2dcc07(0x5a6) + wrapInFlourish(_0x354b64(_0x7bdfb6)) + '</p></div>'), $(_0x2dcc07(0xf0))[_0x2dcc07(0x213)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + cuteText(_0x7bdfb6) + '</p></div>'), $(_0x2dcc07(0xf0))[_0x2dcc07(0x213)](_0x2dcc07(0x5a6) + wrapInFlourish(_0x354b64(_0x7bdfb6)) + _0x2dcc07(0x11d)), $('.stylenamelist')['append'](_0x2dcc07(0x5a6) + wrapInFlourish(_0x354b64(_0x7bdfb6)) + '</p></div>'), $('.stylenamelist')[_0x2dcc07(0x213)](_0x2dcc07(0x5a6) + wrapInFlourish(_0x2c3a96(_0x7bdfb6)) + _0x2dcc07(0x11d)), $(_0x2dcc07(0xf0))[_0x2dcc07(0x213)](_0x2dcc07(0x5a6) + wrapInFlourish(_0x2c3a96(_0x7bdfb6)) + _0x2dcc07(0x11d)), $(_0x2dcc07(0xf0))[_0x2dcc07(0x213)](_0x2dcc07(0x5a6) + wrapInFlourish(_0x2c3a96(_0x7bdfb6)) + '</p></div>'), $(_0x2dcc07(0x530))[_0x2dcc07(0x151)]();
    }), $[_0x104003(0x438)](_0x104003(0x201)) && ($(_0x104003(0x57d) + $[_0x104003(0x438)](_0x104003(0x201)) + _0x104003(0x3cc))[_0x104003(0xed)](_0x104003(0x252)), $(_0x104003(0x4d6))[_0x104003(0x10b)]($['cookie']('textSize'))), $('.clear')[_0x104003(0xf1)](function() {
        var _0x4b15d4 = _0x104003;
        $('#y2k-font')[_0x4b15d4(0x10b)]('');
        var _0x374b03 = {};
        _0x374b03[_0x4b15d4(0x54c)] = 0x16d, $[_0x4b15d4(0x438)](_0x4b15d4(0x38d), '', _0x374b03);
    });
});

function copyit(_0x4515b2) {
    var _0x40abde = _0x4ca65f;
    if (document['body'][_0x40abde(0x577)]) {
        var _0x4a97a8 = document[_0x40abde(0x252)][_0x40abde(0x577)]();
        _0x4a97a8[_0x40abde(0x396)](_0x4515b2), _0x4a97a8[_0x40abde(0x40e)](), _0x4a97a8[_0x40abde(0x49b)](_0x40abde(0xcb));
    } else {
        if (window['getSelection'] && document[_0x40abde(0x2d9)]) {
            var _0x38996c = _0x4515b2[_0x40abde(0x4c6)],
                _0x15345b = _0x4515b2[_0x40abde(0x2b1)];
            _0x4515b2[_0x40abde(0x4c6)] = !![], _0x4515b2[_0x40abde(0x2b1)] = !![];
            var _0x2fe749 = document[_0x40abde(0x2d9)]();
            _0x2fe749[_0x40abde(0x51e)](_0x4515b2);
            var _0x3b43b1 = window[_0x40abde(0x19c)]();
            _0x3b43b1[_0x40abde(0x24b)](), _0x3b43b1[_0x40abde(0x543)](_0x2fe749);
            if (_0x4515b2[_0x40abde(0x57b)] == _0x40abde(0x2df) || _0x4515b2[_0x40abde(0x57b)] == _0x40abde(0x245)) _0x4515b2[_0x40abde(0x40e)]();
            if (_0x4515b2[_0x40abde(0x581)]) _0x4515b2[_0x40abde(0x581)](0x0, 0xf423f);
            _0x4515b2['contentEditable'] = _0x38996c, _0x4515b2[_0x40abde(0x2b1)] = _0x15345b;
            if (document['queryCommandSupported'](_0x40abde(0x212))) {
                var _0x49743b = document[_0x40abde(0x49b)]('copy');
                if (_0x49743b) $('body')['append'](_0x40abde(0x46e) + $(_0x4515b2)[_0x40abde(0x490)]() + _0x40abde(0x3df)), setTimeout(function() {
                    var _0x41704a = _0x40abde;
                    $(_0x41704a(0xbc))[_0x41704a(0x59b)]();
                }, 0x3e8);
                else $('body')[_0x40abde(0x213)]('<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22Press\x20CTRL+C\x20to\x20copy\x22\x20/></p>'), setTimeout(function() {
                    var _0x4458dd = _0x40abde;
                    $(_0x4458dd(0xbc))[_0x4458dd(0x59b)]();
                }, 0x3e8);
            } else {
                if (!navigator[_0x40abde(0x26f)][_0x40abde(0x548)](/ipad|ipod|iphone|android|silk/i)) $(_0x40abde(0x252))[_0x40abde(0x213)](_0x40abde(0x35f)), setTimeout(function() {
                    var _0x12e79e = _0x40abde;
                    $(_0x12e79e(0xbc))[_0x12e79e(0x59b)]();
                }, 0x3e8);
            }
        }
    }
}
$(window)['width']() > 0x3c0 && $(window)[_0x4ca65f(0x422)](function() {
    var _0x4b5f00 = _0x4ca65f,
        _0x1940a2 = $(window)['scrollTop']();
    _0x1940a2 >= 0x64 ? $(_0x4b5f00(0x205))[_0x4b5f00(0x14c)]('fixedtop') : $(_0x4b5f00(0x205))['removeClass'](_0x4b5f00(0x454));
});
$(_0x4ca65f(0x4b4))[_0x4ca65f(0xf1)](function() {
    var _0x5b908c = _0x4ca65f;
    $(_0x5b908c(0x132))[_0x5b908c(0x228)](0x64);
}), $(_0x4ca65f(0x590))[_0x4ca65f(0xf1)](function() {
    var _0x2b57d4 = _0x4ca65f;
    $(_0x2b57d4(0x132))[_0x2b57d4(0x1f9)](0x64);
});
