var _0x1d931a = _0x554c;
(function(_0x2e8ef2, _0x2c2b4c) {
    var _0xd97fa9 = _0x554c,
        _0xabdf10 = _0x2e8ef2();
    while (!![]) {
        try {
            var _0x5c99c1 = parseInt(_0xd97fa9(0x632)) / 0x1 + -parseInt(_0xd97fa9(0x54d)) / 0x2 + parseInt(_0xd97fa9(0x2f3)) / 0x3 + -parseInt(_0xd97fa9(0x3f5)) / 0x4 * (-parseInt(_0xd97fa9(0x240)) / 0x5) + parseInt(_0xd97fa9(0x40b)) / 0x6 * (parseInt(_0xd97fa9(0x66c)) / 0x7) + parseInt(_0xd97fa9(0x1c8)) / 0x8 * (-parseInt(_0xd97fa9(0x4a7)) / 0x9) + parseInt(_0xd97fa9(0x31c)) / 0xa * (-parseInt(_0xd97fa9(0x274)) / 0xb);
            if (_0x5c99c1 === _0x2c2b4c) break;
            else _0xabdf10['push'](_0xabdf10['shift']());
        } catch (_0x2414b6) {
            _0xabdf10['push'](_0xabdf10['shift']());
        }
    }
}(_0x59bf, 0x2b342));
var normal = _0x1d931a(0x577);
const fontgenArray = [_0x1d931a(0x5af), _0x1d931a(0x60c), _0x1d931a(0x2aa), _0x1d931a(0x207), 'heartsBetween', _0x1d931a(0x45e), _0x1d931a(0x526), _0x1d931a(0x2e0), _0x1d931a(0x5e2), _0x1d931a(0x50a), 'arrowBelow', _0x1d931a(0x330), _0x1d931a(0x46e), _0x1d931a(0x539), _0x1d931a(0x20d), _0x1d931a(0x582), _0x1d931a(0x57b), 'scriptify'],
    fontgenArrayMap = ['invertedSquaresCharMapFun', 'wideTextCharMapFun', _0x1d931a(0x5bb), _0x1d931a(0x596), 'bentTextCharMapFun', _0x1d931a(0x5ca), _0x1d931a(0x60a), _0x1d931a(0x1e4), 'squiggle2CharMapFun', _0x1d931a(0x51e), _0x1d931a(0x64e), 'squiggle5CharMapFun', 'squiggle6CharMapFun', 'boldCharMapFun', _0x1d931a(0x281), _0x1d931a(0x2c5), 'cursiveCharMapFun', _0x1d931a(0x1da), _0x1d931a(0x5e9), _0x1d931a(0x268), _0x1d931a(0x594), _0x1d931a(0x482), _0x1d931a(0x243), 'symbolsCharMapFun', _0x1d931a(0x405), _0x1d931a(0x381), 'asianStyle2CharMapFun'];

function applyCharMap(_0x35c557, _0x3c9e62) {
    var _0x46b665 = _0x1d931a;
    let _0x84c8e4 = '';
    for (let _0x5214ea of _0x3c9e62[_0x46b665(0x3a1)]('')) {
        if (_0x35c557[_0x5214ea] !== undefined) _0x84c8e4 += _0x35c557[_0x5214ea];
        else {
            if (_0x35c557[_0x5214ea[_0x46b665(0x43c)]()] !== undefined) _0x84c8e4 += _0x35c557[_0x5214ea[_0x46b665(0x43c)]()];
            else _0x84c8e4 += _0x5214ea;
        }
    }
    return _0x84c8e4;
}

function invertedSquaresCharMapFun(_0x17a4e4) {
    return applyCharMap(invertedSquaresCharMap, _0x17a4e4);
}

function wideTextCharMapFun(_0x400882) {
    return applyCharMap(wideTextCharMap, _0x400882);
}

function squaresCharMapFun(_0x22d76b) {
    return applyCharMap(squaresCharMap, _0x22d76b);
}

function subscriptCharMapFun(_0x5250b5) {
    return applyCharMap(subscriptCharMap, _0x5250b5);
}

function bentTextCharMapFun(_0x5b5397) {
    return applyCharMap(bentTextCharMap, _0x5b5397);
}

function neonCharMapFun(_0x270b08) {
    return applyCharMap(neonCharMap, _0x270b08);
}

function futureAlienCharMapFun(_0x590828) {
    return applyCharMap(futureAlienCharMap, _0x590828);
}

function squiggleCharMapFun(_0x35daf3) {
    return applyCharMap(squiggleCharMap, _0x35daf3);
}

function squiggle2CharMapFun(_0x19bace) {
    return applyCharMap(squiggle2CharMap, _0x19bace);
}

function squiggle3CharMapFun(_0x494fa0) {
    return applyCharMap(squiggle3CharMap, _0x494fa0);
}

function squiggle4CharMapFun(_0x4f27dc) {
    return applyCharMap(squiggle4CharMap, _0x4f27dc);
}

function squiggle5CharMapFun(_0xb754fb) {
    return applyCharMap(squiggle5CharMap, _0xb754fb);
}

function squiggle6CharMapFun(_0x59404e) {
    return applyCharMap(squiggle6CharMap, _0x59404e);
}

function boldCharMapFun(_0x1260c3) {
    return applyCharMap(boldCharMap, _0x1260c3);
}

function oldEnglishCharMapFun(_0xcb43ca) {
    return applyCharMap(oldEnglishCharMap, _0xcb43ca);
}

function _0x59bf() {
    var _0x419122 = ['&#4310;', '&#120831;&#823;', '.squiggle4CharMap', 'ᵔ⌣ᵔ', '&#x', '.wingdings', '&#41769;', '&ETH;', '.vaporwaveText', '#textSize', 'neonCharMapFun', 'x&#829;&#851;', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20[[text]]\x20°º¤ø,¸¸,ø¤º°`°º¤ø,¸', '&#120440;&#823;', '.wavyJoiner', 'K&#838;', '&#1202;', '¸„.-•~¹°”ˆ˜¨\x20', '.kirbyHug', '2&#866;', '1&#866;', '&#120438;&#823;', 'toString', '.crazyWithFlourishOrSymbols', '(✿╹◡╹)', '&#418;', 'W&#829;&#851;', 'U&#838;', '&#377;', 's19', '&#4357;', 'B&#828;', 's30', '7&#828;', 'wavyJoiner', '•]••´º´•»\x20[[text]]\x20«•´º´••[•', '&#545;', '&#435;', 'Z&#826;', '&#5623;', '&#4330;', 'italicCharMapFun', '&#1049;', '&#420;', '#random', 'TEXTAREA', '(•◡•)', '&#5196;', '&#42150;', '&#1079;', '.squiggleCharMap', ',-*\x27^\x27~*-.,_,.-*~\x20', 'B&#829;&#851;', 'i&#846;', '◕‿◕', '&#1043;', '&#1062;', '6&#830;', '`•.,¸¸,.•´¯\x20', '.stylenamerecentlist', '.stylenamelist', 'k&#846;', '&#1179;', '&#65434;', '&#41053;', '&#618;', 'encode', '.result-s23', 'Y&#828;', '&#1056;', '&#5198;', 'N&#829;&#851;', 'F&#857;', 'selecopyit', 'futureAlienCharMapFun', '&#41074;', 'weirdBox', '&#9442;', 'v&#838;', '&#120470;&#823;', '.flourish7', '&#41863;', '&#548;', '&#4327;', '.result-s27', '.flourish4', 'k&#799;', '6&#857;', '&#41392;', 'h&#838;', 'insertBefore', 'p&#826;', '┗(^o^\x20)┓三\x20[[text]]\x20三\x20┗(^o^\x20)┓', '&#7990;', '7&#830;', '7&#838;', '&dagger;', '&#41712;', '&#41976;', 'u&#829;&#851;', 'e&#857;', '0&#799;', 'd&#846;', 'G&#826;', 'e&#838;', '&#258;', 'G&#857;', 'hide', '💧︎', '&#344;', '&#382;', '&#1097;', '◔◡◔', 'D&#846;', '181281OYngVA', 'j&#830;', '8&#857;', '°·.¸.·°¯°·.¸.·°¯°·.¸.->\x20', '&#1140;', '.result-s26', 'E&#846;', '&#586;', '&#41807;', '&#41674;', '&#10123;', 'L&#829;&#851;', '<style>\x20.stylename\x20p{font-size:', 'o&#829;&#851;', '9&#838;', '&#5615;', '.result-s29', '&#392;', 'Q&#830;', '&#120448;&#823;', 'u&#830;', '👍︎', '&#10122;', '&#647;', '2&#857;', 'N&#830;', '&#5205;', '0&#828;', 'squiggle4CharMapFun', '&#41126;', '&Xi;', '꧁༒☬\x20[[text]]\x20☬༒꧂', '&#406;', '&#120471;&#823;', 'V&#846;', '(¯`·.¸¸.->\x20°º\x20', 's13', '&#1139;', 'F&#799;', '🖫︎', '▌│█║▌║▌║\x20[[text]]\x20║▌║▌║█│▌', 'X&#838;', 'z&#838;', 'W&#830;', 'n&#866;', 'U&#866;', '&#23610;', 'Y&#857;', 'top', 'h&#829;&#851;', '&otilde;', 'D&#838;', '&#401;', '•´¯`•»\x20[[text]]\x20«•´¯`•', 'toUpperCase', '｡*ﾟ.*.｡(っ\x20ᐛ\x20)っ✂╰⋃╯\x20[[text]]', '7&#826;', '(^▽^)', '99078rLzcvB', '&#596;', '&#5741;', '&#1060;', 'prepend', 'r&#838;', 'L&#838;', '&#1047;', '(-_-)\x20[[text]]\x20(-_-)', '&#41007;', '&#941;', '&#9687;', '&#10003;', 'P&#838;', '(¯´•._.•\x20', '&#1041;', 'z&#846;', '.currencyCharMap', '.result-s2', '.slashThrough', '&#41426;', 'H&#799;', 'M&#846;', 'execCommand', 'Q&#857;', 's10', 'F&#846;', 'j&#829;&#851;', '.lunitoolsbubbles', 'i&#866;', 'C&#829;&#851;', '&#350;', '&#413;', 'q&#829;&#851;', 'P&#829;&#851;', '&#1028;', 'creepify', '&oplus;', '&#120452;&#823;', 'g&#866;', 'V&#799;', 'f&#826;', '&#434;', '&#412;', 'https://tattoofonts.world/', '&#9730;', '&#42181;', 'textSize', 'd&#857;', 'cookie', '&#41008;', '·.¸¸.·♩♪♫\x20[[text]]\x20♫♪♩·.¸¸.·', 'W&#828;', '&#996;', 'O&#846;', 'I&#830;', '&#608;', 'n&#857;', 'C&#826;', '🏱︎', '&#404;', 'contentEditable', '1&#857;', '8&#829;&#851;', 'R&#829;&#851;', '&#12552;', '&#3182;', '🗄︎', '&#41155;', 's&#799;', '171984UsAvyz', '&#41080;', 'getElementById', '☽≫≻≽≿⋝⋟⋑⊃⊐⊒⫸》＞❯❱', '&#120436;&#823;', '&#653;', 'removeAllRanges', '&#549;', '&#120472;&#823;', 'middle', '&#120439;&#823;', 'bubbles', '&#42180;', 's29', '••¤(`×', '0&#846;', 'X&#866;', '6&#799;', 'doubleStruckCharMapFun', '&#9450;', 'u&#828;', '&scaron;', '.result-s5', 'bottom', '&#41203;', '⎝⎝✧GͥOͣDͫ✧⎠⎠\x20[[text]]\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', '.arrowBelow', '&#120443;&#823;', 'squiggleCharMapFun', '������', 'p&#828;', '.subscriptCharMap', 'Q&#799;', '\x20⋆\x20', '&#5620;', '&#120469;&#823;', '&#8134;', '&#41731;', 'text', 'T&#799;', 'round', 'max', 'h&#828;', 'title', 'onload', '&omega;', '&#5616;', '&#120825;&#823;', 'readOnly', '&#1488;', '&#407;', '.result-s9', '&#41708;', 'I&#829;&#851;', '.stylenamerecentlist\x20.stylename', '•._.••´¯``•.¸¸.•`\x20', '&euro;', 'Y&#866;', 'T&#857;', '1&#799;', '•´¯`•.\x20[[text]]\x20.•´¯`•', '1&#826;', '&#2670;', 'diametricAngleFrame', '&#477;', 'p&#829;&#851;', '&#10130;', '7&#866;', '&#340;', 'underline', 's12', 'x&#830;', '&#987;', 'd&#828;', '&#2749;', '&#41433;', 'r&#828;', 'recenttext', 'p&#830;', '୧(•̀ᗝ•́)૭\x20[[text]]\x20୧(⇀‸↼‶)૭', 'options', 'mapInverse', 'P&#866;', 'n&#846;', '&#8023;', '&#120451;&#823;', '.rand', 's&#866;', 'V&#830;', 'P&#857;', '.clear', '×º°”˜`”°º×\x20[[text]]\x20×º°”˜`”°º×', '&#1330;', '&#1185;', '&#4331;', '&#5500;', '&#41157;', 'removeClass', '&#5610;', 'html', '&fnof;', '.result-s8', '&#41766;', '7&#857;', 'charCodeAt', '&#8355;', 'D&#830;', 'b&#829;&#851;', '&upsilon;', '&#1059;', '꧁༒༻☬ད\x20[[text]]\x20ཌ☬༺༒꧂', '&#1050;', '&#42015;', 'H&#866;', '8&#828;', '&#4318;', '.flourish3', '&#120468;&#823;', '1&#829;&#851;', 'p&#838;', '68655PoIgwJ', '&#5229;', '&#8984;', 'greekCharMapFun', 'fixedtop', '&#613;', '2&#829;&#851;', 'test', 'f&#857;', '—(••÷', '&#942;', 'u&#826;', '🕖︎', '&#1103;', '&#1344;', '&#394;', '&#541;', '&#1338;', '&#1351;', 's22', 'ღƪ(ˆ◡ˆ)ʃ♡\x20[[text]]\x20♡ƪ(ˆ◡ˆ)ʃ♪', 'x&#866;', '^ㅂ^', 'b&#866;', 'C&#866;', 'r&#799;', 'Z&#857;', 'U&#846;', 'z&#828;', '&#5262;', '.asianStyleCharMap', '&#1048;', '&#120465;&#823;', 'D&#826;', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', '&forall;', '๑۞๑,¸¸,ø¤º°`°๑۩\x20[[text]]\x20๑۩\x20,¸¸,ø¤º°`°๑۞๑', '4&#857;', '🕓︎', '&#41266;', 'boldItalicCharMapFun', '&#1130;', 'B&#838;', 'c&#826;', 'expires', 'J&#866;', '&#276;', '&#41556;', 'ıllıllı\x20[[text]]\x20ıllıllı', '0&#857;', '&#1105;', '&#41120;', '115764AcfqaK', '§.•´¨\x27°÷•..×\x20', 'd&#826;', '\x20\x20🎀\x20\x20', 'M&#829;&#851;', '8&#866;', '&#268;', 'A&#838;', 'q&#857;', '&#5511;', 'B&#830;', '#share-link', '&#1085;', 'oldEnglishCharMapFun', 'I&#799;', '&#1084;', '&#294;', 'q&#846;', 'r&#846;', 's17', '&#4317;', 'T&#830;', '1&#846;', 'b&#799;', '➶➶➶➶➶\x20[[text]]\x20➷➷➷➷➷', '🖴︎', '.thickBlockFramed', 'g&#846;', '6&#866;', 'body', 'n&#828;', '#y2k-font', 'H&#846;', '🖂︎', 'S&#830;', '.tildeStrikeThrough', '.y2k-font', 'exports', '&#323;', 'val', '.superscriptCharMap', '&#41751;', '9&#826;', 'S&#838;', '•´¯`•.\x20', 'X&#828;', 'Z&#829;&#851;', 's&#826;', 'a&#799;', 'V&#829;&#851;', 'x&#799;', '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', '&#1071;', '★·.·´¯`·.·★\x20[[text]]\x20★·.·´¯`·.·★', 'littleSparkles', '4&#830;', '&#41922;', '&#5397;', 'b&#830;', 'Y&#826;', '&#387;', 'b&#826;', '&#41660;', '&#1074;', '✨✩✪✫✬✭✮✯✰✦✱✲✳✴✵✶✷֍֎✸✹✺✻✼✽✾✿❀❁❂❃❄★☆＊', 'init', '&sigmaf;', '▌│█║▌║▌║\x20', '<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>', '&#41686;', 'y&#838;', '&#1192;', '—(••÷[\x20[[text]]\x20]÷••)—', 'window', 'reverse', '.symbolsCharMap', 'p&#799;', '【$1】', '&#2797;', '&#1340;', 'length', 'medievalCharMapFun', '9&#799;', '『$1』', '(¯`·.¸¸.·´¯`·.¸¸.->\x20[[text]]\x20<-.¸¸.·´¯`·.¸¸.·´¯)', '&#5167;', 'V&#826;', '&part;', '9&#846;', '•?((¯°·._.•\x20', '&#41754;', '&micro;', 'T&#829;&#851;', 'C&#846;', '⫷\x20[[text]]\x20⫸', '7&#829;&#851;', 'R&#857;', '&#41833;', 'ready', '♪ღ♪*•.¸¸.•*¨¨*•.♪\x20[[text]]\x20♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪', 'W&#799;', '&#41508;', 'y&#830;', 'K&#866;', '&#422;', '&#1377;', 'N&#799;', 'C&#838;', 'dottyJoiner', 'n&#830;', '.result-s17', '&#41016;', '🕭︎', '&#120460;&#823;', '&#120453;&#823;', '••¤(`×[¤\x20[[text]]\x20¤]×´)¤••', 'nodeName', '&#1359;', '&#41991;', '&#42130;', 'remove', '1&#830;', '🕗︎', '.flourish8', '&#41532;', 'N&#857;', 'W&#838;', '402093RUacgz', '#loader', '&#409;', '&#5290;', '&#654;', '&#592;', 'f&#828;', '1&#838;', '&#4306;', 'R&#830;', 'h&#799;', '&#292;', '&#41575;', '`•.,¸¸,.•´¯\x20[[text]]\x20¯`•.,¸¸,.•´', '&#12425;', '&#1397;', '•°¯`••\x20', 'E&#799;', 'n&#838;', '&#1350;', '&#120461;&#823;', '*´¯`*.¸¸.*´¯`*\x20', 'C&#828;', '&#9815;', 'B&#857;', '&#4335;', '(人◕‿◕)', '✿.｡.:*\x20☆:**:.\x20[[text]]\x20.:**:.☆*.:｡.✿', '5&#830;', '.squiggle3CharMap', 'push', '0&#866;', 'F&#829;&#851;', '&#41949;', 's21', 'O&#830;', 'tools', 'H&#830;', '&#974;', 'class', 'w&#799;', '290ZLWFkH', '(¯`·.¸¸.·´¯`·.¸¸.->\x20', '🖮︎', '.result-s25', '1&#828;', 'w&#829;&#851;', '&#120450;&#823;', 'show', '&#645;', '2&#799;', 'mirror', '<:::::[]=¤\x20[[text]]\x20(▀̿̿Ĺ̯̿̿▀̿\x20̿)', '[[text]]\x20☜(`o´)', '&#120828;&#823;', '&#416;', 'i&#838;', '📄︎', 'N&#838;', '&#120826;&#823;', 'A&#857;', 'crossAboveBelow', '.lunisquares', '(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧', '&#595;', 'm&#828;', 'H&#828;', 'D&#866;', '&#9812;', 's26', 'e&#828;', '&#428;', 's&#829;&#851;', '&beta;', '&#41037;', '&#1342;', 'o&#799;', '-漫~*\x27¨¯¨\x27*·舞~\x20', 'decode', '&#19973;', '.result-s4', 'replace', '&alpha;', 'S&#826;', 'S&#846;', 'C&#857;', '[̲̅$1]', '&#638;', '&#120432;&#823;', '4&#866;', '•?((¯°·._.•\x20[[text]]\x20•._.·°¯))؟•', '.neonCharMap', '&#1180;', 'Q&#826;', 'width', 'F&#826;', '&#2414;', '&#1193;', 'c&#799;', 'I&#826;', 'M&#857;', 'O&#866;', '.diametricAngleFrame', '&#40984;', 'j&#826;', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20', 'click', '◠◡◠', '¸,ø¤º°`°º¤ø,¸\x20[[text]]\x20¸,ø¤º°`°º¤ø,¸', 't&#846;', 'e&#830;', 's23', '░▒▓█►─═\x20\x20[[text]]\x20═─◄█▓▒░', '<br>\x0a', '⚔️\x20[[text]]\x20⚔️', '&kappa;', '&#623;', '•°¯`••\x20[[text]]\x20••´¯°•', '👌︎', 'Copy', '&#120454;&#823;', '&#120480;&#823;', '&#120467;&#823;', '.heartsBetween', '×º°”˜`”°º×\x20', 's14', 'maxHeight', '&#41029;', '&#120457;&#823;', '&#9835;', '.result-s16', 'hasOwnProperty', '9&#829;&#851;', '&#940;', '&#1065;', '&#7828;', 'P&#830;', '&#270;', '&Uacute;', '.result-s14', 'squares', '&#120477;&#823;', 'asianStyleCharMapFun', '&#490;', '&#423;', 'k&#826;', '#y2kcredit:visible', '&#615;', 'h&#866;', 'O&#857;', '&#2799;', '&#1360;', '&#41005;', '&#20057;', '&#341;', 'h&#857;', '&#355;', '••.•´¯`•.••\x20', '&#1064;', '¸,ø¤º°`°º¤ø,¸\x20', '&#1283;', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20[[text]]\x20¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', 'd&#830;', 'addClass', '&#4315;', 'match', '&Lambda;', 'a&#866;', 'S&#828;', 'm&#799;', 'w&#838;', 'z&#826;', '&#1138;', 'm&#838;', 'split', ']|I{•------»\x20', '&#651;', 'P&#826;', '&#408;', 'z&#799;', '&#1044;', '0&#830;', '★·.·´¯`·.·★\x20', '&#9736;', '&#9837;', 'n&#799;', '.boldItalicCharMap', 'u&#799;', '.invertedSquaresCharMap', 'K&#799;', '6&#826;', '◦•●◉✿\x20[[text]]\x20✿◉●•◦', 'addRange', 'i&#830;', 'l&#830;', 'O&#799;', 'Z&#838;', '(y)', '.scriptify', '&psi;', '&chi;', 'v&#828;', '&#120823;&#823;', 'q&#830;', '•´¯`•»\x20', '&#41246;', '&#41296;', '.result-s22', '5&#838;', 'L&#846;', 's&#838;', '&#4308;', '&#1092;', '&#4325;', '&sigma;', '&#311;', '.result-s10', 'L&#866;', '.squiggle6CharMap', 'k&#828;', '.littleSparkles', 'px}\x20</style>', '.result-s31', '&#42075;', '<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22Press\x20CTRL+C\x20to\x20copy\x22\x20/></p>', 'fadeIn', '&#429;', 'nodeType', '&#607;', '&#120442;&#823;', '6&#838;', '&#42148;', 'v&#866;', 'Y&#799;', '.•♫•♬•\x20[[text]]\x20•♬•♫•.', 'e&#829;&#851;', 'D&#829;&#851;', '&#403;', '0&#838;', '&eta;', 'html,\x20body', '&#614;', 'J&#829;&#851;', '&#41555;', '0&#826;', 'z&#857;', 's20', 'V&#828;', 's27', '&#295;', '&#1358;', 'queryCommandSupported', 'getSelection', '&#41295;', '&#1210;', 'i&#857;', '░▒▓█\x20[[text]]\x20█▓▒░', 'flip', '28xpKgDg', 'global', 'recentlist', '.lunitoolstinyencode', 'o&#857;', 'v&#857;', 'j&#857;', 'X&#826;', 's25', 'p&#846;', 's16', '&#41105;', 'q&#828;', 'Z&#830;', '<%=\x20version\x20%>', '.lunitoolsmirrorencode', 'currencyCharMapFun', 'noopener', '&#8627;', 'o&#838;', '&#652;', 'innerHTML', '42KMnKBm', 'E&#826;', 'undefined', '&#1331;', '&#646;', 'D&#799;', '.leftsection', 'v&#830;', 'D&#857;', '&#438;', 'G&#830;', '(｡◕‿◕｡)', 'O&#838;', 'copy', '&#381;', '.result-s11', '(Y)', '&#41648;', 'E&#866;', '📬︎', 'scroll', '❀◕‿◕❀', 'f&#846;', '&#336;', 't&#838;', 'g&#830;', 'W&#826;', 'q&#866;', 'g&#838;', '&#998;', '&#308;', '&#9761;', 'find', 'y&#828;', '&#5556;', 'y&#866;', '(ㅅꈍ﹃ꈍ)*\x20[[text]]\x20*(ꈍ﹃ꈍㅅ)♡', '&#3588;', '&#988;', '</p></div>', 'b&#828;', 'リサフランク現代のコンピュ竹内\x20まりや若者が履く流行のスニーカー真夜中のドアホットドッグマスターストライカーソニーブギ新しい日の誕生ライフ\x20-\x20ヒスイ蒸気波\x20無線゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゙゚゛゜ゝゞゟ亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育壱逸茨芋引印因咽姻員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科', '.luniroundsquares', '&#42131;', '&iota;', '<p\x20class=\x22copied\x22><input\x20class=\x22text\x22\x20value=\x22', '.dottyJoiner', 'j&#866;', '&#41707;', 'toLowerCase', '&#296;', '&#9773;', 'R&#799;', '6&#846;', 'append', 'l&#838;', '🖰︎', '¸¸♬·¯·♩¸¸♪·¯·♫¸¸\x20[[text]]\x20¸¸♫·¯·♪¸¸♩·¯·♬¸¸', 'setSelectionRange', 'R&#846;', 'g&#799;', '🕈︎', '&#120464;&#823;', 'diacriticsBottom', 'style', '&#411;', '&#5845;', 'Y&#830;', '.copied', '(⌒‿⌒)', 'l&#866;', '0&#829;&#851;', '`•.¸¸.•´´¯`••._.•\x20[[text]]\x20•._.••`¯´´•.¸¸.•`', '&#9791;', '.result-s20', '&ugrave;', '&#40983;', '&#41823;', '&thorn;', 'input', 'input\x20change', '&epsilon;', 'J&#838;', 'fullCrazy', 'b&#857;', '&#1095;', 'o&#846;', 's11', '🗐︎', '&#9739;', '3&#829;&#851;', 'c&#857;', '4&#826;', '&#447;', '🌘‿🌘', 'a&#838;', '(っ◔◡◔)っ\x20♥\x20', '&#2790;', '(づ｡◕‿‿◕｡)づ', 'strikeThrough', '&#40974;', 'L&#828;', '&#8467;', 'charAt', '【〖〘〚［', '&iuml;', '&#10125;', 'j&#846;', '&#1111;', 'u&#866;', 'r&#830;', '\x22\x20class=\x22', '&phi;', '꧁𓊈𒆜\x20[[text]]\x20𒆜𓊉꧂', '.italicCharMap', 'L&#826;', '9&#828;', '&#41427;', '🖃︎', 'upperAnglesCharMapFun', 'i&#829;&#851;', '&#1112;', '.cuteText', 'diacriticsTop', '【｡_｡】\x20[[text]]\x20【｡_｡】', '&Gamma;', '📂︎', '5&#857;', 'x&#828;', '🕕︎', '📁︎', ',-*\x27\x20^\x20\x27~*-.,_,.-*~\x20[[text]]\x20~*-.,_,.-*~\x27\x20^\x20\x27*-,', 'w&#857;', 'v&#799;', '🕑︎', 's&#846;', 'm&#866;', 'f&#866;', 'R&#826;', '&#42159;', 'b&#846;', 'href', 's&#830;', 'a&#846;', '&#286;', 'd&#799;', '&Oslash;', '🕛︎', '&#10128;', '¤¸¸.•´¯`•¸¸.•..>>\x20', 'G&#829;&#851;', 'y&#846;', '&#351;', '&#120463;&#823;', '&#327;', 'N&#828;', '9yOetdZ', '&#1076;', '&#1337;', '🕯︎', '&#120474;&#823;', '.result-s13', '(¯´•._.•\x20[[text]]\x20•._.•´¯)', '&#391;', '🕚︎', 's15', '&#1349;', 'z&#829;&#851;', '🖳︎', '&#120449;&#823;', '&#576;', 'l&#846;', 'I&#866;', 'U&#830;', 'F&#830;', '4&#829;&#851;', 'T&#838;', 'ᵔᴥᵔ', 'E&#830;', 'c&#846;', 'J&#857;', 'Y&#829;&#851;', 'rel', '.flourish1', '4&#838;', 'e&#826;', '&#313;', '&#1052;', '.boldCharMap', 'k&#866;', '👓︎', '📭︎', '&#1073;', 'pop', '&#120483;&#823;', '&#120433;&#823;', '╰☆☆\x20[[text]]\x20☆☆╮', '.result-s6', '7&#846;', '&#321;', '&#1090;', 'h&#826;', '★彡\x20[[text]]\x20彡★', 'diacriticsMiddle', 's(^‿^)-b', '\x22\x20/><span\x20class=\x22copybtn\x22>✔\x20Copied\x20!</span></p>', '&#2798;', 't&#857;', 'l&#829;&#851;', '.firework', 'y&#799;', 'u&#838;', '•]••´º´•»\x20', '&#1046;', 'N&#846;', '&nu;', 'W&#857;', '.squaresCharMap', 't&#828;', '&#1347;', 'n&#829;&#851;', '&rho;', '&#120473;&#823;', 'I&#846;', '&#41706;', '.doubleStruckCharMap', '&#1141;', 't&#866;', 'E&#838;', 'q&#826;', '$2$1', '&#3619;', '&yen;', '&#5029;', '&#41076;', '#scroll', '&#633;', '.stinky', '˜”*°•.˜”*°•\x20', 'floor', 't&#826;', 'setAttribute', 'X&#846;', 'v&#846;', '&#1506;', 'F&#866;', 'y&#826;', '.upperAnglesCharMap', 'B&#866;', '&#42171;', '.result-s3', '😐︎', '&#410;', '&#627;', '&#120479;&#823;', 'vaporwaveText', 'K&#829;&#851;', 'ღ(¯`◕‿◕´¯)\x20♫\x20♪\x20♫\x20[[text]]\x20♫\x20♪\x20♫\x20(¯`◕‿◕´¯)ღ', '5&#829;&#851;', 'p&#857;', '&#120446;&#823;', 'C&#830;', '(/◔◡◔)/', 'W&#866;', 'O&#828;', '.vaporwaveText2', 'amd', '&#120434;&#823;', 'location', '&#1082;', '&#4329;', 'userAgent', 's18', '&#1008;', '&#1352;', 'squiggle3CharMapFun', 'f&#830;', '^ㅅ^', 'W&#846;', '.cursiveCharMap', 'a&#828;', 'T&#846;', 'S&#829;&#851;', 'kirbyHug', 'T&#828;', '&#1348;', '&#1051;', '&#1356;', 'e&#866;', 'M&#799;', 'scrollTop', '.underline', 'b&#838;', '&#400;', 'K&#846;', '.result-s24', 'm&#826;', '&Mu;', '&#41804;', '.•°¤*(¯`★´¯)*¤°\x20', '&#3648;', '&#12581;', 'tildeStrikeThrough', '&#639;', '_blank', '6&#828;', '#mobile-fly-menu', '&#356;', '&#291;', '&#8857;', 'x&#826;', 'g&#857;', 'map', '&#120475;&#823;', 'A&#799;', 'H&#826;', '.squiggle2CharMap', '3&#828;', '&#1213;', '&#41141;', 'randomization', '&szlig;', '13702gtByfa', '8&#830;', 'r&#866;', '&#9790;', '&#1075;', '◥꧁ད\x20[[text]]\x20ཌ꧂◤', 'random', '&#669;', '&#972;', '&#315;', 'roundsquares', '&#10127;', '&#10124;', 'fadeOut', '▀▄▀▄▀▄\x20', '.leftsection\x20.close', 'V&#838;', 'q&#799;', 'A&#830;', '&#41346;', '&Delta;', '.crossAboveBelow', '&#385;', '&#120822;&#823;', 'U&#799;', 'P&#799;', 'Y2k\x20Font', 'c&#828;', '2&#846;', 'm&#829;&#851;', 'G&#846;', '&#41571;', '#load-more', '[[text]]', '&#7918;', 's&#857;', 'k&#830;', '&#484;', '.lunicreepify', '&#625;', '&#4336;', '&#272;', 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890', 'D&#828;', 'a&#829;&#851;', 's31', 'slashThrough', 'c&#830;', 'u&#857;', '(≧◡≦)', '.result-s18', '&#358;', '&#42014;', 'doubleUnderline', 'j&#799;', '4&#846;', 'M&#838;', 'S&#866;', '3&#826;', '&#41045;', '&#9796;', '§.•´¨\x27°÷•..×\x20[[text]]\x20×,.•´¨\x27°÷•..§', '▀▄▀▄▀▄\x20[[text]]\x20▄▀▄▀▄▀', 'x&#846;', 'display:\x20inline-block!important;\x20font-size:\x20inherit!important;\x20color:\x20#0088ff!important;\x20visibility:\x20visible!important;z-index:99!important;\x20opacity:\x201!important;', 'i&#828;', '9&#866;', '.result-s21', '(¯`*•.¸,¤°´✿.｡.:*\x20[[text]]\x20*.:｡.✿`°¤,¸.•*´¯)', '&#1223;', 'bent', 'monospaceCharMapFun', 'h&#830;', 'subscriptCharMapFun', 'l&#857;', '&#1178;', '&#1171;', '●‿●', '🕒︎', ']|I{•------»\x20[[text]]\x20«------•}I|[', 'fromCharCode', '°°°·.°·..·°¯°·._.·\x20[[text]]\x20·._.·°¯°·.·°\x20.·°°°', 'Q&#846;', 'R&#828;', '&#41240;', '2&#826;', 'H&#829;&#851;', '&#1072;', 'r&#829;&#851;', 'trim', '.lunitoolsflipencode', '🖲︎', 's24', 'E&#828;', '&#5609;', 'join', 'j&#838;', '&Omega;', 'firework', 'T&#826;', '&#3057;', '(✿◕ᗜ◕)━♫.*･｡ﾟ', 'object', '╚»★«╝\x20[[text]]\x20╚»★«╝', 'g&#829;&#851;', '💣︎', '&#372;', 'R&#866;', '3&#846;', '&#1031;', 'squaresCharMapFun', 'attr', '٩(˘◡˘)۶', 'r&#826;', 'INPUT'];
    _0x59bf = function() {
        return _0x419122;
    };
    return _0x59bf();
}

function medievalCharMapFun(_0x5ee951) {
    return applyCharMap(medievalCharMap, _0x5ee951);
}

function cursiveCharMapFun(_0x2b2ea9) {
    return applyCharMap(cursiveCharMap, _0x2b2ea9);
}

function doubleStruckCharMapFun(_0x31b5a1) {
    return applyCharMap(doubleStruckCharMap, _0x31b5a1);
}

function italicCharMapFun(_0x1dc5e2) {
    return applyCharMap(italicCharMap, _0x1dc5e2);
}

function boldItalicCharMapFun(_0x10458d) {
    return applyCharMap(boldItalicCharMap, _0x10458d);
}

function monospaceCharMapFun(_0xfe3f4) {
    return applyCharMap(monospaceCharMap, _0xfe3f4);
}

function upperAnglesCharMapFun(_0x13cd3a) {
    return applyCharMap(upperAnglesCharMap, _0x13cd3a);
}

function greekCharMapFun(_0x1c141e) {
    return applyCharMap(greekCharMap, _0x1c141e);
}

function symbolsCharMapFun(_0x2cc1b2) {
    return applyCharMap(symbolsCharMap, _0x2cc1b2);
}

function currencyCharMapFun(_0x17a137) {
    return applyCharMap(currencyCharMap, _0x17a137);
}

function asianStyleCharMapFun(_0x8409b5) {
    return applyCharMap(asianStyleCharMap, _0x8409b5);
}

function asianStyle2CharMapFun(_0x3423ca) {
    return applyCharMap(asianStyle2CharMap, _0x3423ca);
}
var luni = new Lunicode();
luni[_0x1d931a(0x317)][_0x1d931a(0x1a6)][_0x1d931a(0x218)][_0x1d931a(0x371)] = 0xa;

function crazyWithFlourishOrSymbols(_0x2b7db8) {
    if (Math['random']() < 0.7) return wrapInSymbols(crazifyText(_0x2b7db8), 0x2);
    else return wrapInFlourish(crazifyText(_0x2b7db8), 0x2);
}

function strikeThrough(_0x3ef567) {
    var _0x397ed2 = _0x1d931a;
    return _0x3ef567[_0x397ed2(0x3a1)]('')['join']('̶') + '̶';
}

function tildeStrikeThrough(_0x2dc671) {
    var _0xa52724 = _0x1d931a;
    return _0x2dc671[_0xa52724(0x3a1)]('')[_0xa52724(0x5ac)]('̴') + '̴';
}

function underline(_0x2207c4) {
    var _0x52ddf9 = _0x1d931a;
    return _0x2207c4[_0x52ddf9(0x3a1)]('')['join']('̲') + '̲';
}

function doubleUnderline(_0x2c8459) {
    var _0x42c9b9 = _0x1d931a;
    return _0x2c8459['split']('')[_0x42c9b9(0x5ac)]('̳') + '̳';
}

function slashThrough(_0x580f14) {
    var _0x72d00a = _0x1d931a;
    return _0x580f14[_0x72d00a(0x3a1)]('')[_0x72d00a(0x5ac)]('̷') + '̷';
}

function stinky(_0x257724) {
    var _0x1673f6 = _0x1d931a;
    return _0x257724[_0x1673f6(0x3a1)]('')[_0x1673f6(0x5ac)]('̾') + '̾';
}

function heartsBetween(_0x324cd9) {
    var _0x33422c = _0x1d931a;
    return _0x324cd9[_0x33422c(0x3a1)]('')[_0x33422c(0x5ac)]('♥');
}

function arrowBelow(_0x3e9800) {
    var _0x2b762f = _0x1d931a;
    return _0x3e9800[_0x2b762f(0x3a1)]('')[_0x2b762f(0x5ac)]('͎') + '͎';
}

function crossAboveBelow(_0x45061a) {
    var _0x314698 = _0x1d931a;
    return _0x45061a[_0x314698(0x3a1)]('')[_0x314698(0x5ac)]('͓̽') + '͓̽';
}
var f = {};
f['0'] = _0x1d931a(0x48d), f['1'] = _0x1d931a(0x489), f['2'] = _0x1d931a(0x32c), f['3'] = '🗏︎', f['4'] = _0x1d931a(0x463), f['5'] = _0x1d931a(0x1c5), f['6'] = '⌛︎', f['7'] = _0x1d931a(0x31e), f['8'] = _0x1d931a(0x443), f['9'] = _0x1d931a(0x5a8), f['!'] = '✏︎', f['\x22'] = '✂︎', f['#'] = '✁︎', f['$'] = _0x1d931a(0x4c9), f['%'] = _0x1d931a(0x2e4), f['&'] = '🕮︎', f['\x27'] = _0x1d931a(0x4aa), f['('] = '🕿︎', f[')'] = '✆︎', f['*'] = _0x1d931a(0x295), f['+'] = _0x1d931a(0x481), f[','] = '📪︎', f['-'] = '📫︎', f['.'] = _0x1d931a(0x41e), f['/'] = _0x1d931a(0x4ca), f[':'] = _0x1d931a(0x4b3), f[';'] = _0x1d931a(0x28d), f['<'] = _0x1d931a(0x659), f['='] = '🖬︎', f['>'] = '✇︎', f['?'] = '✍︎', f['A'] = '✌︎', f['B'] = _0x1d931a(0x369), f['C'] = _0x1d931a(0x647), f['D'] = '👎︎', f['E'] = '☜︎', f['F'] = '☞︎', f['G'] = '☝︎', f['H'] = '☟︎', f['I'] = '✋︎', f['J'] = '☺︎', f['K'] = _0x1d931a(0x506), f['L'] = '☹︎', f['M'] = _0x1d931a(0x5b6), f['N'] = '☠︎', f['O'] = '⚐︎', f['P'] = _0x1d931a(0x1bd), f['Q'] = '✈︎', f['R'] = '☼︎', f['S'] = _0x1d931a(0x62c), f['T'] = '❄︎', f['U'] = '🕆︎', f['V'] = '✞︎', f['W'] = _0x1d931a(0x448), f['X'] = '✠︎', f['Y'] = '✡︎', f['Z'] = '☪︎', f['['] = '☯︎', f['\x5c'] = 'ॐ︎', f[']'] = '☸︎', f['^'] = '♈︎', f['_'] = '♉︎', f['`'] = '♊︎', f['a'] = '♋︎', f['b'] = '♌︎', f['c'] = '♍︎', f['d'] = '♎︎', f['e'] = '♏︎', f['f'] = '♐︎', f['g'] = '♑︎', f['h'] = '♒︎', f['i'] = '♓︎', f['j'] = '🙰', f['k'] = '🙵', f['l'] = '●︎', f['m'] = '❍︎', f['n'] = '■︎', f['o'] = '□︎', f['p'] = '◻︎', f['q'] = '❑︎', f['r'] = '❒︎', f['s'] = '⬧︎', f['t'] = '⧫︎', f['u'] = '◆︎', f['v'] = '❖︎', f['w'] = '⬥︎', f['x'] = '⌧︎', f['y'] = '⍓︎', f['z'] = '⌘︎', f['{'] = '❀︎', f['|'] = '✿︎', f['}'] = '❝︎', f['~'] = '❞︎', f['\x20'] = '▯︎', f['€'] = '⓪︎', f['\x20'] = '①︎', f['‚'] = '②︎', f['ƒ'] = '③︎', f['„'] = '④︎', f['…'] = '⑤︎', f['†'] = '⑥︎', f['‡'] = '⑦︎', f['ˆ'] = '⑧︎', f['‰'] = '⑨︎', f['Š'] = '⑩︎', f['‹'] = '⓿︎', f['Œ'] = '❶︎', f['\x20'] = '❷︎', f['Ž'] = '❸︎', f['\x20'] = '❹︎', f['\x20'] = '❺︎', f['‘'] = '❻︎', f['’'] = '❼︎', f['“'] = '❽︎', f['”'] = '❾︎', f['•'] = '❿︎', f['–'] = '◻︎', f['—'] = '◻︎', f['˜'] = '◻︎', f['™'] = '◻︎', f['š'] = '◻︎', f['›'] = '◻︎', f['œ'] = '◻︎', f['\x20'] = '◻︎', f['ž'] = '·︎', f['Ÿ'] = '•︎', f['¡'] = '○︎', f['¢'] = '⭕︎', f['£'] = '◻︎', f['¤'] = '◉︎', f['¥'] = '◎︎', f['¦'] = '◻︎', f['§'] = '▪︎', f['¨'] = '◻︎', f['©'] = '◻︎', f['ª'] = '✦︎', f['«'] = '★︎', f['¬'] = '✶︎', f['®'] = '✹︎', f['¯'] = '✵︎', f['°'] = '◻︎', f['±'] = '⌖︎', f['²'] = '⟡︎', f['³'] = '⌑︎', f['´'] = '◻︎', f['µ'] = '✪︎', f['¶'] = '✰︎', f['·'] = '🕐︎', f['¸'] = _0x1d931a(0x491), f['¹'] = _0x1d931a(0x59b), f['º'] = _0x1d931a(0x266), f['»'] = '🕔︎', f['¼'] = _0x1d931a(0x48c), f['½'] = _0x1d931a(0x24c), f['¾'] = _0x1d931a(0x2ee), f['¿'] = '🕘︎', f['À'] = '🕙︎', f['Á'] = _0x1d931a(0x4af), f['Â'] = _0x1d931a(0x49e), f['Ã'] = '◻︎', f['Ä'] = '◻︎', f['Å'] = '◻︎', f['Æ'] = '◻︎', f['Ç'] = '◻︎', f['È'] = '◻︎', f['É'] = '◻︎', f['Ê'] = '◻︎', f['Ë'] = '◻︎', f['Ì'] = '◻︎', f['Í'] = '◻︎', f['Î'] = '◻︎', f['Ï'] = '◻︎', f['Ð'] = '◻︎', f['Ñ'] = '◻︎', f['Ò'] = '◻︎', f['Ó'] = '◻︎', f['Ô'] = '◻︎', f['Õ'] = '⌫︎', f['Ö'] = '⌦︎', f['×'] = '◻︎', f['Ø'] = '➢︎', f['Ù'] = '◻︎', f['Ú'] = '◻︎', f['Û'] = '◻︎', f['Ü'] = '➲︎', f['Ý'] = '◻︎', f['Þ'] = '◻︎', f['ß'] = '◻︎', f['à'] = '◻︎', f['á'] = '◻︎', f['â'] = '◻︎', f['ã'] = '◻︎', f['ä'] = '◻︎', f['å'] = '◻︎', f['æ'] = '◻︎', f['ç'] = '◻︎', f['è'] = '➔︎', f['é'] = '◻︎', f['ê'] = '◻︎', f['ë'] = '◻︎', f['ì'] = '◻︎', f['í'] = '◻︎', f['î'] = '◻︎', f['ï'] = '⇦︎', f['ð'] = '⇨︎', f['ñ'] = '⇧︎', f['ò'] = '⇩︎', f['ó'] = '⬄︎', f['ô'] = '⇳︎', f['õ'] = '⬀︎', f['ö'] = '⬁︎', f['÷'] = '⬃︎', f['ø'] = '⬂︎', f['ù'] = '▭︎', f['ú'] = '▫︎', f['û'] = '✗︎', f['ü'] = '✓︎', f['ý'] = '☒︎', f['þ'] = '☑︎', f['ÿ'] = '◻︎';
const wingdingsCharMap = f;

function wingdings(_0x2f3dc3) {
    var _0x52696d = _0x1d931a;
    return _0x2f3dc3[_0x52696d(0x3a1)]('')['map'](function(_0x3fe791) {
        return wingdingsCharMap[_0x3fe791] ? wingdingsCharMap[_0x3fe791] : _0x3fe791;
    })[_0x52696d(0x5ac)]('');
}
var g = {};
g['\x20'] = '\u3000', g['`'] = '`', g['1'] = '１', g['2'] = '２', g['3'] = '３', g['4'] = '４', g['5'] = '５', g['6'] = '６', g['7'] = '７', g['8'] = '８', g['9'] = '９', g['0'] = '０', g['-'] = '－', g['='] = '＝', g['~'] = '~', g['!'] = '！', g['@'] = '＠', g['#'] = '＃', g['$'] = '＄', g['%'] = '％', g['^'] = '^', g['&'] = '＆', g['*'] = '＊', g['('] = '（', g[')'] = '）', g['_'] = '_', g['+'] = '＋', g['q'] = 'ｑ', g['w'] = 'ｗ', g['e'] = 'ｅ', g['r'] = 'ｒ', g['t'] = 'ｔ', g['y'] = 'ｙ', g['u'] = 'ｕ', g['i'] = 'ｉ', g['o'] = 'ｏ', g['p'] = 'ｐ', g['['] = '[', g[']'] = ']', g['\x5c'] = '\x5c', g['Q'] = 'Ｑ', g['W'] = 'Ｗ', g['E'] = 'Ｅ', g['R'] = 'Ｒ', g['T'] = 'Ｔ', g['Y'] = 'Ｙ', g['U'] = 'Ｕ', g['I'] = 'Ｉ', g['O'] = 'Ｏ', g['P'] = 'Ｐ', g['{'] = '{', g['}'] = '}', g['|'] = '|', g['a'] = 'ａ', g['s'] = 'ｓ', g['d'] = 'ｄ', g['f'] = 'ｆ', g['g'] = 'ｇ', g['h'] = 'ｈ', g['j'] = 'ｊ', g['k'] = 'ｋ', g['l'] = 'ｌ', g[';'] = '；', g['\x27'] = '＇', g['A'] = 'Ａ', g['S'] = 'Ｓ', g['D'] = 'Ｄ', g['F'] = 'Ｆ', g['G'] = 'Ｇ', g['H'] = 'Ｈ', g['J'] = 'Ｊ', g['K'] = 'Ｋ', g['L'] = 'Ｌ', g[':'] = '：', g['\x22'] = '\x22', g['z'] = 'ｚ', g['x'] = 'ｘ', g['c'] = 'ｃ', g['v'] = 'ｖ', g['b'] = 'ｂ', g['n'] = 'ｎ', g['m'] = 'ｍ', g[','] = '，', g['.'] = '．', g['/'] = '／', g['Z'] = 'Ｚ', g['X'] = 'Ｘ', g['C'] = 'Ｃ', g['V'] = 'Ｖ', g['B'] = 'Ｂ', g['N'] = 'Ｎ', g['M'] = 'Ｍ', g['<'] = '<', g['>'] = '>', g['?'] = '？';
const vaporwaveCharMap = g;

function vaporwaveText(_0x5704e8) {
    var _0x3411b9 = _0x1d931a,
        _0x1bf18b = _0x5704e8[_0x3411b9(0x3a1)]('\x20')['length'];
    _0x5704e8 = applyCharMap(vaporwaveCharMap, _0x5704e8);
    var _0x2c6835 = getAsianChars(Math[_0x3411b9(0x1f1)](0x3, _0x1bf18b));
    if (_0x1bf18b > 0x6) _0x2c6835 = _0x2c6835['split']('')['map'](_0x5cac73 => _0x5cac73 + ['', ''][Math['round'](Math[_0x3411b9(0x553)]() * 0.6)])[_0x3411b9(0x5ac)]('');
    var _0x1b3a87 = [];
    return _0x1b3a87[_0x3411b9(0x311)](_0x5704e8), _0x1b3a87[_0x3411b9(0x5ac)]();
}

function vaporwaveText1(_0xbd5991) {
    var _0x863bb2 = _0x1d931a,
        _0x181aa9 = _0xbd5991[_0x863bb2(0x3a1)]('\x20')[_0x863bb2(0x2c4)];
    _0xbd5991 = applyCharMap(vaporwaveCharMap, _0xbd5991);
    var _0x1120e8 = getAsianChars(Math[_0x863bb2(0x1f1)](0x3, _0x181aa9));
    if (_0x181aa9 > 0x6) _0x1120e8 = _0x1120e8['split']('')[_0x863bb2(0x543)](_0xdbfdd6 => _0xdbfdd6 + ['', ''][Math[_0x863bb2(0x1f0)](Math[_0x863bb2(0x553)]() * 0.6)])[_0x863bb2(0x5ac)]('');
    var _0x289abb = [];
    return _0x289abb[_0x863bb2(0x311)](_0xbd5991[_0x863bb2(0x344)](/　/g, '░')[_0x863bb2(0x344)](/ａｅ/, 'æ')[_0x863bb2(0x344)](/Ａ/g, 'Λ')[_0x863bb2(0x344)](/Ｅ/g, function() {
        var _0x49bebd = _0x863bb2;
        return Math[_0x49bebd(0x553)]() > 0.5 ? 'Ξ' : 'Σ';
    })[_0x863bb2(0x344)](/Ｏ/g, '♢')), _0x289abb[_0x863bb2(0x5ac)]();
}

function vaporwaveText2(_0x213276) {
    var _0x1c274b = _0x1d931a,
        _0x44a898 = _0x213276[_0x1c274b(0x3a1)]('\x20')[_0x1c274b(0x2c4)];
    _0x213276 = applyCharMap(vaporwaveCharMap, _0x213276);
    var _0x2cb094 = getAsianChars(Math[_0x1c274b(0x1f1)](0x3, _0x44a898));
    if (_0x44a898 > 0x6) _0x2cb094 = _0x2cb094['split']('')[_0x1c274b(0x543)](_0x56707b => _0x56707b + ['', ''][Math[_0x1c274b(0x1f0)](Math[_0x1c274b(0x553)]() * 0.6)])[_0x1c274b(0x5ac)]('');
    var _0x4eba35 = [];
    return _0x4eba35[_0x1c274b(0x311)]('【\ufeff' + _0x213276 + '】'), _0x4eba35[_0x1c274b(0x5ac)]();
}

function getAsianChars(_0x369b1f) {
    var _0x3e8fb5 = _0x1d931a;
    if (!_0x369b1f) _0x369b1f = 0x1;
    var _0x6b279 = _0x3e8fb5(0x434),
        _0x4afbdf = '';
    for (var _0x5ce43c = 0x0; _0x5ce43c < _0x369b1f; _0x5ce43c++) {
        _0x4afbdf += _0x6b279[Math[_0x3e8fb5(0x4fa)](Math[_0x3e8fb5(0x553)]() * _0x6b279[_0x3e8fb5(0x2c4)])];
    }
    return _0x4afbdf;
}
const flourishArray = [_0x1d931a(0x651), _0x1d931a(0x552), _0x1d931a(0x2a9), _0x1d931a(0x365), _0x1d931a(0x236), _0x1d931a(0x2d7), '◥꧁ད\x20ॐ卐[[text]]\x20卐ॐ\x20ཌ꧂◤', '(\x20ﾟ∀ﾟ)ﾉ【[[text]]】', _0x1d931a(0x254), _0x1d931a(0x328), _0x1d931a(0x1e1), _0x1d931a(0x327), _0x1d931a(0x669), _0x1d931a(0x61c), _0x1d931a(0x42f), _0x1d931a(0x394), _0x1d931a(0x217), '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20[[text]]\x20█\x20▇\x20▆\x20▅\x20▄\x20▂\x20▁', _0x1d931a(0x59e), _0x1d931a(0x5cc), _0x1d931a(0x270), _0x1d931a(0x34d), _0x1d931a(0x65a), _0x1d931a(0x223), _0x1d931a(0x5e3), '*•.¸♡\x20[[text]]\x20♡¸.•*', _0x1d931a(0x4cf), _0x1d931a(0x262), _0x1d931a(0x4ad), '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', _0x1d931a(0x3f3), _0x1d931a(0x363), _0x1d931a(0x4d5), _0x1d931a(0x204), _0x1d931a(0x58a), _0x1d931a(0x368), _0x1d931a(0x591), '|!¤*\x27~``~\x27*¤!|\x20[[text]]\x20|!¤*\x27~``~\x27*¤!|', '•._.••´¯``•.¸¸.•`\x20[[text]]\x20`•.¸¸.•´´¯`••._.•', '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', _0x1d931a(0x4ad), _0x1d931a(0x2e7), _0x1d931a(0x667), '\x20.o0×X×0o.\x20[[text]]\x20.o0×X×0o.', _0x1d931a(0x2a7), _0x1d931a(0x2bc), _0x1d931a(0x35f), _0x1d931a(0x453), _0x1d931a(0x48e), _0x1d931a(0x300), '↤↤↤↤↤\x20[[text]]\x20↦↦↦↦↦', _0x1d931a(0x28c), '↫↫↫↫↫\x20[[text]]\x20↬↬↬↬↬', _0x1d931a(0x1b5), _0x1d931a(0x487), _0x1d931a(0x59c), _0x1d931a(0x58b), _0x1d931a(0x18a), _0x1d931a(0x204), '-漫~*\x27¨¯¨\x27*·舞~\x20[[text]]\x20~舞*\x27¨¯¨\x27*·~漫-', _0x1d931a(0x264), _0x1d931a(0x262), '••.•´¯`•.••\x20[[text]]\x20••.•´¯`•.••', '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', _0x1d931a(0x3b2), _0x1d931a(0x47c), _0x1d931a(0x5b4), _0x1d931a(0x2d2), '-·=»‡«=·-\x20[[text]]\x20-·=»‡«=·-', '∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ\x20[[text]]\x20ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙', _0x1d931a(0x444), 'ஜ۩۞۩ஜ\x20[[text]]\x20ஜ۩۞۩ஜ', '¤\x20(¯´☆✭.¸_)¤\x20[[text]]\x20¤(_¸.✭☆´¯)\x20¤', _0x1d931a(0x2c8), _0x1d931a(0x30e), _0x1d931a(0x3dd), _0x1d931a(0x50c), '«-(¯`v´¯)-«\x20[[text]]\x20»-(¯`v´¯)-»'];

function wrapInFlourish(_0xbb580e) {
    var _0x55f9f3 = _0x1d931a;
    return flourishArray[Math[_0x55f9f3(0x4fa)](Math[_0x55f9f3(0x553)]() * flourishArray[_0x55f9f3(0x2c4)])][_0x55f9f3(0x344)](_0x55f9f3(0x56e), _0xbb580e);
}

function Flourishlist(_0x10824a, _0x5104fa) {
    var _0x2c7924 = _0x1d931a;
    return flourishArray[_0x10824a][_0x2c7924(0x344)](_0x2c7924(0x56e), _0x5104fa);
}

function wrapInSymbols(_0x260537, _0x5347d7) {
    return randomSymbols(_0x5347d7) + '\x20\x20' + _0x260537 + '\x20\x20' + randomSymbols(_0x5347d7);
}

function firework(_0x3d404e) {
    return _0x3d404e['split']('')['join']('҉') + '҉';
}

function weirdBox(_0x45f574) {
    var _0x4d1a34 = _0x1d931a;
    return _0x45f574['replace'](/([^\s])/g, _0x4d1a34(0x349));
}

function littleSparkles(_0x579b90) {
    var _0x4a0fdb = _0x1d931a;
    return _0x4a0fdb(0x4f9) + _0x579b90 + '\x20•°*”˜.•°*”˜';
}

function kirbyHug(_0x87a9d4) {
    var _0x4bdd22 = _0x1d931a;
    return _0x4bdd22(0x46b) + _0x87a9d4 + '\x20♥';
}

function dottyJoiner(_0x1088bc) {
    var _0x4b1273 = _0x1d931a;
    return '░' + _0x1088bc[_0x4b1273(0x3a1)]('')['join']('░') + '░';
}

function wavyJoiner(_0x5405dc) {
    var _0x4a49b7 = _0x1d931a;
    return '≋' + _0x5405dc[_0x4a49b7(0x3a1)]('')[_0x4a49b7(0x5ac)]('≋') + '≋';
}

function diametricAngleFrame(_0x1ebdd9) {
    var _0x142ec0 = _0x1d931a;
    return _0x1ebdd9['replace'](/([^\s])/g, _0x142ec0(0x2c7));
}

function thickBlockFramed(_0xe46822) {
    var _0x6d02a5 = _0x1d931a;
    return _0xe46822[_0x6d02a5(0x344)](/([^\s])/g, _0x6d02a5(0x2c1));
}
var h = {};
h['1'] = _0x1d931a(0x345), h['2'] = _0x1d931a(0x5c0), h['3'] = _0x1d931a(0x643), h['4'] = _0x1d931a(0x393), h['5'] = _0x1d931a(0x549), h['6'] = '&#989;', h['7'] = _0x1d931a(0x1ba), h['8'] = '&#1291;', h['9'] = _0x1d931a(0x437), h['10'] = _0x1d931a(0x554), h['11'] = _0x1d931a(0x2f5), h['12'] = _0x1d931a(0x324), h['13'] = _0x1d931a(0x574), h['14'] = _0x1d931a(0x508), h['15'] = _0x1d931a(0x3c9), h['16'] = _0x1d931a(0x4e8), h['17'] = '&#985;', h['18'] = _0x1d931a(0x34a), h['19'] = '&#642;', h['20'] = _0x1d931a(0x507), h['21'] = _0x1d931a(0x234), h['22'] = _0x1d931a(0x3a3), h['23'] = _0x1d931a(0x367), h['24'] = 'x', h['25'] = _0x1d931a(0x613), h['26'] = _0x1d931a(0x1cf), h['27'] = 'A', h['28'] = 'B', h['29'] = 'C', h['30'] = 'D', h['31'] = 'E', h['32'] = 'F', h['33'] = 'G', h['34'] = 'H', h['35'] = 'I', h['36'] = 'J', h['37'] = 'K', h['38'] = 'L', h['39'] = 'M', h['40'] = 'N', h['41'] = 'O', h['42'] = 'P', h['43'] = 'Q', h['44'] = 'R', h['45'] = 'S', h['46'] = 'T', h['47'] = 'U', h['48'] = 'V', h['49'] = 'W', h['50'] = 'X', h['51'] = 'Y', h['52'] = 'Z', h['53'] = '1', h['54'] = '2', h['55'] = '3', h['56'] = '4', h['57'] = '5', h['58'] = '6', h['59'] = '7', h['60'] = '8', h['61'] = '9', h['62'] = '0';
var i = {};
i['1'] = _0x1d931a(0x63a), i['2'] = '&#9837;', i['3'] = _0x1d931a(0x550), i['4'] = _0x1d931a(0x18d), i['5'] = _0x1d931a(0x200), i['6'] = _0x1d931a(0x431), i['7'] = '&#10081;', i['8'] = _0x1d931a(0x589), i['9'] = _0x1d931a(0x30a), i['10'] = '&#9834;', i['11'] = _0x1d931a(0x51c), i['12'] = _0x1d931a(0x407), i['13'] = _0x1d931a(0x337), i['14'] = _0x1d931a(0x374), i['15'] = _0x1d931a(0x540), i['16'] = _0x1d931a(0x4e8), i['17'] = _0x1d931a(0x43e), i['18'] = _0x1d931a(0x3aa), i['19'] = _0x1d931a(0x60d), i['20'] = _0x1d931a(0x1af), i['21'] = _0x1d931a(0x464), i['22'] = _0x1d931a(0x18e), i['23'] = _0x1d931a(0x1f5), i['24'] = _0x1d931a(0x242), i['25'] = _0x1d931a(0x454), i['26'] = _0x1d931a(0x42a), i['27'] = _0x1d931a(0x63a), i['28'] = _0x1d931a(0x3ab), i['29'] = _0x1d931a(0x550), i['30'] = _0x1d931a(0x18d), i['31'] = _0x1d931a(0x200), i['32'] = _0x1d931a(0x431), i['33'] = '&#10081;', i['34'] = '&#9796;', i['35'] = _0x1d931a(0x30a), i['36'] = '&#9834;', i['37'] = _0x1d931a(0x51c), i['38'] = _0x1d931a(0x407), i['39'] = _0x1d931a(0x337), i['40'] = _0x1d931a(0x374), i['41'] = _0x1d931a(0x540), i['42'] = _0x1d931a(0x4e8), i['43'] = _0x1d931a(0x43e), i['44'] = _0x1d931a(0x3aa), i['45'] = _0x1d931a(0x60d), i['46'] = _0x1d931a(0x1af), i['47'] = _0x1d931a(0x464), i['48'] = '&#10003;', i['49'] = _0x1d931a(0x1f5), i['50'] = _0x1d931a(0x242), i['51'] = _0x1d931a(0x454), i['52'] = _0x1d931a(0x42a), i['53'] = _0x1d931a(0x648), i['54'] = _0x1d931a(0x63c), i['55'] = _0x1d931a(0x559), i['56'] = _0x1d931a(0x475), i['57'] = '&#10126;', i['58'] = _0x1d931a(0x558), i['59'] = _0x1d931a(0x49f), i['60'] = '&#10129;', i['61'] = _0x1d931a(0x20a), i['62'] = _0x1d931a(0x1db);
var j = {};
j['1'] = _0x1d931a(0x629), j['2'] = _0x1d931a(0x33c), j['3'] = _0x1d931a(0x27a), j['4'] = _0x1d931a(0x37c), j['5'] = _0x1d931a(0x26e), j['6'] = '&#358;', j['7'] = _0x1d931a(0x49b), j['8'] = _0x1d931a(0x2fe), j['9'] = _0x1d931a(0x43d), j['10'] = '&#308;', j['11'] = '&#310;', j['12'] = _0x1d931a(0x4c5), j['13'] = _0x1d931a(0x4c6), j['14'] = _0x1d931a(0x29a), j['15'] = _0x1d931a(0x422), j['16'] = _0x1d931a(0x605), j['17'] = 'Q', j['18'] = _0x1d931a(0x20c), j['19'] = '&#346;', j['20'] = _0x1d931a(0x53e), j['21'] = '&Uacute;', j['22'] = 'V', j['23'] = _0x1d931a(0x5b7), j['24'] = '&#1046;', j['25'] = '&#374;', j['26'] = _0x1d931a(0x5dc), j['27'] = _0x1d931a(0x629), j['28'] = '&beta;', j['29'] = _0x1d931a(0x27a), j['30'] = _0x1d931a(0x37c), j['31'] = _0x1d931a(0x26e), j['32'] = _0x1d931a(0x580), j['33'] = _0x1d931a(0x49b), j['34'] = _0x1d931a(0x2fe), j['35'] = _0x1d931a(0x43d), j['36'] = _0x1d931a(0x429), j['37'] = '&#310;', j['38'] = '&#313;', j['39'] = _0x1d931a(0x4c6), j['40'] = _0x1d931a(0x29a), j['41'] = '&#336;', j['42'] = _0x1d931a(0x605), j['43'] = 'Q', j['44'] = '&#340;', j['45'] = '&#346;', j['46'] = _0x1d931a(0x53e), j['47'] = _0x1d931a(0x37d), j['48'] = 'V', j['49'] = '&#372;', j['50'] = _0x1d931a(0x4e0), j['51'] = '&#374;', j['52'] = _0x1d931a(0x5dc), j['53'] = '1', j['54'] = '2', j['55'] = '3', j['56'] = '4', j['57'] = '5', j['58'] = '6', j['59'] = '7', j['60'] = '8', j['61'] = '9', j['62'] = '0';
var k = {};
k['1'] = '&#592;', k['2'] = 'q', k['3'] = _0x1d931a(0x66d), k['4'] = 'p', k['5'] = _0x1d931a(0x208), k['6'] = '&#607;', k['7'] = '&#387;', k['8'] = _0x1d931a(0x245), k['9'] = '&#7433;', k['10'] = '&#638;', k['11'] = '&#670;', k['12'] = 'l', k['13'] = _0x1d931a(0x367), k['14'] = 'u', k['15'] = 'o', k['16'] = 'd', k['17'] = 'b', k['18'] = _0x1d931a(0x4f7), k['19'] = 's', k['20'] = _0x1d931a(0x649), k['21'] = 'n', k['22'] = _0x1d931a(0x409), k['23'] = '&#653;', k['24'] = 'x', k['25'] = _0x1d931a(0x2f7), k['26'] = 'z', k['27'] = _0x1d931a(0x2f8), k['28'] = 'q', k['29'] = _0x1d931a(0x66d), k['30'] = 'p', k['31'] = '&#477;', k['32'] = _0x1d931a(0x3d7), k['33'] = _0x1d931a(0x2b0), k['34'] = _0x1d931a(0x245), k['35'] = '&#7433;', k['36'] = _0x1d931a(0x34a), k['37'] = '&#670;', k['38'] = 'l', k['39'] = _0x1d931a(0x367), k['40'] = 'u', k['41'] = 'o', k['42'] = 'd', k['43'] = 'b', k['44'] = '&#633;', k['45'] = 's', k['46'] = _0x1d931a(0x649), k['47'] = 'n', k['48'] = _0x1d931a(0x409), k['49'] = _0x1d931a(0x1cd), k['50'] = 'x', k['51'] = _0x1d931a(0x2f7), k['52'] = 'z', k['53'] = _0x1d931a(0x652), k['54'] = _0x1d931a(0x5de), k['55'] = _0x1d931a(0x530), k['56'] = '&#12579;', k['57'] = _0x1d931a(0x210), k['58'] = '9', k['59'] = _0x1d931a(0x538), k['60'] = '8', k['61'] = '6', k['62'] = '0';
var l = {};
l['1'] = _0x1d931a(0x561), l['2'] = '&beta;', l['3'] = '&#262;', l['4'] = _0x1d931a(0x576), l['5'] = _0x1d931a(0x200), l['6'] = _0x1d931a(0x231), l['7'] = _0x1d931a(0x572), l['8'] = _0x1d931a(0x284), l['9'] = _0x1d931a(0x1fa), l['10'] = _0x1d931a(0x429), l['11'] = '&#1180;', l['12'] = _0x1d931a(0x4d2), l['13'] = _0x1d931a(0x534), l['14'] = '&#327;', l['15'] = _0x1d931a(0x49d), l['16'] = '&#420;', l['17'] = _0x1d931a(0x5ae), l['18'] = _0x1d931a(0x62d), l['19'] = _0x1d931a(0x1a1), l['20'] = '&#358;', l['21'] = _0x1d931a(0x56f), l['22'] = 'V', l['23'] = _0x1d931a(0x5b7), l['24'] = _0x1d931a(0x4e0), l['25'] = '&yen;', l['26'] = _0x1d931a(0x419), l['27'] = _0x1d931a(0x561), l['28'] = _0x1d931a(0x33c), l['29'] = '&#262;', l['30'] = '&#272;', l['31'] = _0x1d931a(0x200), l['32'] = '&#8355;', l['33'] = _0x1d931a(0x572), l['34'] = _0x1d931a(0x284), l['35'] = _0x1d931a(0x1fa), l['36'] = _0x1d931a(0x429), l['37'] = _0x1d931a(0x34f), l['38'] = _0x1d931a(0x4d2), l['39'] = _0x1d931a(0x534), l['40'] = _0x1d931a(0x4a5), l['41'] = '&Oslash;', l['42'] = _0x1d931a(0x5eb), l['43'] = '&Omega;', l['44'] = '&#344;', l['45'] = _0x1d931a(0x1a1), l['46'] = '&#358;', l['47'] = '&#7918;', l['48'] = 'V', l['49'] = _0x1d931a(0x5b7), l['50'] = '&#1046;', l['51'] = _0x1d931a(0x4f3), l['52'] = _0x1d931a(0x419), l['53'] = '1', l['54'] = '2', l['55'] = '3', l['56'] = '4', l['57'] = '5', l['58'] = '6', l['59'] = '7', l['60'] = '8', l['61'] = '9', l['62'] = '0';
var m = {};
m['1'] = '&alpha;', m['2'] = '&#595;', m['3'] = _0x1d931a(0x4d9), m['4'] = _0x1d931a(0x2cb), m['5'] = '&epsilon;', m['6'] = _0x1d931a(0x22c), m['7'] = '&#608;', m['8'] = _0x1d931a(0x3e4), m['9'] = _0x1d931a(0x537), m['10'] = '&#669;', m['11'] = _0x1d931a(0x225), m['12'] = _0x1d931a(0x471), m['13'] = _0x1d931a(0x574), m['14'] = '&#627;', m['15'] = _0x1d931a(0x3c9), m['16'] = _0x1d931a(0x4e8), m['17'] = '&phi;', m['18'] = '&#2792;', m['19'] = _0x1d931a(0x4f2), m['20'] = _0x1d931a(0x3d5), m['21'] = _0x1d931a(0x2cf), m['22'] = _0x1d931a(0x4ed), m['23'] = '&omega;', m['24'] = _0x1d931a(0x1f9), m['25'] = '&#4327;', m['26'] = _0x1d931a(0x414), m['27'] = _0x1d931a(0x345), m['28'] = _0x1d931a(0x333), m['29'] = _0x1d931a(0x4d9), m['30'] = _0x1d931a(0x2cb), m['31'] = '&epsilon;', m['32'] = '&fnof;', m['33'] = _0x1d931a(0x1ba), m['34'] = '&#614;', m['35'] = _0x1d931a(0x537), m['36'] = '&#669;', m['37'] = _0x1d931a(0x225), m['38'] = _0x1d931a(0x471), m['39'] = _0x1d931a(0x574), m['40'] = '&#627;', m['41'] = _0x1d931a(0x3c9), m['42'] = '&rho;', m['43'] = _0x1d931a(0x47b), m['44'] = '&#2792;', m['45'] = _0x1d931a(0x4f2), m['46'] = '&#429;', m['47'] = _0x1d931a(0x2cf), m['48'] = '&#1141;', m['49'] = '&omega;', m['50'] = _0x1d931a(0x1f9), m['51'] = _0x1d931a(0x613), m['52'] = _0x1d931a(0x414), m['53'] = '1', m['54'] = '2', m['55'] = '3', m['56'] = '4', m['57'] = '5', m['58'] = '6', m['59'] = '7', m['60'] = '8', m['61'] = '9', m['62'] = '0';
var n = {};
n['1'] = '&#5609;', n['2'] = _0x1d931a(0x5e7), n['3'] = _0x1d931a(0x64c), n['4'] = '&#5610;', n['5'] = _0x1d931a(0x1ea), n['6'] = _0x1d931a(0x42d), n['7'] = _0x1d931a(0x572), n['8'] = '&#5500;', n['9'] = _0x1d931a(0x4f4), n['10'] = _0x1d931a(0x25d), n['11'] = '&#5845;', n['12'] = _0x1d931a(0x2f6), n['13'] = _0x1d931a(0x1f6), n['14'] = _0x1d931a(0x606), n['15'] = '&#5597;', n['16'] = '&#5229;', n['17'] = _0x1d931a(0x639), n['18'] = _0x1d931a(0x27d), n['19'] = _0x1d931a(0x2ad), n['20'] = '&#19973;', n['21'] = _0x1d931a(0x5ef), n['22'] = _0x1d931a(0x2c9), n['23'] = _0x1d931a(0x641), n['24'] = _0x1d931a(0x66e), n['25'] = _0x1d931a(0x5e5), n['26'] = '&#20057;', n['27'] = _0x1d931a(0x5ab), n['28'] = '&#5623;', n['29'] = _0x1d931a(0x64c), n['30'] = _0x1d931a(0x22a), n['31'] = '&#5620;', n['32'] = _0x1d931a(0x42d), n['33'] = '&#484;', n['34'] = _0x1d931a(0x227), n['35'] = _0x1d931a(0x4f4), n['36'] = _0x1d931a(0x25d), n['37'] = _0x1d931a(0x44d), n['38'] = _0x1d931a(0x2f6), n['39'] = _0x1d931a(0x1f6), n['40'] = _0x1d931a(0x606), n['41'] = '&#5597;', n['42'] = _0x1d931a(0x241), n['43'] = '&#586;', n['44'] = '&#5511;', n['45'] = _0x1d931a(0x2ad), n['46'] = _0x1d931a(0x342), n['47'] = _0x1d931a(0x5ef), n['48'] = _0x1d931a(0x2c9), n['49'] = '&#5615;', n['50'] = _0x1d931a(0x66e), n['51'] = _0x1d931a(0x5e5), n['52'] = _0x1d931a(0x38c), n['53'] = '1', n['54'] = '2', n['55'] = '3', n['56'] = '4', n['57'] = '5', n['58'] = '6', n['59'] = '7', n['60'] = '8', n['61'] = '9', n['62'] = '0';
var o = {};
o['1'] = _0x1d931a(0x397), o['2'] = _0x1d931a(0x519), o['3'] = _0x1d931a(0x3c6), o['4'] = '&#4331;', o['5'] = '&#4318;', o['6'] = 'f', o['7'] = _0x1d931a(0x5e8), o['8'] = 'h', o['9'] = _0x1d931a(0x61d), o['10'] = _0x1d931a(0x3c8), o['11'] = _0x1d931a(0x366), o['12'] = 'l', o['13'] = '&#4317;', o['14'] = _0x1d931a(0x1ec), o['15'] = _0x1d931a(0x664), o['16'] = _0x1d931a(0x4e8), o['17'] = _0x1d931a(0x2fb), o['18'] = '&Gamma;', o['19'] = _0x1d931a(0x575), o['20'] = '&#3923;', o['21'] = _0x1d931a(0x234), o['22'] = _0x1d931a(0x21c), o['23'] = 'w', o['24'] = _0x1d931a(0x30c), o['25'] = _0x1d931a(0x613), o['26'] = _0x1d931a(0x4b5), o['27'] = '&#4315;', o['28'] = _0x1d931a(0x519), o['29'] = '&#4308;', o['30'] = '&#4331;', o['31'] = _0x1d931a(0x23b), o['32'] = 'f', o['33'] = '&#4330;', o['34'] = 'h', o['35'] = _0x1d931a(0x61d), o['36'] = _0x1d931a(0x3c8), o['37'] = _0x1d931a(0x366), o['38'] = 'l', o['39'] = _0x1d931a(0x288), o['40'] = _0x1d931a(0x1ec), o['41'] = _0x1d931a(0x664), o['42'] = _0x1d931a(0x4e8), o['43'] = _0x1d931a(0x2fb), o['44'] = '&Gamma;', o['45'] = _0x1d931a(0x575), o['46'] = '&#3923;', o['47'] = _0x1d931a(0x234), o['48'] = '&#8023;', o['49'] = 'w', o['50'] = _0x1d931a(0x30c), o['51'] = _0x1d931a(0x613), o['52'] = _0x1d931a(0x4b5), o['53'] = '1', o['54'] = '2', o['55'] = '3', o['56'] = '4', o['57'] = '5', o['58'] = '6', o['59'] = '7', o['60'] = '8', o['61'] = '9', o['62'] = '0';
var p = {};
p['1'] = _0x1d931a(0x378), p['2'] = _0x1d931a(0x2b3), p['3'] = _0x1d931a(0x2b6), p['4'] = _0x1d931a(0x5e4), p['5'] = _0x1d931a(0x18c), p['6'] = '&#1171;', p['7'] = _0x1d931a(0x53f), p['8'] = _0x1d931a(0x3ec), p['9'] = '&#943;', p['10'] = _0x1d931a(0x484), p['11'] = _0x1d931a(0x3ca), p['12'] = _0x1d931a(0x556), p['13'] = _0x1d931a(0x283), p['14'] = _0x1d931a(0x24a), p['15'] = _0x1d931a(0x555), p['16'] = _0x1d931a(0x4e8), p['17'] = 'q', p['18'] = _0x1d931a(0x38d), p['19'] = _0x1d931a(0x4a3), p['20'] = _0x1d931a(0x38f), p['21'] = _0x1d931a(0x456), p['22'] = '&nu;', p['23'] = _0x1d931a(0x319), p['24'] = 'x', p['25'] = _0x1d931a(0x460), p['26'] = '&#382;', p['27'] = '&#940;', p['28'] = _0x1d931a(0x2b3), p['29'] = _0x1d931a(0x2b6), p['30'] = _0x1d931a(0x5e4), p['31'] = _0x1d931a(0x18c), p['32'] = _0x1d931a(0x599), p['33'] = _0x1d931a(0x53f), p['34'] = _0x1d931a(0x3ec), p['35'] = '&#943;', p['36'] = _0x1d931a(0x484), p['37'] = _0x1d931a(0x3ca), p['38'] = _0x1d931a(0x556), p['39'] = '&#1084;', p['40'] = '&#942;', p['41'] = _0x1d931a(0x555), p['42'] = '&rho;', p['43'] = 'q', p['44'] = _0x1d931a(0x38d), p['45'] = _0x1d931a(0x4a3), p['46'] = _0x1d931a(0x38f), p['47'] = '&ugrave;', p['48'] = _0x1d931a(0x4e2), p['49'] = _0x1d931a(0x319), p['50'] = 'x', p['51'] = '&#1095;', p['52'] = _0x1d931a(0x62e), p['53'] = '1', p['54'] = '2', p['55'] = '3', p['56'] = '4', p['57'] = '5', p['58'] = '6', p['59'] = '7', p['60'] = '8', p['61'] = '9', p['62'] = '0';
var q = {};
q['1'] = _0x1d931a(0x43b), q['2'] = '&#41155;', q['3'] = _0x1d931a(0x622), q['4'] = _0x1d931a(0x588), q['5'] = _0x1d931a(0x458), q['6'] = _0x1d931a(0x5a1), q['7'] = _0x1d931a(0x33d), q['8'] = _0x1d931a(0x3d2), q['9'] = _0x1d931a(0x400), q['10'] = _0x1d931a(0x38b), q['11'] = _0x1d931a(0x457), q['12'] = '&#42130;', q['13'] = '&#41042;', q['14'] = '&#41081;', q['15'] = '&#41346;', q['16'] = _0x1d931a(0x56c), q['17'] = _0x1d931a(0x1c9), q['18'] = '&#42131;', q['19'] = '&#41754;', q['20'] = _0x1d931a(0x1b0), q['21'] = _0x1d931a(0x2ea), q['22'] = _0x1d931a(0x314), q['23'] = _0x1d931a(0x3c1), q['24'] = _0x1d931a(0x480), q['25'] = _0x1d931a(0x238), q['26'] = _0x1d931a(0x4f5), q['27'] = '&#41707;', q['28'] = _0x1d931a(0x1c6), q['29'] = _0x1d931a(0x622), q['30'] = _0x1d931a(0x588), q['31'] = '&#41823;', q['32'] = _0x1d931a(0x5a1), q['33'] = _0x1d931a(0x33d), q['34'] = _0x1d931a(0x3d2), q['35'] = _0x1d931a(0x400), q['36'] = _0x1d931a(0x38b), q['37'] = _0x1d931a(0x457), q['38'] = '&#42130;', q['39'] = '&#41042;', q['40'] = '&#41081;', q['41'] = _0x1d931a(0x560), q['42'] = _0x1d931a(0x56c), q['43'] = _0x1d931a(0x1c9), q['44'] = _0x1d931a(0x436), q['45'] = _0x1d931a(0x2ce), q['46'] = _0x1d931a(0x1b0), q['47'] = _0x1d931a(0x2ea), q['48'] = _0x1d931a(0x314), q['49'] = '&#41296;', q['50'] = _0x1d931a(0x480), q['51'] = _0x1d931a(0x238), q['52'] = _0x1d931a(0x4f5), q['53'] = '1', q['54'] = '2', q['55'] = '3', q['56'] = '4', q['57'] = '5', q['58'] = '6', q['59'] = '7', q['60'] = '8', q['61'] = '9', q['62'] = '0';
var r = {};
r['1'] = _0x1d931a(0x3a7), r['2'] = _0x1d931a(0x191), r['3'] = 'C', r['4'] = 'D', r['5'] = _0x1d931a(0x650), r['6'] = 'F', r['7'] = 'G', r['8'] = 'H', r['9'] = 'I', r['10'] = 'J', r['11'] = _0x1d931a(0x34f), r['12'] = 'L', r['13'] = 'M', r['14'] = _0x1d931a(0x25f), r['15'] = _0x1d931a(0x66f), r['16'] = 'P', r['17'] = _0x1d931a(0x382), r['18'] = _0x1d931a(0x2a8), r['19'] = 'S', r['20'] = _0x1d931a(0x488), r['21'] = '&#1062;', r['22'] = 'V', r['23'] = _0x1d931a(0x379), r['24'] = _0x1d931a(0x4e0), r['25'] = _0x1d931a(0x235), r['26'] = 'Z', r['27'] = _0x1d931a(0x3a7), r['28'] = _0x1d931a(0x191), r['29'] = 'C', r['30'] = 'D', r['31'] = _0x1d931a(0x650), r['32'] = 'F', r['33'] = 'G', r['34'] = 'H', r['35'] = 'I', r['36'] = 'J', r['37'] = '&#1180;', r['38'] = 'L', r['39'] = 'M', r['40'] = _0x1d931a(0x25f), r['41'] = _0x1d931a(0x66f), r['42'] = 'P', r['43'] = _0x1d931a(0x382), r['44'] = _0x1d931a(0x2a8), r['45'] = 'S', r['46'] = _0x1d931a(0x488), r['47'] = _0x1d931a(0x5f8), r['48'] = 'V', r['49'] = _0x1d931a(0x379), r['50'] = _0x1d931a(0x4e0), r['51'] = _0x1d931a(0x235), r['52'] = 'Z', r['53'] = '1', r['54'] = '2', r['55'] = '3', r['56'] = '4', r['57'] = '5', r['58'] = '6', r['59'] = '7', r['60'] = '8', r['61'] = '9', r['62'] = '0';
var s = {};
s['1'] = _0x1d931a(0x63a), s['2'] = _0x1d931a(0x1ed), s['3'] = _0x1d931a(0x3e6), s['4'] = _0x1d931a(0x2e3), s['5'] = '&#41823;', s['6'] = _0x1d931a(0x611), s['7'] = '&#41029;', s['8'] = _0x1d931a(0x228), s['9'] = '&#40996;', s['10'] = _0x1d931a(0x38b), s['11'] = _0x1d931a(0x35a), s['12'] = _0x1d931a(0x2eb), s['13'] = '&#41141;', s['14'] = _0x1d931a(0x2d9), s['15'] = _0x1d931a(0x64f), s['16'] = '&#41571;', s['17'] = _0x1d931a(0x618), s['18'] = '&#41706;', s['19'] = _0x1d931a(0x29d), s['20'] = _0x1d931a(0x1d4), s['21'] = '&#40974;', s['22'] = '&#41204;', s['23'] = _0x1d931a(0x3f0), s['24'] = _0x1d931a(0x2b2), s['25'] = _0x1d931a(0x5c6), s['26'] = _0x1d931a(0x4f5), s['27'] = _0x1d931a(0x63a), s['28'] = _0x1d931a(0x1ed), s['29'] = _0x1d931a(0x3e6), s['30'] = _0x1d931a(0x2e3), s['31'] = '&#41823;', s['32'] = _0x1d931a(0x611), s['33'] = _0x1d931a(0x372), s['34'] = _0x1d931a(0x228), s['35'] = '&#40996;', s['36'] = '&#41005;', s['37'] = _0x1d931a(0x35a), s['38'] = '&#42130;', s['39'] = _0x1d931a(0x54a), s['40'] = _0x1d931a(0x2d9), s['41'] = '&#41126;', s['42'] = _0x1d931a(0x56c), s['43'] = _0x1d931a(0x618), s['44'] = _0x1d931a(0x4eb), s['45'] = '&#41751;', s['46'] = _0x1d931a(0x1d4), s['47'] = _0x1d931a(0x46f), s['48'] = '&#41204;', s['49'] = _0x1d931a(0x3f0), s['50'] = _0x1d931a(0x2b2), s['51'] = _0x1d931a(0x5c6), s['52'] = _0x1d931a(0x4f5), s['53'] = '1', s['54'] = '2', s['55'] = '3', s['56'] = '4', s['57'] = '5', s['58'] = '6', s['59'] = '7', s['60'] = '8', s['61'] = '9', s['62'] = '0';
var t = {};
t['1'] = _0x1d931a(0x1fc), t['2'] = _0x1d931a(0x1e0), t['3'] = '&#41556;', t['4'] = _0x1d931a(0x496), t['5'] = '&#41922;', t['6'] = _0x1d931a(0x41c), t['7'] = _0x1d931a(0x535), t['8'] = _0x1d931a(0x600), t['9'] = '&#42128;', t['10'] = _0x1d931a(0x504), t['11'] = _0x1d931a(0x35a), t['12'] = _0x1d931a(0x2eb), t['13'] = '&#41141;', t['14'] = '&#41674;', t['15'] = _0x1d931a(0x267), t['16'] = _0x1d931a(0x56c), t['17'] = _0x1d931a(0x618), t['18'] = _0x1d931a(0x4eb), t['19'] = _0x1d931a(0x213), t['20'] = _0x1d931a(0x1d4), t['21'] = _0x1d931a(0x3da), t['22'] = _0x1d931a(0x5f0), t['23'] = '&#41296;', t['24'] = '&#41575;', t['25'] = _0x1d931a(0x22e), t['26'] = _0x1d931a(0x4f5), t['27'] = '&#41708;', t['28'] = _0x1d931a(0x1e0), t['29'] = _0x1d931a(0x26f), t['30'] = _0x1d931a(0x496), t['31'] = _0x1d931a(0x2ac), t['32'] = _0x1d931a(0x41c), t['33'] = _0x1d931a(0x535), t['34'] = _0x1d931a(0x600), t['35'] = '&#42128;', t['36'] = _0x1d931a(0x504), t['37'] = '&#40984;', t['38'] = _0x1d931a(0x2eb), t['39'] = _0x1d931a(0x54a), t['40'] = _0x1d931a(0x63b), t['41'] = _0x1d931a(0x267), t['42'] = _0x1d931a(0x56c), t['43'] = _0x1d931a(0x618), t['44'] = _0x1d931a(0x4eb), t['45'] = '&#41433;', t['46'] = _0x1d931a(0x1d4), t['47'] = _0x1d931a(0x3da), t['48'] = _0x1d931a(0x5f0), t['49'] = _0x1d931a(0x3c1), t['50'] = _0x1d931a(0x2ff), t['51'] = _0x1d931a(0x22e), t['52'] = '&#41076;', t['53'] = '1', t['54'] = '2', t['55'] = '3', t['56'] = '4', t['57'] = '5', t['58'] = '6', t['59'] = '7', t['60'] = '8', t['61'] = '9', t['62'] = '0';
var u = {};
u['1'] = _0x1d931a(0x399), u['2'] = _0x1d931a(0x428), u['3'] = _0x1d931a(0x1c3), u['4'] = _0x1d931a(0x5c7), u['5'] = _0x1d931a(0x530), u['6'] = 'F', u['7'] = _0x1d931a(0x3e0), u['8'] = '&#1085;', u['9'] = _0x1d931a(0x601), u['10'] = '&#65420;', u['11'] = _0x1d931a(0x598), u['12'] = '&#321;', u['13'] = '&#3057;', u['14'] = _0x1d931a(0x529), u['15'] = _0x1d931a(0x49d), u['16'] = _0x1d931a(0x459), u['17'] = _0x1d931a(0x2bb), u['18'] = _0x1d931a(0x660), u['19'] = _0x1d931a(0x301), u['20'] = _0x1d931a(0x53e), u['21'] = _0x1d931a(0x5f8), u['22'] = _0x1d931a(0x1be), u['23'] = _0x1d931a(0x1ad), u['24'] = _0x1d931a(0x3bb), u['25'] = '&#996;', u['26'] = _0x1d931a(0x37a), u['27'] = _0x1d931a(0x399), u['28'] = '&#998;', u['29'] = _0x1d931a(0x1c3), u['30'] = _0x1d931a(0x5c7), u['31'] = '&#400;', u['32'] = 'F', u['33'] = _0x1d931a(0x3e0), u['34'] = _0x1d931a(0x280), u['35'] = _0x1d931a(0x601), u['36'] = '&#65420;', u['37'] = _0x1d931a(0x598), u['38'] = _0x1d931a(0x4d2), u['39'] = _0x1d931a(0x5b1), u['40'] = '&#1051;', u['41'] = _0x1d931a(0x49d), u['42'] = _0x1d931a(0x459), u['43'] = _0x1d931a(0x2bb), u['44'] = _0x1d931a(0x660), u['45'] = _0x1d931a(0x301), u['46'] = '&#356;', u['47'] = _0x1d931a(0x5f8), u['48'] = _0x1d931a(0x1be), u['49'] = _0x1d931a(0x1ad), u['50'] = _0x1d931a(0x3bb), u['51'] = _0x1d931a(0x1b7), u['52'] = _0x1d931a(0x37a), u['53'] = '1', u['54'] = '2', u['55'] = '3', u['56'] = '4', u['57'] = '5', u['58'] = '6', u['59'] = '7', u['60'] = '8', u['61'] = '9', u['62'] = '0';
var v = {};
v['1'] = _0x1d931a(0x44c), v['2'] = _0x1d931a(0x563), v['3'] = _0x1d931a(0x4ae), v['4'] = _0x1d931a(0x24f), v['5'] = _0x1d931a(0x1a5), v['6'] = _0x1d931a(0x666), v['7'] = '&#403;', v['8'] = _0x1d931a(0x592), v['9'] = _0x1d931a(0x652), v['10'] = _0x1d931a(0x40f), v['11'] = _0x1d931a(0x3a5), v['12'] = _0x1d931a(0x2c3), v['13'] = 'M', v['14'] = _0x1d931a(0x1a2), v['15'] = _0x1d931a(0x32a), v['16'] = _0x1d931a(0x5eb), v['17'] = _0x1d931a(0x5d9), v['18'] = '&#422;', v['19'] = _0x1d931a(0x383), v['20'] = '&#428;', v['21'] = _0x1d931a(0x1ac), v['22'] = _0x1d931a(0x1be), v['23'] = _0x1d931a(0x1ad), v['24'] = _0x1d931a(0x5d0), v['25'] = _0x1d931a(0x5e5), v['26'] = '&#548;', v['27'] = _0x1d931a(0x44c), v['28'] = _0x1d931a(0x563), v['29'] = _0x1d931a(0x4ae), v['30'] = _0x1d931a(0x24f), v['31'] = '&#1028;', v['32'] = _0x1d931a(0x666), v['33'] = _0x1d931a(0x3e0), v['34'] = _0x1d931a(0x592), v['35'] = _0x1d931a(0x652), v['36'] = _0x1d931a(0x40f), v['37'] = '&#408;', v['38'] = _0x1d931a(0x2c3), v['39'] = 'M', v['40'] = _0x1d931a(0x1a2), v['41'] = '&#416;', v['42'] = _0x1d931a(0x5eb), v['43'] = _0x1d931a(0x5d9), v['44'] = _0x1d931a(0x2dc), v['45'] = '&#423;', v['46'] = _0x1d931a(0x33a), v['47'] = _0x1d931a(0x1ac), v['48'] = _0x1d931a(0x1be), v['49'] = _0x1d931a(0x1ad), v['50'] = _0x1d931a(0x5d0), v['51'] = _0x1d931a(0x5e5), v['52'] = _0x1d931a(0x612), v['53'] = '1', v['54'] = '2', v['55'] = '3', v['56'] = '4', v['57'] = '5', v['58'] = '6', v['59'] = '7', v['60'] = '8', v['61'] = '9', v['62'] = '0';
var w = {};
w['1'] = _0x1d931a(0x60b), w['2'] = _0x1d931a(0x621), w['3'] = _0x1d931a(0x18b), w['4'] = _0x1d931a(0x273), w['5'] = _0x1d931a(0x2f0), w['6'] = _0x1d931a(0x3c0), w['7'] = _0x1d931a(0x372), w['8'] = _0x1d931a(0x2d5), w['9'] = '&#41105;', w['10'] = _0x1d931a(0x504), w['11'] = _0x1d931a(0x457), w['12'] = _0x1d931a(0x2eb), w['13'] = _0x1d931a(0x54a), w['14'] = _0x1d931a(0x63b), w['15'] = _0x1d931a(0x64f), w['16'] = _0x1d931a(0x56c), w['17'] = '&#41079;', w['18'] = '&#41733;', w['19'] = _0x1d931a(0x2ce), w['20'] = '&#41686;', w['21'] = '&#41991;', w['22'] = _0x1d931a(0x1b4), w['23'] = _0x1d931a(0x3f0), w['24'] = _0x1d931a(0x196), w['25'] = _0x1d931a(0x581), w['26'] = _0x1d931a(0x4f5), w['27'] = _0x1d931a(0x60b), w['28'] = _0x1d931a(0x621), w['29'] = _0x1d931a(0x18b), w['30'] = _0x1d931a(0x273), w['31'] = '&#41532;', w['32'] = _0x1d931a(0x3c0), w['33'] = _0x1d931a(0x372), w['34'] = '&#41833;', w['35'] = _0x1d931a(0x400), w['36'] = '&#42171;', w['37'] = '&#40983;', w['38'] = '&#42130;', w['39'] = _0x1d931a(0x54a), w['40'] = '&#41674;', w['41'] = '&#41126;', w['42'] = _0x1d931a(0x56c), w['43'] = '&#41079;', w['44'] = '&#41733;', w['45'] = _0x1d931a(0x2ce), w['46'] = _0x1d931a(0x2b9), w['47'] = '&#41991;', w['48'] = '&#41008;', w['49'] = _0x1d931a(0x3f0), w['50'] = _0x1d931a(0x196), w['51'] = _0x1d931a(0x581), w['52'] = _0x1d931a(0x4f5), w['53'] = '1', w['54'] = '2', w['55'] = '3', w['56'] = '4', w['57'] = '5', w['58'] = '6', w['59'] = '7', w['60'] = '8', w['61'] = '9', w['62'] = '0';
var x = {};
x['1'] = _0x1d931a(0x4a9), x['2'] = _0x1d931a(0x4b1), x['3'] = '&#1351;', x['4'] = _0x1d931a(0x251), x['5'] = _0x1d931a(0x250), x['6'] = _0x1d931a(0x224), x['7'] = '&#1331;', x['8'] = '&#615;', x['9'] = _0x1d931a(0x53a), x['10'] = _0x1d931a(0x554), x['11'] = '&#409;', x['12'] = _0x1d931a(0x324), x['13'] = _0x1d931a(0x1cd), x['14'] = _0x1d931a(0x52a), x['15'] = _0x1d931a(0x33e), x['16'] = _0x1d931a(0x4e8), x['17'] = _0x1d931a(0x47b), x['18'] = '&#1360;', x['19'] = '&#1359;', x['20'] = '&#1333;', x['21'] = '&#1348;', x['22'] = '&#1506;', x['23'] = '&#1377;', x['24'] = '&#1347;', x['25'] = _0x1d931a(0x3ed), x['26'] = _0x1d931a(0x24e), x['27'] = _0x1d931a(0x4a9), x['28'] = _0x1d931a(0x4b1), x['29'] = _0x1d931a(0x252), x['30'] = _0x1d931a(0x251), x['31'] = _0x1d931a(0x250), x['32'] = _0x1d931a(0x224), x['33'] = _0x1d931a(0x40e), x['34'] = _0x1d931a(0x386), x['35'] = _0x1d931a(0x53a), x['36'] = _0x1d931a(0x554), x['37'] = '&#409;', x['38'] = _0x1d931a(0x324), x['39'] = '&#653;', x['40'] = '&#1356;', x['41'] = _0x1d931a(0x33e), x['42'] = _0x1d931a(0x4e8), x['43'] = _0x1d931a(0x47b), x['44'] = _0x1d931a(0x38a), x['45'] = _0x1d931a(0x2e9), x['46'] = '&#1333;', x['47'] = _0x1d931a(0x528), x['48'] = '&#1506;', x['49'] = _0x1d931a(0x2dd), x['50'] = _0x1d931a(0x4e6), x['51'] = '&#1358;', x['52'] = _0x1d931a(0x24e), x['53'] = '1', x['54'] = '2', x['55'] = '3', x['56'] = '4', x['57'] = '5', x['58'] = '6', x['59'] = '7', x['60'] = '8', x['61'] = '9', x['62'] = '0';
var y = {};
y['1'] = '&alpha;', y['2'] = _0x1d931a(0x54c), y['3'] = '&sigmaf;', y['4'] = 'd', y['5'] = '&epsilon;', y['6'] = _0x1d931a(0x22c), y['7'] = 'g', y['8'] = 'h', y['9'] = _0x1d931a(0x474), y['10'] = '&#1397;', y['11'] = _0x1d931a(0x366), y['12'] = '&#65434;', y['13'] = 'm', y['14'] = _0x1d931a(0x3e2), y['15'] = _0x1d931a(0x1a7), y['16'] = 'p', y['17'] = _0x1d931a(0x5ae), y['18'] = 'r', y['19'] = _0x1d931a(0x1dd), y['20'] = _0x1d931a(0x620), y['21'] = 'u', y['22'] = _0x1d931a(0x263), y['23'] = _0x1d931a(0x1f5), y['24'] = 'x', y['25'] = _0x1d931a(0x3ba), y['26'] = 'z', y['27'] = '&alpha;', y['28'] = '&szlig;', y['29'] = _0x1d931a(0x2b6), y['30'] = 'd', y['31'] = _0x1d931a(0x45c), y['32'] = _0x1d931a(0x22c), y['33'] = 'g', y['34'] = 'h', y['35'] = '&iuml;', y['36'] = _0x1d931a(0x302), y['37'] = _0x1d931a(0x366), y['38'] = _0x1d931a(0x5ff), y['39'] = 'm', y['40'] = _0x1d931a(0x3e2), y['41'] = _0x1d931a(0x1a7), y['42'] = 'p', y['43'] = _0x1d931a(0x5ae), y['44'] = 'r', y['45'] = '&scaron;', y['46'] = '&dagger;', y['47'] = 'u', y['48'] = _0x1d931a(0x263), y['49'] = _0x1d931a(0x1f5), y['50'] = 'x', y['51'] = _0x1d931a(0x3ba), y['52'] = 'z', y['53'] = '1', y['54'] = '2', y['55'] = '3', y['56'] = '4', y['57'] = '5', y['58'] = '6', y['59'] = '7', y['60'] = '8', y['61'] = '9', y['62'] = '0';
var z = {};
z['1'] = _0x1d931a(0x430), z['2'] = '&#4330;', z['3'] = '&#2414;', z['4'] = '&#4331;', z['5'] = _0x1d931a(0x389), z['6'] = _0x1d931a(0x224), z['7'] = '&#2797;', z['8'] = _0x1d931a(0x3f1), z['9'] = '&#639;', z['10'] = _0x1d931a(0x40f), z['11'] = _0x1d931a(0x5fe), z['12'] = _0x1d931a(0x306), z['13'] = _0x1d931a(0x574), z['14'] = _0x1d931a(0x51d), z['15'] = _0x1d931a(0x46c), z['16'] = _0x1d931a(0x468), z['17'] = _0x1d931a(0x354), z['18'] = _0x1d931a(0x38a), z['19'] = _0x1d931a(0x2b6), z['20'] = _0x1d931a(0x206), z['21'] = _0x1d931a(0x234), z['22'] = _0x1d931a(0x1c4), z['23'] = '&omega;', z['24'] = '&#2794;', z['25'] = _0x1d931a(0x4ff), z['26'] = '&#2749;', z['27'] = _0x1d931a(0x430), z['28'] = '&#4330;', z['29'] = _0x1d931a(0x353), z['30'] = _0x1d931a(0x226), z['31'] = '&#2799;', z['32'] = _0x1d931a(0x224), z['33'] = _0x1d931a(0x2c2), z['34'] = _0x1d931a(0x3f1), z['35'] = _0x1d931a(0x53a), z['36'] = '&#646;', z['37'] = _0x1d931a(0x5fe), z['38'] = _0x1d931a(0x306), z['39'] = '&#625;', z['40'] = '&#1352;', z['41'] = _0x1d931a(0x46c), z['42'] = _0x1d931a(0x468), z['43'] = _0x1d931a(0x354), z['44'] = _0x1d931a(0x38a), z['45'] = _0x1d931a(0x2b6), z['46'] = _0x1d931a(0x206), z['47'] = _0x1d931a(0x234), z['48'] = _0x1d931a(0x1c4), z['49'] = _0x1d931a(0x1f5), z['50'] = '&#2794;', z['51'] = '&#1506;', z['52'] = _0x1d931a(0x212), z['53'] = '1', z['54'] = '2', z['55'] = '3', z['56'] = '4', z['57'] = '5', z['58'] = '6', z['59'] = '7', z['60'] = '8', z['61'] = '9', z['62'] = '0';
var A = {};
A['1'] = _0x1d931a(0x5a4), A['2'] = _0x1d931a(0x4cb), A['3'] = 'c', A['4'] = _0x1d931a(0x4a8), A['5'] = _0x1d931a(0x272), A['6'] = 'f', A['7'] = 'g', A['8'] = _0x1d931a(0x280), A['9'] = _0x1d931a(0x477), A['10'] = 'j', A['11'] = _0x1d931a(0x518), A['12'] = _0x1d931a(0x551), A['13'] = '&#1131;', A['14'] = '&#1087;', A['15'] = _0x1d931a(0x657), A['16'] = 'p', A['17'] = _0x1d931a(0x3c7), A['18'] = _0x1d931a(0x24d), A['19'] = '$', A['20'] = _0x1d931a(0x4d3), A['21'] = '&#1094;', A['22'] = _0x1d931a(0x4ed), A['23'] = _0x1d931a(0x62f), A['24'] = '&#1078;', A['25'] = '&#1095;', A['26'] = _0x1d931a(0x5f1), A['27'] = '&#1040;', A['28'] = _0x1d931a(0x191), A['29'] = 'C', A['30'] = '&#1044;', A['31'] = _0x1d931a(0x1a5), A['32'] = 'F', A['33'] = 'G', A['34'] = 'H', A['35'] = _0x1d931a(0x5ba), A['36'] = 'J', A['37'] = _0x1d931a(0x237), A['38'] = _0x1d931a(0x5f7), A['39'] = _0x1d931a(0x269), A['40'] = _0x1d931a(0x5ea), A['41'] = _0x1d931a(0x39f), A['42'] = 'P', A['43'] = _0x1d931a(0x66f), A['44'] = _0x1d931a(0x2a8), A['45'] = '$', A['46'] = 'T', A['47'] = _0x1d931a(0x5f8), A['48'] = _0x1d931a(0x636), A['49'] = _0x1d931a(0x391), A['50'] = _0x1d931a(0x4e0), A['51'] = '&#1063;', A['52'] = _0x1d931a(0x189), A['53'] = '1', A['54'] = '2', A['55'] = '3', A['56'] = '4', A['57'] = '5', A['58'] = '6', A['59'] = '7', A['60'] = '8', A['61'] = '9', A['62'] = '0';
var B = {};
B['1'] = 'a&#830;', B['2'] = _0x1d931a(0x2ae), B['3'] = _0x1d931a(0x57c), B['4'] = _0x1d931a(0x395), B['5'] = _0x1d931a(0x361), B['6'] = _0x1d931a(0x51f), B['7'] = _0x1d931a(0x424), B['8'] = _0x1d931a(0x595), B['9'] = _0x1d931a(0x3b4), B['10'] = _0x1d931a(0x633), B['11'] = _0x1d931a(0x571), B['12'] = _0x1d931a(0x3b5), B['13'] = 'm&#830;', B['14'] = _0x1d931a(0x2e1), B['15'] = 'o&#830;', B['16'] = _0x1d931a(0x216), B['17'] = _0x1d931a(0x3be), B['18'] = _0x1d931a(0x479), B['19'] = _0x1d931a(0x499), B['20'] = 't&#830;', B['21'] = _0x1d931a(0x646), B['22'] = _0x1d931a(0x412), B['23'] = 'w&#830;', B['24'] = _0x1d931a(0x20f), B['25'] = _0x1d931a(0x2da), B['26'] = 'z&#830;', B['27'] = _0x1d931a(0x55f), B['28'] = _0x1d931a(0x27e), B['29'] = _0x1d931a(0x510), B['30'] = _0x1d931a(0x232), B['31'] = _0x1d931a(0x4bd), B['32'] = _0x1d931a(0x4b9), B['33'] = _0x1d931a(0x415), B['34'] = _0x1d931a(0x318), B['35'] = _0x1d931a(0x1b9), B['36'] = 'J&#830;', B['37'] = 'K&#830;', B['38'] = 'L&#830;', B['39'] = 'M&#830;', B['40'] = _0x1d931a(0x64b), B['41'] = _0x1d931a(0x316), B['42'] = _0x1d931a(0x37b), B['43'] = _0x1d931a(0x644), B['44'] = _0x1d931a(0x2fc), B['45'] = _0x1d931a(0x296), B['46'] = _0x1d931a(0x289), B['47'] = _0x1d931a(0x4b8), B['48'] = _0x1d931a(0x220), B['49'] = _0x1d931a(0x65d), B['50'] = 'X&#830;', B['51'] = _0x1d931a(0x44e), B['52'] = _0x1d931a(0x402), B['53'] = _0x1d931a(0x2ed), B['54'] = '2&#830;', B['55'] = '3&#830;', B['56'] = _0x1d931a(0x2ab), B['57'] = _0x1d931a(0x30f), B['58'] = _0x1d931a(0x5f9), B['59'] = _0x1d931a(0x61e), B['60'] = _0x1d931a(0x54e), B['61'] = '9&#830;', B['62'] = _0x1d931a(0x3a8);
var C = {};
C['1'] = _0x1d931a(0x46a), C['2'] = _0x1d931a(0x52f), C['3'] = 'c&#838;', C['4'] = 'd&#838;', C['5'] = _0x1d931a(0x628), C['6'] = 'f&#838;', C['7'] = _0x1d931a(0x427), C['8'] = _0x1d931a(0x619), C['9'] = _0x1d931a(0x32b), C['10'] = _0x1d931a(0x5ad), C['11'] = 'k&#838;', C['12'] = _0x1d931a(0x442), C['13'] = _0x1d931a(0x3a0), C['14'] = _0x1d931a(0x305), C['15'] = _0x1d931a(0x408), C['16'] = _0x1d931a(0x23f), C['17'] = 'q&#838;', C['18'] = _0x1d931a(0x671), C['19'] = _0x1d931a(0x3c5), C['20'] = _0x1d931a(0x423), C['21'] = _0x1d931a(0x4de), C['22'] = _0x1d931a(0x60e), C['23'] = _0x1d931a(0x39d), C['24'] = 'x&#838;', C['25'] = _0x1d931a(0x2ba), C['26'] = _0x1d931a(0x65c), C['27'] = _0x1d931a(0x27b), C['28'] = _0x1d931a(0x26a), C['29'] = _0x1d931a(0x2df), C['30'] = _0x1d931a(0x665), C['31'] = _0x1d931a(0x4ef), C['32'] = 'F&#838;', C['33'] = 'G&#838;', C['34'] = 'H&#838;', C['35'] = 'I&#838;', C['36'] = _0x1d931a(0x45d), C['37'] = _0x1d931a(0x5cf), C['38'] = _0x1d931a(0x672), C['39'] = _0x1d931a(0x585), C['40'] = _0x1d931a(0x32d), C['41'] = _0x1d931a(0x417), C['42'] = _0x1d931a(0x18f), C['43'] = 'Q&#838;', C['44'] = 'R&#838;', C['45'] = _0x1d931a(0x29f), C['46'] = _0x1d931a(0x4bb), C['47'] = _0x1d931a(0x5db), C['48'] = _0x1d931a(0x55d), C['49'] = _0x1d931a(0x2f2), C['50'] = _0x1d931a(0x65b), C['51'] = 'Y&#838;', C['52'] = _0x1d931a(0x3b7), C['53'] = _0x1d931a(0x2fa), C['54'] = '2&#838;', C['55'] = '3&#838;', C['56'] = _0x1d931a(0x4c3), C['57'] = _0x1d931a(0x3c3), C['58'] = _0x1d931a(0x3d9), C['59'] = _0x1d931a(0x61f), C['60'] = '8&#838;', C['61'] = _0x1d931a(0x640), C['62'] = _0x1d931a(0x3e1);
var D = {};
D['1'] = 'a&#826;', D['2'] = _0x1d931a(0x2b1), D['3'] = _0x1d931a(0x26b), D['4'] = _0x1d931a(0x276), D['5'] = _0x1d931a(0x4c4), D['6'] = _0x1d931a(0x1ab), D['7'] = 'g&#826;', D['8'] = _0x1d931a(0x4d4), D['9'] = 'i&#826;', D['10'] = _0x1d931a(0x35b), D['11'] = _0x1d931a(0x384), D['12'] = 'l&#826;', D['13'] = _0x1d931a(0x533), D['14'] = 'n&#826;', D['15'] = 'o&#826;', D['16'] = _0x1d931a(0x61b), D['17'] = _0x1d931a(0x4f0), D['18'] = _0x1d931a(0x5be), D['19'] = _0x1d931a(0x2a3), D['20'] = _0x1d931a(0x4fb), D['21'] = _0x1d931a(0x24b), D['22'] = 'v&#826;', D['23'] = 'w&#826;', D['24'] = _0x1d931a(0x541), D['25'] = _0x1d931a(0x501), D['26'] = _0x1d931a(0x39e), D['27'] = 'A&#826;', D['28'] = 'B&#826;', D['29'] = _0x1d931a(0x1bc), D['30'] = _0x1d931a(0x261), D['31'] = _0x1d931a(0x40c), D['32'] = _0x1d931a(0x352), D['33'] = _0x1d931a(0x627), D['34'] = _0x1d931a(0x546), D['35'] = _0x1d931a(0x356), D['36'] = 'J&#826;', D['37'] = 'K&#826;', D['38'] = _0x1d931a(0x47e), D['39'] = 'M&#826;', D['40'] = 'N&#826;', D['41'] = 'O&#826;', D['42'] = _0x1d931a(0x3a4), D['43'] = _0x1d931a(0x350), D['44'] = _0x1d931a(0x495), D['45'] = _0x1d931a(0x346), D['46'] = _0x1d931a(0x5b0), D['47'] = 'U&#826;', D['48'] = _0x1d931a(0x2ca), D['49'] = _0x1d931a(0x425), D['50'] = _0x1d931a(0x3fc), D['51'] = _0x1d931a(0x2af), D['52'] = _0x1d931a(0x5e6), D['53'] = _0x1d931a(0x205), D['54'] = _0x1d931a(0x5a2), D['55'] = _0x1d931a(0x587), D['56'] = _0x1d931a(0x467), D['57'] = '5&#826;', D['58'] = _0x1d931a(0x3b1), D['59'] = _0x1d931a(0x66a), D['60'] = '8&#826;', D['61'] = _0x1d931a(0x29e), D['62'] = _0x1d931a(0x3e7);
var E = {};
E['1'] = 'a&#857;', E['2'] = _0x1d931a(0x45f), E['3'] = _0x1d931a(0x466), E['4'] = _0x1d931a(0x1b2), E['5'] = _0x1d931a(0x624), E['6'] = _0x1d931a(0x248), E['7'] = _0x1d931a(0x542), E['8'] = _0x1d931a(0x38e), E['9'] = _0x1d931a(0x3f2), E['10'] = _0x1d931a(0x3fb), E['11'] = 'k&#857;', E['12'] = _0x1d931a(0x597), E['13'] = 'm&#857;', E['14'] = _0x1d931a(0x1bb), E['15'] = _0x1d931a(0x3f9), E['16'] = _0x1d931a(0x50e), E['17'] = _0x1d931a(0x27c), E['18'] = 'r&#857;', E['19'] = _0x1d931a(0x570), E['20'] = _0x1d931a(0x4da), E['21'] = _0x1d931a(0x57d), E['22'] = _0x1d931a(0x3fa), E['23'] = _0x1d931a(0x48f), E['24'] = 'x&#857;', E['25'] = 'y&#857;', E['26'] = _0x1d931a(0x3e8), E['27'] = _0x1d931a(0x32f), E['28'] = _0x1d931a(0x30b), E['29'] = _0x1d931a(0x348), E['30'] = _0x1d931a(0x413), E['31'] = 'E&#857;', E['32'] = _0x1d931a(0x608), E['33'] = _0x1d931a(0x62a), E['34'] = 'H&#857;', E['35'] = 'I&#857;', E['36'] = _0x1d931a(0x4bf), E['37'] = 'K&#857;', E['38'] = 'L&#857;', E['39'] = _0x1d931a(0x357), E['40'] = _0x1d931a(0x2f1), E['41'] = _0x1d931a(0x388), E['42'] = _0x1d931a(0x221), E['43'] = _0x1d931a(0x19a), E['44'] = _0x1d931a(0x2d4), E['45'] = 'S&#857;', E['46'] = _0x1d931a(0x202), E['47'] = 'U&#857;', E['48'] = 'V&#857;', E['49'] = _0x1d931a(0x4e3), E['50'] = 'X&#857;', E['51'] = _0x1d931a(0x661), E['52'] = _0x1d931a(0x25a), E['53'] = _0x1d931a(0x1c0), E['54'] = _0x1d931a(0x64a), E['55'] = '3&#857;', E['56'] = _0x1d931a(0x265), E['57'] = _0x1d931a(0x48a), E['58'] = _0x1d931a(0x617), E['59'] = _0x1d931a(0x22f), E['60'] = _0x1d931a(0x634), E['61'] = '9&#857;', E['62'] = _0x1d931a(0x271);
var F = {};
F['1'] = _0x1d931a(0x2a4), F['2'] = _0x1d931a(0x28b), F['3'] = _0x1d931a(0x355), F['4'] = _0x1d931a(0x49c), F['5'] = 'e&#799;', F['6'] = 'f&#799;', F['7'] = _0x1d931a(0x447), F['8'] = _0x1d931a(0x2fd), F['9'] = 'i&#799;', F['10'] = _0x1d931a(0x583), F['11'] = _0x1d931a(0x616), F['12'] = 'l&#799;', F['13'] = _0x1d931a(0x39c), F['14'] = _0x1d931a(0x3ac), F['15'] = _0x1d931a(0x33f), F['16'] = _0x1d931a(0x2c0), F['17'] = _0x1d931a(0x55e), F['18'] = _0x1d931a(0x259), F['19'] = _0x1d931a(0x1c7), F['20'] = 't&#799;', F['21'] = _0x1d931a(0x3ae), F['22'] = _0x1d931a(0x490), F['23'] = _0x1d931a(0x31b), F['24'] = _0x1d931a(0x2a6), F['25'] = _0x1d931a(0x4dd), F['26'] = _0x1d931a(0x3a6), F['27'] = _0x1d931a(0x545), F['28'] = 'B&#799;', F['29'] = 'C&#799;', F['30'] = _0x1d931a(0x410), F['31'] = _0x1d931a(0x304), F['32'] = _0x1d931a(0x658), F['33'] = 'G&#799;', F['34'] = _0x1d931a(0x197), F['35'] = _0x1d931a(0x282), F['36'] = 'J&#799;', F['37'] = _0x1d931a(0x3b0), F['38'] = 'L&#799;', F['39'] = _0x1d931a(0x52c), F['40'] = _0x1d931a(0x2de), F['41'] = _0x1d931a(0x3b6), F['42'] = _0x1d931a(0x566), F['43'] = _0x1d931a(0x1e8), F['44'] = _0x1d931a(0x43f), F['45'] = 'S&#799;', F['46'] = _0x1d931a(0x1ef), F['47'] = _0x1d931a(0x565), F['48'] = _0x1d931a(0x1aa), F['49'] = _0x1d931a(0x2d8), F['50'] = 'X&#799;', F['51'] = _0x1d931a(0x3dc), F['52'] = 'Z&#799;', F['53'] = _0x1d931a(0x203), F['54'] = _0x1d931a(0x325), F['55'] = '3&#799;', F['56'] = '4&#799;', F['57'] = '5&#799;', F['58'] = _0x1d931a(0x1d9), F['59'] = '7&#799;', F['60'] = '8&#799;', F['61'] = _0x1d931a(0x2c6), F['62'] = _0x1d931a(0x625);
var G = {};
G['1'] = _0x1d931a(0x49a), G['2'] = _0x1d931a(0x497), G['3'] = _0x1d931a(0x4be), G['4'] = _0x1d931a(0x626), G['5'] = 'e&#846;', G['6'] = _0x1d931a(0x421), G['7'] = _0x1d931a(0x28f), G['8'] = 'h&#846;', G['9'] = _0x1d931a(0x5f5), G['10'] = _0x1d931a(0x476), G['11'] = _0x1d931a(0x5fd), G['12'] = _0x1d931a(0x4b6), G['13'] = 'm&#846;', G['14'] = _0x1d931a(0x21b), G['15'] = _0x1d931a(0x461), G['16'] = _0x1d931a(0x3fe), G['17'] = _0x1d931a(0x285), G['18'] = _0x1d931a(0x286), G['19'] = _0x1d931a(0x492), G['20'] = _0x1d931a(0x360), G['21'] = 'u&#846;', G['22'] = _0x1d931a(0x4fe), G['23'] = 'w&#846;', G['24'] = _0x1d931a(0x58c), G['25'] = _0x1d931a(0x4a2), G['26'] = _0x1d931a(0x192), G['27'] = 'A&#846;', G['28'] = 'B&#846;', G['29'] = _0x1d931a(0x2d1), G['30'] = _0x1d931a(0x631), G['31'] = _0x1d931a(0x638), G['32'] = _0x1d931a(0x19c), G['33'] = _0x1d931a(0x56b), G['34'] = _0x1d931a(0x294), G['35'] = _0x1d931a(0x4ea), G['36'] = 'J&#846;', G['37'] = _0x1d931a(0x531), G['38'] = _0x1d931a(0x3c4), G['39'] = _0x1d931a(0x198), G['40'] = _0x1d931a(0x4e1), G['41'] = _0x1d931a(0x1b8), G['42'] = 'P&#846;', G['43'] = _0x1d931a(0x59f), G['44'] = _0x1d931a(0x446), G['45'] = _0x1d931a(0x347), G['46'] = _0x1d931a(0x524), G['47'] = _0x1d931a(0x25b), G['48'] = _0x1d931a(0x654), G['49'] = _0x1d931a(0x521), G['50'] = _0x1d931a(0x4fd), G['51'] = 'Y&#846;', G['52'] = 'Z&#846;', G['53'] = _0x1d931a(0x28a), G['54'] = _0x1d931a(0x569), G['55'] = _0x1d931a(0x5b9), G['56'] = _0x1d931a(0x584), G['57'] = '5&#846;', G['58'] = _0x1d931a(0x440), G['59'] = _0x1d931a(0x4d1), G['60'] = '8&#846;', G['61'] = _0x1d931a(0x2cc), G['62'] = _0x1d931a(0x1d7);
var H = {};
H['1'] = _0x1d931a(0x579), H['2'] = _0x1d931a(0x233), H['3'] = 'c&#829;&#851;', H['4'] = 'd&#829;&#851;', H['5'] = _0x1d931a(0x3de), H['6'] = 'f&#829;&#851;', H['7'] = _0x1d931a(0x5b5), H['8'] = _0x1d931a(0x663), H['9'] = _0x1d931a(0x483), H['10'] = _0x1d931a(0x19d), H['11'] = 'k&#829;&#851;', H['12'] = _0x1d931a(0x4db), H['13'] = _0x1d931a(0x56a), H['14'] = _0x1d931a(0x4e7), H['15'] = _0x1d931a(0x63f), H['16'] = _0x1d931a(0x209), H['17'] = _0x1d931a(0x1a3), H['18'] = _0x1d931a(0x5a5), H['19'] = _0x1d931a(0x33b), H['20'] = 't&#829;&#851;', H['21'] = _0x1d931a(0x623), H['22'] = 'v&#829;&#851;', H['23'] = _0x1d931a(0x321), H['24'] = _0x1d931a(0x5cb), H['25'] = 'y&#829;&#851;', H['26'] = _0x1d931a(0x4b2), H['27'] = 'A&#829;&#851;', H['28'] = _0x1d931a(0x5f4), H['29'] = _0x1d931a(0x1a0), H['30'] = _0x1d931a(0x3df), H['31'] = 'E&#829;&#851;', H['32'] = _0x1d931a(0x313), H['33'] = _0x1d931a(0x4a1), H['34'] = _0x1d931a(0x5a3), H['35'] = _0x1d931a(0x1fd), H['36'] = _0x1d931a(0x3e5), H['37'] = _0x1d931a(0x50b), H['38'] = _0x1d931a(0x63d), H['39'] = _0x1d931a(0x278), H['40'] = _0x1d931a(0x607), H['41'] = 'O&#829;&#851;', H['42'] = _0x1d931a(0x1a4), H['43'] = 'Q&#829;&#851;', H['44'] = _0x1d931a(0x1c2), H['45'] = _0x1d931a(0x525), H['46'] = _0x1d931a(0x2d0), H['47'] = 'U&#829;&#851;', H['48'] = _0x1d931a(0x2a5), H['49'] = _0x1d931a(0x5da), H['50'] = 'X&#829;&#851;', H['51'] = _0x1d931a(0x4c0), H['52'] = _0x1d931a(0x2a2), H['53'] = _0x1d931a(0x23e), H['54'] = _0x1d931a(0x246), H['55'] = _0x1d931a(0x465), H['56'] = _0x1d931a(0x4ba), H['57'] = _0x1d931a(0x50d), H['58'] = '6&#829;&#851;', H['59'] = _0x1d931a(0x2d3), H['60'] = _0x1d931a(0x1c1), H['61'] = _0x1d931a(0x377), H['62'] = _0x1d931a(0x452);
var I = {};
I['1'] = '&#120458;&#823;', I['2'] = '&#120459;&#823;', I['3'] = _0x1d931a(0x2e5), I['4'] = _0x1d931a(0x307), I['5'] = '&#120462;&#823;', I['6'] = _0x1d931a(0x4a4), I['7'] = _0x1d931a(0x449), I['8'] = _0x1d931a(0x260), I['9'] = '&#120466;&#823;', I['10'] = _0x1d931a(0x36d), I['11'] = _0x1d931a(0x23d), I['12'] = _0x1d931a(0x1eb), I['13'] = _0x1d931a(0x60f), I['14'] = _0x1d931a(0x653), I['15'] = _0x1d931a(0x1d0), I['16'] = _0x1d931a(0x4e9), I['17'] = _0x1d931a(0x4ab), I['18'] = _0x1d931a(0x544), I['19'] = '&#120476;&#823;', I['20'] = _0x1d931a(0x380), I['21'] = '&#120478;&#823;', I['22'] = _0x1d931a(0x509), I['23'] = _0x1d931a(0x36c), I['24'] = '&#120481;&#823;', I['25'] = '&#120482;&#823;', I['26'] = _0x1d931a(0x4cd), I['27'] = _0x1d931a(0x34b), I['28'] = _0x1d931a(0x4ce), I['29'] = _0x1d931a(0x516), I['30'] = '&#120435;&#823;', I['31'] = _0x1d931a(0x1cc), I['32'] = '&#120437;&#823;', I['33'] = _0x1d931a(0x5d5), I['34'] = _0x1d931a(0x1d2), I['35'] = _0x1d931a(0x5cd), I['36'] = '&#120441;&#823;', I['37'] = _0x1d931a(0x3d8), I['38'] = _0x1d931a(0x1e3), I['39'] = '&#120444;&#823;', I['40'] = '&#120445;&#823;', I['41'] = _0x1d931a(0x50f), I['42'] = '&#120447;&#823;', I['43'] = _0x1d931a(0x645), I['44'] = _0x1d931a(0x4b4), I['45'] = _0x1d931a(0x322), I['46'] = _0x1d931a(0x21d), I['47'] = _0x1d931a(0x1a8), I['48'] = _0x1d931a(0x2e6), I['49'] = _0x1d931a(0x36b), I['50'] = '&#120455;&#823;', I['51'] = '&#120456;&#823;', I['52'] = _0x1d931a(0x373), I['53'] = _0x1d931a(0x3bd), I['54'] = '&#120824;&#823;', I['55'] = _0x1d931a(0x1f7), I['56'] = _0x1d931a(0x32e), I['57'] = '&#120827;&#823;', I['58'] = _0x1d931a(0x329), I['59'] = '&#120829;&#823;', I['60'] = '&#120830;&#823;', I['61'] = _0x1d931a(0x5c1), I['62'] = _0x1d931a(0x564);
var J = {};
J['1'] = _0x1d931a(0x39a), J['2'] = _0x1d931a(0x257), J['3'] = 'c&#866;', J['4'] = 'd&#866;', J['5'] = _0x1d931a(0x52b), J['6'] = _0x1d931a(0x494), J['7'] = _0x1d931a(0x1a9), J['8'] = _0x1d931a(0x387), J['9'] = _0x1d931a(0x19f), J['10'] = _0x1d931a(0x43a), J['11'] = _0x1d931a(0x4c8), J['12'] = _0x1d931a(0x451), J['13'] = _0x1d931a(0x493), J['14'] = _0x1d931a(0x65e), J['15'] = 'o&#866;', J['16'] = 'p&#866;', J['17'] = _0x1d931a(0x426), J['18'] = _0x1d931a(0x54f), J['19'] = _0x1d931a(0x21f), J['20'] = _0x1d931a(0x4ee), J['21'] = _0x1d931a(0x478), J['22'] = _0x1d931a(0x3db), J['23'] = 'w&#866;', J['24'] = _0x1d931a(0x255), J['25'] = _0x1d931a(0x42e), J['26'] = 'z&#866;', J['27'] = 'A&#866;', J['28'] = _0x1d931a(0x503), J['29'] = _0x1d931a(0x258), J['30'] = _0x1d931a(0x336), J['31'] = _0x1d931a(0x41d), J['32'] = _0x1d931a(0x500), J['33'] = 'G&#866;', J['34'] = _0x1d931a(0x239), J['35'] = _0x1d931a(0x4b7), J['36'] = _0x1d931a(0x26d), J['37'] = _0x1d931a(0x2db), J['38'] = _0x1d931a(0x3cc), J['39'] = 'M&#866;', J['40'] = 'N&#866;', J['41'] = _0x1d931a(0x358), J['42'] = _0x1d931a(0x21a), J['43'] = 'Q&#866;', J['44'] = _0x1d931a(0x5b8), J['45'] = _0x1d931a(0x586), J['46'] = 'T&#866;', J['47'] = _0x1d931a(0x65f), J['48'] = 'V&#866;', J['49'] = _0x1d931a(0x512), J['50'] = _0x1d931a(0x1d8), J['51'] = _0x1d931a(0x201), J['52'] = 'Z&#866;', J['53'] = _0x1d931a(0x5d4), J['54'] = _0x1d931a(0x5d3), J['55'] = '3&#866;', J['56'] = _0x1d931a(0x34c), J['57'] = '5&#866;', J['58'] = _0x1d931a(0x290), J['59'] = _0x1d931a(0x20b), J['60'] = _0x1d931a(0x279), J['61'] = _0x1d931a(0x58f), J['62'] = _0x1d931a(0x312);
var K = {};
K['1'] = _0x1d931a(0x523), K['2'] = _0x1d931a(0x433), K['3'] = _0x1d931a(0x568), K['4'] = _0x1d931a(0x211), K['5'] = _0x1d931a(0x339), K['6'] = _0x1d931a(0x2f9), K['7'] = 'g&#828;', K['8'] = _0x1d931a(0x1f2), K['9'] = _0x1d931a(0x58e), K['10'] = 'j&#828;', K['11'] = _0x1d931a(0x3ce), K['12'] = 'l&#828;', K['13'] = _0x1d931a(0x334), K['14'] = _0x1d931a(0x292), K['15'] = 'o&#828;', K['16'] = _0x1d931a(0x1e6), K['17'] = _0x1d931a(0x401), K['18'] = _0x1d931a(0x214), K['19'] = 's&#828;', K['20'] = _0x1d931a(0x4e5), K['21'] = _0x1d931a(0x1dc), K['22'] = _0x1d931a(0x3bc), K['23'] = 'w&#828;', K['24'] = _0x1d931a(0x48b), K['25'] = _0x1d931a(0x42c), K['26'] = _0x1d931a(0x25c), K['27'] = 'A&#828;', K['28'] = _0x1d931a(0x5df), K['29'] = _0x1d931a(0x309), K['30'] = _0x1d931a(0x578), K['31'] = _0x1d931a(0x5aa), K['32'] = 'F&#828;', K['33'] = 'G&#828;', K['34'] = _0x1d931a(0x335), K['35'] = 'I&#828;', K['36'] = 'J&#828;', K['37'] = 'K&#828;', K['38'] = _0x1d931a(0x470), K['39'] = 'M&#828;', K['40'] = _0x1d931a(0x4a6), K['41'] = _0x1d931a(0x513), K['42'] = 'P&#828;', K['43'] = 'Q&#828;', K['44'] = _0x1d931a(0x5a0), K['45'] = _0x1d931a(0x39b), K['46'] = _0x1d931a(0x527), K['47'] = 'U&#828;', K['48'] = _0x1d931a(0x3ea), K['49'] = _0x1d931a(0x1b6), K['50'] = _0x1d931a(0x2a1), K['51'] = _0x1d931a(0x604), K['52'] = 'Z&#828;', K['53'] = _0x1d931a(0x320), K['54'] = '2&#828;', K['55'] = _0x1d931a(0x548), K['56'] = '4&#828;', K['57'] = '5&#828;', K['58'] = _0x1d931a(0x53c), K['59'] = _0x1d931a(0x5e1), K['60'] = _0x1d931a(0x23a), K['61'] = _0x1d931a(0x47f), K['62'] = _0x1d931a(0x64d);
var L = {};
L['s1'] = h, L['s2'] = i, L['s3'] = j, L['s4'] = k, L['s5'] = l, L['s6'] = m, L['s7'] = n, L['s8'] = o, L['s9'] = p, L[_0x1d931a(0x19b)] = q, L['s11'] = r, L['s12'] = s, L[_0x1d931a(0x656)] = t, L[_0x1d931a(0x370)] = u, L[_0x1d931a(0x4b0)] = v, L['s16'] = w, L[_0x1d931a(0x287)] = x, L[_0x1d931a(0x51b)] = y, L[_0x1d931a(0x5dd)] = z, L[_0x1d931a(0x3e9)] = A, L[_0x1d931a(0x315)] = B, L[_0x1d931a(0x253)] = C, L[_0x1d931a(0x362)] = D, L['s24'] = E, L['s25'] = F, L['s26'] = G, L[_0x1d931a(0x3eb)] = H, L[_0x1d931a(0x1d5)] = I, L[_0x1d931a(0x5e0)] = J, L[_0x1d931a(0x57a)] = K;
var newtext = L;

function Change(_0x24efba, _0xde6898) {
    var _0x3cdd18 = _0x1d931a,
        _0x50fcef = '',
        _0x24efba = _0x24efba;
    if (_0x24efba[_0x3cdd18(0x2c4)] == 0x0) return;
    for (i = 0x0; i < _0x24efba[_0x3cdd18(0x2c4)]; i++) {
        var _0x5caef8 = _0x24efba[_0x3cdd18(0x472)](i),
            _0x4bc711 = normal['indexOf'](_0x5caef8) + 0x1;
        if (_0x5caef8 == '\x20') _0x50fcef += '\x20';
        else !_0x4bc711 ? _0x50fcef += _0x5caef8 : _0x50fcef += newtext[_0xde6898][_0x4bc711];
    }
    return _0x50fcef;
}
var M = {};
M['0'] = '0', M['1'] = '1', M['2'] = '2', M['3'] = '3', M['4'] = '4', M['5'] = '5', M['6'] = '6', M['7'] = '7', M['8'] = '8', M['9'] = '9', M['a'] = 'ᗩ', M['b'] = 'ᗷ', M['c'] = 'ᑢ', M['d'] = 'ᕲ', M['e'] = 'ᘿ', M['f'] = 'ᖴ', M['g'] = 'ᘜ', M['h'] = 'ᕼ', M['i'] = 'ᓰ', M['j'] = 'ᒚ', M['k'] = 'ᖽᐸ', M['l'] = 'ᒪ', M['m'] = 'ᘻ', M['n'] = 'ᘉ', M['o'] = 'ᓍ', M['p'] = 'ᕵ', M['q'] = 'ᕴ', M['r'] = 'ᖇ', M['s'] = 'S', M['t'] = 'ᖶ', M['u'] = 'ᑘ', M['v'] = 'ᐺ', M['w'] = 'ᘺ', M['x'] = '᙭', M['y'] = 'ᖻ', M['z'] = 'ᗱ', M['A'] = 'ᗩ', M['B'] = 'ᗷ', M['C'] = 'ᑢ', M['D'] = 'ᕲ', M['E'] = 'ᘿ', M['F'] = 'ᖴ', M['G'] = 'ᘜ', M['H'] = 'ᕼ', M['I'] = 'ᓰ', M['J'] = 'ᒚ', M['K'] = 'ᖽᐸ', M['L'] = 'ᒪ', M['M'] = 'ᘻ', M['N'] = 'ᘉ', M['O'] = 'ᓍ', M['P'] = 'ᕵ', M['Q'] = 'ᕴ', M['R'] = 'ᖇ', M['S'] = 'S', M['T'] = 'ᖶ', M['U'] = 'ᑘ', M['V'] = 'ᐺ', M['W'] = 'ᘺ', M['X'] = '᙭', M['Y'] = 'ᖻ', M['Z'] = 'ᗱ';
const futureAlienCharMap = M;
var N = {};
N['0'] = '0', N['1'] = '1', N['2'] = '2', N['3'] = '3', N['4'] = '4', N['5'] = '5', N['6'] = '6', N['7'] = '7', N['8'] = '8', N['9'] = '9', N['a'] = 'ค', N['b'] = '๖', N['c'] = '¢', N['d'] = '໓', N['e'] = 'ē', N['f'] = 'f', N['g'] = 'ງ', N['h'] = 'h', N['i'] = 'i', N['j'] = 'ว', N['k'] = 'k', N['l'] = 'l', N['m'] = '๓', N['n'] = 'ຖ', N['o'] = '໐', N['p'] = 'p', N['q'] = '๑', N['r'] = 'r', N['s'] = 'Ş', N['t'] = 't', N['u'] = 'น', N['v'] = 'ง', N['w'] = 'ຟ', N['x'] = 'x', N['y'] = 'ฯ', N['z'] = 'ຊ', N['A'] = 'ค', N['B'] = '๖', N['C'] = '¢', N['D'] = '໓', N['E'] = 'ē', N['F'] = 'f', N['G'] = 'ງ', N['H'] = 'h', N['I'] = 'i', N['J'] = 'ว', N['K'] = 'k', N['L'] = 'l', N['M'] = '๓', N['N'] = 'ຖ', N['O'] = '໐', N['P'] = 'p', N['Q'] = '๑', N['R'] = 'r', N['S'] = 'Ş', N['T'] = 't', N['U'] = 'น', N['V'] = 'ง', N['W'] = 'ຟ', N['X'] = 'x', N['Y'] = 'ฯ', N['Z'] = 'ຊ';
const squiggle6CharMap = N;
var O = {};
O['0'] = '0', O['1'] = '1', O['2'] = '2', O['3'] = '3', O['4'] = '4', O['5'] = '5', O['6'] = '6', O['7'] = '7', O['8'] = '8', O['9'] = '9', O['a'] = 'ą', O['b'] = 'ც', O['c'] = 'ƈ', O['d'] = 'ɖ', O['e'] = 'ɛ', O['f'] = 'ʄ', O['g'] = 'ɠ', O['h'] = 'ɧ', O['i'] = 'ı', O['j'] = 'ʝ', O['k'] = 'ƙ', O['l'] = 'Ɩ', O['m'] = 'ɱ', O['n'] = 'ŋ', O['o'] = 'ơ', O['p'] = '℘', O['q'] = 'զ', O['r'] = 'ཞ', O['s'] = 'ʂ', O['t'] = 'ɬ', O['u'] = 'ų', O['v'] = '۷', O['w'] = 'ῳ', O['x'] = 'ҳ', O['y'] = 'ყ', O['z'] = 'ʑ', O['A'] = 'ą', O['B'] = 'ც', O['C'] = 'ƈ', O['D'] = 'ɖ', O['E'] = 'ɛ', O['F'] = 'ʄ', O['G'] = 'ɠ', O['H'] = 'ɧ', O['I'] = 'ı', O['J'] = 'ʝ', O['K'] = 'ƙ', O['L'] = 'Ɩ', O['M'] = 'ɱ', O['N'] = 'ŋ', O['O'] = 'ơ', O['P'] = '℘', O['Q'] = 'զ', O['R'] = 'ཞ', O['S'] = 'ʂ', O['T'] = 'ɬ', O['U'] = 'ų', O['V'] = '۷', O['W'] = 'ῳ', O['X'] = 'ҳ', O['Y'] = 'ყ', O['Z'] = 'ʑ';
const squiggle5CharMap = O;
var P = {};
P['0'] = '0', P['1'] = '1', P['2'] = '2', P['3'] = '3', P['4'] = '4', P['5'] = '5', P['6'] = '6', P['7'] = '7', P['8'] = '8', P['9'] = '9', P['a'] = 'ﾑ', P['b'] = '乃', P['c'] = 'ᄃ', P['d'] = 'り', P['e'] = '乇', P['f'] = 'ｷ', P['g'] = 'ム', P['h'] = 'ん', P['i'] = 'ﾉ', P['j'] = 'ﾌ', P['k'] = 'ズ', P['l'] = 'ﾚ', P['m'] = 'ﾶ', P['n'] = '刀', P['o'] = 'の', P['p'] = 'ｱ', P['q'] = 'ゐ', P['r'] = '尺', P['s'] = '丂', P['t'] = 'ｲ', P['u'] = 'ひ', P['v'] = '√', P['w'] = 'W', P['x'] = 'ﾒ', P['y'] = 'ﾘ', P['z'] = '乙', P['A'] = 'ﾑ', P['B'] = '乃', P['C'] = 'ᄃ', P['D'] = 'り', P['E'] = '乇', P['F'] = 'ｷ', P['G'] = 'ム', P['H'] = 'ん', P['I'] = 'ﾉ', P['J'] = 'ﾌ', P['K'] = 'ズ', P['L'] = 'ﾚ', P['M'] = 'ﾶ', P['N'] = '刀', P['O'] = 'の', P['P'] = 'ｱ', P['Q'] = 'ゐ', P['R'] = '尺', P['S'] = '丂', P['T'] = 'ｲ', P['U'] = 'ひ', P['V'] = '√', P['W'] = 'W', P['X'] = 'ﾒ', P['Y'] = 'ﾘ', P['Z'] = '乙';
const asianStyle2CharMap = P;
var Q = {};
Q['0'] = '0', Q['1'] = '1', Q['2'] = '2', Q['3'] = '3', Q['4'] = '4', Q['5'] = '5', Q['6'] = '6', Q['7'] = '7', Q['8'] = '8', Q['9'] = '9', Q['a'] = '卂', Q['b'] = '乃', Q['c'] = '匚', Q['d'] = 'ᗪ', Q['e'] = '乇', Q['f'] = '千', Q['g'] = 'Ꮆ', Q['h'] = '卄', Q['i'] = '丨', Q['j'] = 'ﾌ', Q['k'] = 'Ҝ', Q['l'] = 'ㄥ', Q['m'] = '爪', Q['n'] = '几', Q['o'] = 'ㄖ', Q['p'] = '卩', Q['q'] = 'Ɋ', Q['r'] = '尺', Q['s'] = '丂', Q['t'] = 'ㄒ', Q['u'] = 'ㄩ', Q['v'] = 'ᐯ', Q['w'] = '山', Q['x'] = '乂', Q['y'] = 'ㄚ', Q['z'] = '乙', Q['A'] = '卂', Q['B'] = '乃', Q['C'] = '匚', Q['D'] = 'ᗪ', Q['E'] = '乇', Q['F'] = '千', Q['G'] = 'Ꮆ', Q['H'] = '卄', Q['I'] = '丨', Q['J'] = 'ﾌ', Q['K'] = 'Ҝ', Q['L'] = 'ㄥ', Q['M'] = '爪', Q['N'] = '几', Q['O'] = 'ㄖ', Q['P'] = '卩', Q['Q'] = 'Ɋ', Q['R'] = '尺', Q['S'] = '丂', Q['T'] = 'ㄒ', Q['U'] = 'ㄩ', Q['V'] = 'ᐯ', Q['W'] = '山', Q['X'] = '乂', Q['Y'] = 'ㄚ', Q['Z'] = '乙';
const asianStyleCharMap = Q;
var R = {};

function _0x554c(_0x4c633c, _0x4308c9) {
    var _0x59bf04 = _0x59bf();
    return _0x554c = function(_0x554cd5, _0x5068f5) {
        _0x554cd5 = _0x554cd5 - 0x189;
        var _0x3156e = _0x59bf04[_0x554cd5];
        return _0x3156e;
    }, _0x554c(_0x4c633c, _0x4308c9);
}
R['0'] = '0', R['1'] = '1', R['2'] = '2', R['3'] = '3', R['4'] = '4', R['5'] = '5', R['6'] = '6', R['7'] = '7', R['8'] = '8', R['9'] = '9', R['a'] = '🄰', R['b'] = '🄱', R['c'] = '🄲', R['d'] = '🄳', R['e'] = '🄴', R['f'] = '🄵', R['g'] = '🄶', R['h'] = '🄷', R['i'] = '🄸', R['j'] = '🄹', R['k'] = '🄺', R['l'] = '🄻', R['m'] = '🄼', R['n'] = '🄽', R['o'] = '🄾', R['p'] = '🄿', R['q'] = '🅀', R['r'] = '🅁', R['s'] = '🅂', R['t'] = '🅃', R['u'] = '🅄', R['v'] = '🅅', R['w'] = '🅆', R['x'] = '🅇', R['y'] = '🅈', R['z'] = '🅉', R['A'] = '🄰', R['B'] = '🄱', R['C'] = '🄲', R['D'] = '🄳', R['E'] = '🄴', R['F'] = '🄵', R['G'] = '🄶', R['H'] = '🄷', R['I'] = '🄸', R['J'] = '🄹', R['K'] = '🄺', R['L'] = '🄻', R['M'] = '🄼', R['N'] = '🄽', R['O'] = '🄾', R['P'] = '🄿', R['Q'] = '🅀', R['R'] = '🅁', R['S'] = '🅂', R['T'] = '🅃', R['U'] = '🅄', R['V'] = '🅅', R['W'] = '🅆', R['X'] = '🅇', R['Y'] = '🅈', R['Z'] = '🅉';
const squaresCharMap = R;
var S = {};
S['0'] = '0', S['1'] = '1', S['2'] = '2', S['3'] = '3', S['4'] = '4', S['5'] = '5', S['6'] = '6', S['7'] = '7', S['8'] = '8', S['9'] = '9', S['a'] = 'Ꮧ', S['b'] = 'Ᏸ', S['c'] = 'ፈ', S['d'] = 'Ꮄ', S['e'] = 'Ꮛ', S['f'] = 'Ꭶ', S['g'] = 'Ꮆ', S['h'] = 'Ꮒ', S['i'] = 'Ꭵ', S['j'] = 'Ꮰ', S['k'] = 'Ꮶ', S['l'] = 'Ꮭ', S['m'] = 'Ꮇ', S['n'] = 'Ꮑ', S['o'] = 'Ꭷ', S['p'] = 'Ꭾ', S['q'] = 'Ꭴ', S['r'] = 'Ꮢ', S['s'] = 'Ꮥ', S['t'] = 'Ꮦ', S['u'] = 'Ꮼ', S['v'] = 'Ꮙ', S['w'] = 'Ꮗ', S['x'] = 'ጀ', S['y'] = 'Ꭹ', S['z'] = 'ፚ', S['A'] = 'Ꮧ', S['B'] = 'Ᏸ', S['C'] = 'ፈ', S['D'] = 'Ꮄ', S['E'] = 'Ꮛ', S['F'] = 'Ꭶ', S['G'] = 'Ꮆ', S['H'] = 'Ꮒ', S['I'] = 'Ꭵ', S['J'] = 'Ꮰ', S['K'] = 'Ꮶ', S['L'] = 'Ꮭ', S['M'] = 'Ꮇ', S['N'] = 'Ꮑ', S['O'] = 'Ꭷ', S['P'] = 'Ꭾ', S['Q'] = 'Ꭴ', S['R'] = 'Ꮢ', S['S'] = 'Ꮥ', S['T'] = 'Ꮦ', S['U'] = 'Ꮼ', S['V'] = 'Ꮙ', S['W'] = 'Ꮗ', S['X'] = 'ጀ', S['Y'] = 'Ꭹ', S['Z'] = 'ፚ';
const squiggle4CharMap = S;
var T = {};
T['0'] = '0', T['1'] = '1', T['2'] = '2', T['3'] = '3', T['4'] = '4', T['5'] = '5', T['6'] = '6', T['7'] = '7', T['8'] = '8', T['9'] = '9', T['a'] = 'ᗩ', T['b'] = 'ᗷ', T['c'] = 'ᑕ', T['d'] = 'ᗪ', T['e'] = 'E', T['f'] = 'ᖴ', T['g'] = 'G', T['h'] = 'ᕼ', T['i'] = 'I', T['j'] = 'ᒍ', T['k'] = 'K', T['l'] = 'ᒪ', T['m'] = 'ᗰ', T['n'] = 'ᑎ', T['o'] = 'O', T['p'] = 'ᑭ', T['q'] = 'ᑫ', T['r'] = 'ᖇ', T['s'] = 'ᔕ', T['t'] = 'T', T['u'] = 'ᑌ', T['v'] = 'ᐯ', T['w'] = 'ᗯ', T['x'] = '᙭', T['y'] = 'Y', T['z'] = 'ᘔ', T['A'] = 'ᗩ', T['B'] = 'ᗷ', T['C'] = 'ᑕ', T['D'] = 'ᗪ', T['E'] = 'E', T['F'] = 'ᖴ', T['G'] = 'G', T['H'] = 'ᕼ', T['I'] = 'I', T['J'] = 'ᒍ', T['K'] = 'K', T['L'] = 'ᒪ', T['M'] = 'ᗰ', T['N'] = 'ᑎ', T['O'] = 'O', T['P'] = 'ᑭ', T['Q'] = 'ᑫ', T['R'] = 'ᖇ', T['S'] = 'ᔕ', T['T'] = 'T', T['U'] = 'ᑌ', T['V'] = 'ᐯ', T['W'] = 'ᗯ', T['X'] = '᙭', T['Y'] = 'Y', T['Z'] = 'ᘔ';
const neonCharMap = T;
var U = {};
U['0'] = '0', U['1'] = '1', U['2'] = '2', U['3'] = '3', U['4'] = '4', U['5'] = '5', U['6'] = '6', U['7'] = '7', U['8'] = '8', U['9'] = '9', U['a'] = 'ǟ', U['b'] = 'ɮ', U['c'] = 'ƈ', U['d'] = 'ɖ', U['e'] = 'ɛ', U['f'] = 'ʄ', U['g'] = 'ɢ', U['h'] = 'ɦ', U['i'] = 'ɨ', U['j'] = 'ʝ', U['k'] = 'ӄ', U['l'] = 'ʟ', U['m'] = 'ʍ', U['n'] = 'ռ', U['o'] = 'օ', U['p'] = 'ք', U['q'] = 'զ', U['r'] = 'ʀ', U['s'] = 'ֆ', U['t'] = 'ȶ', U['u'] = 'ʊ', U['v'] = 'ʋ', U['w'] = 'ա', U['x'] = 'Ӽ', U['y'] = 'ʏ', U['z'] = 'ʐ', U['A'] = 'ǟ', U['B'] = 'ɮ', U['C'] = 'ƈ', U['D'] = 'ɖ', U['E'] = 'ɛ', U['F'] = 'ʄ', U['G'] = 'ɢ', U['H'] = 'ɦ', U['I'] = 'ɨ', U['J'] = 'ʝ', U['K'] = 'ӄ', U['L'] = 'ʟ', U['M'] = 'ʍ', U['N'] = 'ռ', U['O'] = 'օ', U['P'] = 'ք', U['Q'] = 'զ', U['R'] = 'ʀ', U['S'] = 'ֆ', U['T'] = 'ȶ', U['U'] = 'ʊ', U['V'] = 'ʋ', U['W'] = 'ա', U['X'] = 'Ӽ', U['Y'] = 'ʏ', U['Z'] = 'ʐ';
const squiggle3CharMap = U;
var V = {};
V['0'] = '𝟶', V['1'] = '𝟷', V['2'] = '𝟸', V['3'] = '𝟹', V['4'] = '𝟺', V['5'] = '𝟻', V['6'] = '𝟼', V['7'] = '𝟽', V['8'] = '𝟾', V['9'] = '𝟿', V['a'] = '𝚊', V['b'] = '𝚋', V['c'] = '𝚌', V['d'] = '𝚍', V['e'] = '𝚎', V['f'] = '𝚏', V['g'] = '𝚐', V['h'] = '𝚑', V['i'] = '𝚒', V['j'] = '𝚓', V['k'] = '𝚔', V['l'] = '𝚕', V['m'] = '𝚖', V['n'] = '𝚗', V['o'] = '𝚘', V['p'] = '𝚙', V['q'] = '𝚚', V['r'] = '𝚛', V['s'] = '𝚜', V['t'] = '𝚝', V['u'] = '𝚞', V['v'] = '𝚟', V['w'] = '𝚠', V['x'] = '𝚡', V['y'] = '𝚢', V['z'] = '𝚣', V['A'] = '𝙰', V['B'] = '𝙱', V['C'] = '𝙲', V['D'] = '𝙳', V['E'] = '𝙴', V['F'] = '𝙵', V['G'] = '𝙶', V['H'] = '𝙷', V['I'] = '𝙸', V['J'] = '𝙹', V['K'] = '𝙺', V['L'] = '𝙻', V['M'] = '𝙼', V['N'] = '𝙽', V['O'] = '𝙾', V['P'] = '𝙿', V['Q'] = '𝚀', V['R'] = '𝚁', V['S'] = '𝚂', V['T'] = '𝚃', V['U'] = '𝚄', V['V'] = '𝚅', V['W'] = '𝚆', V['X'] = '𝚇', V['Y'] = '𝚈', V['Z'] = '𝚉';
const monospaceCharMap = V;
var W = {};
W['0'] = '0', W['1'] = '1', W['2'] = '2', W['3'] = '3', W['4'] = '4', W['5'] = '5', W['6'] = '6', W['7'] = '7', W['8'] = '8', W['9'] = '9', W['a'] = '𝙖', W['b'] = '𝙗', W['c'] = '𝙘', W['d'] = '𝙙', W['e'] = '𝙚', W['f'] = '𝙛', W['g'] = '𝙜', W['h'] = '𝙝', W['i'] = '𝙞', W['j'] = '𝙟', W['k'] = '𝙠', W['l'] = '𝙡', W['m'] = '𝙢', W['n'] = '𝙣', W['o'] = '𝙤', W['p'] = '𝙥', W['q'] = '𝙦', W['r'] = '𝙧', W['s'] = '𝙨', W['t'] = '𝙩', W['u'] = '𝙪', W['v'] = '𝙫', W['w'] = '𝙬', W['x'] = '𝙭', W['y'] = '𝙮', W['z'] = '𝙯', W['A'] = '𝘼', W['B'] = '𝘽', W['C'] = '𝘾', W['D'] = '𝘿', W['E'] = '𝙀', W['F'] = '𝙁', W['G'] = '𝙂', W['H'] = '𝙃', W['I'] = '𝙄', W['J'] = '𝙅', W['K'] = '𝙆', W['L'] = '𝙇', W['M'] = '𝙈', W['N'] = '𝙉', W['O'] = '𝙊', W['P'] = '𝙋', W['Q'] = '𝙌', W['R'] = '𝙍', W['S'] = '𝙎', W['T'] = '𝙏', W['U'] = '𝙐', W['V'] = '𝙑', W['W'] = '𝙒', W['X'] = '𝙓', W['Y'] = '𝙔', W['Z'] = '𝙕';
const boldItalicCharMap = W;
var X = {};
X['0'] = '𝟎', X['1'] = '𝟏', X['2'] = '𝟐', X['3'] = '𝟑', X['4'] = '𝟒', X['5'] = '𝟓', X['6'] = '𝟔', X['7'] = '𝟕', X['8'] = '𝟖', X['9'] = '𝟗', X['a'] = '𝐚', X['b'] = '𝐛', X['c'] = '𝐜', X['d'] = '𝐝', X['e'] = '𝐞', X['f'] = '𝐟', X['g'] = '𝐠', X['h'] = '𝐡', X['i'] = '𝐢', X['j'] = '𝐣', X['k'] = '𝐤', X['l'] = '𝐥', X['m'] = '𝐦', X['n'] = '𝐧', X['o'] = '𝐨', X['p'] = '𝐩', X['q'] = '𝐪', X['r'] = '𝐫', X['s'] = '𝐬', X['t'] = '𝐭', X['u'] = '𝐮', X['v'] = '𝐯', X['w'] = '𝐰', X['x'] = '𝐱', X['y'] = '𝐲', X['z'] = '𝐳', X['A'] = '𝐀', X['B'] = '𝐁', X['C'] = '𝐂', X['D'] = '𝐃', X['E'] = '𝐄', X['F'] = '𝐅', X['G'] = '𝐆', X['H'] = '𝐇', X['I'] = '𝐈', X['J'] = '𝐉', X['K'] = '𝐊', X['L'] = '𝐋', X['M'] = '𝐌', X['N'] = '𝐍', X['O'] = '𝐎', X['P'] = '𝐏', X['Q'] = '𝐐', X['R'] = '𝐑', X['S'] = '𝐒', X['T'] = '𝐓', X['U'] = '𝐔', X['V'] = '𝐕', X['W'] = '𝐖', X['X'] = '𝐗', X['Y'] = '𝐘', X['Z'] = '𝐙';
const boldCharMap = X;
var Y = {};
Y['0'] = '0', Y['1'] = '1', Y['2'] = '2', Y['3'] = '3', Y['4'] = '4', Y['5'] = '5', Y['6'] = '6', Y['7'] = '7', Y['8'] = '8', Y['9'] = '9', Y['a'] = '𝘢', Y['b'] = '𝘣', Y['c'] = '𝘤', Y['d'] = '𝘥', Y['e'] = '𝘦', Y['f'] = '𝘧', Y['g'] = '𝘨', Y['h'] = '𝘩', Y['i'] = '𝘪', Y['j'] = '𝘫', Y['k'] = '𝘬', Y['l'] = '𝘭', Y['m'] = '𝘮', Y['n'] = '𝘯', Y['o'] = '𝘰', Y['p'] = '𝘱', Y['q'] = '𝘲', Y['r'] = '𝘳', Y['s'] = '𝘴', Y['t'] = '𝘵', Y['u'] = '𝘶', Y['v'] = '𝘷', Y['w'] = '𝘸', Y['x'] = '𝘹', Y['y'] = '𝘺', Y['z'] = '𝘻', Y['A'] = '𝘈', Y['B'] = '𝘉', Y['C'] = '𝘊', Y['D'] = '𝘋', Y['E'] = '𝘌', Y['F'] = '𝘍', Y['G'] = '𝘎', Y['H'] = '𝘏', Y['I'] = '𝘐', Y['J'] = '𝘑', Y['K'] = '𝘒', Y['L'] = '𝘓', Y['M'] = '𝘔', Y['N'] = '𝘕', Y['O'] = '𝘖', Y['P'] = '𝘗', Y['Q'] = '𝘘', Y['R'] = '𝘙', Y['S'] = '𝘚', Y['T'] = '𝘛', Y['U'] = '𝘜', Y['V'] = '𝘝', Y['W'] = '𝘞', Y['X'] = '𝘟', Y['Y'] = '𝘠', Y['Z'] = '𝘡';
const italicCharMap = Y;
var Z = {};
Z['0'] = '0', Z['1'] = '1', Z['2'] = '2', Z['3'] = '3', Z['4'] = '4', Z['5'] = '5', Z['6'] = '6', Z['7'] = '7', Z['8'] = '8', Z['9'] = '9', Z['a'] = 'α', Z['b'] = 'Ⴆ', Z['c'] = 'ƈ', Z['d'] = 'ԃ', Z['e'] = 'ҽ', Z['f'] = 'ϝ', Z['g'] = 'ɠ', Z['h'] = 'ԋ', Z['i'] = 'ι', Z['j'] = 'ʝ', Z['k'] = 'ƙ', Z['l'] = 'ʅ', Z['m'] = 'ɱ', Z['n'] = 'ɳ', Z['o'] = 'σ', Z['p'] = 'ρ', Z['q'] = 'ϙ', Z['r'] = 'ɾ', Z['s'] = 'ʂ', Z['t'] = 'ƚ', Z['u'] = 'υ', Z['v'] = 'ʋ', Z['w'] = 'ɯ', Z['x'] = 'x', Z['y'] = 'ყ', Z['z'] = 'ȥ', Z['A'] = 'A', Z['B'] = 'B', Z['C'] = 'C', Z['D'] = 'D', Z['E'] = 'E', Z['F'] = 'F', Z['G'] = 'G', Z['H'] = 'H', Z['I'] = 'I', Z['J'] = 'J', Z['K'] = 'K', Z['L'] = 'L', Z['M'] = 'M', Z['N'] = 'N', Z['O'] = 'O', Z['P'] = 'P', Z['Q'] = 'Q', Z['R'] = 'R', Z['S'] = 'S', Z['T'] = 'T', Z['U'] = 'U', Z['V'] = 'V', Z['W'] = 'W', Z['X'] = 'X', Z['Y'] = 'Y', Z['Z'] = 'Z';
const squiggle2CharMap = Z;
var a0 = {};
a0['0'] = '0', a0['1'] = '1', a0['2'] = '2', a0['3'] = '3', a0['4'] = '4', a0['5'] = '5', a0['6'] = '6', a0['7'] = '7', a0['8'] = '8', a0['9'] = '9', a0['a'] = '₳', a0['b'] = '฿', a0['c'] = '₵', a0['d'] = 'Đ', a0['e'] = 'Ɇ', a0['f'] = '₣', a0['g'] = '₲', a0['h'] = 'Ⱨ', a0['i'] = 'ł', a0['j'] = 'J', a0['k'] = '₭', a0['l'] = 'Ⱡ', a0['m'] = '₥', a0['n'] = '₦', a0['o'] = 'Ø', a0['p'] = '₱', a0['q'] = 'Q', a0['r'] = 'Ɽ', a0['s'] = '₴', a0['t'] = '₮', a0['u'] = 'Ʉ', a0['v'] = 'V', a0['w'] = '₩', a0['x'] = 'Ӿ', a0['y'] = 'Ɏ', a0['z'] = 'Ⱬ', a0['A'] = '₳', a0['B'] = '฿', a0['C'] = '₵', a0['D'] = 'Đ', a0['E'] = 'Ɇ', a0['F'] = '₣', a0['G'] = '₲', a0['H'] = 'Ⱨ', a0['I'] = 'ł', a0['J'] = 'J', a0['K'] = '₭', a0['L'] = 'Ⱡ', a0['M'] = '₥', a0['N'] = '₦', a0['O'] = 'Ø', a0['P'] = '₱', a0['Q'] = 'Q', a0['R'] = 'Ɽ', a0['S'] = '₴', a0['T'] = '₮', a0['U'] = 'Ʉ', a0['V'] = 'V', a0['W'] = '₩', a0['X'] = 'Ӿ', a0['Y'] = 'Ɏ', a0['Z'] = 'Ⱬ';
const currencyCharMap = a0;
var a1 = {};
a1['0'] = '0', a1['1'] = '1', a1['2'] = '2', a1['3'] = '3', a1['4'] = '4', a1['5'] = '5', a1['6'] = '6', a1['7'] = '7', a1['8'] = '8', a1['9'] = '9', a1['a'] = 'å', a1['b'] = 'ß', a1['c'] = '¢', a1['d'] = 'Ð', a1['e'] = 'ê', a1['f'] = '£', a1['g'] = 'g', a1['h'] = 'h', a1['i'] = 'ï', a1['j'] = 'j', a1['k'] = 'k', a1['l'] = 'l', a1['m'] = 'm', a1['n'] = 'ñ', a1['o'] = 'ð', a1['p'] = 'þ', a1['q'] = 'q', a1['r'] = 'r', a1['s'] = '§', a1['t'] = '†', a1['u'] = 'µ', a1['v'] = 'v', a1['w'] = 'w', a1['x'] = 'x', a1['y'] = '¥', a1['z'] = 'z', a1['A'] = 'Ä', a1['B'] = 'ß', a1['C'] = 'Ç', a1['D'] = 'Ð', a1['E'] = 'È', a1['F'] = '£', a1['G'] = 'G', a1['H'] = 'H', a1['I'] = 'Ì', a1['J'] = 'J', a1['K'] = 'K', a1['L'] = 'L', a1['M'] = 'M', a1['N'] = 'ñ', a1['O'] = 'Ö', a1['P'] = 'þ', a1['Q'] = 'Q', a1['R'] = 'R', a1['S'] = '§', a1['T'] = '†', a1['U'] = 'Ú', a1['V'] = 'V', a1['W'] = 'W', a1['X'] = '×', a1['Y'] = '¥', a1['Z'] = 'Z';
const symbolsCharMap = a1;
var a2 = {};
a2['0'] = '0', a2['1'] = '1', a2['2'] = '2', a2['3'] = '3', a2['4'] = '4', a2['5'] = '5', a2['6'] = '6', a2['7'] = '7', a2['8'] = '8', a2['9'] = '9', a2['a'] = 'α', a2['b'] = 'в', a2['c'] = '¢', a2['d'] = '∂', a2['e'] = 'є', a2['f'] = 'ƒ', a2['g'] = 'g', a2['h'] = 'н', a2['i'] = 'ι', a2['j'] = 'נ', a2['k'] = 'к', a2['l'] = 'ℓ', a2['m'] = 'м', a2['n'] = 'η', a2['o'] = 'σ', a2['p'] = 'ρ', a2['q'] = 'q', a2['r'] = 'я', a2['s'] = 'ѕ', a2['t'] = 'т', a2['u'] = 'υ', a2['v'] = 'ν', a2['w'] = 'ω', a2['x'] = 'χ', a2['y'] = 'у', a2['z'] = 'z', a2['A'] = 'α', a2['B'] = 'в', a2['C'] = '¢', a2['D'] = '∂', a2['E'] = 'є', a2['F'] = 'ƒ', a2['G'] = 'g', a2['H'] = 'н', a2['I'] = 'ι', a2['J'] = 'נ', a2['K'] = 'к', a2['L'] = 'ℓ', a2['M'] = 'м', a2['N'] = 'η', a2['O'] = 'σ', a2['P'] = 'ρ', a2['Q'] = 'q', a2['R'] = 'я', a2['S'] = 'ѕ', a2['T'] = 'т', a2['U'] = 'υ', a2['V'] = 'ν', a2['W'] = 'ω', a2['X'] = 'χ', a2['Y'] = 'у', a2['Z'] = 'z';
const greekCharMap = a2;
var a3 = {};
a3['0'] = '⊘', a3['1'] = '𝟙', a3['2'] = 'ϩ', a3['3'] = 'Ӡ', a3['4'] = '५', a3['5'] = 'Ƽ', a3['6'] = 'Ϭ', a3['7'] = '7', a3['8'] = '𝟠', a3['9'] = '९', a3['a'] = 'ą', a3['b'] = 'ҍ', a3['c'] = 'ç', a3['d'] = 'ժ', a3['e'] = 'ҽ', a3['f'] = 'ƒ', a3['g'] = 'ց', a3['h'] = 'հ', a3['i'] = 'ì', a3['j'] = 'ʝ', a3['k'] = 'ҟ', a3['l'] = 'Ӏ', a3['m'] = 'ʍ', a3['n'] = 'ղ', a3['o'] = 'օ', a3['p'] = 'ք', a3['q'] = 'զ', a3['r'] = 'ɾ', a3['s'] = 'ʂ', a3['t'] = 'է', a3['u'] = 'մ', a3['v'] = 'ѵ', a3['w'] = 'ա', a3['x'] = '×', a3['y'] = 'վ', a3['z'] = 'Հ', a3['A'] = 'Ⱥ', a3['B'] = 'β', a3['C'] = '↻', a3['D'] = 'Ꭰ', a3['E'] = 'Ɛ', a3['F'] = 'Ƒ', a3['G'] = 'Ɠ', a3['H'] = 'Ƕ', a3['I'] = 'į', a3['J'] = 'ل', a3['K'] = 'Ҡ', a3['L'] = 'Ꝉ', a3['M'] = 'Ɱ', a3['N'] = 'ហ', a3['O'] = 'ට', a3['P'] = 'φ', a3['Q'] = 'Ҩ', a3['R'] = 'འ', a3['S'] = 'Ϛ', a3['T'] = 'Ͳ', a3['U'] = 'Ա', a3['V'] = 'Ỽ', a3['W'] = 'చ', a3['X'] = 'ჯ', a3['Y'] = 'Ӌ', a3['Z'] = 'ɀ';
const bentTextCharMap = a3;
var a4 = {};
a4['0'] = '0', a4['1'] = '1', a4['2'] = '2', a4['3'] = '3', a4['4'] = '4', a4['5'] = '5', a4['6'] = '6', a4['7'] = '7', a4['8'] = '8', a4['9'] = '9', a4['a'] = 'Λ', a4['b'] = 'B', a4['c'] = 'ᄃ', a4['d'] = 'D', a4['e'] = 'Σ', a4['f'] = 'F', a4['g'] = 'G', a4['h'] = 'Ή', a4['i'] = 'I', a4['j'] = 'J', a4['k'] = 'K', a4['l'] = 'ᄂ', a4['m'] = 'M', a4['n'] = 'П', a4['o'] = 'Ө', a4['p'] = 'P', a4['q'] = 'Q', a4['r'] = 'Я', a4['s'] = 'Ƨ', a4['t'] = 'Ƭ', a4['u'] = 'Ц', a4['v'] = 'V', a4['w'] = 'Щ', a4['x'] = 'X', a4['y'] = 'Y', a4['z'] = 'Z', a4['A'] = 'Λ', a4['B'] = 'B', a4['C'] = 'ᄃ', a4['D'] = 'D', a4['E'] = 'Σ', a4['F'] = 'F', a4['G'] = 'G', a4['H'] = 'Ή', a4['I'] = 'I', a4['J'] = 'J', a4['K'] = 'K', a4['L'] = 'ᄂ', a4['M'] = 'M', a4['N'] = 'П', a4['O'] = 'Ө', a4['P'] = 'P', a4['Q'] = 'Q', a4['R'] = 'Я', a4['S'] = 'Ƨ', a4['T'] = 'Ƭ', a4['U'] = 'Ц', a4['V'] = 'V', a4['W'] = 'Щ', a4['X'] = 'X', a4['Y'] = 'Y', a4['Z'] = 'Z';
const upperAnglesCharMap = a4;
var a5 = {};
a5['0'] = '₀', a5['1'] = '₁', a5['2'] = '₂', a5['3'] = '₃', a5['4'] = '₄', a5['5'] = '₅', a5['6'] = '₆', a5['7'] = '₇', a5['8'] = '₈', a5['9'] = '₉', a5['a'] = 'ₐ', a5['b'] = 'b', a5['c'] = 'c', a5['d'] = 'd', a5['e'] = 'ₑ', a5['f'] = 'f', a5['g'] = 'g', a5['h'] = 'ₕ', a5['i'] = 'ᵢ', a5['j'] = 'ⱼ', a5['k'] = 'ₖ', a5['l'] = 'ₗ', a5['m'] = 'ₘ', a5['n'] = 'ₙ', a5['o'] = 'ₒ', a5['p'] = 'ₚ', a5['q'] = 'q', a5['r'] = 'ᵣ', a5['s'] = 'ₛ', a5['t'] = 'ₜ', a5['u'] = 'ᵤ', a5['v'] = 'ᵥ', a5['w'] = 'w', a5['x'] = 'ₓ', a5['y'] = 'y', a5['z'] = 'z', a5['A'] = 'ₐ', a5['B'] = 'B', a5['C'] = 'C', a5['D'] = 'D', a5['E'] = 'ₑ', a5['F'] = 'F', a5['G'] = 'G', a5['H'] = 'ₕ', a5['I'] = 'ᵢ', a5['J'] = 'ⱼ', a5['K'] = 'ₖ', a5['L'] = 'ₗ', a5['M'] = 'ₘ', a5['N'] = 'ₙ', a5['O'] = 'ₒ', a5['P'] = 'ₚ', a5['Q'] = 'Q', a5['R'] = 'ᵣ', a5['S'] = 'ₛ', a5['T'] = 'ₜ', a5['U'] = 'ᵤ', a5['V'] = 'ᵥ', a5['W'] = 'W', a5['X'] = 'ₓ', a5['Y'] = 'Y', a5['Z'] = 'Z', a5['+'] = '₊', a5['-'] = '₋', a5['='] = '₌', a5['('] = '₍', a5[')'] = '₎';
const subscriptCharMap = a5;
var a6 = {};
a6['0'] = '⁰', a6['1'] = '¹', a6['2'] = '²', a6['3'] = '³', a6['4'] = '⁴', a6['5'] = '⁵', a6['6'] = '⁶', a6['7'] = '⁷', a6['8'] = '⁸', a6['9'] = '⁹', a6['a'] = 'ᵃ', a6['b'] = 'ᵇ', a6['c'] = 'ᶜ', a6['d'] = 'ᵈ', a6['e'] = 'ᵉ', a6['f'] = 'ᶠ', a6['g'] = 'ᵍ', a6['h'] = 'ʰ', a6['i'] = 'ⁱ', a6['j'] = 'ʲ', a6['k'] = 'ᵏ', a6['l'] = 'ˡ', a6['m'] = 'ᵐ', a6['n'] = 'ⁿ', a6['o'] = 'ᵒ', a6['p'] = 'ᵖ', a6['q'] = 'q', a6['r'] = 'ʳ', a6['s'] = 'ˢ', a6['t'] = 'ᵗ', a6['u'] = 'ᵘ', a6['v'] = 'ᵛ', a6['w'] = 'ʷ', a6['x'] = 'ˣ', a6['y'] = 'ʸ', a6['z'] = 'ᶻ', a6['A'] = 'ᴬ', a6['B'] = 'ᴮ', a6['C'] = 'ᶜ', a6['D'] = 'ᴰ', a6['E'] = 'ᴱ', a6['F'] = 'ᶠ', a6['G'] = 'ᴳ', a6['H'] = 'ᴴ', a6['I'] = 'ᴵ', a6['J'] = 'ᴶ', a6['K'] = 'ᴷ', a6['L'] = 'ᴸ', a6['M'] = 'ᴹ', a6['N'] = 'ᴺ', a6['O'] = 'ᴼ', a6['P'] = 'ᴾ', a6['Q'] = 'Q', a6['R'] = 'ᴿ', a6['S'] = 'ˢ', a6['T'] = 'ᵀ', a6['U'] = 'ᵁ', a6['V'] = 'ⱽ', a6['W'] = 'ᵂ', a6['X'] = 'ˣ', a6['Y'] = 'ʸ', a6['Z'] = 'ᶻ', a6['+'] = '⁺', a6['-'] = '⁻', a6['='] = '⁼', a6['('] = '⁽', a6[')'] = '⁾';
const superscriptCharMap = a6;
var a7 = {};
a7['0'] = '0', a7['1'] = '1', a7['2'] = '2', a7['3'] = '3', a7['4'] = '4', a7['5'] = '5', a7['6'] = '6', a7['7'] = '7', a7['8'] = '8', a7['9'] = '9', a7['a'] = 'ค', a7['b'] = '๒', a7['c'] = 'ς', a7['d'] = '๔', a7['e'] = 'є', a7['f'] = 'Ŧ', a7['g'] = 'ﻮ', a7['h'] = 'ђ', a7['i'] = 'เ', a7['j'] = 'ן', a7['k'] = 'к', a7['l'] = 'ɭ', a7['m'] = '๓', a7['n'] = 'ภ', a7['o'] = '๏', a7['p'] = 'ק', a7['q'] = 'ợ', a7['r'] = 'г', a7['s'] = 'ร', a7['t'] = 'Շ', a7['u'] = 'ย', a7['v'] = 'ש', a7['w'] = 'ฬ', a7['x'] = 'א', a7['y'] = 'ץ', a7['z'] = 'չ', a7['A'] = 'ค', a7['B'] = '๒', a7['C'] = 'ς', a7['D'] = '๔', a7['E'] = 'є', a7['F'] = 'Ŧ', a7['G'] = 'ﻮ', a7['H'] = 'ђ', a7['I'] = 'เ', a7['J'] = 'ן', a7['K'] = 'к', a7['L'] = 'ɭ', a7['M'] = '๓', a7['N'] = 'ภ', a7['O'] = '๏', a7['P'] = 'ק', a7['Q'] = 'ợ', a7['R'] = 'г', a7['S'] = 'ร', a7['T'] = 'Շ', a7['U'] = 'ย', a7['V'] = 'ש', a7['W'] = 'ฬ', a7['X'] = 'א', a7['Y'] = 'ץ', a7['Z'] = 'չ';
const squiggleCharMap = a7;
var a8 = {};
a8['0'] = '𝟘', a8['1'] = '𝟙', a8['2'] = '𝟚', a8['3'] = '𝟛', a8['4'] = '𝟜', a8['5'] = '𝟝', a8['6'] = '𝟞', a8['7'] = '𝟟', a8['8'] = '𝟠', a8['9'] = '𝟡', a8['a'] = '𝕒', a8['b'] = '𝕓', a8['c'] = '𝕔', a8['d'] = '𝕕', a8['e'] = '𝕖', a8['f'] = '𝕗', a8['g'] = '𝕘', a8['h'] = '𝕙', a8['i'] = '𝕚', a8['j'] = '𝕛', a8['k'] = '𝕜', a8['l'] = '𝕝', a8['m'] = '𝕞', a8['n'] = '𝕟', a8['o'] = '𝕠', a8['p'] = '𝕡', a8['q'] = '𝕢', a8['r'] = '𝕣', a8['s'] = '𝕤', a8['t'] = '𝕥', a8['u'] = '𝕦', a8['v'] = '𝕧', a8['w'] = '𝕨', a8['x'] = '𝕩', a8['y'] = '𝕪', a8['z'] = '𝕫', a8['A'] = '𝔸', a8['B'] = '𝔹', a8['C'] = 'ℂ', a8['D'] = '𝔻', a8['E'] = '𝔼', a8['F'] = '𝔽', a8['G'] = '𝔾', a8['H'] = 'ℍ', a8['I'] = '𝕀', a8['J'] = '𝕁', a8['K'] = '𝕂', a8['L'] = '𝕃', a8['M'] = '𝕄', a8['N'] = 'ℕ', a8['O'] = '𝕆', a8['P'] = 'ℙ', a8['Q'] = 'ℚ', a8['R'] = 'ℝ', a8['S'] = '𝕊', a8['T'] = '𝕋', a8['U'] = '𝕌', a8['V'] = '𝕍', a8['W'] = '𝕎', a8['X'] = '𝕏', a8['Y'] = '𝕐', a8['Z'] = 'ℤ';
const doubleStruckCharMap = a8;
var a9 = {};
a9['0'] = '0', a9['1'] = '1', a9['2'] = '2', a9['3'] = '3', a9['4'] = '4', a9['5'] = '5', a9['6'] = '6', a9['7'] = '7', a9['8'] = '8', a9['9'] = '9', a9['a'] = '𝖆', a9['b'] = '𝖇', a9['c'] = '𝖈', a9['d'] = '𝖉', a9['e'] = '𝖊', a9['f'] = '𝖋', a9['g'] = '𝖌', a9['h'] = '𝖍', a9['i'] = '𝖎', a9['j'] = '𝖏', a9['k'] = '𝖐', a9['l'] = '𝖑', a9['m'] = '𝖒', a9['n'] = '𝖓', a9['o'] = '𝖔', a9['p'] = '𝖕', a9['q'] = '𝖖', a9['r'] = '𝖗', a9['s'] = '𝖘', a9['t'] = '𝖙', a9['u'] = '𝖚', a9['v'] = '𝖛', a9['w'] = '𝖜', a9['x'] = '𝖝', a9['y'] = '𝖞', a9['z'] = '𝖟', a9['A'] = '𝕬', a9['B'] = '𝕭', a9['C'] = '𝕮', a9['D'] = '𝕯', a9['E'] = '𝕰', a9['F'] = '𝕱', a9['G'] = '𝕲', a9['H'] = '𝕳', a9['I'] = '𝕴', a9['J'] = '𝕵', a9['K'] = '𝕶', a9['L'] = '𝕷', a9['M'] = '𝕸', a9['N'] = '𝕹', a9['O'] = '𝕺', a9['P'] = '𝕻', a9['Q'] = '𝕼', a9['R'] = '𝕽', a9['S'] = '𝕾', a9['T'] = '𝕿', a9['U'] = '𝖀', a9['V'] = '𝖁', a9['W'] = '𝖂', a9['X'] = '𝖃', a9['Y'] = '𝖄', a9['Z'] = '𝖅';
const medievalCharMap = a9;
var aa = {};
aa['q'] = '🆀', aa['w'] = '🆆', aa['e'] = '🅴', aa['r'] = '🆁', aa['t'] = '🆃', aa['y'] = '🆈', aa['u'] = '🆄', aa['i'] = '🅸', aa['o'] = '🅾', aa['p'] = '🅿', aa['a'] = '🅰', aa['s'] = '🆂', aa['d'] = '🅳', aa['f'] = '🅵', aa['g'] = '🅶', aa['h'] = '🅷', aa['j'] = '🅹', aa['k'] = '🅺', aa['l'] = '🅻', aa['z'] = '🆉', aa['x'] = '🆇', aa['c'] = '🅲', aa['v'] = '🆅', aa['b'] = '🅱', aa['n'] = '🅽', aa['m'] = '🅼';
const invertedSquaresCharMap = aa;
var ab = {};
ab['0'] = '0', ab['1'] = '1', ab['2'] = '2', ab['3'] = '3', ab['4'] = '4', ab['5'] = '5', ab['6'] = '6', ab['7'] = '7', ab['8'] = '8', ab['9'] = '9', ab['a'] = '𝓪', ab['b'] = '𝓫', ab['c'] = '𝓬', ab['d'] = '𝓭', ab['e'] = '𝓮', ab['f'] = '𝓯', ab['g'] = '𝓰', ab['h'] = '𝓱', ab['i'] = '𝓲', ab['j'] = '𝓳', ab['k'] = '𝓴', ab['l'] = '𝓵', ab['m'] = '𝓶', ab['n'] = '𝓷', ab['o'] = '𝓸', ab['p'] = '𝓹', ab['q'] = '𝓺', ab['r'] = '𝓻', ab['s'] = '𝓼', ab['t'] = '𝓽', ab['u'] = '𝓾', ab['v'] = '𝓿', ab['w'] = '𝔀', ab['x'] = '𝔁', ab['y'] = '𝔂', ab['z'] = '𝔃', ab['A'] = '𝓐', ab['B'] = '𝓑', ab['C'] = '𝓒', ab['D'] = '𝓓', ab['E'] = '𝓔', ab['F'] = '𝓕', ab['G'] = '𝓖', ab['H'] = '𝓗', ab['I'] = '𝓘', ab['J'] = '𝓙', ab['K'] = '𝓚', ab['L'] = '𝓛', ab['M'] = '𝓜', ab['N'] = '𝓝', ab['O'] = '𝓞', ab['P'] = '𝓟', ab['Q'] = '𝓠', ab['R'] = '𝓡', ab['S'] = '𝓢', ab['T'] = '𝓣', ab['U'] = '𝓤', ab['V'] = '𝓥', ab['W'] = '𝓦', ab['X'] = '𝓧', ab['Y'] = '𝓨', ab['Z'] = '𝓩';
const cursiveCharMap = ab;
var ac = {};
ac['a'] = '𝔞', ac['b'] = '𝔟', ac['c'] = '𝔠', ac['d'] = '𝔡', ac['e'] = '𝔢', ac['f'] = '𝔣', ac['g'] = '𝔤', ac['h'] = '𝔥', ac['i'] = '𝔦', ac['j'] = '𝔧', ac['k'] = '𝔨', ac['l'] = '𝔩', ac['m'] = '𝔪', ac['n'] = '𝔫', ac['o'] = '𝔬', ac['p'] = '𝔭', ac['q'] = '𝔮', ac['r'] = '𝔯', ac['s'] = '𝔰', ac['t'] = '𝔱', ac['u'] = '𝔲', ac['v'] = '𝔳', ac['w'] = '𝔴', ac['x'] = '𝔵', ac['y'] = '𝔶', ac['z'] = '𝔷', ac['A'] = '𝔄', ac['B'] = '𝔅', ac['C'] = 'ℭ', ac['D'] = '𝔇', ac['E'] = '𝔈', ac['F'] = '𝔉', ac['G'] = '𝔊', ac['H'] = 'ℌ', ac['I'] = 'ℑ', ac['J'] = '𝔍', ac['K'] = '𝔎', ac['L'] = '𝔏', ac['M'] = '𝔐', ac['N'] = '𝔑', ac['O'] = '𝔒', ac['P'] = '𝔓', ac['Q'] = '𝔔', ac['R'] = 'ℜ', ac['S'] = '𝔖', ac['T'] = '𝔗', ac['U'] = '𝔘', ac['V'] = '𝔙', ac['W'] = '𝔚', ac['X'] = '𝔛', ac['Y'] = '𝔜', ac['Z'] = 'ℨ';
const oldEnglishCharMap = ac;
var ad = {};
ad['`'] = '`', ad['1'] = '１', ad['2'] = '２', ad['3'] = '３', ad['4'] = '４', ad['5'] = '５', ad['6'] = '６', ad['7'] = '７', ad['8'] = '８', ad['9'] = '９', ad['0'] = '０', ad['-'] = '－', ad['='] = '＝', ad['~'] = '~', ad['!'] = '！', ad['@'] = '＠', ad['#'] = '＃', ad['$'] = '＄', ad['%'] = '％', ad['^'] = '^', ad['&'] = '＆', ad['*'] = '＊', ad['('] = '（', ad[')'] = '）', ad['_'] = '_', ad['+'] = '＋', ad['q'] = 'ｑ', ad['w'] = 'ｗ', ad['e'] = 'ｅ', ad['r'] = 'ｒ', ad['t'] = 'ｔ', ad['y'] = 'ｙ', ad['u'] = 'ｕ', ad['i'] = 'ｉ', ad['o'] = 'ｏ', ad['p'] = 'ｐ', ad['['] = '[', ad[']'] = ']', ad['\x5c'] = '\x5c', ad['Q'] = 'Ｑ', ad['W'] = 'Ｗ', ad['E'] = 'Ｅ', ad['R'] = 'Ｒ', ad['T'] = 'Ｔ', ad['Y'] = 'Ｙ', ad['U'] = 'Ｕ', ad['I'] = 'Ｉ', ad['O'] = 'Ｏ', ad['P'] = 'Ｐ', ad['{'] = '{', ad['}'] = '}', ad['|'] = '|', ad['a'] = 'ａ', ad['s'] = 'ｓ', ad['d'] = 'ｄ', ad['f'] = 'ｆ', ad['g'] = 'ｇ', ad['h'] = 'ｈ', ad['j'] = 'ｊ', ad['k'] = 'ｋ', ad['l'] = 'ｌ', ad[';'] = '；', ad['\x27'] = '＇', ad['A'] = 'Ａ', ad['S'] = 'Ｓ', ad['D'] = 'Ｄ', ad['F'] = 'Ｆ', ad['G'] = 'Ｇ', ad['H'] = 'Ｈ', ad['J'] = 'Ｊ', ad['K'] = 'Ｋ', ad['L'] = 'Ｌ', ad[':'] = '：', ad['\x22'] = '\x22', ad['z'] = 'ｚ', ad['x'] = 'ｘ', ad['c'] = 'ｃ', ad['v'] = 'ｖ', ad['b'] = 'ｂ', ad['n'] = 'ｎ', ad['m'] = 'ｍ', ad[','] = '，', ad['.'] = '．', ad['/'] = '／', ad['Z'] = 'Ｚ', ad['X'] = 'Ｘ', ad['C'] = 'Ｃ', ad['V'] = 'Ｖ', ad['B'] = 'Ｂ', ad['N'] = 'Ｎ', ad['M'] = 'Ｍ', ad['<'] = '<', ad['>'] = '>', ad['?'] = '？';
const wideTextCharMap = ad;

function Lunicode() {
    var _0x23b519 = _0x1d931a,
        _0x135381 = {};
    _0x135381['a'] = 'ɐ', _0x135381['b'] = 'q', _0x135381['c'] = 'ɔ', _0x135381['d'] = 'p', _0x135381['e'] = 'ǝ', _0x135381['f'] = 'ɟ', _0x135381['g'] = 'ɓ', _0x135381['h'] = 'ɥ', _0x135381['i'] = 'ı', _0x135381['j'] = 'ɾ', _0x135381['k'] = 'ʞ', _0x135381['l'] = 'l', _0x135381['m'] = 'ɯ', _0x135381['n'] = 'u', _0x135381['r'] = 'ɹ', _0x135381['t'] = 'ʇ', _0x135381['v'] = 'ʌ', _0x135381['w'] = 'ʍ', _0x135381['y'] = 'ʎ', _0x135381['A'] = '∀', _0x135381['B'] = 'ᙠ', _0x135381['C'] = 'Ɔ', _0x135381['D'] = 'ᗡ', _0x135381['E'] = 'Ǝ', _0x135381['F'] = 'Ⅎ', _0x135381['G'] = '⅁', _0x135381['J'] = 'ſ', _0x135381['K'] = '⋊', _0x135381['L'] = '˥', _0x135381['M'] = 'W', _0x135381['P'] = 'Ԁ', _0x135381['Q'] = 'Ό', _0x135381['R'] = 'ᴚ', _0x135381['T'] = '⊥', _0x135381['U'] = '∩', _0x135381['V'] = 'Λ', _0x135381['Y'] = '⅄', _0x135381['1'] = '⇂', _0x135381['2'] = 'ᄅ', _0x135381['3'] = 'Ɛ', _0x135381['4'] = 'ㄣ', _0x135381['5'] = 'ގ', _0x135381['6'] = '9', _0x135381['7'] = 'ㄥ', _0x135381['&'] = '⅋', _0x135381['.'] = '˙', _0x135381['\x22'] = '„', _0x135381[';'] = '؛', _0x135381['['] = ']', _0x135381['('] = ')', _0x135381['{'] = '}', _0x135381['?'] = '¿', _0x135381['!'] = '¡', _0x135381['\x27'] = ',', _0x135381['<'] = '>', _0x135381['‾'] = '_', _0x135381['¯'] = '_', _0x135381['‿'] = '⁀', _0x135381['⁅'] = '⁆', _0x135381['∴'] = '∵', _0x135381['\x0d'] = '\x0a', _0x135381['ß'] = 'ᙠ', _0x135381['̈'] = '̤', _0x135381['ä'] = 'ɐ̤', _0x135381['ö'] = 'o̤', _0x135381['ü'] = 'n̤', _0x135381['Ä'] = '∀̤', _0x135381['Ö'] = 'O̤', _0x135381['Ü'] = '∩̤', _0x135381['´'] = '\x20̗', _0x135381['é'] = 'ǝ̗', _0x135381['á'] = 'ɐ̗', _0x135381['ó'] = 'o̗', _0x135381['ú'] = 'n̗', _0x135381['É'] = 'Ǝ̗', _0x135381['Á'] = '∀̗', _0x135381['Ó'] = 'O̗', _0x135381['Ú'] = '∩̗', _0x135381['`'] = '\x20̖', _0x135381['è'] = 'ǝ̖', _0x135381['à'] = 'ɐ̖', _0x135381['ò'] = 'o̖', _0x135381['ù'] = 'n̖', _0x135381['È'] = 'Ǝ̖', _0x135381['À'] = '∀̖', _0x135381['Ò'] = 'O̖', _0x135381['Ù'] = '∩̖', _0x135381['^'] = '\x20̮', _0x135381['ê'] = 'ǝ̮', _0x135381['â'] = 'ɐ̮', _0x135381['ô'] = 'o̮', _0x135381['û'] = 'n̮', _0x135381['Ê'] = 'Ǝ̮', _0x135381['Â'] = '∀̮', _0x135381['Ô'] = 'O̮', _0x135381['Û'] = '∩̮';
    var _0x249d6b = {};
    _0x249d6b['init'] = function() {
        var _0xb9842a = _0x554c;
        for (i in this['map']) this[_0xb9842a(0x543)][this[_0xb9842a(0x543)][i]] = i;
    }, _0x249d6b[_0x23b519(0x602)] = function(_0x23cbed) {
        var _0x41feac = _0x23b519;
        for (var _0x42a9fc, _0x13a42b = [], _0x11071f = 0x0, _0x5f1295 = _0x23cbed[_0x41feac(0x2c4)]; _0x5f1295 > _0x11071f; _0x11071f++) _0x42a9fc = _0x23cbed[_0x41feac(0x472)](_0x11071f), _0x11071f > 0x0 && ('̤' == _0x42a9fc || '̗' == _0x42a9fc || '̖' == _0x42a9fc || '̮' == _0x42a9fc) ? (_0x42a9fc = this[_0x41feac(0x543)][_0x23cbed[_0x41feac(0x472)](_0x11071f - 0x1) + _0x42a9fc], _0x13a42b[_0x41feac(0x4cc)]()) : (_0x42a9fc = this[_0x41feac(0x543)][_0x42a9fc], _0x41feac(0x40d) == typeof _0x42a9fc && (_0x42a9fc = _0x23cbed[_0x41feac(0x472)](_0x11071f))), _0x13a42b[_0x41feac(0x311)](_0x42a9fc);
        return _0x13a42b[_0x41feac(0x2be)]()[_0x41feac(0x5ac)]('');
    }, _0x249d6b['decode'] = function(_0x431fc9) {
        var _0x4af948 = _0x23b519;
        for (var _0x22cd78, _0x171be1 = [], _0x56cae4 = 0x0, _0x1db7af = _0x431fc9['length']; _0x1db7af > _0x56cae4; _0x56cae4++) _0x22cd78 = _0x431fc9[_0x4af948(0x472)](_0x56cae4), _0x56cae4 > 0x0 && ('̤' == _0x22cd78 || '̗' == _0x22cd78 || '̖' == _0x22cd78 || '̮' == _0x22cd78) ? (_0x22cd78 = this[_0x4af948(0x543)][_0x431fc9[_0x4af948(0x472)](_0x56cae4 - 0x1) + _0x22cd78], _0x171be1['pop']()) : (_0x22cd78 = this['map'][_0x22cd78], 'undefined' == typeof _0x22cd78 && (_0x22cd78 = _0x431fc9['charAt'](_0x56cae4))), _0x171be1[_0x4af948(0x311)](_0x22cd78);
        return _0x171be1[_0x4af948(0x2be)]()[_0x4af948(0x5ac)]('');
    }, _0x249d6b[_0x23b519(0x543)] = _0x135381;
    var _0x15c0ba = {};
    _0x15c0ba['a'] = 'ɒ', _0x15c0ba['b'] = 'd', _0x15c0ba['c'] = 'ɔ', _0x15c0ba['e'] = 'ɘ', _0x15c0ba['f'] = 'Ꮈ', _0x15c0ba['g'] = 'ǫ', _0x15c0ba['h'] = 'ʜ', _0x15c0ba['j'] = 'ꞁ', _0x15c0ba['k'] = 'ʞ', _0x15c0ba['l'] = '|', _0x15c0ba['n'] = 'ᴎ', _0x15c0ba['p'] = 'q', _0x15c0ba['r'] = 'ɿ', _0x15c0ba['s'] = 'ꙅ', _0x15c0ba['t'] = 'ƚ', _0x15c0ba['y'] = 'ʏ', _0x15c0ba['z'] = 'ƹ', _0x15c0ba['B'] = 'ᙠ', _0x15c0ba['C'] = 'Ɔ', _0x15c0ba['D'] = 'ᗡ', _0x15c0ba['E'] = 'Ǝ', _0x15c0ba['F'] = 'ꟻ', _0x15c0ba['G'] = 'Ꭾ', _0x15c0ba['J'] = 'Ⴑ', _0x15c0ba['K'] = '⋊', _0x15c0ba['L'] = '⅃', _0x15c0ba['N'] = 'Ͷ', _0x15c0ba['P'] = 'ꟼ', _0x15c0ba['Q'] = 'Ọ', _0x15c0ba['R'] = 'Я', _0x15c0ba['S'] = 'Ꙅ', _0x15c0ba['Z'] = 'Ƹ', _0x15c0ba['1'] = '', _0x15c0ba['2'] = '', _0x15c0ba['3'] = '', _0x15c0ba['4'] = '', _0x15c0ba['5'] = '', _0x15c0ba['6'] = '', _0x15c0ba['7'] = '', _0x15c0ba['&'] = '', _0x15c0ba[';'] = '', _0x15c0ba['['] = ']', _0x15c0ba['('] = ')', _0x15c0ba['{'] = '}', _0x15c0ba['?'] = '⸮', _0x15c0ba['<'] = '>', _0x15c0ba['ä'] = 'ɒ̈', _0x15c0ba['ß'] = 'ᙠ', _0x15c0ba['´'] = '`', _0x15c0ba['é'] = 'ɘ̀', _0x15c0ba['á'] = 'ɒ̀', _0x15c0ba['ó'] = 'ò', _0x15c0ba['ú'] = 'ù', _0x15c0ba['É'] = 'Ǝ̀', _0x15c0ba['Á'] = 'À', _0x15c0ba['Ó'] = 'Ò', _0x15c0ba['Ú'] = 'Ù', _0x15c0ba['`'] = '´', _0x15c0ba['è'] = 'ɘ́', _0x15c0ba['à'] = 'ɒ́', _0x15c0ba['È'] = 'Ǝ́', _0x15c0ba['ê'] = 'ɘ̂', _0x15c0ba['â'] = 'ɒ̂', _0x15c0ba['Ê'] = 'Ǝ̂', _0x15c0ba['Ø'] = 'ᴓ', _0x15c0ba['ø'] = 'ᴓ';
    var _0x43927d = {};
    _0x43927d[_0x23b519(0x2b5)] = function() {
        var _0x41bacf = _0x23b519;
        for (i in this[_0x41bacf(0x543)]) this['map'][this['map'][i]] = i;
    }, _0x43927d[_0x23b519(0x602)] = function(_0x1fcdf2) {
        var _0x19dd03 = _0x23b519;
        for (var _0x25ed72, _0x49bb92 = [], _0x3f3879 = [], _0x309083 = 0x0, _0x37f0fa = _0x1fcdf2[_0x19dd03(0x2c4)]; _0x37f0fa > _0x309083; _0x309083++) _0x25ed72 = _0x1fcdf2[_0x19dd03(0x472)](_0x309083), _0x309083 > 0x0 && ('̈' == _0x25ed72 || '̀' == _0x25ed72 || '́' == _0x25ed72 || '̂' == _0x25ed72) ? (_0x25ed72 = this[_0x19dd03(0x543)][_0x1fcdf2['charAt'](_0x309083 - 0x1) + _0x25ed72], _0x49bb92['pop']()) : (_0x25ed72 = this[_0x19dd03(0x543)][_0x25ed72], _0x19dd03(0x40d) == typeof _0x25ed72 && (_0x25ed72 = _0x1fcdf2[_0x19dd03(0x472)](_0x309083))), '\x0a' == _0x25ed72 ? (_0x3f3879[_0x19dd03(0x311)](_0x49bb92['reverse']()['join']('')), _0x49bb92 = []) : _0x49bb92[_0x19dd03(0x311)](_0x25ed72);
        return _0x3f3879[_0x19dd03(0x311)](_0x49bb92[_0x19dd03(0x2be)]()[_0x19dd03(0x5ac)]('')), _0x3f3879[_0x19dd03(0x5ac)]('\x0a');
    }, _0x43927d[_0x23b519(0x341)] = function(_0x3181cc) {
        var _0x1498d7 = _0x23b519;
        for (var _0x4751d5, _0x2f511e = [], _0xbb8db5 = [], _0xb9ed71 = 0x0, _0x3802d4 = _0x3181cc[_0x1498d7(0x2c4)]; _0x3802d4 > _0xb9ed71; _0xb9ed71++) _0x4751d5 = _0x3181cc[_0x1498d7(0x472)](_0xb9ed71), _0xb9ed71 > 0x0 && ('̈' == _0x4751d5 || '̀' == _0x4751d5 || '́' == _0x4751d5 || '̂' == _0x4751d5) ? (_0x4751d5 = this[_0x1498d7(0x543)][_0x3181cc[_0x1498d7(0x472)](_0xb9ed71 - 0x1) + _0x4751d5], _0x2f511e[_0x1498d7(0x4cc)]()) : (_0x4751d5 = this[_0x1498d7(0x543)][_0x4751d5], _0x1498d7(0x40d) == typeof _0x4751d5 && (_0x4751d5 = _0x3181cc[_0x1498d7(0x472)](_0xb9ed71))), '\x0a' == _0x4751d5 ? (_0xbb8db5[_0x1498d7(0x311)](_0x2f511e['reverse']()[_0x1498d7(0x5ac)]('')), _0x2f511e = []) : _0x2f511e[_0x1498d7(0x311)](_0x4751d5);
        return _0xbb8db5[_0x1498d7(0x311)](_0x2f511e[_0x1498d7(0x2be)]()[_0x1498d7(0x5ac)]('')), _0xbb8db5[_0x1498d7(0x5ac)]('\x0a');
    }, _0x43927d['map'] = _0x15c0ba;
    var _0x3d1611 = {};
    _0x3d1611['top'] = !0x0, _0x3d1611[_0x23b519(0x1d1)] = !0x0, _0x3d1611[_0x23b519(0x1df)] = !0x0, _0x3d1611['maxHeight'] = 0xf, _0x3d1611['randomization'] = 0x64;
    var _0x9300e = {};
    _0x9300e[_0x23b519(0x2b5)] = function() {
        var _0x30bab6 = _0x23b519;
        for (var _0xec0ca4 = 0x300; 0x315 >= _0xec0ca4; _0xec0ca4++) this[_0x30bab6(0x486)][_0x30bab6(0x311)](String['fromCharCode'](_0xec0ca4));
        for (var _0xec0ca4 = 0x316; 0x333 >= _0xec0ca4; _0xec0ca4++) 0x31a != _0xec0ca4 && 0x31b != _0xec0ca4 && this[_0x30bab6(0x44a)][_0x30bab6(0x311)](String['fromCharCode'](_0xec0ca4));
        this['diacriticsTop'][_0x30bab6(0x311)](String['fromCharCode'](0x31a)), this[_0x30bab6(0x486)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x31b));
        for (var _0xec0ca4 = 0x334; 0x338 >= _0xec0ca4; _0xec0ca4++) this[_0x30bab6(0x4d6)]['push'](String[_0x30bab6(0x59d)](_0xec0ca4));
        for (var _0xec0ca4 = 0x339; 0x33c >= _0xec0ca4; _0xec0ca4++) this[_0x30bab6(0x44a)][_0x30bab6(0x311)](String['fromCharCode'](_0xec0ca4));
        for (var _0xec0ca4 = 0x33d; 0x344 >= _0xec0ca4; _0xec0ca4++) this[_0x30bab6(0x486)][_0x30bab6(0x311)](String['fromCharCode'](_0xec0ca4));
        this[_0x30bab6(0x486)]['push'](String[_0x30bab6(0x59d)](0x344)), this['diacriticsBottom'][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x345)), this[_0x30bab6(0x486)][_0x30bab6(0x311)](String['fromCharCode'](0x346)), this[_0x30bab6(0x44a)][_0x30bab6(0x311)](String['fromCharCode'](0x347)), this[_0x30bab6(0x44a)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x348)), this['diacriticsBottom']['push'](String[_0x30bab6(0x59d)](0x349)), this['diacriticsTop']['push'](String[_0x30bab6(0x59d)](0x34a)), this[_0x30bab6(0x486)]['push'](String['fromCharCode'](0x34b)), this[_0x30bab6(0x486)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x34c)), this[_0x30bab6(0x44a)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x34d)), this[_0x30bab6(0x44a)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x34e)), this[_0x30bab6(0x486)]['push'](String[_0x30bab6(0x59d)](0x350)), this[_0x30bab6(0x486)]['push'](String[_0x30bab6(0x59d)](0x351)), this[_0x30bab6(0x486)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x352)), this[_0x30bab6(0x44a)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x353)), this[_0x30bab6(0x44a)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x354)), this['diacriticsBottom'][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x355)), this['diacriticsBottom'][_0x30bab6(0x311)](String['fromCharCode'](0x356)), this[_0x30bab6(0x486)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x357)), this[_0x30bab6(0x486)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x358)), this[_0x30bab6(0x44a)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x359)), this[_0x30bab6(0x44a)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x35a)), this[_0x30bab6(0x486)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x35b)), this['diacriticsBottom'][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x35c)), this[_0x30bab6(0x486)][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x35d)), this['diacriticsTop'][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x35d)), this['diacriticsBottom'][_0x30bab6(0x311)](String[_0x30bab6(0x59d)](0x35f)), this[_0x30bab6(0x486)][_0x30bab6(0x311)](String['fromCharCode'](0x360)), this[_0x30bab6(0x486)][_0x30bab6(0x311)](String['fromCharCode'](0x361));
    }, _0x9300e[_0x23b519(0x602)] = function(_0x1304bc) {
        var _0x400d67 = _0x23b519,
            _0x20e81f, _0x128763 = '';
        for (i in _0x1304bc) {
            if (_0x20e81f = _0x1304bc[i], this[_0x400d67(0x218)][_0x400d67(0x1d1)] && (_0x20e81f += this[_0x400d67(0x4d6)][Math[_0x400d67(0x4fa)](Math[_0x400d67(0x553)]() * this[_0x400d67(0x4d6)][_0x400d67(0x2c4)])]), this[_0x400d67(0x218)][_0x400d67(0x662)]) {
                for (var _0x317011 = this[_0x400d67(0x486)][_0x400d67(0x2c4)] - 0x1, _0x289431 = 0x0, _0x3e1b34 = this[_0x400d67(0x218)][_0x400d67(0x371)] - Math[_0x400d67(0x553)]() * (this[_0x400d67(0x218)]['randomization'] / 0x64 * this[_0x400d67(0x218)][_0x400d67(0x371)]); _0x3e1b34 > _0x289431; _0x289431++) _0x20e81f += this[_0x400d67(0x486)][Math[_0x400d67(0x4fa)](Math[_0x400d67(0x553)]() * _0x317011)];
            }
            if (this[_0x400d67(0x218)]['bottom']) {
                for (var _0x49f542 = this[_0x400d67(0x44a)][_0x400d67(0x2c4)] - 0x1, _0x289431 = 0x0, _0x3e1b34 = this[_0x400d67(0x218)][_0x400d67(0x371)] - Math[_0x400d67(0x553)]() * (this[_0x400d67(0x218)][_0x400d67(0x54b)] / 0x64 * this[_0x400d67(0x218)][_0x400d67(0x371)]); _0x3e1b34 > _0x289431; _0x289431++) _0x20e81f += this[_0x400d67(0x44a)][Math[_0x400d67(0x4fa)](Math[_0x400d67(0x553)]() * _0x49f542)];
            }
            _0x128763 += _0x20e81f;
        }
        return _0x128763;
    }, _0x9300e[_0x23b519(0x341)] = function(_0x39503c) {
        var _0x2da8ef = _0x23b519,
            _0x260500, _0x259dff = '';
        for (i in _0x39503c) _0x260500 = _0x39503c[i][_0x2da8ef(0x230)](0x0), (0x300 > _0x260500 || _0x260500 > 0x361) && (_0x259dff += _0x39503c[i]);
        return _0x259dff;
    }, _0x9300e[_0x23b519(0x486)] = [], _0x9300e[_0x23b519(0x4d6)] = [], _0x9300e[_0x23b519(0x44a)] = [], _0x9300e['options'] = _0x3d1611;
    var _0x4cbeae = {};
    _0x4cbeae['init'] = function() {
        var _0x49fe4e = _0x23b519;
        for (var _0x5a1b80 = 0x31; 0x39 >= _0x5a1b80; _0x5a1b80++) this[_0x49fe4e(0x543)][String[_0x49fe4e(0x59d)](_0x5a1b80)] = String[_0x49fe4e(0x59d)](_0x5a1b80 + 0x242f);
        this[_0x49fe4e(0x543)][0x0] = '⓪';
        for (var _0x5a1b80 = 0x41; 0x5a >= _0x5a1b80; _0x5a1b80++) this[_0x49fe4e(0x543)][String[_0x49fe4e(0x59d)](_0x5a1b80)] = String[_0x49fe4e(0x59d)](_0x5a1b80 + 0x2475);
        for (var _0x5a1b80 = 0x61; 0x7a >= _0x5a1b80; _0x5a1b80++) this[_0x49fe4e(0x543)][String[_0x49fe4e(0x59d)](_0x5a1b80)] = String[_0x49fe4e(0x59d)](_0x5a1b80 + 0x246f);
        for (_0x5a1b80 in this['map']) this[_0x49fe4e(0x219)][this[_0x49fe4e(0x543)][_0x5a1b80]] = _0x5a1b80;
    }, _0x4cbeae[_0x23b519(0x602)] = function(_0x5a8791) {
        var _0x2f7112 = _0x23b519,
            _0x55dfb8, _0x1d0744 = '',
            _0xb66c28 = !0x0;
        for (i in _0x5a8791) _0x55dfb8 = this[_0x2f7112(0x543)][_0x5a8791[i]], _0x2f7112(0x40d) == typeof _0x55dfb8 && (_0x5a8791[i]['charCodeAt'](0x0) >= 0x21 ? (_0x55dfb8 = _0x5a8791[i] + String[_0x2f7112(0x59d)](0x20dd), _0xb66c28 || (_0x55dfb8 = String[_0x2f7112(0x59d)](0x202f) + String[_0x2f7112(0x59d)](0xa0) + String[_0x2f7112(0x59d)](0xa0) + String[_0x2f7112(0x59d)](0x202f) + _0x55dfb8)) : _0x55dfb8 = _0x5a8791[i]), _0x1d0744 += _0x55dfb8, _0xb66c28 = '\x0a' == _0x55dfb8;
        return _0x1d0744;
    }, _0x4cbeae[_0x23b519(0x341)] = function(_0x370770) {
        var _0x58f31c = _0x23b519,
            _0x13b08f, _0x468228 = '',
            _0x42a2b8 = '';
        for (i in _0x370770) _0x13b08f = this[_0x58f31c(0x219)][_0x370770[i]], _0x468228 += _0x58f31c(0x40d) == typeof _0x13b08f ? _0x370770[i] : _0x13b08f;
        for (i in _0x468228) _0x13b08f = _0x468228[i][_0x58f31c(0x230)](0x0), 0xa0 != _0x13b08f && 0x202f != _0x13b08f && 0x20dd != _0x13b08f && (_0x42a2b8 += _0x468228[i]);
        return _0x42a2b8;
    }, _0x4cbeae[_0x23b519(0x543)] = {}, _0x4cbeae[_0x23b519(0x219)] = {};
    var _0x5b2f2e = {};
    _0x5b2f2e[_0x23b519(0x2b5)] = function() {}, _0x5b2f2e[_0x23b519(0x602)] = function(_0x518f6f) {
        var _0x97ecb5 = _0x23b519,
            _0x175b0f, _0x41d2b9 = '',
            _0x4349a3 = !0x0;
        for (i in _0x518f6f) _0x518f6f[i][_0x97ecb5(0x230)](0x0) >= 0x21 ? (_0x175b0f = _0x518f6f[i] + String[_0x97ecb5(0x59d)](0x20de), _0x4349a3 || (_0x175b0f = String[_0x97ecb5(0x59d)](0x202f) + String[_0x97ecb5(0x59d)](0xa0) + String[_0x97ecb5(0x59d)](0xa0) + String[_0x97ecb5(0x59d)](0x202f) + _0x175b0f)) : _0x175b0f = _0x518f6f[i], _0x41d2b9 += _0x175b0f, _0x4349a3 = '\x0a' == _0x175b0f;
        return _0x41d2b9;
    }, _0x5b2f2e[_0x23b519(0x341)] = function(_0x209fff) {
        var _0x27572c = _0x23b519,
            _0x3de3ec, _0x47cb59 = '';
        for (i in _0x209fff) _0x3de3ec = _0x209fff[i][_0x27572c(0x230)](0x0), 0xa0 != _0x3de3ec && 0x202f != _0x3de3ec && 0x20de != _0x3de3ec && (_0x47cb59 += _0x209fff[i]);
        return _0x47cb59;
    };
    var _0x2841ae = {};
    _0x2841ae[_0x23b519(0x2b5)] = function() {}, _0x2841ae['encode'] = function(_0x5ae841) {
        var _0x49afcc = _0x23b519,
            _0x102d1d, _0x1c1592 = '',
            _0x428952 = !0x0;
        for (i in _0x5ae841) _0x5ae841[i][_0x49afcc(0x230)](0x0) >= 0x21 ? (_0x102d1d = _0x5ae841[i] + String[_0x49afcc(0x59d)](0x20e3), _0x428952 || (_0x102d1d = String['fromCharCode'](0xa0) + String[_0x49afcc(0x59d)](0xa0) + String[_0x49afcc(0x59d)](0xa0) + _0x102d1d)) : _0x102d1d = _0x5ae841[i], _0x1c1592 += _0x102d1d, _0x428952 = '\x0a' == _0x102d1d;
        return _0x1c1592;
    }, _0x2841ae['decode'] = function(_0x2d45d4) {
        var _0xf536 = _0x23b519,
            _0x4c60a2, _0x6f4f6c = '';
        for (i in _0x2d45d4) _0x4c60a2 = _0x2d45d4[i][_0xf536(0x230)](0x0), 0xa0 != _0x4c60a2 && 0x202f != _0x4c60a2 && 0x20e3 != _0x4c60a2 && (_0x6f4f6c += _0x2d45d4[i]);
        return _0x6f4f6c;
    };
    var _0x452a8e = {};
    _0x452a8e['a'] = 'ą', _0x452a8e['b'] = 'ҍ', _0x452a8e['c'] = 'ç', _0x452a8e['d'] = 'ժ', _0x452a8e['e'] = 'ҽ', _0x452a8e['f'] = 'ƒ', _0x452a8e['g'] = 'ց', _0x452a8e['h'] = 'հ', _0x452a8e['i'] = 'ì', _0x452a8e['j'] = 'ʝ', _0x452a8e['k'] = 'ҟ', _0x452a8e['l'] = 'Ӏ', _0x452a8e['m'] = 'ʍ', _0x452a8e['n'] = 'ղ', _0x452a8e['o'] = 'օ', _0x452a8e['p'] = 'ք', _0x452a8e['q'] = 'զ', _0x452a8e['r'] = 'ɾ', _0x452a8e['s'] = 'ʂ', _0x452a8e['t'] = 'է', _0x452a8e['u'] = 'մ', _0x452a8e['v'] = 'ѵ', _0x452a8e['w'] = 'ա', _0x452a8e['x'] = '×', _0x452a8e['y'] = 'վ', _0x452a8e['z'] = 'Հ', _0x452a8e['A'] = 'Ⱥ', _0x452a8e['B'] = 'β', _0x452a8e['C'] = '↻', _0x452a8e['D'] = 'Ꭰ', _0x452a8e['E'] = 'Ɛ', _0x452a8e['F'] = 'Ƒ', _0x452a8e['G'] = 'Ɠ', _0x452a8e['H'] = 'Ƕ', _0x452a8e['I'] = 'į', _0x452a8e['J'] = 'ل', _0x452a8e['K'] = 'Ҡ', _0x452a8e['L'] = 'Ꝉ', _0x452a8e['M'] = 'Ɱ', _0x452a8e['N'] = 'ហ', _0x452a8e['O'] = 'ට', _0x452a8e['P'] = 'φ', _0x452a8e['Q'] = 'Ҩ', _0x452a8e['R'] = 'འ', _0x452a8e['S'] = 'Ϛ', _0x452a8e['T'] = 'Ͳ', _0x452a8e['U'] = 'Ա', _0x452a8e['V'] = 'Ỽ', _0x452a8e['W'] = 'చ', _0x452a8e['X'] = 'ჯ', _0x452a8e['Y'] = 'Ӌ', _0x452a8e['Z'] = 'ɀ', _0x452a8e['0'] = '⊘', _0x452a8e['1'] = _0x23b519(0x1e5), _0x452a8e['2'] = 'ϩ', _0x452a8e['3'] = 'Ӡ', _0x452a8e['4'] = '५', _0x452a8e['5'] = 'Ƽ', _0x452a8e['6'] = 'Ϭ', _0x452a8e['7'] = '7', _0x452a8e['8'] = _0x23b519(0x1e5), _0x452a8e['9'] = '९', _0x452a8e['&'] = '⅋', _0x452a8e['('] = '{', _0x452a8e[')'] = '}', _0x452a8e['{'] = '(', _0x452a8e['}'] = ')', _0x452a8e['ä'] = 'ą̈', _0x452a8e['ö'] = 'օ̈', _0x452a8e['ü'] = 'մ̈', _0x452a8e['Ä'] = 'Ⱥ̈', _0x452a8e['Ö'] = 'ට̈', _0x452a8e['Ü'] = 'Ա̈', _0x452a8e['é'] = 'ҽ́', _0x452a8e['á'] = 'ą́', _0x452a8e['ó'] = 'օ́', _0x452a8e['ú'] = 'մ́', _0x452a8e['É'] = 'Ɛ́', _0x452a8e['Á'] = 'Ⱥ́', _0x452a8e['Ó'] = 'ට́', _0x452a8e['Ú'] = 'Ա́', _0x452a8e['è'] = 'ҽ̀', _0x452a8e['à'] = 'ą̀', _0x452a8e['ò'] = 'օ̀', _0x452a8e['ù'] = 'մ̀', _0x452a8e['È'] = 'Ɛ̀', _0x452a8e['À'] = 'Ⱥ̀', _0x452a8e['Ò'] = 'ට̀', _0x452a8e['Ù'] = 'Ա̀', _0x452a8e['ê'] = 'ҽ̂', _0x452a8e['â'] = 'ą̂', _0x452a8e['ô'] = 'օ̂', _0x452a8e['û'] = 'մ̂', _0x452a8e['Ê'] = 'Ɛ̂', _0x452a8e['Â'] = 'Ⱥ̂', _0x452a8e['Ô'] = 'ට̂', _0x452a8e['Û'] = 'Ա̂';
    var _0x3bb81c = {};
    _0x3bb81c[_0x23b519(0x2b5)] = function() {
        var _0x2ae16e = _0x23b519;
        for (i in this['map']) this['map'][this[_0x2ae16e(0x543)][i]] = i;
    }, _0x3bb81c[_0x23b519(0x602)] = function(_0x233df3) {
        var _0x5e1ef5 = _0x23b519;
        for (var _0x17ee7d, _0x41ff41 = '', _0x407df3 = 0x0, _0x356b4f = _0x233df3['length']; _0x356b4f > _0x407df3; _0x407df3++) _0x17ee7d = this['map'][_0x233df3[_0x5e1ef5(0x472)](_0x407df3)], _0x5e1ef5(0x40d) == typeof _0x17ee7d && (_0x17ee7d = _0x233df3['charAt'](_0x407df3)), _0x41ff41 += _0x17ee7d;
        return _0x41ff41;
    }, _0x3bb81c[_0x23b519(0x341)] = function(_0x50a296) {
        var _0x4e292e = _0x23b519;
        for (var _0x4d557d, _0x179014 = '', _0x5bd32d = 0x0, _0x1b4e30 = _0x50a296[_0x4e292e(0x2c4)]; _0x1b4e30 > _0x5bd32d; _0x5bd32d++) _0x4d557d = this[_0x4e292e(0x543)][_0x50a296['charAt'](_0x5bd32d)], 'undefined' == typeof _0x4d557d && (_0x4d557d = _0x50a296[_0x4e292e(0x472)](_0x5bd32d)), _0x179014 += _0x4d557d;
        return _0x179014;
    }, _0x3bb81c[_0x23b519(0x543)] = _0x452a8e;
    var _0x4f470c = {};
    _0x4f470c['A'] = 'ᴀ', _0x4f470c['B'] = 'ʙ', _0x4f470c['C'] = 'ᴄ', _0x4f470c['D'] = 'ᴅ', _0x4f470c['E'] = 'ᴇ', _0x4f470c['F'] = 'ꜰ', _0x4f470c['G'] = 'ɢ', _0x4f470c['H'] = 'ʜ', _0x4f470c['I'] = 'ɪ', _0x4f470c['J'] = 'ᴊ', _0x4f470c['K'] = 'ᴋ', _0x4f470c['L'] = 'ʟ', _0x4f470c['M'] = 'ᴍ', _0x4f470c['N'] = 'ɴ', _0x4f470c['O'] = 'ᴏ', _0x4f470c['P'] = 'ᴘ', _0x4f470c['Q'] = 'Q', _0x4f470c['R'] = 'ʀ', _0x4f470c['S'] = 'ꜱ', _0x4f470c['T'] = 'ᴛ', _0x4f470c['U'] = 'ᴜ', _0x4f470c['V'] = 'ᴠ', _0x4f470c['W'] = 'ᴡ', _0x4f470c['X'] = 'x', _0x4f470c['Y'] = 'ʏ', _0x4f470c['Z'] = 'ᴢ';
    var _0x3368c3 = {};
    _0x3368c3[_0x23b519(0x2b5)] = function() {
        var _0x50f662 = _0x23b519;
        for (i in this[_0x50f662(0x543)]) this[_0x50f662(0x543)][this[_0x50f662(0x543)][i]] = i;
    }, _0x3368c3[_0x23b519(0x602)] = function(_0xd07ceb) {
        var _0x232752 = _0x23b519,
            _0xfa235f, _0x475491 = '';
        _0xd07ceb = _0xd07ceb[_0x232752(0x668)]();
        for (var _0x3894bf = 0x0, _0x17a790 = _0xd07ceb['length']; _0x17a790 > _0x3894bf; _0x3894bf++) _0xfa235f = this[_0x232752(0x543)][_0xd07ceb[_0x232752(0x472)](_0x3894bf)], _0x232752(0x40d) == typeof _0xfa235f && (_0xfa235f = _0xd07ceb[_0x232752(0x472)](_0x3894bf)), _0x475491 += _0xfa235f;
        return _0x475491;
    }, _0x3368c3[_0x23b519(0x341)] = function(_0x4ac74d) {
        var _0x12ea09 = _0x23b519;
        for (var _0x4985b1, _0x12d15e = '', _0x2e97dc = 0x0, _0x4a6993 = _0x4ac74d[_0x12ea09(0x2c4)]; _0x4a6993 > _0x2e97dc; _0x2e97dc++) _0x4985b1 = this['map'][_0x4ac74d['charAt'](_0x2e97dc)], _0x12ea09(0x40d) == typeof _0x4985b1 && (_0x4985b1 = _0x4ac74d[_0x12ea09(0x472)](_0x2e97dc)), _0x12d15e += _0x4985b1;
        return _0x12d15e;
    }, _0x3368c3[_0x23b519(0x543)] = _0x4f470c;
    var _0x415f1b = {};
    _0x415f1b[_0x23b519(0x3f4)] = _0x249d6b, _0x415f1b['mirror'] = _0x43927d, _0x415f1b[_0x23b519(0x1a6)] = _0x9300e, _0x415f1b[_0x23b519(0x1d3)] = _0x4cbeae, _0x415f1b[_0x23b519(0x37f)] = _0x5b2f2e, _0x415f1b[_0x23b519(0x557)] = _0x2841ae, _0x415f1b[_0x23b519(0x593)] = _0x3bb81c, _0x415f1b['tiny'] = _0x3368c3, this[_0x23b519(0x317)] = _0x415f1b;
    for (i in this[_0x23b519(0x317)]) this[_0x23b519(0x317)][i][_0x23b519(0x2b5)]();
    this['getHTML'] = function(_0x4f1be6) {
        var _0x5e9f9e = _0x23b519;
        for (var _0x547f25, _0x49bace = '', _0x460da3 = !0x0, _0x1ec938 = 0x0, _0x197e8c = 0x0, _0x58e2aa = 0x0, _0x4f1d93 = _0x4f1be6[_0x5e9f9e(0x2c4)]; _0x4f1d93 > _0x58e2aa; _0x58e2aa++) _0x547f25 = _0x4f1be6[_0x5e9f9e(0x230)](_0x58e2aa), 0xa == _0x547f25 || 0xd == _0x547f25 ? (_0x49bace += _0x5e9f9e(0x364), _0x460da3 = !0x0) : 0x20 == _0x547f25 ? _0x460da3 ? (_0x49bace += '\x20', _0x460da3 = !0x1) : (_0x49bace += '\x20', _0x460da3 = !0x0) : (_0x547f25 >= 0xd800 && 0xdbff >= _0x547f25 ? (_0x1ec938 = _0x547f25, _0x197e8c = 0x0) : _0x1ec938 > 0x0 ? (_0x547f25 >= 0xdc00 && 0xdfff >= _0x547f25 && (_0x197e8c = 0x400 * (_0x1ec938 - 0xd800) + (_0x547f25 - 0xdc00) + 0x10000), _0x1ec938 = 0x0) : _0x197e8c = _0x547f25, 0x0 != _0x197e8c && (_0x49bace += _0x5e9f9e(0x5c4) + _0x197e8c[_0x5e9f9e(0x5d6)](0x10) + ';', _0x460da3 = !0x0));
        return _0x49bace;
    };
}

function cuteText(_0x50854d) {
    var _0x3aac2e = _0x1d931a;
    if (_0x50854d[_0x3aac2e(0x5a6)]() === '') return '';
    qi = -0x1;
    var _0x2b31f7 = boundingString(Math[_0x3aac2e(0x4fa)](Math[_0x3aac2e(0x553)]() * 0x2) + 0x1);
    return _0x2b31f7 + _0x3aac2e(0x277) + _0x50854d[_0x3aac2e(0x3a1)](/([!?.]+)/gi)[_0x3aac2e(0x543)](cuteSentence)[_0x3aac2e(0x5ac)]('') + '\x20\x20🎀\x20\x20' + esrever[_0x3aac2e(0x2be)](_0x2b31f7);
}

function cuteSentence(_0xbd2d5c) {
    var _0x325ac5 = _0x1d931a;
    return _0xbd2d5c[_0x325ac5(0x3a1)](/([\s,]+)/gi)[_0x325ac5(0x543)](cuteWord)[_0x325ac5(0x5ac)]('');
}

function cuteWord(_0x2d6b3a) {
    var _0x528fff = _0x1d931a;
    if (_0x2d6b3a === '' || /[[!?.\s,]+]/gi [_0x528fff(0x247)](_0x2d6b3a)) return _0x2d6b3a;
    return _0x2d6b3a = roundReplace(_0x2d6b3a), _0x2d6b3a = punctReplace(_0x2d6b3a), _0x2d6b3a = emojiReplace(_0x2d6b3a), scriptify(_0x2d6b3a);
}
var qi = -0x1,
    qa = ['❝', '❞'];

function quotes() {
    qi++;
    if (qi === 0x2) qi = 0x0;
    return qa[qi];
}

function punctReplace(_0x2fdf60) {
    var _0x1375b2 = _0x1d931a;
    return _0x2fdf60['split']('')[_0x1375b2(0x543)](function(_0x10a646) {
        if (_0x10a646 === '!') return randomElement(['❣', '❢']);
        else {
            if (_0x10a646 === '?') return randomElement(['¿', '?']);
            else {
                if (_0x10a646 === '\x22') return quotes();
                else return _0x10a646;
            }
        }
    })[_0x1375b2(0x5ac)]('');
}

function emojiReplace(_0x40eb8b) {
    var _0x2ea854 = _0x1d931a;
    return _0x40eb8b['replace'](':)', randomElement(emoji[':)']))[_0x2ea854(0x344)]('(:', randomElement(emoji[':)']))[_0x2ea854(0x344)]('^^', randomElement(emoji['^^']))[_0x2ea854(0x344)](':P', randomElement(emoji[':p']))[_0x2ea854(0x344)](':p', randomElement(emoji[':p']))[_0x2ea854(0x344)](':D', randomElement(emoji[':D']))[_0x2ea854(0x344)]('<3', randomElement(emoji['<3']))[_0x2ea854(0x344)](_0x2ea854(0x3b8), randomElement(emoji[_0x2ea854(0x3b8)]))['replace'](_0x2ea854(0x41b), randomElement(emoji['(y)']));
}

function roundReplace(_0x5c6227) {
    var _0x2544fa = _0x1d931a;
    return _0x5c6227[_0x2544fa(0x3a1)]('')[_0x2544fa(0x543)](function(_0x368a55) {
        var _0x100bc1 = _0x2544fa;
        return _0x368a55[_0x100bc1(0x43c)]() === 'o' || _0x368a55 === '0' ? randomElement(round) : _0x368a55;
    })['join']('');
}
var ar = {};
ar[':)'] = [_0x1d931a(0x5bd), _0x1d931a(0x5ee), '(ɔ◔‿◔)ɔ', _0x1d931a(0x420), _0x1d931a(0x416), _0x1d931a(0x59a), _0x1d931a(0x5f6), '😍', 'ツ', '(✿ヘᴥヘ)', _0x1d931a(0x469), _0x1d931a(0x46d), _0x1d931a(0x511), _0x1d931a(0x4d7), _0x1d931a(0x30d), _0x1d931a(0x5d8), _0x1d931a(0x630)], ar['^^'] = [_0x1d931a(0x66b), '(✿^▽^)', _0x1d931a(0x5c3), _0x1d931a(0x4bc), _0x1d931a(0x57e), _0x1d931a(0x520), _0x1d931a(0x256), _0x1d931a(0x450), _0x1d931a(0x35e), '⁀‿⁀', ''], ar[':p'] = [':Þ', ''], ar[':D'] = [_0x1d931a(0x332), _0x1d931a(0x5b2), 'ᕕ(ᐛ)ᕗ'], ar['<3'] = ['♡', '❤', '♥', '❥', '💘', '💙', '💗', '💖', '💕', '💓', '💞', '💝', '💟'], ar[_0x1d931a(0x3b8)] = ['👍', '👌'];
var emoji = ar,
    round = ['❁', '🌺', '❀', '💮', '🏵', '🌸', '☯', '😍', '♡', '🍩', '🍬', '💙', '🌞', '💍', '🍪', '❤', '💗', '🍑', '💞'],
    food = ['🍬', '🍭', '🍒', '🍎', '🍉', '🍇', '🍓', '🍌', '🍑', '🍰', '🎂', '🍩', '🍪', '🍧', '🍦', '🍫', '🍡'],
    flowers = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    twinkles = ['⚛', '🌌', '🌠', '*', ':', '｡', '･ﾟ', '✧', '✮', '★', '✩', '⋆', '.', '°', '`', '✴', '｡', '✴', '⋆', '✳', '✶', '✷', '❈'],
    animals = ['🐯', '🐎', '🐖', '🐷', '🐏', '🐑', '🐐', '🐫', '🐘', '🐭', '🐁', '🐀', '🐹', '🐰', '🐇', '🐿', '🐻', '🐨', '🐼', '🐾', '🐔', '🐓', '🐣', '🐤', '🐥', '🐦', '🐧', '🕊', '🐸', '🐢', '🐳', '🐋', '🐬', '🐟', '🐠', '🐡', '🐙', '🐚', '🐌', '🐞'],
    plants = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    misc = ['🌌', '🌠', '🎉', '🎊', '🎈', '💌', '🎎', '🎁', '🎀', '🕯', '🔮', '🛀', '🎖', '🏆', '🏅', '👑', '💍', '👶', '👼', '👸', '👯', '👒', '👻'],
    music = ['♫', '♬', '♪', '♩', '°', '｡', '✧', '🎻', '🎺', '🎸', '🎷', '📯'],
    flourish = [_0x1d931a(0x2cd), 'ıllıllı\x20', _0x1d931a(0x35c), '°°°·.°·..·°¯°·._.·\x20', _0x1d931a(0x2a0), _0x1d931a(0x36f), _0x1d931a(0x4df), _0x1d931a(0x3a2), _0x1d931a(0x275), _0x1d931a(0x303), _0x1d931a(0x31d), _0x1d931a(0x308), _0x1d931a(0x655), _0x1d931a(0x635), _0x1d931a(0x1ff), _0x1d931a(0x5d1), _0x1d931a(0x190), _0x1d931a(0x1d6), _0x1d931a(0x3bf), _0x1d931a(0x5fa), _0x1d931a(0x392), '.o0×X×0o.\x20', _0x1d931a(0x5f3), '`•.¸¸.•´´¯`••._.•\x20', _0x1d931a(0x249), _0x1d931a(0x4a0), _0x1d931a(0x390), _0x1d931a(0x536), '๑۞๑,¸¸,ø¤º°`°๑۩\x20', _0x1d931a(0x340), _0x1d931a(0x3a9), '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', _0x1d931a(0x55b), _0x1d931a(0x2b7)];

function boundingString(_0x19b6c9) {
    return randomElement([foodString, twinkleString, animalString, flourishString])(_0x19b6c9);
}

function foodString(_0x38c3f9) {
    var _0x48adeb = _0x1d931a;
    return new Array(_0x38c3f9 + 0x1)[_0x48adeb(0x5ac)]('0')[_0x48adeb(0x3a1)]('')[_0x48adeb(0x543)](function(_0x626134) {
        return randomElement(food);
    })['join'](_0x48adeb(0x1e9));
}

function twinkleString(_0x1ca65f) {
    var _0x31b70d = _0x1d931a;
    return new Array(_0x1ca65f + 0x1)[_0x31b70d(0x5ac)]('0')['split']('')[_0x31b70d(0x543)](function() {
        return randomElement(twinkles);
    })[_0x31b70d(0x5ac)]('');
}

function animalString(_0x4ce934) {
    var _0x1dad9f = _0x1d931a;
    return new Array(_0x4ce934 + 0x1)[_0x1dad9f(0x5ac)]('0')[_0x1dad9f(0x3a1)]('')[_0x1dad9f(0x543)](function(_0x131b0f) {
        return randomElement(animals);
    })[_0x1dad9f(0x5ac)](_0x1dad9f(0x1e9));
}

function flourishString(_0x21bc9a) {
    return randomElement(flourish);
}

function scriptify(_0x51a55e) {
    var _0xa689e = _0x1d931a,
        _0x502b3e = {};
    _0x502b3e['0'] = '𝟢', _0x502b3e['1'] = '𝟣', _0x502b3e['2'] = '𝟤', _0x502b3e['3'] = '𝟥', _0x502b3e['4'] = '𝟦', _0x502b3e['5'] = '𝟧', _0x502b3e['6'] = '𝟨', _0x502b3e['7'] = '𝟩', _0x502b3e['8'] = '𝟪', _0x502b3e['9'] = '𝟫', _0x502b3e['a'] = '𝒶', _0x502b3e['b'] = '𝒷', _0x502b3e['c'] = '𝒸', _0x502b3e['d'] = '𝒹', _0x502b3e['e'] = '𝑒', _0x502b3e['f'] = '𝒻', _0x502b3e['g'] = '𝑔', _0x502b3e['h'] = '𝒽', _0x502b3e['i'] = '𝒾', _0x502b3e['j'] = '𝒿', _0x502b3e['k'] = '𝓀', _0x502b3e['l'] = '𝓁', _0x502b3e['m'] = '𝓂', _0x502b3e['n'] = '𝓃', _0x502b3e['o'] = '𝑜', _0x502b3e['p'] = '𝓅', _0x502b3e['q'] = '𝓆', _0x502b3e['r'] = '𝓇', _0x502b3e['s'] = '𝓈', _0x502b3e['t'] = '𝓉', _0x502b3e['u'] = '𝓊', _0x502b3e['v'] = '𝓋', _0x502b3e['w'] = '𝓌', _0x502b3e['x'] = '𝓍', _0x502b3e['y'] = '𝓎', _0x502b3e['z'] = '𝓏', _0x502b3e['A'] = '𝒜', _0x502b3e['B'] = '𝐵', _0x502b3e['C'] = '𝒞', _0x502b3e['D'] = '𝒟', _0x502b3e['E'] = '𝐸', _0x502b3e['F'] = '𝐹', _0x502b3e['G'] = '𝒢', _0x502b3e['H'] = '𝐻', _0x502b3e['I'] = '𝐼', _0x502b3e['J'] = '𝒥', _0x502b3e['K'] = '𝒦', _0x502b3e['L'] = '𝐿', _0x502b3e['M'] = '𝑀', _0x502b3e['N'] = '𝒩', _0x502b3e['O'] = '𝒪', _0x502b3e['P'] = '𝒫', _0x502b3e['Q'] = '𝒬', _0x502b3e['R'] = '𝑅', _0x502b3e['S'] = '𝒮', _0x502b3e['T'] = '𝒯', _0x502b3e['U'] = '𝒰', _0x502b3e['V'] = '𝒱', _0x502b3e['W'] = '𝒲', _0x502b3e['X'] = '𝒳', _0x502b3e['Y'] = '𝒴', _0x502b3e['Z'] = '𝒵';
    var _0x9cbd24 = _0x502b3e,
        _0x4d16cb = _0x51a55e[_0xa689e(0x3a1)]('');
    for (var _0x454fae = 0x0; _0x454fae < _0x4d16cb[_0xa689e(0x2c4)]; _0x454fae++) {
        _0x9cbd24[_0x4d16cb[_0x454fae][_0xa689e(0x43c)]()] && (_0x4d16cb[_0x454fae] = _0x9cbd24[_0x4d16cb[_0x454fae]]);
    }
    return _0x51a55e = _0x4d16cb[_0xa689e(0x5ac)](''), _0x51a55e;
}

function shuffleArray(_0x253a7f) {
    var _0x46bfef = _0x1d931a,
        _0x18e4c = _0x253a7f[_0x46bfef(0x2c4)],
        _0x2b9277, _0xc66151;
    while (0x0 !== _0x18e4c) {
        _0xc66151 = Math[_0x46bfef(0x4fa)](Math['random']() * _0x18e4c), _0x18e4c -= 0x1, _0x2b9277 = _0x253a7f[_0x18e4c], _0x253a7f[_0x18e4c] = _0x253a7f[_0xc66151], _0x253a7f[_0xc66151] = _0x2b9277;
    }
    return _0x253a7f;
}

function randomElement(_0x3a1054) {
    var _0x52baba = _0x1d931a;
    return _0x3a1054[Math[_0x52baba(0x4fa)](Math[_0x52baba(0x553)]() * _0x3a1054[_0x52baba(0x2c4)])];
}! function(_0x3378c8) {
    var _0x17cc78 = _0x1d931a,
        _0xde317d = _0x17cc78(0x5b3) == typeof exports && exports,
        _0x455f6a = 'object' == typeof module && module && module[_0x17cc78(0x299)] == _0xde317d && module,
        _0x47dc93 = _0x17cc78(0x5b3) == typeof global && global;
    (_0x47dc93[_0x17cc78(0x3f6)] === _0x47dc93 || _0x47dc93[_0x17cc78(0x2bd)] === _0x47dc93) && (_0x3378c8 = _0x47dc93);
    var _0xab7546 = /(<%= allExceptCombiningMarks %>)(<%= combiningMarks %>+)/g,
        _0x2b80bc = /([\uD800-\uDBFF])([\uDC00-\uDFFF])/g,
        _0x4000fb = function(_0x1902ed) {
            var _0x51bb02 = _0x17cc78;
            _0x1902ed = _0x1902ed['replace'](_0xab7546, function(_0x415488, _0xeb660b, _0x4449da) {
                return _0x4000fb(_0x4449da) + _0xeb660b;
            })['replace'](_0x2b80bc, _0x51bb02(0x4f1));
            for (var _0xf574ce = '', _0x3e49b2 = _0x1902ed[_0x51bb02(0x2c4)]; _0x3e49b2--;) _0xf574ce += _0x1902ed[_0x51bb02(0x472)](_0x3e49b2);
            return _0xf574ce;
        },
        _0x1cc34a = {
            'version': _0x17cc78(0x403),
            'reverse': _0x4000fb
        };
    if ('function' == typeof define && _0x17cc78(0x5b3) == typeof define[_0x17cc78(0x515)] && define['amd']) define(function() {
        return _0x1cc34a;
    });
    else {
        if (_0xde317d && !_0xde317d[_0x17cc78(0x3d6)]) {
            if (_0x455f6a) _0x455f6a[_0x17cc78(0x299)] = _0x1cc34a;
            else {
                for (var _0x57e018 in _0x1cc34a) _0x1cc34a[_0x17cc78(0x376)](_0x57e018) && (_0xde317d[_0x57e018] = _0x1cc34a[_0x57e018]);
            }
        } else _0x3378c8['esrever'] = _0x1cc34a;
    }
}(this);

function fullCrazy(_0x328e45) {
    if (_0x328e45['trim']() === '') return '';
    return randomSymbols(0x2) + '\x20\x20' + crazifyText(_0x328e45) + '\x20\x20' + randomSymbols(0x2);
}

function crazifyText(_0x4133ef) {
    var _0x50d8e0 = _0x1d931a;
    _0x4133ef = _0x4133ef[_0x50d8e0(0x3a1)]('');
    for (var _0x2d786f = 0x0; _0x2d786f < _0x4133ef['length']; _0x2d786f++) {
        _0x4133ef[_0x2d786f] = crazifyCharacter(_0x4133ef[_0x2d786f]);
    }
    return _0x4133ef[_0x50d8e0(0x5ac)]('');
}

function crazifyCharacter(_0x1a882a) {
    var _0x3fc9a5 = _0x1d931a;
    _0x1a882a = _0x1a882a[_0x3fc9a5(0x43c)]();
    var _0x454d57 = {};
    _0x454d57['&'] = '⅋', _0x454d57['%'] = ['⅍', '℀', '℁', '℆', '℅'], _0x454d57['0'] = ['０', 'Ѳ', 'ʘ'], _0x454d57['1'] = ['➀', '❶', '１'], _0x454d57['2'] = ['２', '❷', '➁'], _0x454d57['3'] = ['３', '❸', '➂'], _0x454d57['4'] = ['４', '❹', '➃'], _0x454d57['5'] = ['❺', '➄', '５'], _0x454d57['6'] = ['６', '❻', '➅'], _0x454d57['7'] = ['７', '❼', '➆'], _0x454d57['8'] = ['８', '➇', '❽'], _0x454d57['9'] = ['➈', '❾', '９'], _0x454d57['<'] = ['≼', '≺', '≪', '☾', '≾', '⋜', '⋞', '⋐', '⊂', '⊏', '⊑', '《', '＜', '❮', '❰', '⫷'], _0x454d57['>'] = _0x3fc9a5(0x1cb), _0x454d57['['] = _0x3fc9a5(0x473), _0x454d57[']'] = '】〗〙〛］', _0x454d57['*'] = _0x3fc9a5(0x2b4), _0x454d57['a'] = ['Ⓐ', 'ⓐ', 'α', 'Ａ', 'ａ', 'ᗩ', '卂', 'Δ', 'ค', 'α', 'ά', 'Ã', '𝔞', '𝓪', '𝒶', '𝓐', '𝐀', '𝐚', '𝔸', '𝕒', 'ᵃ'], _0x454d57['b'] = ['Ⓑ', 'ⓑ', 'в', 'Ｂ', '乃', 'ｂ', 'ᗷ', 'β', '๒', 'в', 'в', 'β', '𝔟', '𝓫', '𝒷', '𝓑', '𝐁', '𝐛', '𝔹', '𝕓', 'ᵇ'], _0x454d57['c'] = ['Ⓒ', 'ⓒ', '匚', '¢', 'Ｃ', 'ｃ', 'ᑕ', 'Ć', 'ς', 'c', 'ς', 'Č', '℃', '𝔠', '𝓬', '𝒸', '𝓒', '𝐂', '𝐜', 'ℂ', '𝕔', 'ᶜ'], _0x454d57['d'] = ['Ⓓ', 'ⓓ', '∂', 'Ｄ', 'ｄ', 'ᗪ', 'Đ', '๔', '∂', 'đ', 'Ď', '𝔡', '𝓭', '𝒹', '𝓓', '𝐃', 'ᗪ', '𝐝', '𝔻', '𝕕', 'ᵈ'], _0x454d57['e'] = ['Ⓔ', '乇', 'ⓔ', 'є', 'Ｅ', 'ｅ', 'ᗴ', '€', 'є', 'ε', 'έ', 'Ẹ', '𝔢', '𝒆', '𝑒', '𝓔', '𝐄', '𝐞', '𝔼', '𝕖', 'ᵉ'], _0x454d57['f'] = ['Ⓕ', 'ⓕ', 'ƒ', 'Ｆ', 'ｆ', '千', 'ᖴ', 'ℱ', 'Ŧ', 'ғ', 'ғ', 'Ƒ', '𝔣', '𝒇', '𝒻', '𝓕', '𝐅', '𝐟', '𝔽', '𝕗', 'ᶠ'], _0x454d57['g'] = ['Ⓖ', 'ⓖ', 'ق', 'g', 'Ｇ', 'ｇ', 'Ǥ', 'Ꮆ', 'ﻮ', 'g', 'ģ', 'Ğ', '𝔤', '𝓰', '𝑔', '𝓖', '𝐆', '𝐠', '𝔾', '𝕘', 'ᵍ', 'Ꮆ'], _0x454d57['h'] = ['Ⓗ', '卄', 'ⓗ', 'н', 'Ｈ', 'ｈ', 'ᕼ', 'Ħ', 'ђ', 'н', 'ħ', 'Ĥ', '𝔥', '𝓱', '𝒽', '𝓗', '𝐇', '𝐡', 'ℍ', '𝕙', 'ʰ'], _0x454d57['i'] = ['Ⓘ', 'ⓘ', 'ι', 'Ｉ', 'ｉ', 'Ꭵ', '丨', 'Ɨ', 'เ', 'ι', 'ί', 'Į', '𝔦', '𝓲', '𝒾', '𝓘', '𝐈', '𝐢', '𝕀', '𝕚', 'ᶤ'], _0x454d57['j'] = ['Ⓙ', 'ⓙ', 'נ', 'Ｊ', 'ڶ', 'ｊ', 'ᒎ', 'Ĵ', 'ן', 'נ', 'ј', 'Ĵ', '𝔧', '𝓳', '𝒿', '𝓙', '𝐉', '𝐣', '𝕁', '𝕛', 'ʲ'], _0x454d57['k'] = ['Ⓚ', 'ⓚ', 'к', 'Ｋ', 'ｋ', 'ᛕ', 'Ҝ', 'к', 'к', 'ķ', 'Ќ', '𝔨', '𝓴', '𝓀', '𝓚', '𝐊', '𝐤', '𝕂', '𝕜', 'ᵏ', 'Ҝ'], _0x454d57['l'] = ['Ⓛ', 'ⓛ', 'ℓ', 'ㄥ', 'Ｌ', 'ｌ', 'ᒪ', 'Ł', 'l', 'ℓ', 'Ļ', 'Ĺ', '𝔩', '𝓵', '𝓁', '𝓛', '𝐋', '𝐥', '𝕃', '𝕝', 'ˡ'], _0x454d57['m'] = ['Ⓜ', 'ⓜ', 'м', 'Ｍ', 'ｍ', 'ᗰ', 'Μ', '๓', 'м', 'м', 'ϻ', '𝔪', '𝓶', '𝓂', '𝓜', '𝐌', '𝐦', '𝕄', '𝕞', 'ᵐ', '爪'], _0x454d57['n'] = ['Ⓝ', '几', 'ⓝ', 'η', 'Ｎ', 'ｎ', 'ᑎ', 'Ň', 'ภ', 'η', 'ή', 'Ň', '𝔫', '𝓷', '𝓃', '𝓝', '𝐍', '𝐧', 'ℕ', '𝕟', 'ᶰ'], _0x454d57['o'] = ['Ⓞ', 'ㄖ', 'ⓞ', 'σ', 'Ｏ', 'ｏ', 'ᗝ', 'Ø', '๏', 'σ', 'ό', 'Ỗ', '𝔬', '𝓸', '𝑜', '𝓞', '𝐎', '𝐨', '𝕆', '𝕠', 'ᵒ'], _0x454d57['p'] = ['Ⓟ', 'ⓟ', 'ρ', 'Ｐ', 'ｐ', '卩', 'ᑭ', 'Ƥ', 'ק', 'ρ', 'ρ', 'Ƥ', '𝔭', '𝓹', '𝓅', '𝓟', '𝐏', '𝐩', 'ℙ', '𝕡', 'ᵖ'], _0x454d57['q'] = ['Ⓠ', 'ⓠ', 'q', 'Ｑ', 'ｑ', 'Ɋ', 'Ω', 'ợ', 'q', 'q', 'Ǫ', '𝔮', '𝓺', '𝓆', '𝓠', '𝐐', '𝐪', 'ℚ', '𝕢', 'ᵠ'], _0x454d57['r'] = ['Ⓡ', 'ⓡ', 'я', '尺', 'Ｒ', 'ｒ', 'ᖇ', 'Ř', 'г', 'я', 'ŕ', 'Ř', '𝔯', '𝓻', '𝓇', '𝓡', '𝐑', '𝐫', 'ℝ', '𝕣', 'ʳ'], _0x454d57['s'] = ['Ⓢ', 'ⓢ', 'ѕ', 'Ｓ', '丂', 'ｓ', 'ᔕ', 'Ş', 'ร', 's', 'ş', 'Ŝ', '𝔰', '𝓼', '𝓈', '𝓢', '𝐒', '𝐬', '𝕊', '𝕤', 'ˢ'], _0x454d57['t'] = ['Ⓣ', 'ⓣ', 'т', 'Ｔ', 'ｔ', '丅', 'Ŧ', 't', 'т', 'ţ', 'Ť', '𝔱', '𝓽', '𝓉', '𝓣', '𝐓', '𝐭', '𝕋', '𝕥', 'ᵗ'], _0x454d57['u'] = ['Ⓤ', 'ⓤ', 'υ', 'Ｕ', 'ｕ', 'ᑌ', 'Ữ', 'ย', 'υ', 'ù', 'Ǘ', '𝔲', '𝓾', '𝓊', '𝓤', '𝐔', '𝐮', '𝕌', '𝕦', 'ᵘ'], _0x454d57['v'] = ['Ⓥ', 'ⓥ', 'ν', 'Ｖ', 'ｖ', 'ᐯ', 'V', 'ש', 'v', 'ν', 'Ѷ', '𝔳', '𝓿', '𝓋', '𝓥', '𝐕', '𝐯', '𝕍', '𝕧', 'ᵛ'], _0x454d57['w'] = ['Ⓦ', 'ⓦ', 'ω', 'Ｗ', 'ｗ', 'ᗯ', 'Ŵ', 'ฬ', 'ω', 'ώ', 'Ŵ', '𝔴', '𝔀', '𝓌', '𝓦', '𝐖', '𝐰', '𝕎', '𝕨', 'ʷ', '山'], _0x454d57['x'] = ['Ⓧ', 'ⓧ', 'χ', 'Ｘ', '乂', 'ｘ', '᙭', 'Ж', 'א', 'x', 'x', 'Ж', '𝔵', '𝔁', '𝓍', '𝓧', '𝐗', '𝐱', '𝕏', '𝕩', 'ˣ'], _0x454d57['y'] = ['Ⓨ', 'ㄚ', 'ⓨ', 'у', 'Ｙ', 'ｙ', 'Ƴ', '¥', 'ץ', 'ү', 'ч', 'Ў', '𝔶', '𝔂', '𝓎', '𝓨', '𝐘', '𝐲', '𝕐', '𝕪', 'ʸ'], _0x454d57['z'] = ['Ⓩ', 'ⓩ', 'z', '乙', 'Ｚ', 'ｚ', 'Ƶ', 'Ž', 'z', 'z', 'ž', 'Ż', '𝔷', '𝔃', '𝓏', '𝓩', '𝐙', '𝐳', 'ℤ', '𝕫', 'ᶻ'];
    var _0x286974 = _0x454d57;
    return _0x286974[_0x1a882a] ? randomElement(_0x286974[_0x1a882a]) : _0x1a882a;
}

function randomElement(_0x2261db) {
    var _0x1cb516 = _0x1d931a;
    return _0x2261db[Math['floor'](Math[_0x1cb516(0x553)]() * _0x2261db['length'])];
}

function randomSymbols(_0x24b2ce) {
    var _0x27bc9f = _0x1d931a,
        _0x45a061 = ['🐙', '🐉', '🐊', '🐒', '🐝', '🐜', '🐚', '🐲', '🐳', '🐸', '👑', '👹', '👺', '👤', '💲', '💣', '💙', '💚', '💛', '💜', '💝', '💗', '💘', '💞', '💔', '💥', '🐯', '🐼', '🐻', '🐺', '👌', '🐍', '🐧', '🐟', '🐠', '🐨', '🎯', '🏆', '🎁', '🎀', '🎉', '🎈', '🍮', '🍭', '🍬', '🍫', '🍪', '🍧', '🌷', '🍓', '😺', '😾', '✎', '😎', '😝', '😂', '😈', '😡', '😲', '😳', '🍔', '🍟', '🍩', '🎃', '🎄', '🎅', '🐣', '🐤', '👍', '👊', '👻', '👽', '👮', '💎', '💋', '👣', '💀', '💢', '🔥', '♔', '♕', '♖', '♗', '♘', '♙', '♚', '♛', '♜', '♝', '♞', '♟', '♠', '♡', '♢', '♣', '♤', '♥', '♦', '♧', '♨', '♩', '♪', '♬', '★', '☆', '☺', '☹', '☯', '☮', '☢', '☠', '☟', '☞', '☝', '☜', '✌', '✋', '✊', '⛵', 'ൠ', '✌', 'ඏ'],
        _0x11b5db = [];
    for (var _0x57ba7e = 0x0; _0x57ba7e < _0x24b2ce; _0x57ba7e++) _0x11b5db[_0x27bc9f(0x311)](randomElement(_0x45a061));
    return _0x11b5db[_0x27bc9f(0x5ac)]('');
}

function randInt(_0x3c107c, _0x15de84) {
    var _0x362c53 = _0x1d931a;
    return _0x3c107c + Math[_0x362c53(0x4fa)](Math['random']() * (_0x15de84 - _0x3c107c + 0x1));
}
$(document)[_0x1d931a(0x2d6)](function() {
    var _0x359eba = _0x1d931a;
    $(_0x359eba(0x2f4))['hide'](), $(window)[_0x359eba(0x41f)](function() {
        var _0x312d84 = _0x359eba;
        $(this)[_0x312d84(0x52d)]() > 0x64 ? $(_0x312d84(0x4f6))[_0x312d84(0x3d4)]() : $(_0x312d84(0x4f6))['fadeOut']();
    }), $(_0x359eba(0x4f6))[_0x359eba(0x35d)](function() {
        var _0x19e656 = _0x359eba,
            _0x36a21c = {};
        return _0x36a21c[_0x19e656(0x52d)] = 0x0, $(_0x19e656(0x3e3))['animate'](_0x36a21c, 0x258), ![];
    });
}), $(document)[_0x1d931a(0x2d6)](function() {
    var _0x527b72 = _0x1d931a;
    $(_0x527b72(0x5c9))['on'](_0x527b72(0x45b), function() {
        var _0x5f0c05 = _0x527b72;
        $('<style>\x20.stylename\x20p{font-size:' + $(this)[_0x5f0c05(0x29b)]() + 'px}\x20</style>')[_0x5f0c05(0x61a)](_0x5f0c05(0x291));
        var _0x185bdf = {};
        _0x185bdf['expires'] = 0x16d, $[_0x5f0c05(0x1b3)](_0x5f0c05(0x1b1), $(this)[_0x5f0c05(0x29b)](), _0x185bdf);
    });
    $[_0x527b72(0x1b3)]('recentlist') && $(_0x527b72(0x5fb))['html']($['cookie']('recentlist'));
    $(_0x527b72(0x298))['on'](_0x527b72(0x45a), function(_0x4dd3c5) {
        var _0x483bb9 = _0x527b72,
            _0x58ef2f = $(_0x483bb9(0x293))[_0x483bb9(0x29b)]();
        _0x45075a(_0x58ef2f);
        var _0x8cfacb = {};
        _0x8cfacb[_0x483bb9(0x26c)] = 0x16d, $[_0x483bb9(0x1b3)](_0x483bb9(0x215), _0x58ef2f, _0x8cfacb), $('#share-link')[_0x483bb9(0x22b)](siteurl + encodeURIComponent(_0x58ef2f));
    });
    var _0x37656b = window[_0x527b72(0x517)][_0x527b72(0x498)],
        _0x58e2b2 = _0x37656b[_0x527b72(0x3a1)]('?=');
    urltext = _0x58e2b2[0x1];
    if (urltext) {
        urltext = decodeURIComponent(urltext), $('#y2k-font')[_0x527b72(0x29b)](urltext), _0x45075a(urltext);
        var _0x5e65f0 = {};
        _0x5e65f0['expires'] = 0x16d, $[_0x527b72(0x1b3)](_0x527b72(0x215), urltext, _0x5e65f0), $(_0x527b72(0x27f))[_0x527b72(0x22b)](siteurl + encodeURIComponent(urltext));
    }
    $(document)['on'](_0x527b72(0x35d), '.stylenamelist\x20.stylename', function() {
        var _0x2dd2c4 = _0x527b72;
        $('.stylenamerecentlist')[_0x2dd2c4(0x670)]('<div\x20class=\x22stylename\x22><span>Recently\x20Used</span><p\x20onclick=\x22copyit(this)\x22\x20data-clipboard-target=\x22.' + $(this)['find']('p')[_0x2dd2c4(0x5bc)](_0x2dd2c4(0x31a)) + _0x2dd2c4(0x47a) + $(this)[_0x2dd2c4(0x42b)]('p')['attr']('class') + '\x22>' + $(this)['find']('p')[_0x2dd2c4(0x1ee)]() + '</p></div>');
        $(_0x2dd2c4(0x1fe))['length'] > 0x3 && $(_0x2dd2c4(0x1fe))['last']()[_0x2dd2c4(0x2ec)]();
        var _0x7a65fa = {};
        _0x7a65fa[_0x2dd2c4(0x26c)] = 0x16d, $[_0x2dd2c4(0x1b3)](_0x2dd2c4(0x3f7), $(_0x2dd2c4(0x5fb))[_0x2dd2c4(0x22b)](), _0x7a65fa);
    });

    function _0x5eb278() {
        var _0x48deb4 = _0x527b72,
            _0x122aaa = $(_0x48deb4(0x293))[_0x48deb4(0x29b)]();
        $(_0x48deb4(0x4c2))[_0x48deb4(0x22b)](wrapInFlourish(_0x52549d(_0x122aaa))), $('.flourish2')['html'](wrapInFlourish(_0x52549d(_0x122aaa))), $(_0x48deb4(0x23c))[_0x48deb4(0x22b)](wrapInFlourish(_0x52549d(_0x122aaa))), $(_0x48deb4(0x615))[_0x48deb4(0x22b)](wrapInFlourish(_0x52549d(_0x122aaa))), $('.flourish5')['html'](wrapInFlourish(_0x52549d(_0x122aaa))), $('.flourish6')[_0x48deb4(0x22b)](wrapInFlourish(_0x52549d(_0x122aaa))), $(_0x48deb4(0x610))[_0x48deb4(0x22b)](wrapInFlourish(_0x52549d(_0x122aaa))), $(_0x48deb4(0x2ef))[_0x48deb4(0x22b)](wrapInFlourish(_0x52549d(_0x122aaa))), $('.flourish9')[_0x48deb4(0x22b)](wrapInFlourish(_0x52549d(_0x122aaa)));
    }

    function _0x45075a(_0x1fb5a8) {
        var _0xf23c66 = _0x527b72;
        _0x1fb5a8 = _0x1fb5a8['trim'](), $('.result-s1')[_0xf23c66(0x22b)](Change(_0x1fb5a8, 's1')), $(_0xf23c66(0x194))[_0xf23c66(0x22b)](Change(_0x1fb5a8, 's2')), $(_0xf23c66(0x505))[_0xf23c66(0x22b)](Change(_0x1fb5a8, 's3')), $(_0xf23c66(0x343))['html'](Change(_0x1fb5a8, 's4')), $(_0xf23c66(0x1de))[_0xf23c66(0x22b)](Change(_0x1fb5a8, 's5')), $(_0xf23c66(0x4d0))[_0xf23c66(0x22b)](Change(_0x1fb5a8, 's6')), $('.result-s7')[_0xf23c66(0x22b)](Change(_0x1fb5a8, 's7')), $(_0xf23c66(0x22d))[_0xf23c66(0x22b)](Change(_0x1fb5a8, 's8')), $(_0xf23c66(0x1fb))['html'](Change(_0x1fb5a8, 's9')), $(_0xf23c66(0x3cb))['html'](Change(_0x1fb5a8, _0xf23c66(0x19b))), $(_0xf23c66(0x41a))[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x462))), $('.result-s12')['html'](Change(_0x1fb5a8, _0xf23c66(0x20e))), $(_0xf23c66(0x4ac))[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x656))), $(_0xf23c66(0x37e))[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x370))), $('.result-s15')[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x4b0))), $(_0xf23c66(0x375))[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x3ff))), $(_0xf23c66(0x2e2))['html'](Change(_0x1fb5a8, 's17')), $(_0xf23c66(0x57f))['html'](Change(_0x1fb5a8, _0xf23c66(0x51b))), $('.result-s19')[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x5dd))), $(_0xf23c66(0x455))[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x3e9))), $(_0xf23c66(0x590))[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x315))), $(_0xf23c66(0x3c2))[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x253))), $(_0xf23c66(0x603))[_0xf23c66(0x22b)](Change(_0x1fb5a8, 's23')), $(_0xf23c66(0x532))[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x5a9))), $(_0xf23c66(0x31f))[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x3fd))), $(_0xf23c66(0x637))[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x338))), $(_0xf23c66(0x614))['html'](Change(_0x1fb5a8, _0xf23c66(0x3eb))), $(_0xf23c66(0x642))['html'](Change(_0x1fb5a8, _0xf23c66(0x1d5))), $('.result-s30')[_0xf23c66(0x22b)](Change(_0x1fb5a8, _0xf23c66(0x5e0))), $(_0xf23c66(0x3d1))[_0xf23c66(0x22b)](Change(_0x1fb5a8, 's31')), $(_0xf23c66(0x19e))[_0xf23c66(0x22b)](luni['tools']['bubbles']['encode'](_0x1fb5a8)), $(_0xf23c66(0x3af))[_0xf23c66(0x22b)](applyCharMap(invertedSquaresCharMap, _0x1fb5a8)), $('.wideTextCharMap')[_0xf23c66(0x22b)](applyCharMap(wideTextCharMap, _0x1fb5a8)), $(_0xf23c66(0x3f8))[_0xf23c66(0x22b)](luni[_0xf23c66(0x317)]['tiny']['encode'](_0x1fb5a8)), $(_0xf23c66(0x5a7))['html'](luni[_0xf23c66(0x317)][_0xf23c66(0x3f4)]['encode'](_0x1fb5a8)), $(_0xf23c66(0x4e4))[_0xf23c66(0x22b)](applyCharMap(squaresCharMap, _0x1fb5a8)), $(_0xf23c66(0x404))[_0xf23c66(0x22b)](luni['tools'][_0xf23c66(0x326)][_0xf23c66(0x602)](_0x1fb5a8)), $(_0xf23c66(0x1e7))[_0xf23c66(0x22b)](applyCharMap(subscriptCharMap, _0x1fb5a8)), $(_0xf23c66(0x29c))[_0xf23c66(0x22b)](applyCharMap(superscriptCharMap, _0x1fb5a8)), $('.bentTextCharMap')[_0xf23c66(0x22b)](applyCharMap(bentTextCharMap, _0x1fb5a8)), $(_0xf23c66(0x34e))[_0xf23c66(0x22b)](applyCharMap(neonCharMap, _0x1fb5a8)), $('.futureAlienCharMap')[_0xf23c66(0x22b)](applyCharMap(futureAlienCharMap, _0x1fb5a8)), $('.strikeThrough')[_0xf23c66(0x22b)](strikeThrough(_0x1fb5a8)), $(_0xf23c66(0x297))[_0xf23c66(0x22b)](tildeStrikeThrough(_0x1fb5a8)), $(_0xf23c66(0x195))[_0xf23c66(0x22b)](slashThrough(_0x1fb5a8)), $(_0xf23c66(0x52e))[_0xf23c66(0x22b)](underline(_0x1fb5a8)), $('.doubleUnderline')[_0xf23c66(0x22b)](doubleUnderline(_0x1fb5a8)), $(_0xf23c66(0x573))[_0xf23c66(0x22b)](luni[_0xf23c66(0x317)][_0xf23c66(0x1a6)][_0xf23c66(0x602)](_0x1fb5a8)), $(_0xf23c66(0x5f2))[_0xf23c66(0x22b)](applyCharMap(squiggleCharMap, _0x1fb5a8)), $(_0xf23c66(0x547))[_0xf23c66(0x22b)](applyCharMap(squiggle2CharMap, _0x1fb5a8)), $(_0xf23c66(0x310))['html'](applyCharMap(squiggle3CharMap, _0x1fb5a8)), $(_0xf23c66(0x5c2))['html'](applyCharMap(squiggle4CharMap, _0x1fb5a8)), $('.squiggle5CharMap')[_0xf23c66(0x22b)](applyCharMap(squiggle5CharMap, _0x1fb5a8)), $(_0xf23c66(0x3cd))[_0xf23c66(0x22b)](applyCharMap(squiggle6CharMap, _0x1fb5a8)), $(_0xf23c66(0x4c7))[_0xf23c66(0x22b)](applyCharMap(boldCharMap, _0x1fb5a8)), $(_0xf23c66(0x435))[_0xf23c66(0x22b)](luni['tools'][_0xf23c66(0x557)][_0xf23c66(0x602)](_0x1fb5a8)), $(_0xf23c66(0x331))[_0xf23c66(0x22b)](luni[_0xf23c66(0x317)][_0xf23c66(0x37f)][_0xf23c66(0x602)](_0x1fb5a8)), $('.oldEnglishCharMap')['html'](applyCharMap(oldEnglishCharMap, _0x1fb5a8)), $('.medievalCharMap')['html'](applyCharMap(medievalCharMap, _0x1fb5a8)), $(_0xf23c66(0x522))['html'](applyCharMap(cursiveCharMap, _0x1fb5a8)), $(_0xf23c66(0x3b9))[_0xf23c66(0x22b)](scriptify(_0x1fb5a8)), $(_0xf23c66(0x4ec))['html'](applyCharMap(doubleStruckCharMap, _0x1fb5a8)), $(_0xf23c66(0x47d))[_0xf23c66(0x22b)](applyCharMap(italicCharMap, _0x1fb5a8)), $(_0xf23c66(0x3ad))['html'](applyCharMap(boldItalicCharMap, _0x1fb5a8)), $('.monospaceCharMap')[_0xf23c66(0x22b)](applyCharMap(monospaceCharMap, _0x1fb5a8)), $(_0xf23c66(0x502))[_0xf23c66(0x22b)](applyCharMap(upperAnglesCharMap, _0x1fb5a8)), $('.greekCharMap')['html'](applyCharMap(greekCharMap, _0x1fb5a8)), $(_0xf23c66(0x2bf))[_0xf23c66(0x22b)](applyCharMap(symbolsCharMap, _0x1fb5a8)), $(_0xf23c66(0x193))[_0xf23c66(0x22b)](applyCharMap(currencyCharMap, _0x1fb5a8)), $(_0xf23c66(0x25e))[_0xf23c66(0x22b)](applyCharMap(asianStyleCharMap, _0x1fb5a8)), $('.asianStyle2CharMap')['html'](applyCharMap(asianStyle2CharMap, _0x1fb5a8)), $(_0xf23c66(0x28e))[_0xf23c66(0x22b)](thickBlockFramed(_0x1fb5a8)), $(_0xf23c66(0x359))[_0xf23c66(0x22b)](diametricAngleFrame(_0x1fb5a8)), $(_0xf23c66(0x5ce))[_0xf23c66(0x22b)](wavyJoiner(_0x1fb5a8)), $(_0xf23c66(0x439))[_0xf23c66(0x22b)](dottyJoiner(_0x1fb5a8)), $(_0xf23c66(0x5d2))[_0xf23c66(0x22b)](kirbyHug(_0x1fb5a8)), $(_0xf23c66(0x5c8))['html'](vaporwaveText(_0x1fb5a8)), $('.vaporwaveText1')['html'](vaporwaveText1(_0x1fb5a8)), $(_0xf23c66(0x514))[_0xf23c66(0x22b)](vaporwaveText2(_0x1fb5a8)), $(_0xf23c66(0x3cf))[_0xf23c66(0x22b)](littleSparkles(_0x1fb5a8)), $('.weirdBox')['html'](weirdBox(_0x1fb5a8)), $(_0xf23c66(0x4dc))[_0xf23c66(0x22b)](firework(_0x1fb5a8)), $(_0xf23c66(0x4f8))['html'](stinky(_0x1fb5a8)), $(_0xf23c66(0x36e))['html'](heartsBetween(_0x1fb5a8)), $(_0xf23c66(0x1e2))[_0xf23c66(0x22b)](arrowBelow(_0x1fb5a8)), $(_0xf23c66(0x562))[_0xf23c66(0x22b)](crossAboveBelow(_0x1fb5a8)), $(_0xf23c66(0x5c5))[_0xf23c66(0x22b)](wingdings(_0x1fb5a8)), $('.fullCrazy')['html'](fullCrazy(_0x1fb5a8)), $(_0xf23c66(0x5d7))[_0xf23c66(0x22b)](crazyWithFlourishOrSymbols(_0x1fb5a8)), $(_0xf23c66(0x485))[_0xf23c66(0x22b)](cuteText(_0x1fb5a8)), _0x5eb278(), $(_0xf23c66(0x21e))[_0xf23c66(0x2ec)]();
    };
    $(_0x527b72(0x5ec))[_0x527b72(0x35d)](function() {
        var _0x5b1490 = _0x527b72;
        $(_0x5b1490(0x2f4))['fadeIn'](), _0x5eb278(), $(_0x5b1490(0x2f4))['fadeOut']();
    });

    function _0x1b8f56() {
        var _0xc5132c = _0x527b72;
        return fontgenArray[Math[_0xc5132c(0x4fa)](Math[_0xc5132c(0x553)]() * fontgenArray[_0xc5132c(0x2c4)])];
    }

    function _0x4ac3ff(_0x5398d6) {
        var _0x3a9007 = _0x1b8f56();
        return eval(_0x3a9007 + '(\x22' + _0x5398d6 + '\x22)');
    }

    function _0x4c157a() {
        var _0x1d5b66 = _0x527b72;
        return fontgenArrayMap[Math['floor'](Math[_0x1d5b66(0x553)]() * fontgenArrayMap[_0x1d5b66(0x2c4)])];
    }

    function _0x52549d(_0x127d3f) {
        var _0x405ebf = _0x527b72,
            _0x3072c3 = _0x4c157a();
        return _0x127d3f = _0x127d3f[_0x405ebf(0x5a6)](), eval(_0x3072c3 + '(\x22' + _0x127d3f + '\x22)');
    }
    $(_0x527b72(0x56d))['click'](function() {
        var _0x541240 = _0x527b72;
        $(_0x541240(0x2f4))[_0x541240(0x3d4)]();
        var _0x549c22 = $(_0x541240(0x293))[_0x541240(0x29b)]();
        $(_0x541240(0x5fc))[_0x541240(0x441)](_0x541240(0x2b8) + fullCrazy(_0x549c22) + _0x541240(0x432)), $(_0x541240(0x5fc))[_0x541240(0x441)](_0x541240(0x2b8) + crazyWithFlourishOrSymbols(_0x549c22) + _0x541240(0x432)), $(_0x541240(0x5fc))[_0x541240(0x441)](_0x541240(0x2b8) + wrapInFlourish(_0x4ac3ff(_0x549c22)) + _0x541240(0x432)), $(_0x541240(0x5fc))['append']('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + cuteText(_0x549c22) + _0x541240(0x432)), $(_0x541240(0x5fc))['append']('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x4ac3ff(_0x549c22)) + _0x541240(0x432)), $(_0x541240(0x5fc))[_0x541240(0x441)](_0x541240(0x2b8) + wrapInFlourish(_0x4ac3ff(_0x549c22)) + _0x541240(0x432)), $('.stylenamelist')['append'](_0x541240(0x2b8) + wrapInFlourish(_0x52549d(_0x549c22)) + _0x541240(0x432)), $(_0x541240(0x5fc))[_0x541240(0x441)]('<div\x20class=\x22stylename\x22><span>Random</span><p\x20onclick=\x22copyit(this)\x22>' + wrapInFlourish(_0x52549d(_0x549c22)) + _0x541240(0x432)), $(_0x541240(0x5fc))['append'](_0x541240(0x2b8) + wrapInFlourish(_0x52549d(_0x549c22)) + _0x541240(0x432)), $('#loader')[_0x541240(0x55a)]();
    }), $[_0x527b72(0x1b3)]('textSize') && ($(_0x527b72(0x63e) + $[_0x527b72(0x1b3)](_0x527b72(0x1b1)) + _0x527b72(0x3d0))[_0x527b72(0x61a)]('body'), $(_0x527b72(0x5c9))[_0x527b72(0x29b)]($[_0x527b72(0x1b3)]('textSize'))), $(_0x527b72(0x222))['click'](function() {
        var _0x2789d7 = _0x527b72;
        $(_0x2789d7(0x293))['val']('');
        var _0x2cc79e = {};
        _0x2cc79e[_0x2789d7(0x26c)] = 0x16d, $['cookie'](_0x2789d7(0x215), '', _0x2cc79e);
    });
}), $(document)[_0x1d931a(0x2d6)](function() {
    setInterval(function() {
        var _0x413599 = _0x554c;
        !$(_0x413599(0x385))[_0x413599(0x2c4)] && (window[_0x413599(0x517)]['href'] = _0x413599(0x1ae));
    }, 0x186a0);
}), window[_0x1d931a(0x1f4)] = function() {
    var _0x14c5ff = _0x1d931a,
        _0x2b0e0d = document[_0x14c5ff(0x1ca)]('y2kcredit');
    _0x2b0e0d['setAttribute']('href', _0x14c5ff(0x1ae)), _0x2b0e0d[_0x14c5ff(0x4fc)](_0x14c5ff(0x4c1), _0x14c5ff(0x406)), _0x2b0e0d[_0x14c5ff(0x4fc)]('target', _0x14c5ff(0x53b)), _0x2b0e0d[_0x14c5ff(0x4fc)](_0x14c5ff(0x1f3), 'Y2k\x20Font'), _0x2b0e0d[_0x14c5ff(0x4fc)](_0x14c5ff(0x44b), _0x14c5ff(0x58d)), _0x2b0e0d[_0x14c5ff(0x40a)] = _0x14c5ff(0x567);
};

function copyit(_0x221434) {
    var _0x3649e9 = _0x1d931a;
    if (document[_0x3649e9(0x291)]['createTextRange']) {
        var _0x29b806 = document[_0x3649e9(0x291)]['createTextRange']();
        _0x29b806['moveToElementText'](_0x221434), _0x29b806[_0x3649e9(0x609)](), _0x29b806['execCommand'](_0x3649e9(0x36a));
    } else {
        if (window[_0x3649e9(0x3ef)] && document['createRange']) {
            var _0x3409d7 = _0x221434[_0x3649e9(0x1bf)],
                _0x543670 = _0x221434[_0x3649e9(0x1f8)];
            _0x221434['contentEditable'] = !![], _0x221434[_0x3649e9(0x1f8)] = !![];
            var _0x9b6293 = document['createRange']();
            _0x9b6293['selectNodeContents'](_0x221434);
            var _0x3cdaef = window[_0x3649e9(0x3ef)]();
            _0x3cdaef[_0x3649e9(0x1ce)](), _0x3cdaef[_0x3649e9(0x3b3)](_0x9b6293);
            if (_0x221434[_0x3649e9(0x2e8)] == _0x3649e9(0x5ed) || _0x221434[_0x3649e9(0x2e8)] == _0x3649e9(0x5bf)) _0x221434[_0x3649e9(0x609)]();
            if (_0x221434['setSelectionRange']) _0x221434[_0x3649e9(0x445)](0x0, 0xf423f);
            _0x221434[_0x3649e9(0x1bf)] = _0x3409d7, _0x221434[_0x3649e9(0x1f8)] = _0x543670;
            if (document[_0x3649e9(0x3ee)](_0x3649e9(0x418))) {
                var _0x2bd1df = document[_0x3649e9(0x199)](_0x3649e9(0x418));
                if (_0x2bd1df) $(_0x3649e9(0x291))[_0x3649e9(0x441)](_0x3649e9(0x438) + $(_0x221434)['text']() + _0x3649e9(0x4d8)), setTimeout(function() {
                    $('.copied')['remove']();
                }, 0x3e8);
                else $(_0x3649e9(0x291))[_0x3649e9(0x441)](_0x3649e9(0x3d3)), setTimeout(function() {
                    var _0x5e27d2 = _0x3649e9;
                    $(_0x5e27d2(0x44f))[_0x5e27d2(0x2ec)]();
                }, 0x3e8);
            } else {
                if (!navigator[_0x3649e9(0x51a)][_0x3649e9(0x398)](/ipad|ipod|iphone|android|silk/i)) $('body')[_0x3649e9(0x441)](_0x3649e9(0x3d3)), setTimeout(function() {
                    var _0x58ed23 = _0x3649e9;
                    $(_0x58ed23(0x44f))['remove']();
                }, 0x3e8);
            }
        }
    }
}
$(window)[_0x1d931a(0x351)]() > 0x3c0 && $(window)[_0x1d931a(0x41f)](function() {
    var _0x4ed5d0 = _0x1d931a,
        _0x30e97b = $(window)[_0x4ed5d0(0x52d)]();
    _0x30e97b >= 0x64 ? $(_0x4ed5d0(0x298))[_0x4ed5d0(0x396)](_0x4ed5d0(0x244)) : $(_0x4ed5d0(0x298))[_0x4ed5d0(0x229)](_0x4ed5d0(0x244));
});
$(_0x1d931a(0x53d))[_0x1d931a(0x35d)](function() {
    var _0xd8b4d = _0x1d931a;
    $(_0xd8b4d(0x411))[_0xd8b4d(0x323)](0x64);
}), $(_0x1d931a(0x55c))['click'](function() {
    var _0x2118ec = _0x1d931a;
    $(_0x2118ec(0x411))[_0x2118ec(0x62b)](0x64);
});
